-- -*- M2-comint -*- hash: 158124038

i1 : D = digraph({{1,2},{2,3},{3,4},{4,3}},EntryMode=>"edges");

i2 : adjacencyMatrix D

o2 = | 0 1 0 0 |
     | 0 0 1 0 |
     | 0 0 0 1 |
     | 0 0 1 0 |

              4        4
o2 : Matrix ZZ  <--- ZZ

i3 : G = graph({1,2,3,4}, {{1,2},{2,3},{3,4},{4,3}})

o3 = Graph{1 => {2}   }
           2 => {1, 3}
           3 => {2, 4}
           4 => {3}

o3 : Graph

i4 : adjacencyMatrix G

o4 = | 0 1 0 0 |
     | 1 0 1 0 |
     | 0 1 0 1 |
     | 0 0 1 0 |

              4        4
o4 : Matrix ZZ  <--- ZZ

i5 : 
