-- -*- M2-comint -*- hash: 4809948

i1 : G = graph({{1,2},{2,3},{3,4}},EntryMode=>"edges");

i2 : d = distanceMatrix G

o2 = | 0 1 2 3 |
     | 1 0 1 2 |
     | 2 1 0 1 |
     | 3 2 1 0 |

              4        4
o2 : Matrix ZZ  <--- ZZ

i3 : G = digraph({1,2,3,4},{{2,3},{3,4}},EntryMode=>"edges");

i4 : d = distanceMatrix G

o4 = | 0  -1 -1 -1 |
     | -1 0  1  2  |
     | -1 -1 0  1  |
     | -1 -1 -1 0  |

              4        4
o4 : Matrix ZZ  <--- ZZ

i5 : 
