-- -*- M2-comint -*- hash: 1968188499

i1 : D = digraph({{1,2},{2,1},{3,1}},EntryMode=>"edges");

i2 : vertexSet D;

i3 : G = completeGraph 4;

i4 : vertexSet G

o4 = {0, 1, 2, 3}

o4 : List

i5 : A = adjacencyMatrix G;

              4        4
o5 : Matrix ZZ  <--- ZZ

i6 : graph({a,b,c,d}, A)

o6 = Graph{a => {b, c, d}}
           b => {a, c, d}
           c => {a, b, d}
           d => {a, b, c}

o6 : Graph

i7 : 
