-- -*- M2-comint -*- hash: 708712595

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x-y, x-z)

o2 = ideal (x - y, x - z)

o2 : Ideal of R

i3 : oneStepGVD(I, x, CheckDegenerate=>true)

o3 = (true, ideal (y - z, 1), ideal(y - z), degenerate)

o3 : Sequence

i4 : 
