-- -*- M2-comint -*- hash: 6713815

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x-y, x-z)

o2 = ideal (x - y, x - z)

o2 : Ideal of R

i3 : isGVD I

o3 = true

i4 : isGVD(I, Verbose=>true)
ideal(x-y,x-z)
-- decomposing with respect to x
-- C = ideal(y-z,1)
-- N = ideal(y-z)
ideal(y-z,1)
-- unit ideal
ideal(y-z)
-- decomposing with respect to y
-- C = ideal 1
-- N = ideal()
ideal 1
-- unit ideal
ideal()
-- zero ideal

o4 = true

i5 : 
