-- -*- M2-comint -*- hash: -1416764732

i1 : R = QQ[a,b,c,d]

o1 = R

o1 : PolynomialRing

i2 : f = 3*a*b + 4*b*c+ 16*a*c + 18*d

o2 = 3a*b + 16a*c + 4b*c + 18d

o2 : R

i3 : i = ideal f

o3 = ideal(3a*b + 16a*c + 4b*c + 18d)

o3 : Ideal of R

i4 : isGVD i

o4 = true

i5 : R = QQ[a,b,c,d]

o5 = R

o5 : PolynomialRing

i6 : i = ideal(a*b, a*c, a*d, b*c, b*d, c*d) -- edge ideal of a complete graph K_4, a chordal graph

o6 = ideal (a*b, a*c, a*d, b*c, b*d, c*d)

o6 : Ideal of R

i7 : isGVD(i, Verbose=>true)
ideal(a*b,a*c,a*d,b*c,b*d,c*d)
-- decomposing with respect to a
-- C = ideal(c*d,b*d,b*c,d,c,b)
-- N = ideal(c*d,b*d,b*c)
ideal(c*d,b*d,b*c,d,c,b)
-- decomposing with respect to b
-- C = ideal(d,c,1)
-- N = ideal(d,c)
ideal(d,c,1)
-- unit ideal
ideal(d,c)
-- generated by indeterminates
ideal(c*d,b*d,b*c)
-- decomposing with respect to b
-- C = ideal(c*d,d,c)
-- N = ideal(c*d)
ideal(c*d,d,c)
-- decomposing with respect to c
-- C = ideal(d,1)
-- N = ideal d
ideal(d,1)
-- unit ideal
ideal d
-- generated by indeterminates
ideal(c*d)
-- decomposing with respect to c
-- C = ideal d
-- N = ideal()
ideal d
-- generated by indeterminates
ideal()
-- zero ideal

o7 = true

i8 : R = QQ[e_1..e_7]

o8 = R

o8 : PolynomialRing

i9 : i = ideal(e_2*e_7-e_5*e_6, e_1*e_4-e_2*e_3) -- the toric ideal of a graph

o9 = ideal (- e e  + e e , - e e  + e e )
               5 6    2 7     2 3    1 4

o9 : Ideal of R

i10 : isGVD i

o10 = true

i11 : R = QQ[e_1..e_10]

o11 = R

o11 : PolynomialRing

i12 : i = ideal(e_1*e_4-e_2*e_3, e_2^2*e_7*e_8*e_9-e_4^2*e_5*e_6*e_10, e_1*e_2*e_7*e_8*e_9-e_3*e_4*e_5*e_6*e_10, e_1^2*e_7*e_8*e_9-e_3^2*e_5*e_6*e_10)

                             2          2                                  
o12 = ideal (- e e  + e e , e e e e  - e e e e  , e e e e e  - e e e e e  ,
                2 3    1 4   2 7 8 9    4 5 6 10   1 2 7 8 9    3 4 5 6 10 
      -----------------------------------------------------------------------
       2          2
      e e e e  - e e e e  )
       1 7 8 9    3 5 6 10

o12 : Ideal of R

i13 : isGVD i

o13 = false

i14 : 
