-- -*- M2-comint -*- hash: 1811313801

i1 : R = QQ[a,b,c,d]

o1 = R

o1 : PolynomialRing

i2 : f = 3*a*b + 4*b*c+ 16*a*c+18*d

o2 = 3a*b + 16a*c + 4b*c + 18d

o2 : R

i3 : i = ideal f

o3 = ideal(3a*b + 16a*c + 4b*c + 18d)

o3 : Ideal of R

i4 : oneStepGVD(i, a)

o4 = (true, ideal(3b + 16c), ideal ())

o4 : Sequence

i5 : R = QQ[a,b,c,d];

i6 : i = ideal(a*b, a*c, a*d, b*c, b*d, c*d); -- edge ideal of complete graph K_4, a chordal graph

o6 : Ideal of R

i7 : oneStepGVD(i, c, CheckDegenerate=>true)

o7 = (true, ideal (a*d, b*d, a*b, d, a, b), ideal (a*d, b*d, a*b),
     ------------------------------------------------------------------------
     nondegenerate)

o7 : Sequence

i8 : R = QQ[e_1..e_10];

i9 : i = ideal(e_1*e_4-e_2*e_3, e_2^2*e_7*e_8*e_9-e_4^2*e_5*e_6*e_10, e_1*e_2*e_7*e_8*e_9-e_3*e_4*e_5*e_6*e_10, e_1^2*e_7*e_8*e_9-e_3^2*e_5*e_6*e_10);

o9 : Ideal of R

i10 : mingens gb i

o10 = | e_2e_3-e_1e_4 e_2^2e_7e_8e_9-e_4^2e_5e_6e_10
      -----------------------------------------------------------------------
      e_1e_2e_7e_8e_9-e_3e_4e_5e_6e_10 e_1^2e_7e_8e_9-e_3^2e_5e_6e_10 |

              1       4
o10 : Matrix R  <--- R

i11 : oneStepGVD(i, e_1)

                      2          2                               
o11 = (false, ideal (e e e e  - e e e e  , e , e e e e , e e e ),
                      2 7 8 9    4 5 6 10   4   2 7 8 9   7 8 9  
      -----------------------------------------------------------------------
             2          2
      ideal(e e e e  - e e e e  ))
             2 7 8 9    4 5 6 10

o11 : Sequence

i12 : 
