-- -*- M2-comint -*- hash: -352683235

i1 : S = surface {4,5,1};

o1 : ProjectiveVariety, surface in PP^6

i2 : V = random(3,S);

o2 : ProjectiveVariety, hypersurface in PP^6

i3 : X = V * random(2,S);

o3 : ProjectiveVariety, 4-dimensional subvariety of PP^6

i4 : F = specialFourfold(S,X,V);

o4 : ProjectiveVariety, complete intersection of type (2,3) in PP^6 containing a surface of degree 7 and sectional genus 2

i5 : ambientFivefold F

o5 = V

o5 : ProjectiveVariety, hypersurface in PP^6

i6 : X = specialFourfold("21",ZZ/33331);

o6 : ProjectiveVariety, GM fourfold containing a surface of degree 12 and sectional genus 5

i7 : describe X

o7 = Special Gushel-Mukai fourfold of discriminant 26(')
     containing a surface in PP^8 of degree 12 and sectional genus 5
     cut out by 16 hypersurfaces of degree 2
     and with class in G(1,4) given by 7*s_(3,1)+5*s_(2,2)
     Type: ordinary
     (case 21 of Table 1 in arXiv:2002.07026)

i8 : Y = ambientFivefold X;

o8 : ProjectiveVariety, 5-dimensional subvariety of PP^8

i9 : isSubset(X,Y)

o9 = true

i10 : Y!
dim:.................. 5
codim:................ 3
degree:............... 5
sectional genus:...... 1
generators:........... 2^5 
linear normality:..... true
connected components:. 1
purity:............... true
dim sing. l.:......... -1

i11 : 
