-- -*- M2-comint -*- hash: -1800980604

i1 : S = PP_(ZZ/65521)[2,2];

o1 : ProjectiveVariety, surface in PP^5

i2 : Y = ambient S;

o2 : ProjectiveVariety, PP^5

i3 : X = specialCubicFourfold S;

o3 : ProjectiveVariety, cubic fourfold containing a surface of degree 4 and sectional genus 0

i4 : f = detectCongruence(X,1);

o4 : Congruence of 2-secant lines to S in Y

i5 : F = map f;

o5 : MultirationalMap (dominant rational map from Y to hypersurface in PP^5)

i6 : Q = target F

o6 = Q

o6 : ProjectiveVariety, hypersurface in PP^5

i7 : f;

o7 : Congruence of 2-secant lines to S in Y; parameter space: Q

i8 : p = point Y;

o8 : ProjectiveVariety, a point in PP^5

i9 : assert(f p == F^* F p)

i10 : 
