-- -*- M2-comint -*- hash: -2090945783

i1 : X = specialFourfold(PP_(ZZ/65521)[2,2]);

o1 : ProjectiveVariety, cubic fourfold containing a surface of degree 4 and sectional genus 0

i2 : W = mirrorFourfold X;

o2 : ProjectiveVariety, fourfold in PP^5 containing a surface of degree 10 and sectional genus 7

i3 : U = surface W;

o3 : ProjectiveVariety, surface in PP^5 (subvariety of codimension 2 in hypersurface in PP^5 defined by a form of degree 2)

i4 : mirrorFourfold W

o4 = X

o4 : ProjectiveVariety, cubic fourfold containing a surface of degree 4 and sectional genus 0

i5 : (building associatedK3surface X)_1

o5 = U

o5 : ProjectiveVariety, surface in PP^5 (subvariety of codimension 2 in hypersurface in PP^5 defined by a form of degree 2)

i6 : assert(oo === U)

i7 : X' = specialFourfold "tau-quadric";

o7 : ProjectiveVariety, GM fourfold containing a surface of degree 2 and sectional genus 0

i8 : W' = mirrorFourfold X';

o8 : ProjectiveVariety, a PP^4 containing a surface of degree 8 and sectional genus 6

i9 : U' = surface W';

o9 : ProjectiveVariety, surface in PP^4

i10 : mirrorFourfold W'

o10 = X'

o10 : ProjectiveVariety, GM fourfold containing a surface of degree 2 and sectional genus 0

i11 : (building associatedK3surface X')_1

o11 = U'

o11 : ProjectiveVariety, surface in PP^4

i12 : assert(oo === U')

i13 : 
