-- -*- M2-comint -*- hash: -1897993101

i1 : X = specialFourfold surface {3,4};

o1 : ProjectiveVariety, cubic fourfold containing a surface of degree 5 and sectional genus 1

i2 : phi = parametrize X;

o2 : MultirationalMap (birational map from PP^4 to X)

i3 : describe phi

o3 = multi-rational map consisting of one single rational map
     source variety: PP^4
     target variety: hypersurface in PP^5 defined by a form of degree 3
     base locus: surface in PP^4 cut out by 6 hypersurfaces of degree 4
     dominance: true
     multidegree: {1, 4, 7, 6, 3}
     degree: 1
     degree sequence (map 1/1): [4]
     coefficient ring: ZZ/65521

i4 : Y = specialFourfold "tau-quadric";

o4 : ProjectiveVariety, GM fourfold containing a surface of degree 2 and sectional genus 0

i5 : psi = parametrize Y;

o5 : MultirationalMap (birational map from PP^4 to Y)

i6 : describe psi

o6 = multi-rational map consisting of one single rational map
     source variety: PP^4
     target variety: 4-dimensional subvariety of PP^8 cut out by 6 hypersurfaces of degree 2
     base locus: surface in PP^4 cut out by 5 hypersurfaces of degrees 3^1 4^4 
     dominance: true
     multidegree: {1, 4, 8, 10, 10}
     degree: 1
     degree sequence (map 1/1): [4]
     coefficient ring: ZZ/65521

i7 : Z = specialFourfold "plane in PP^7";

o7 : ProjectiveVariety, complete intersection of three quadrics in PP^7 containing a surface of degree 1 and sectional genus 0

i8 : eta = parametrize Z;

o8 : MultirationalMap (birational map from PP^4 to Z)

i9 : describe eta

o9 = multi-rational map consisting of one single rational map
     source variety: PP^4
     target variety: 4-dimensional subvariety of PP^7 cut out by 3 hypersurfaces of degree 2
     base locus: surface in PP^4 cut out by 4 hypersurfaces of degrees 3^1 4^3 
     dominance: true
     multidegree: {1, 4, 7, 8, 8}
     degree: 1
     degree sequence (map 1/1): [4]
     coefficient ring: ZZ/65521

i10 : 
