-- -*- M2-comint -*- hash: -347562123

i1 : S = surface {3,4};

o1 : ProjectiveVariety, surface in PP^5

i2 : X = specialFourfold S -- a random cubic fourfold through S

o2 = X

o2 : ProjectiveVariety, cubic fourfold containing a surface of degree 5 and sectional genus 1

i3 : describe X

o3 = Special cubic fourfold of discriminant 14
     containing a (smooth) surface of degree 5 and sectional genus 1
     cut out by 5 hypersurfaces of degree 2

i4 : Y = specialFourfold "tau-quadric" -- a random GM fourfold through a tau-quadric

o4 = Y

o4 : ProjectiveVariety, GM fourfold containing a surface of degree 2 and sectional genus 0

i5 : describe Y

o5 = Special Gushel-Mukai fourfold of discriminant 10(')
     containing a surface in PP^8 of degree 2 and sectional genus 0
     cut out by 6 hypersurfaces of degrees (1,1,1,1,1,2)
     and with class in G(1,4) given by s_(3,1)+s_(2,2)
     Type: ordinary
     (case 1 of Table 1 in arXiv:2002.07026)

i6 : T = surface {3,2};

o6 : ProjectiveVariety, surface in PP^7

i7 : Z = specialFourfold T -- a random c. i. of 3 quadrics through T

o7 = Z

o7 : ProjectiveVariety, complete intersection of three quadrics in PP^7 containing a surface of degree 7 and sectional genus 1

i8 : describe Z

o8 = Complete intersection of 3 quadrics in PP^7
     of discriminant 79 = det| 8 7  |
                             | 7 16 |
     containing a smooth surface of degree 7 and sectional genus 1
     cut out by 14 hypersurfaces of degree 2

i9 : 
