-- -*- M2-comint -*- hash: -1996286929

i1 : E = QQ[e_1..e_4, SkewCommutative => true]

o1 = E

o1 : PolynomialRing, 4 skew commutative variables

i2 : m=matrix {{e_1*e_2,e_3*e_4,0,0,0},{0,0,e_1*e_2,e_2*e_3*e_4,0},{0,0,0,0,e_2*e_3*e_4}}

o2 = | e_1e_2 e_3e_4 0      0         0         |
     | 0      0      e_1e_2 e_2e_3e_4 0         |
     | 0      0      0      0         e_2e_3e_4 |

             3       5
o2 : Matrix E  <--- E

i3 : M=image m

o3 = image | e_1e_2 e_3e_4 0      0         0         |
           | 0      0      e_1e_2 e_2e_3e_4 0         |
           | 0      0      0      0         e_2e_3e_4 |

                             3
o3 : E-module, submodule of E

i4 : getIdeals M

o4 = {ideal (e e , e e ), ideal (e e , e e e ), ideal(e e e )}
              3 4   1 2           1 2   2 3 4          2 3 4

o4 : List

i5 : 
