-- -*- M2-comint -*- hash: 522290639

i1 : E=QQ[e_1..e_4,SkewCommutative=>true]

o1 = E

o1 : PolynomialRing, 4 skew commutative variables

i2 : F=E^{0,0}

      2
o2 = E

o2 : E-module, free

i3 : I_1=ideal(e_1*e_2,e_1*e_3,e_2*e_3)

o3 = ideal (e e , e e , e e )
             1 2   1 3   2 3

o3 : Ideal of E

i4 : I_2=ideal(e_1*e_2,e_1*e_3)

o4 = ideal (e e , e e )
             1 2   1 3

o4 : Ideal of E

i5 : M_1=createModule({I_1,I_2},F)

o5 = image | e_2e_3 e_1e_3 e_1e_2 0      0      |
           | 0      0      0      e_1e_3 e_1e_2 |

                             2
o5 : E-module, submodule of E

i6 : J=ideal(join(flatten entries gens I_1,{e_1*e_2*e_3}))

o6 = ideal (e e , e e , e e , e e e )
             1 2   1 3   2 3   1 2 3

o6 : Ideal of E

i7 : M_2=createModule({J,I_2},F)

o7 = image | e_2e_3 e_1e_3 e_1e_2 0      0      |
           | 0      0      0      e_1e_3 e_1e_2 |

                             2
o7 : E-module, submodule of E

i8 : M_1==M_2

o8 = true

i9 : betti M_1==betti M_2

o9 = true

i10 : minimalBettiNumbers M_1==minimalBettiNumbers M_2

o10 = true

i11 : 
