-- -*- M2-comint -*- hash: 255823651

i1 : E = QQ[e_1..e_4, SkewCommutative => true]

o1 = E

o1 : PolynomialRing, 4 skew commutative variables

i2 : F=E^{0,0}

      2
o2 = E

o2 : E-module, free

i3 : I_1=ideal(e_1*e_2)

o3 = ideal(e e )
            1 2

o3 : Ideal of E

i4 : I_2=ideal(e_1*e_2*e_3,e_1*e_2*e_4,e_1*e_3*e_4)           

o4 = ideal (e e e , e e e , e e e )
             1 2 3   1 2 4   1 3 4

o4 : Ideal of E

i5 : M=createModule({I_1,I_2},F)

o5 = image | e_1e_2 0         0         0         |
           | 0      e_1e_3e_4 e_1e_2e_4 e_1e_2e_3 |

                             2
o5 : E-module, submodule of E

i6 : isStableModule M

o6 = false

i7 : Ms=stableModule M

o7 = image | e_1e_2 e_1e_3e_4 0         0         0         |
           | 0      0         e_1e_3e_4 e_1e_2e_4 e_1e_2e_3 |

                             2
o7 : E-module, submodule of E

i8 : isStableModule Ms

o8 = true

i9 : 
