-- -*- M2-comint -*- hash: -499394107

i1 : L = {graph {{1,2}}, graph {{1,2},{2,3}}, graph {{1,2},{2,3},{3,4}}, graph {{1,2},{2,3},{3,4},{4,5}}};

i2 : s = buildGraphFilter {"NumEdges" => 3};

i3 : filterGraphs(L, s)

o3 = {Graph{1 => {2}   }}
            2 => {1, 3}
            3 => {2, 4}
            4 => {3}

o3 : List

i4 : s = buildGraphFilter {"NumEdges" => (2,3)};

i5 : filterGraphs(L, s)

o5 = {Graph{1 => {2}   }, Graph{1 => {2}   }}
            2 => {1, 3}         2 => {1, 3}
            3 => {2}            3 => {2, 4}
                                4 => {3}

o5 : List

i6 : s = buildGraphFilter {"NumEdges" => (,3)};

i7 : filterGraphs(L, s)

o7 = {Graph{1 => {2}}, Graph{1 => {2}   }, Graph{1 => {2}   }}
            2 => {1}         2 => {1, 3}         2 => {1, 3}
                             3 => {2}            3 => {2, 4}
                                                 4 => {3}

o7 : List

i8 : s = buildGraphFilter {"NumEdges" => (2,)};

i9 : filterGraphs(L, s)

o9 = {Graph{1 => {2}   }, Graph{1 => {2}   }, Graph{1 => {2}   }}
            2 => {1, 3}         2 => {1, 3}         2 => {1, 3}
            3 => {2}            3 => {2, 4}         3 => {2, 4}
                                4 => {3}            4 => {3, 5}
                                                    5 => {4}

o9 : List

i10 : s = buildGraphFilter {"NumEdges" => (2,), "NegateNumEdges" => true};

i11 : filterGraphs(L, s)

o11 = {Graph{1 => {2}}}
             2 => {1}

o11 : List

i12 : 
