-- -*- M2-comint -*- hash: 1695007708

i1 : S = ZZ/101[a..d];

i2 : L = orbitRepresentatives(S,(2,2,2))

                      2        2                   2            
o2 = {monomialIdeal (a , a*b, b ), monomialIdeal (a , a*b, a*c),
     ------------------------------------------------------------------------
                     2                             2        2                
     monomialIdeal (a , a*b, b*c), monomialIdeal (a , a*b, c ), monomialIdeal
     ------------------------------------------------------------------------
       2                             2   2   2                   2   2       
     (a , a*b, c*d), monomialIdeal (a , b , c ), monomialIdeal (a , b , c*d),
     ------------------------------------------------------------------------
                     2
     monomialIdeal (a , b*c, b*d), monomialIdeal (a*b, a*c, b*c),
     ------------------------------------------------------------------------
     monomialIdeal (a*b, a*c, a*d), monomialIdeal (a*b, a*c, b*d)}

o2 : List

i3 : #L

o3 = 11

i4 : tally apply(L, m->betti res m)

                  0 1 2
o4 = Tally{total: 1 3 2 => 4  }
               0: 1 . .
               1: . 3 2
                  0 1 2 3
           total: 1 3 3 1 => 2
               0: 1 . . .
               1: . 3 . .
               2: . . 3 .
               3: . . . 1
                  0 1 2 3
           total: 1 3 3 1 => 2
               0: 1 . . .
               1: . 3 3 1
                  0 1 2 3
           total: 1 3 3 1 => 3
               0: 1 . . .
               1: . 3 1 .
               2: . . 2 1

o4 : Tally

i5 : L' = orbitRepresentatives(S,(2,2,2), MonomialType => "SquareFree")

o5 = {monomialIdeal (a*b, a*c, b*c), monomialIdeal (a*b, a*c, a*d),
     ------------------------------------------------------------------------
     monomialIdeal (a*b, a*c, b*d)}

o5 : List

i6 : #L'

o6 = 3

i7 : tally apply(L', m->betti res m)

                  0 1 2
o7 = Tally{total: 1 3 2 => 2  }
               0: 1 . .
               1: . 3 2
                  0 1 2 3
           total: 1 3 3 1 => 1
               0: 1 . . .
               1: . 3 3 1

o7 : Tally

i8 : I = monomialIdeal"a2,b2,c2,d2"

                     2   2   2   2
o8 = monomialIdeal (a , b , c , d )

o8 : MonomialIdeal of S

i9 : L'' = orbitRepresentatives(S,I,{2,2,2})

                      2        2             2   2                   2      
o9 = {monomialIdeal (a , a*b, b , a*c, b*c, c , d ), monomialIdeal (a , a*b,
     ------------------------------------------------------------------------
      2        2        2                   2        2        2        2
     b , a*c, c , a*d, d ), monomialIdeal (a , a*b, b , a*c, c , b*d, d )}

o9 : List

i10 : tally apply(L'', m->betti res m)

                   0 1  2  3 4
o10 = Tally{total: 1 7 13 10 3 => 1}
                0: 1 .  .  . .
                1: . 7  8  2 .
                2: . .  5  8 3
                   0 1  2  3 4
            total: 1 7 14 11 3 => 1
                0: 1 .  .  . .
                1: . 7  8  3 .
                2: . .  6  8 3
                   0 1  2 3 4
            total: 1 7 12 8 2 => 1
                0: 1 .  . . .
                1: . 7  9 4 1
                2: . .  3 3 .
                3: . .  . 1 1

o10 : Tally

i11 : S = ZZ/101[x_0..x_3, Degrees=>{{1,2},{2,1},{1,1},{1,0}}];

i12 : orbitRepresentatives(S,{{2,2},{2,1}})

                           2                                             2
o12 = {monomialIdeal (x , x ), monomialIdeal (x , x x ), monomialIdeal (x ,
                       1   2                   1   0 3                   2 
      -----------------------------------------------------------------------
      x x ), monomialIdeal (x x , x x )}
       2 3                   0 3   2 3

o12 : List

i13 : S = ZZ/101[a,b];

i14 : L = orbitRepresentatives(S,(2,2,2,2))

o14 = {monomialIdeal ()}

o14 : List

i15 : L = orbitRepresentatives(S,monomialIdeal a^3, (ideal(a,b))^3, 2)

                       3     2   3                   3   2      2
o15 = {monomialIdeal (a , a*b , b ), monomialIdeal (a , a b, a*b )}

o15 : List

i16 : L = orbitRepresentatives(S,monomialIdeal a^3, (ideal(a,b))^3, -2)

                       3   2                    3   3
o16 = {monomialIdeal (a , a b), monomialIdeal (a , b )}

o16 : List

i17 : 
