-- -*- M2-comint -*- hash: -353340295

i1 : E1 = toricVectorBundle(2,hirzebruchFan 3)

o1 = {dimension of the variety => 2 }
      number of affine charts => 4
      number of rays => 4
      rank of the vector bundle => 2

o1 : ToricVectorBundleKlyachko

i2 : E2 = tangentBundle hirzebruchFan 3

o2 = {dimension of the variety => 2 }
      number of affine charts => 4
      number of rays => 4
      rank of the vector bundle => 2

o2 : ToricVectorBundleKlyachko

i3 : E = E1 ** E2

o3 = {dimension of the variety => 2 }
      number of affine charts => 4
      number of rays => 4
      rank of the vector bundle => 4

o3 : ToricVectorBundleKlyachko

i4 : details E

o4 = HashTable{| -1 | => (| -1 1/3 0  0   |, | -1 0 -1 0 |)}
               | 3  |     | 3  0   0  0   |
                          | 0  0   -1 1/3 |
                          | 0  0   3  0   |
               | 0  | => (| 0  1 0  0 |, | -1 0 -1 0 |)
               | -1 |     | -1 0 0  0 |
                          | 0  0 0  1 |
                          | 0  0 -1 0 |
               | 0 | => (| 0 1 0 0 |, | -1 0 -1 0 |)
               | 1 |     | 1 0 0 0 |
                         | 0 0 0 1 |
                         | 0 0 1 0 |
               | 1 | => (| 1 0 0 0 |, | -1 0 -1 0 |)
               | 0 |     | 0 1 0 0 |
                         | 0 0 1 0 |
                         | 0 0 0 1 |

o4 : HashTable

i5 : E1 = toricVectorBundle(2,hirzebruchFan 3,"Type" => "Kaneyama")

o5 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o5 : ToricVectorBundleKaneyama

i6 : E2 = tangentBundle(hirzebruchFan 3,"Type" => "Kaneyama")

o6 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o6 : ToricVectorBundleKaneyama

i7 : E = E1 ** E2

o7 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 4

o7 : ToricVectorBundleKaneyama

i8 : details E

o8 = (HashTable{0 => (| 0 -1 |, | 1 1 -3 -3 |) }, HashTable{(0, 1) => |
                      | 1 3  |  | 0 0 -1 -1 |                         |
                1 => (| 0  -1 |, | 1 1 3 3 |)                         |
                      | -1 3  |  | 0 0 1 1 |                          |
                2 => (| 1 0 |, | -1 -1 0  0  |)             (0, 2) => |
                      | 0 1 |  | 0  0  -1 -1 |                        |
                3 => (| 1 0  |, | -1 -1 0 0 |)                        |
                      | 0 -1 |  | 0  0  1 1 |                         |
                                                            (1, 3) => |
                                                                      |
                                                                      |
                                                                      |
                                                            (2, 3) => |
                                                                      |
                                                                      |
                                                                      |
     ------------------------------------------------------------------------
     1 0 0  0  |})
     0 1 0  0  |
     0 0 -1 0  |
     0 0 0  -1 |
     -1 0  0 0 |
     0  -1 0 0 |
     3  0  1 0 |
     0  3  0 1 |
     -1 0  0 0 |
     0  -1 0 0 |
     -3 0  1 0 |
     0  -3 0 1 |
     1 0 0  0  |
     0 1 0  0  |
     0 0 -1 0  |
     0 0 0  -1 |

o8 : Sequence

i9 : 
