-- -*- M2-comint -*- hash: -276509679

i1 : E = toricVectorBundle(2,pp1ProductFan 2,"Type" => "Kaneyama")

o1 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o1 : ToricVectorBundleKaneyama

i2 : details E

o2 = (HashTable{0 => (| 1 0 |, 0)  }, HashTable{(0, 1) => | 1 0 |})
                      | 0 1 |                             | 0 1 |
                1 => (| 1 0  |, 0)              (0, 2) => | 1 0 |
                      | 0 -1 |                            | 0 1 |
                2 => (| -1 0 |, 0)              (1, 3) => | 1 0 |
                      | 0  1 |                            | 0 1 |
                3 => (| -1 0  |, 0)             (2, 3) => | 1 0 |
                      | 0  -1 |                           | 0 1 |

o2 : Sequence

i3 : A = matrix{{1,2},{0,1}};

              2        2
o3 : Matrix ZZ  <--- ZZ

i4 : B = matrix{{1,0},{3,1}};

              2        2
o4 : Matrix ZZ  <--- ZZ

i5 : C = matrix{{1,-2},{0,1}};

              2        2
o5 : Matrix ZZ  <--- ZZ

i6 : E1 = addBaseChange(E,{A,B,C,matrix{{1,0},{0,1}}})

o6 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o6 : ToricVectorBundleKaneyama

i7 : cocycleCheck E1

o7 = false

i8 : D = inverse(B)*A*C

o8 = | 1  0 |
     | -3 1 |

              2        2
o8 : Matrix ZZ  <--- ZZ

i9 : E1 = addBaseChange(E,{A,B,C,D})

o9 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o9 : ToricVectorBundleKaneyama

i10 : cocycleCheck E1

o10 = true

i11 : 
