-- -*- M2-comint -*- hash: -1418454015

i1 : E = tangentBundle hirzebruchFan 3

o1 = {dimension of the variety => 2 }
      number of affine charts => 4
      number of rays => 4
      rank of the vector bundle => 2

o1 : ToricVectorBundleKlyachko

i2 : u = matrix {{0},{0}}

o2 = 0

              2        1
o2 : Matrix ZZ  <--- ZZ

i3 : eulerChi(u,E)

o3 = 2

i4 : eulerChi E

o4 = 6

i5 : E = tangentBundle(hirzebruchFan 3,"Type" => "Kaneyama")

o5 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o5 : ToricVectorBundleKaneyama

i6 : u = matrix {{0},{0}}

o6 = 0

              2        1
o6 : Matrix ZZ  <--- ZZ

i7 : eulerChi(u,E)

o7 = 2

i8 : eulerChi E

o8 = 6

i9 : 
