-- -*- M2-comint -*- hash: -128671073

i1 : E = toricVectorBundle(2,pp1ProductFan 2)

o1 = {dimension of the variety => 2 }
      number of affine charts => 4
      number of rays => 4
      rank of the vector bundle => 2

o1 : ToricVectorBundleKlyachko

i2 : E = addBase(E,{matrix{{1,2},{3,1}},matrix{{-1,0},{3,1}},matrix{{1,2},{-3,-1}},matrix{{-1,0},{-3,-1}}})

o2 = {dimension of the variety => 2 }
      number of affine charts => 4
      number of rays => 4
      rank of the vector bundle => 2

o2 : ToricVectorBundleKlyachko

i3 : isVectorBundle E

o3 = true

i4 : F = toricVectorBundle(1,normalFan crossPolytope 3)

o4 = {dimension of the variety => 3 }
      number of affine charts => 6
      number of rays => 8
      rank of the vector bundle => 1

o4 : ToricVectorBundleKlyachko

i5 : F = addFiltration(F,apply({2,1,1,2,2,1,1,2}, i -> matrix {{i}}))

o5 = {dimension of the variety => 3 }
      number of affine charts => 6
      number of rays => 8
      rank of the vector bundle => 1

o5 : ToricVectorBundleKlyachko

i6 : isVectorBundle F

o6 = false

i7 : E = toricVectorBundle(2,pp1ProductFan 2,"Type" => "Kaneyama")

o7 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o7 : ToricVectorBundleKaneyama

i8 : isVectorBundle E

o8 = true

i9 : E = addBaseChange(E,{matrix{{1,2},{3,1}},matrix{{-1,0},{3,1}},matrix{{1,2},{-3,-1}},matrix{{-1,0},{-3,-1}}})

o9 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o9 : ToricVectorBundleKaneyama

i10 : isVectorBundle E

o10 = false

i11 : 
