-- -*- M2-comint -*- hash: -401484208

i1 : L1 = {matrix {{1,0},{0,1}},matrix{{0,1},{1,0}},matrix{{-1,0},{-1,1}}}

o1 = {| 1 0 |, | 0 1 |, | -1 0 |}
      | 0 1 |  | 1 0 |  | -1 1 |

o1 : List

i2 : L2 = {matrix {{-1,0}},matrix{{-2,-1}},matrix{{0,1}}}

o2 = {| -1 0 |, | -2 -1 |, | 0 1 |}

o2 : List

i3 : E = toricVectorBundle(2,projectiveSpaceFan 2,L1,L2)

o3 = {dimension of the variety => 2 }
      number of affine charts => 3
      number of rays => 3
      rank of the vector bundle => 2

o3 : ToricVectorBundleKlyachko

i4 : details E

o4 = HashTable{| -1 | => (| 1 0 |, | -1 0 |)}
               | -1 |     | 0 1 |
               | 0 | => (| 0 1 |, | -2 -1 |)
               | 1 |     | 1 0 |
               | 1 | => (| -1 0 |, | 0 1 |)
               | 0 |     | -1 1 |

o4 : HashTable

i5 : L1 = {matrix {{1,0},{0,1}},matrix{{0,1},{1,0}},matrix{{-1,0},{-1,1}}}

o5 = {| 1 0 |, | 0 1 |, | -1 0 |}
      | 0 1 |  | 1 0 |  | -1 1 |

o5 : List

i6 : L2 = {matrix {{-1,0},{0,-1}},matrix{{0,1},{1,0}},matrix{{0,-1},{-1,0}}}

o6 = {| -1 0  |, | 0 1 |, | 0  -1 |}
      | 0  -1 |  | 1 0 |  | -1 0  |

o6 : List

i7 : E = toricVectorBundle(2,projectiveSpaceFan 2,L1,L2,"Type" => "Kaneyama")

o7 = {dimension of the variety => 2 }
      number of affine charts => 3
      rank of the vector bundle => 2

o7 : ToricVectorBundleKaneyama

i8 : details E

o8 = (HashTable{0 => (| -1 0 |, | 1 0 |) }, HashTable{(0, 1) => | -1 0  |})
                      | -1 1 |  | 0 1 |                         | 0  -1 |
                1 => (| 1 0 |, | 0 1 |)               (0, 2) => | 0 1 |
                      | 0 1 |  | 1 0 |                          | 1 0 |
                2 => (| 1 -1 |, | -1 0 |)             (1, 2) => | 0  -1 |
                      | 0 -1 |  | -1 1 |                        | -1 0  |

o8 : Sequence

i9 : 
