-- -*- M2-comint -*- hash: -199964059

i1 : R = ZZ/101[a..d]/ideal"a3"

o1 = R

o1 : QuotientRing

i2 : apply(5, i -> auslanderInvariant ((R^1)/(ideal(vars R))^(i+1)))

o2 = {0, 0, 1, 1, 1}

o2 : List

i3 : R = ZZ/101[a..d]/ideal"a3,b4"

o3 = R

o3 : QuotientRing

i4 : apply(6, i -> auslanderInvariant ((R^1)/(ideal(vars R))^(i+1)))

o4 = {0, 0, 0, 0, 0, 1}

o4 : List

i5 : S = ZZ/101[a,b,c]

o5 = S

o5 : PolynomialRing

i6 : N = matrix{{0,a,0,0,c},
                {0,0,b,c,0},
                {0,0,0,a,0},
                {0,0,0,0,b},
                {0,0,0,0,0}}

o6 = | 0 a 0 0 c |
     | 0 0 b c 0 |
     | 0 0 0 a 0 |
     | 0 0 0 0 b |
     | 0 0 0 0 0 |

             5       5
o6 : Matrix S  <--- S

i7 : M = N-transpose N

o7 = | 0  a  0  0  c |
     | -a 0  b  c  0 |
     | 0  -b 0  a  0 |
     | 0  -c -a 0  b |
     | -c 0  0  -b 0 |

             5       5
o7 : Matrix S  <--- S

i8 : J = pfaffians(4,M)

             2              2        2
o8 = ideal (a , b*c, a*b + c , a*c, b )

o8 : Ideal of S

i9 : R = S/J

o9 = R

o9 : QuotientRing

i10 : I = ideal vars R

o10 = ideal (a, b, c)

o10 : Ideal of R

i11 : scan(5, i->print auslanderInvariant ((R^1)/(I^i)))
0
0
0
1
1

i12 : 
