-- -*- M2-comint -*- hash: 1102071495

i1 : setRandomSeed 100

o1 = 100

i2 : c = 3;d=3;

i4 : S = setupRings(c,d);

i5 : R = S_c; -- complete intersection, codim = c

i6 : R' = S_(c-1); --codim c-1

i7 : Mc = coker vars R;

i8 : (M,k,p) = setupModules(S,Mc); --M_(c-1) is Mc as an R_(c-1)-module

i9 : ca = coApproximation M_(c-1);

o9 : Matrix

i10 : M'' = coker ca;

i11 : N = target ca

o11 = cokernel {-4} | x_0^2x_1^2x_2 14x_0^2x_2^3  8x_1^2x_2^3     14x_2 |
               {-4} | x_0^2x_2^3    x_0^2x_1x_2^2 8x_2^5          x_1   |
               {-4} | 15x_1^2x_2^3  8x_2^5        15x_0x_1^2x_2^2 x_0   |

                               3
o11 : R'-module, quotient of R'

i12 : profondeur M'' == dim ring M'' -- an MCM module

o12 = true

i13 : M'' == source approximation(M'', Total=>false) -- no free summands

o13 = false

i14 : 2 == length res(N, LengthLimit =>10) -- projective dimension <\infty

o14 = true

i15 : 
