-- -*- M2-comint -*- hash: 611729269

i1 : I = adjacentMinorsIdeal(QQ,2,10);

o1 : Ideal of QQ[a..t]

i2 : N = chordalNet I;

i3 : chordalTria N;

i4 : topComponents N;

i5 : N

o5 = ChordalNet{ a => { , a*d - b*c}                  }
                 b => { ,  }
                 c => {c,  , c*f - d*e}
                 d => {d,  ,  }
                 e => { , e*h - f*g, e,  , e*h - f*g}
                 f => { ,  , f,  ,  }
                 g => {g,  , g*j - h*i,  , g*j - h*i}
                 h => {h,  ,  ,  ,  }
                 i => { , i*l - j*k, i,  , i*l - j*k}
                 j => { ,  , j,  ,  }
                 k => {k,  , k*n - l*m,  , k*n - l*m}
                 l => {l,  ,  ,  ,  }
                 m => { , m*p - n*o, m,  , m*p - n*o}
                 n => { ,  , n,  ,  }
                 o => {o,  , o*r - p*q,  , o*r - p*q}
                 p => {p,  ,  ,  ,  }
                 q => {q*t - r*s, q, q*t - r*s}
                 r => { , r,  }
                 s => { ,  }
                 t => { ,  }

o5 : ChordalNet

i6 : codimCount N

        9
o6 = 55t

o6 : ZZ[t]

i7 : G = cartesianProduct(cycleGraph 3, pathGraph 5);

i8 : I = edgeIdeal G;

o8 : MonomialIdeal of QQ[x ..x  ]
                          1   15

i9 : N = chordalNet(I,"SuggestOrder");

i10 : chordalTria N;

i11 : topComponents N;

i12 : N

o12 = ChordalNet{ x  => {x ,  }                }
                   1      1
                  x  => {x , x ,  }
                   2      2   2
                  x  => {x ,  , x , x }
                   6      6      6   6
                  x  => {x , x ,  }
                   3      3   3
                  x  => {x , x ,  }
                   5      5   5
                  x  => {x ,  , x , x }
                   9      9      9   9
                  x  => {x , x ,  }
                   4      4   4
                  x  => {x , x ,  }
                   8      8   8
                  x   => {x  ,  , x  , x  }
                   10      10      10   10
                  x  => {x , x ,  }
                   7      7   7
                  x   => {x  , x  ,  }
                   12      12   12
                  x   => {x  , x  ,  , x  ,  }
                   11      11   11      11
                  x   => {x  ,  ,  , x  , x  }
                   13      13         13   13
                  x   => {x  ,  , x  }
                   14      14      14
                  x   => { , x  }
                   15         15

o12 : ChordalNet

i13 : codimCount N

         10
o13 = 48t

o13 : ZZ[t]

i14 : 
