-- -*- M2-comint -*- hash: 1115411119

i1 : R = QQ[a,b,c,d,MonomialOrder=>Lex];

i2 : I = ideal {a*b, a*c, b*c, c*d};

o2 : Ideal of R

i3 : N = chordalNet I;

i4 : chordalTria N;

i5 : reduceNet N;

i6 : N

o6 = ChordalNet{ a => {a,  }    }
                 b => {b,  , b}
                 c => {c,  }
                 d => { , d}

o6 : ChordalNet

i7 : nodes N / (Ni -> label Ni)

o7 = {a_0, a_1, b_0, b_1, b_2, c_0, c_1, d_0, d_1}

o7 : List

i8 : digraph N

o8 = Digraph{a_0 => {b_0, b_1}}
             a_1 => {b_2}
             b_0 => {c_1}
             b_1 => {c_0}
             b_2 => {c_0}
             c_0 => {d_0}
             c_1 => {d_1}
             d_0 => {}
             d_1 => {}

o8 : Digraph

i9 : 
