-- -*- M2-comint -*- hash: -1945236733

i1 : I = adjacentMinorsIdeal(QQ,2,5)

o1 = ideal (a*d - b*c, c*f - d*e, e*h - f*g, g*j - h*i)

o1 : Ideal of QQ[a..j]

i2 : N = chordalNet I;

i3 : chordalTria N;

i4 : topComponents N;

i5 : N

o5 = ChordalNet{ a => { , a*d - b*c}                  }
                 b => { ,  }
                 c => {c,  , c*f - d*e}
                 d => {d,  ,  }
                 e => { , e*h - f*g, e,  , e*h - f*g}
                 f => { ,  , f,  ,  }
                 g => {g, g*j - h*i, g*j - h*i}
                 h => {h,  ,  }
                 i => { ,  }
                 j => { ,  }

o5 : ChordalNet

i6 : isPrimeSimple N

o6 = true

i7 : C = nextChain N

o7 = ChordalNetChain{a => a*d - b*c}
                     b =>  
                     c => c*f - d*e
                     d =>  
                     e =>  
                     f =>  
                     g => g
                     h => h
                     i =>  
                     j =>  

o7 : ChordalNetChain

i8 : isPrimeSimple triaSystem(N,C)

o8 = true

i9 : 
dmat lu qq PLU
