-- -*- M2-comint -*- hash: 1056827493

i1 : R = QQ[a..j,MonomialOrder=>Lex];

i2 : I = ideal {a*d - b*c, c*f - d*e, e*h - f*g, g*j - h*i, a*j - b*i};

o2 : Ideal of R

i3 : N = chordalNet I;

i4 : chordalTria N;

i5 : codimCount N

       7      6      5    4
o5 = 2t  + 17t  + 14t  + t

o5 : ZZ[t]

i6 : reduceDimension(N,2);

i7 : codimCount N

        5    4
o7 = 14t  + t

o7 : ZZ[t]

i8 : reduceDimension(N,1);

i9 : codimCount N

      4
o9 = t

o9 : ZZ[t]

i10 : 
