-- -*- M2-comint -*- hash: 1881448272

i1 : H = cycleGraph 4;

i2 : G = addEdge(H, set {0,2})

o2 = Graph{0 => {1, 2, 3}}
           1 => {0, 2}
           2 => {0, 1, 3}
           3 => {0, 2}

o2 : Graph

i3 : G = addEdges'(H, {{0,2},{3,1}})

o3 = Graph{0 => {1, 2, 3}}
           1 => {0, 2, 3}
           2 => {0, 1, 3}
           3 => {0, 1, 2}

o3 : Graph

i4 : 
