-- -*- M2-comint -*- hash: 1228625766

i1 : D = digraph({1,2,3,4},{{1,2},{2,3},{3,4},{4,2},{2,4}});

i2 : degree(D, 3)

o2 = 2

i3 : degree(D, 2)

o3 = 3

i4 : 
