-- -*- M2-comint -*- hash: 901278568

i1 : G = graph({1,2,3,4,5},{{1,3},{3,4},{4,5}});

i2 : L = {1,2};

i3 : deleteVertices(G,L)

o3 = Graph{3 => {4}   }
           4 => {3, 5}
           5 => {4}

o3 : Graph

i4 : 
