-- -*- M2-comint -*- hash: 396637424

i1 : D = digraph({{1,2},{2,1},{3,1}},EntryMode=>"edges");

i2 : edges D

o2 = {{1, 2}, {2, 1}, {3, 1}}

o2 : List

i3 : G = cycleGraph 4;

i4 : edges G

o4 = {set {0, 1}, set {0, 3}, set {1, 2}, set {2, 3}}

o4 : List

i5 : 
