-- -*- M2-comint -*- hash: 687129348

i1 : G = completeGraph 5

o1 = Graph{0 => {1, 2, 3, 4}}
           1 => {0, 2, 3, 4}
           2 => {0, 1, 3, 4}
           3 => {0, 1, 2, 4}
           4 => {0, 1, 2, 3}

o1 : Graph

i2 : S = {3,4}

o2 = {3, 4}

o2 : List

i3 : inducedSubgraph(G,S)

o3 = Graph{3 => {4}}
           4 => {3}

o3 : Graph

i4 : D = digraph ({{1,2},{2,3},{3,4},{4,1},{2,4}},EntryMode=>"edges");

i5 : D' = inducedSubgraph(D,{1,2,4})

o5 = Digraph{1 => {2}}
             2 => {4}
             4 => {1}

o5 : Digraph

i6 : 
