-- -*- M2-comint -*- hash: -473418371

i1 : R = CC[x,y,z];

i2 : F = {x^2+y^2+z^2-1, y-x^2, z-x^3};

i3 : s = solveSystem F 

o3 = {{.540536+1.03152*ii, -.771845+1.11514*ii, -1.5675-.193395*ii},
     ------------------------------------------------------------------------
     {-.737353, .543689, -.400891}, {-.540536-1.03152*ii,
     ------------------------------------------------------------------------
     -.771845+1.11514*ii, 1.5675+.193395*ii}, {-.540536+1.03152*ii,
     ------------------------------------------------------------------------
     -.771845-1.11514*ii, 1.5675-.193395*ii}, {.737353, .543689, .400891},
     ------------------------------------------------------------------------
     {.540536-1.03152*ii, -.771845-1.11514*ii, -1.5675+.193395*ii}}

o3 : List

i4 : realPoints s

o4 = {{-.737353, .543689, -.400891}, {.737353, .543689, .400891}}

o4 : List

i5 : R = CC[x,y,z];

i6 : sph = x^2+y^2+z^2-1; 

i7 : I = ideal {x*sph*(y-x^2), sph*(z-x^3)};

o7 : Ideal of R

i8 : numericalIrreducibleDecomposition I 

o8 = a "numerical variety" with components in
     dim 1:  (dim=1,deg=1) (dim=1,deg=3)
     dim 2:  (dim=2,deg=2)

o8 : NumericalVariety

i9 : 
