-- -*- M2-comint -*- hash: 1991796909

i1 : R = CC[x,y];

i2 : S = {x^2-1,y^2-1};

i3 : T = {x^2+y^2-1, x*y};

i4 : solsS = {(1,-1),(1,1),(-1,1),(-1,-1)};

i5 : track(S,T,solsS)  

o5 = {{-4.40616e-16, -1}, {1, 1.22819e-15}, {4.40616e-16, 1}, {-1,
     ------------------------------------------------------------------------
     -1.22819e-15}}

o5 : List

i6 : R = CC[x,y];

i7 : S = {x^2-1,y^2-1};

i8 : T = {x^2+y^2-1, x-y};

i9 : solsS = {(1,-1),(1,1),(-1,1),(-1,-1)};

i10 : track(S,T,solsS,gamma=>0.6+0.8*ii) 

o10 = {[M,t=.999998], {.707107, .707107}, [M,t=.999998], {-.707107,
      -----------------------------------------------------------------------
      -.707107}}

o10 : List

i11 : R = CC[x,y];

i12 : S = {x^2-1,y^2-1};

i13 : T = {x^2+y^2-1, (x-y)^2};

i14 : solsS = {(1,-1),(1,1),(-1,1),(-1,-1)};

i15 : track(S,T,solsS)

o15 = {[M,t=.999998], [M,t=.999998], [M,t=.999998], [M,t=.999998]}

o15 : List

i16 : R = CC[x,y,z];

i17 : S = {x^2-z^2,y^2-z^2};

i18 : T = {x^2+y^2-z^2, x*y};

i19 : solsS = {(1,-1,1),(1,1,1),(-1,1,1),(-1,-1,1)};

i20 : track(S,T,solsS,Predictor=>Certified,Normalize=>true)

o20 = {{.00000107266, -.70712, .70712}, {.707125, -1.48993e-7, .707107},
      -----------------------------------------------------------------------
      {-.00000107266, .70712, .70712}, {-.707125, 1.48993e-7, .707107}}

o20 : List

i21 : 
