-- -*- M2-comint -*- hash: -710670039

i1 : setRandomSeed 0

o1 = 0

i2 : S = ZZ/101[a,b]

o2 = S

o2 : PolynomialRing

i3 : mm = ideal vars S

o3 = ideal (a, b)

o3 : Ideal of S

i4 : M0 = mm^3*S^{3} ++ S^{-1};

i5 : M1 =S^1/ideal(a^3)++S^{-1}/(ideal b^2)++S^1/(ideal b^2) ;

i6 : M = M0++M1;

i7 : L = analyze M0;

i8 : freegens = L_0

o8 = {1, -3}

o8 : List

i9 : anns = L_1

o9 = {}

o9 : List

i10 : e = L_2

o10 = {1}  | 0  0   0   0  1 |
      {-3} | a3 a2b ab2 b3 0 |

o10 : Matrix

i11 : D = L_3

o11 = 0

o11 : Matrix 0 <--- 0

i12 : 
