-- -*- M2-comint -*- hash: 1920430087

i1 : R = CC[x,y]; I = ideal((x^2+y^2+2)*x,(x^2+y^2+2)*y*(y-1));

o2 : Ideal of R

i3 : w1 := witnessSet(I , ideal(x-y), {point {{0.999*ii,0.999*ii}}, point {{-1.001*ii,-1.001*ii}}} )

o3 = [dim=1,deg=2]-*may be reducible*-

o3 : WitnessSet

i4 : w0 := witnessSet(I, ideal R, {point {{0.,0.}}})

o4 = [dim=0,deg=1]-*may be reducible*-

o4 : WitnessSet

i5 : w0' := witnessSet(I, ideal R, {point {{0.,1.}}})

o5 = [dim=0,deg=1]-*may be reducible*-

o5 : WitnessSet

i6 : V := numericalVariety {w0,w1,w0'}

o6 = a "numerical variety" with components in
     dim 0:  [dim=0,deg=1]-*may be reducible*- [dim=0,deg=1]-*may be reducible*-
     dim 1:  [dim=1,deg=2]-*may be reducible*-

o6 : NumericalVariety

i7 : dim V

o7 = 1

i8 : degree V

o8 = 2

i9 : 
