-- -*- M2-comint -*- hash: -1153638591

i1 : R = CC[x,y]	

o1 = R

o1 : PolynomialRing

i2 : I = ideal((x^2+y^2+2)*x,(x^2+y^2+2)*y);

o2 : Ideal of R

i3 : w1 = witnessSet(I , ideal(x-y), {point {{0.999999*ii,0.999999*ii}}, point {{-1.000001*ii,-1.000001*ii}}} )

o3 = w1

o3 : WitnessSet

i4 : O = point {{0.,0.}}

o4 = O

o4 : Point

i5 : numericalVariety {witnessSet(I, ideal R, {O}),w1}

o5 = a "numerical variety" with components in
     dim 0:  [dim=0,deg=1]-*may be reducible*-
     dim 1:  w1

o5 : NumericalVariety

i6 : V = oo

o6 = V

o6 : NumericalVariety

i7 : peek V

o7 = NumericalVariety{0 => {[dim=0,deg=1]-*may be reducible*-}}
                      1 => {w1}

i8 : peek w1

o8 = WitnessSet{cache => CacheTable{...1...}        }
                Equations => {-3} | x3+xy2+2x |
                             {-3} | x2y+y3+2y |
                Points => {{.999999*ii, .999999*ii}}
                          {{-ii, -ii}              }
                Slice => | 1 -1 0 |

i9 : peek O

o9 = Point{cache => CacheTable{}}
           Coordinates => {0, 0}

i10 : 
