-- -*- M2-comint -*- hash: 829606699

i1 : R = CC[x,y]; I = ideal((x^2+y^2+2)*x,(x^2+y^2+2)*y);

o2 : Ideal of R

i3 : w1 := witnessSet(I , ideal(x-y), {point {{0.999999*ii,0.999999*ii}}, point {{-1.000001*ii,-1.000001*ii}}} )

o3 = [dim=1,deg=2]-*may be reducible*-

o3 : WitnessSet

i4 : w0 := witnessSet(I, ideal R, {point {{0.,0.}}})

o4 = [dim=0,deg=1]-*may be reducible*-

o4 : WitnessSet

i5 : V := numericalVariety {w0,w1}

o5 = a "numerical variety" with components in
     dim 0:  [dim=0,deg=1]-*may be reducible*-
     dim 1:  [dim=1,deg=2]-*may be reducible*-

o5 : NumericalVariety

i6 : components V    

o6 = {[dim=0,deg=1]-*may be reducible*-, [dim=1,deg=2]-*may be reducible*-}

o6 : List

i7 : 
