-- -*- M2-comint -*- hash: 1170217594

i1 : R = CC[x,y];

i2 : M = matrix{{1,x,x^2-y}}

o2 = | 1 x x2-y |

             1       3
o2 : Matrix R  <--- R

i3 : p = point matrix{{1,0}};

i4 : D = dualSpace(M,p)

o4 = | 1 x x2-y |

o4 : DualSpace

i5 : 
