-- -*- M2-comint -*- hash: 321061227

i1 : R = CC[x,y]; I = ideal((x^2+y^2+2)*x,(x^2+y^2+2)*y);

o2 : Ideal of R

i3 : w1 = witnessSet(I , ideal(x-y), {point {{0.999999*ii,0.999999*ii}}, point {{-1.000001*ii,-1.000001*ii}}} )

o3 = w1

o3 : WitnessSet

i4 : w0 = witnessSet(I, ideal R, {point {{0.,0.}}})

o4 = w0

o4 : WitnessSet

i5 : V = numericalVariety {w0,w1}

o5 = V

o5 : NumericalVariety

i6 : 
