-- -*- M2-comint -*- hash: 2064709601

i1 : setRandomSeed 100;

i2 : declareVariable \ {t_1,t_2,u_0,u_1,u_2,u_3};

i3 : paramMatrix = gateMatrix{{u_0,u_1,u_2,u_3}};

i4 : varMatrix = gateMatrix{{t_1,t_2}};

i5 : phi = transpose gateMatrix{{t_1^3, t_1^2*t_2, t_1*t_2^2, t_2^3}};

i6 : loss = sum for i from 0 to 3 list (u_i - phi_(i,0))^2;

i7 : dLoss = diff(varMatrix, gateMatrix{{loss}});

i8 : G = gateSystem(paramMatrix,varMatrix,transpose dLoss);

i9 : monodromyGroup(G,"msOptions" => {NumberOfEdges=>10})

o9 = {{13, 10, 8, 15, 6, 7, 9, 11, 12, 4, 14, 5, 2, 16, 1, 17, 0, 3, 19, 20,
     ------------------------------------------------------------------------
     18}, {1, 16, 3, 19, 9, 2, 4, 8, 15, 6, 0, 12, 17, 10, 13, 20, 14, 18,
     ------------------------------------------------------------------------
     11, 5, 7}, {6, 0, 5, 2, 14, 19, 1, 20, 7, 10, 13, 18, 11, 9, 16, 8, 4,
     ------------------------------------------------------------------------
     12, 17, 3, 15}, {13, 10, 8, 15, 6, 7, 9, 11, 12, 4, 14, 5, 2, 16, 1, 17,
     ------------------------------------------------------------------------
     0, 3, 19, 20, 18}, {13, 10, 9, 8, 20, 7, 18, 11, 4, 19, 14, 5, 6, 16, 1,
     ------------------------------------------------------------------------
     12, 0, 2, 3, 15, 17}, {10, 5, 6, 15, 0, 20, 13, 18, 9, 16, 7, 19, 4, 14,
     ------------------------------------------------------------------------
     11, 17, 1, 3, 8, 12, 2}, {3, 16, 14, 4, 5, 2, 7, 8, 1, 11, 0, 12, 10,
     ------------------------------------------------------------------------
     15, 13, 6, 17, 9, 18, 19, 20}, {6, 0, 5, 2, 14, 19, 1, 20, 7, 10, 13,
     ------------------------------------------------------------------------
     18, 11, 9, 16, 8, 4, 12, 3, 15, 17}, {0, 1, 15, 12, 4, 5, 6, 7, 17, 9,
     ------------------------------------------------------------------------
     10, 11, 3, 13, 14, 2, 16, 8, 19, 20, 18}, {13, 10, 8, 15, 6, 7, 9, 11,
     ------------------------------------------------------------------------
     12, 4, 14, 5, 2, 16, 1, 17, 0, 3, 19, 20, 18}, {13, 10, 8, 15, 6, 7, 9,
     ------------------------------------------------------------------------
     11, 12, 4, 14, 5, 2, 16, 1, 17, 0, 3, 19, 20, 18}, {0, 10, 5, 2, 6, 3,
     ------------------------------------------------------------------------
     9, 15, 7, 4, 14, 17, 11, 13, 1, 8, 16, 12, 18, 19, 20}, {13, 10, 8, 15,
     ------------------------------------------------------------------------
     6, 7, 9, 11, 12, 4, 14, 5, 2, 16, 1, 17, 0, 3, 19, 20, 18}, {0, 1, 2, 3,
     ------------------------------------------------------------------------
     4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20}, {0, 1,
     ------------------------------------------------------------------------
     15, 12, 4, 5, 6, 7, 17, 9, 10, 11, 3, 13, 14, 2, 16, 8, 19, 20, 18}, {0,
     ------------------------------------------------------------------------
     14, 3, 19, 9, 2, 4, 8, 15, 6, 1, 12, 17, 13, 10, 20, 16, 18, 11, 5, 7},
     ------------------------------------------------------------------------
     {13, 10, 8, 15, 6, 7, 9, 11, 12, 4, 14, 5, 2, 16, 1, 17, 0, 3, 19, 20,
     ------------------------------------------------------------------------
     18}, {13, 19, 9, 8, 14, 11, 1, 5, 4, 10, 20, 7, 6, 16, 18, 12, 0, 2, 3,
     ------------------------------------------------------------------------
     15, 17}, {9, 13, 19, 8, 14, 11, 1, 5, 20, 10, 16, 7, 18, 4, 0, 12, 6, 2,
     ------------------------------------------------------------------------
     3, 15, 17}, {6, 0, 1, 15, 20, 8, 18, 12, 10, 19, 13, 2, 14, 9, 16, 17,
     ------------------------------------------------------------------------
     4, 3, 5, 7, 11}, {13, 10, 9, 8, 19, 7, 20, 11, 4, 18, 14, 5, 6, 16, 1,
     ------------------------------------------------------------------------
     12, 0, 2, 3, 15, 17}, {2, 0, 1, 3, 6, 5, 9, 7, 10, 4, 13, 11, 14, 8, 16,
     ------------------------------------------------------------------------
     15, 12, 17, 18, 19, 20}, {13, 10, 9, 8, 20, 11, 18, 5, 4, 19, 14, 7, 6,
     ------------------------------------------------------------------------
     16, 1, 12, 0, 2, 3, 15, 17}, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,
     ------------------------------------------------------------------------
     13, 14, 15, 16, 17, 18, 19, 20}, {0, 1, 15, 12, 4, 5, 6, 7, 17, 9, 10,
     ------------------------------------------------------------------------
     11, 3, 13, 14, 2, 16, 8, 19, 20, 18}, {6, 10, 5, 2, 0, 19, 13, 20, 7,
     ------------------------------------------------------------------------
     16, 14, 18, 11, 9, 1, 8, 4, 12, 17, 3, 15}, {13, 10, 8, 15, 6, 7, 9, 11,
     ------------------------------------------------------------------------
     12, 4, 14, 5, 2, 16, 1, 17, 0, 3, 19, 20, 18}, {9, 13, 19, 8, 14, 11, 1,
     ------------------------------------------------------------------------
     5, 20, 10, 16, 7, 18, 4, 0, 12, 6, 2, 3, 15, 17}, {4, 16, 14, 3, 5, 2,
     ------------------------------------------------------------------------
     7, 8, 1, 11, 0, 12, 10, 6, 13, 15, 9, 17, 18, 19, 20}, {9, 13, 7, 8, 14,
     ------------------------------------------------------------------------
     20, 1, 18, 11, 10, 16, 19, 5, 4, 0, 12, 6, 2, 3, 15, 17}, {1, 16, 3, 19,
     ------------------------------------------------------------------------
     9, 2, 4, 8, 15, 6, 0, 12, 17, 10, 13, 20, 14, 18, 11, 5, 7}, {13, 10, 8,
     ------------------------------------------------------------------------
     15, 6, 7, 9, 11, 12, 4, 14, 5, 2, 16, 1, 17, 0, 3, 19, 20, 18}, {13, 10,
     ------------------------------------------------------------------------
     8, 15, 6, 7, 9, 11, 12, 4, 14, 5, 2, 16, 1, 17, 0, 3, 19, 20, 18}, {13,
     ------------------------------------------------------------------------
     7, 9, 8, 14, 20, 1, 18, 4, 10, 11, 19, 6, 16, 5, 12, 0, 2, 3, 15, 17},
     ------------------------------------------------------------------------
     {6, 0, 1, 2, 20, 5, 18, 7, 10, 19, 13, 11, 14, 9, 16, 8, 4, 12, 17, 3,
     ------------------------------------------------------------------------
     15}, {4, 1, 2, 3, 0, 5, 13, 7, 8, 16, 10, 11, 12, 6, 14, 15, 9, 17, 18,
     ------------------------------------------------------------------------
     19, 20}, {6, 0, 1, 15, 20, 5, 18, 7, 10, 19, 13, 11, 14, 9, 16, 17, 4,
     ------------------------------------------------------------------------
     3, 8, 12, 2}, {9, 13, 19, 8, 14, 11, 1, 5, 20, 10, 16, 7, 18, 4, 0, 12,
     ------------------------------------------------------------------------
     6, 2, 17, 3, 15}, {0, 1, 15, 12, 4, 5, 6, 7, 17, 9, 10, 11, 3, 13, 14,
     ------------------------------------------------------------------------
     2, 16, 8, 19, 20, 18}, {13, 10, 5, 2, 6, 3, 9, 15, 7, 4, 14, 17, 11, 16,
     ------------------------------------------------------------------------
     1, 8, 0, 12, 18, 19, 20}, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13,
     ------------------------------------------------------------------------
     14, 15, 16, 17, 18, 19, 20}, {0, 1, 3, 19, 12, 5, 2, 7, 15, 8, 10, 11,
     ------------------------------------------------------------------------
     17, 13, 14, 20, 16, 18, 9, 4, 6}, {6, 10, 8, 15, 13, 7, 16, 11, 12, 0,
     ------------------------------------------------------------------------
     14, 5, 2, 9, 1, 17, 4, 3, 19, 20, 18}, {2, 1, 0, 3, 4, 5, 6, 7, 13, 9,
     ------------------------------------------------------------------------
     10, 11, 16, 8, 14, 15, 12, 17, 18, 19, 20}, {6, 0, 8, 15, 14, 7, 1, 11,
     ------------------------------------------------------------------------
     12, 10, 13, 5, 2, 9, 16, 17, 4, 3, 19, 20, 18}, {6, 0, 5, 2, 14, 19, 1,
     ------------------------------------------------------------------------
     20, 7, 10, 13, 18, 11, 9, 16, 8, 4, 12, 17, 3, 15}, {0, 1, 2, 3, 4, 5,
     ------------------------------------------------------------------------
     6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20}, {0, 1, 2, 3, 4,
     ------------------------------------------------------------------------
     5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20}, {0, 5, 6,
     ------------------------------------------------------------------------
     15, 19, 10, 20, 14, 9, 18, 7, 1, 4, 13, 11, 17, 16, 3, 8, 12, 2}, {13,
     ------------------------------------------------------------------------
     10, 5, 2, 6, 3, 9, 15, 7, 4, 14, 17, 11, 16, 1, 8, 0, 12, 18, 19, 20},
     ------------------------------------------------------------------------
     {8, 0, 6, 20, 14, 7, 1, 11, 9, 10, 13, 5, 4, 12, 16, 18, 2, 19, 3, 15,
     ------------------------------------------------------------------------
     17}, {2, 0, 1, 19, 4, 5, 6, 7, 10, 9, 13, 11, 14, 8, 16, 20, 12, 18, 17,
     ------------------------------------------------------------------------
     3, 15}, {13, 19, 9, 8, 14, 11, 1, 5, 4, 10, 20, 7, 6, 16, 18, 12, 0, 2,
     ------------------------------------------------------------------------
     3, 15, 17}, {8, 10, 6, 20, 13, 7, 16, 11, 9, 0, 14, 5, 4, 12, 1, 18, 2,
     ------------------------------------------------------------------------
     19, 3, 15, 17}, {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15,
     ------------------------------------------------------------------------
     16, 17, 18, 19, 20}}

o9 : List

i10 : 
