-- -*- M2-comint -*- hash: -1643915995

i1 : S = ZZ/101[x,y]

o1 = S

o1 : PolynomialRing

i2 : R = S/ideal(x^2,y^2,x*y)

o2 = R

o2 : QuotientRing

i3 : KR = koszulComplexDGA(ideal R)

o3 = {Ring => S                      }
      Underlying algebra => S[T ..T ]
                               1   3
                        2   2
      Differential => {x , y , x*y}

o3 : DGAlgebra

i4 : lastCyclesDegree = 4

o4 = 4

i5 : A = acyclicClosure(KR, EndDegree => lastCyclesDegree)

o5 = {Ring => S                                                                                                                                                                                                                                                                                                                                                                                                                                                           }
      Underlying algebra => S[T ..T  ]
                               1   25
                        2   2                                                                                                                                                                                                                 2                                   2                                                                           2                                                                          2
      Differential => {x , y , x*y, x*T  - y*T , - y*T  + x*T , T T  + y*T , - T T  + x*T  + y*T , - T T  + x*T , - T T  + y*T , - T T  + x*T , - T T  - T T  + y*T , - T T  - T T  + x*T , - T T  + y*T , - T T  + x*T , - T T  + y*T , - 50T  - T T  + x*T , - T T  + y*T  , 50T  - T T  + y*T  , T T  + x*T   - y*T  , - T T  - T T  + x*T   + y*T  , - 50T  - T T  + x*T  , - T T  - T T  - T T  + y*T   + y*T  , - T T  + x*T  , 50T  - T T  + y*T  , - T T  + x*T  }
                                       2      3       1      3   2 3      4     1 2      4      5     1 3      5     2 4      6     3 4      6     3 4    2 5      7     1 4    3 5      7     3 5      8     1 5      8     2 6      9       4    3 6      9     3 6      10     4    2 7      11   4 5      11      12     1 6    3 7      10      12       5    1 7      12     4 5    3 7    2 8      12      13     3 8      13     5    3 8      14     1 8      14

o5 : DGAlgebra

i6 : bracketMatrix(A,1,1)

o6 = | 2T_1 T_3  |
     | T_3  2T_2 |

                        2                  2
o6 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                1   25             1   25

i7 : bracketMatrix(A,2,1)

o7 = | 0   -T_5 |
     | T_4 0    |
     | T_5 -T_4 |

                        3                  2
o7 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                1   25             1   25

i8 : bracketMatrix(A,2,2)

o8 = | 0   -T_7 -T_8 |
     | T_7 0    T_6  |
     | T_8 -T_6 0    |

                        3                  3
o8 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                1   25             1   25

i9 : bracketMatrix(A,1,1) - transpose bracketMatrix(A,1,1)

o9 = 0

                        2                  2
o9 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                1   25             1   25

i10 : bracketMatrix(A,2,1) + transpose bracketMatrix(A,1,2)

o10 = 0

                         3                  2
o10 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                 1   25             1   25

i11 : 
