-- -*- M2-comint -*- hash: 733348883

i1 : kk = ZZ/101

o1 = kk

o1 : QuotientRing

i2 : S = kk[x,y,z]

o2 = S

o2 : PolynomialRing

i3 : R = S/ideal(x^2,y^2,z^2-x*y,x*z, y*z)

o3 = R

o3 : QuotientRing

i4 : lastCyclesDegree = 4

o4 = 4

i5 : KR = koszulComplexDGA(ideal R)

o5 = {Ring => S                                     }
      Underlying algebra => S[T ..T ]
                               1   5
                        2   2           2
      Differential => {x , y , - x*y + z , x*z, y*z}

o5 : DGAlgebra

i6 : A = acyclicClosure(KR, EndDegree => lastCyclesDegree);

i7 : d = 1

o7 = 1

i8 : e = 1

o8 = 1

i9 : U = sum (Gd = allgens(A,d-1))

o9 = x + y + z

o9 : S[T ..T  ]
        1   99

i10 : ad(A,U,1)

o10 = {1, 2} | 2  0  0 |
      {1, 2} | 0  2  0 |
      {1, 2} | -1 -1 2 |
      {1, 2} | 1  0  1 |
      {1, 2} | 0  1  1 |

                         5                  3
o10 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                 1   99             1   99

i11 : matrix{{1,1,1}}*bracketMatrix(A,d,e)

o11 = | 2T_1-T_3+T_4 2T_2-T_3+T_5 2T_3+T_4+T_5 |

                         1                  3
o11 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                 1   99             1   99

i12 : 
