-- -*- M2-comint -*- hash: 1793742393

i1 : kk = ZZ/101

o1 = kk

o1 : QuotientRing

i2 : S = kk[x,y,z]

o2 = S

o2 : PolynomialRing

i3 : R = S/ideal(x^2,y^2,z^2-x*y,x*z, y*z)

o3 = R

o3 : QuotientRing

i4 : lastCyclesDegree = 1

o4 = 1

i5 : KR = koszulComplexDGA(ideal R)

o5 = {Ring => S                                     }
      Underlying algebra => S[T ..T ]
                               1   5
                        2   2           2
      Differential => {x , y , - x*y + z , x*z, y*z}

o5 : DGAlgebra

i6 : A = acyclicClosure(KR, EndDegree => lastCyclesDegree);

i7 : g = gens(A.natural)

o7 = {T , T , T , T , T , T , T , T , T , T  }
       1   2   3   4   5   6   7   8   9   10

o7 : List

i8 : g/degree

o8 = {{1, 2}, {1, 2}, {1, 2}, {1, 2}, {1, 2}, {2, 3}, {2, 3}, {2, 3}, {2, 3},
     ------------------------------------------------------------------------
     {2, 3}}

o8 : List

i9 : allgens A

o9 = {x, y, z, T , T , T , T , T , T , T , T , T , T  }
                1   2   3   4   5   6   7   8   9   10

o9 : List

i10 : G3 = allgens(A,2)

o10 = {T , T , T , T , T  }
        6   7   8   9   10

o10 : List

i11 : G3/degree

o11 = {{2, 3}, {2, 3}, {2, 3}, {2, 3}, {2, 3}}

o11 : List

i12 : 
