-- -*- M2-comint -*- hash: -121160532

i1 : kk = ZZ/101

o1 = kk

o1 : QuotientRing

i2 : S = kk[x,y,z]

o2 = S

o2 : PolynomialRing

i3 : R = S/ideal(x^2,y^2,z^2-x*y,x*z, y*z)

o3 = R

o3 : QuotientRing

i4 : lastCyclesDegree = 4

o4 = 4

i5 : KR = koszulComplexDGA(ideal R)

o5 = {Ring => S                                     }
      Underlying algebra => S[T ..T ]
                               1   5
                        2   2           2
      Differential => {x , y , - x*y + z , x*z, y*z}

o5 : DGAlgebra

i6 : A = acyclicClosure(KR, EndDegree => lastCyclesDegree);

i7 : p2 = allgens(A,1) -- dual generators of Pi^2

o7 = {T , T , T , T , T }
       1   2   3   4   5

o7 : List

i8 : p3 = allgens(A,2) -- dual generators of Pi^3

o8 = {T , T , T , T , T  }
       6   7   8   9   10

o8 : List

i9 : a5 = allgens(A,4) -- generators of A of homological degree 5

o9 = {T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  ,
       21   22   23   24   25   26   27   28   29   30   31   32   33   34 
     ------------------------------------------------------------------------
     T  , T  , T  , T  , T  , T  , T  , T  , T  , T  }
      35   36   37   38   39   40   41   42   43   44

o9 : List

i10 : bracket(A, {sum p2, sum p3})

o10 = - 2T   + T   + T   - T   + 2T   - T   - 2T   - 3T   - 2T   - T   - T  
          21    22    23    24     25    26     27     28     29    30    31
      -----------------------------------------------------------------------
      + 2T   + 3T   + T   + T   - 2T   - T   - T   - 2T   - 2T   + 2T
          32     33    34    35     36    37    38     40     42     43

o10 : S[T ..T  ]
         1   99

i11 : bracket(A,{sum p2, sum p3}, sum a5)

o11 = -8

o11 : S[T ..T  ]
         1   99

i12 : H = bracket(A,2,3);
(5, 5, 24)
{T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  , T  }
  21   22   23   24   25   26   27   28   29   30   31   32   33   34   35   36   37   38   39   40   41   42   43   44

i13 : #keys H

o13 = 600

i14 : H' = select(keys H, k->H#k != 0);

i15 : H'

o15 = {({T , T }, T T  + x*T   - z*T  ), ({T , T }, - T T  - T T  - T T  +
          3   8    3 8      15      17      1   8      3 6    5 7    1 8  
      -----------------------------------------------------------------------
      z*T   + x*T  ), ({T , T }, T T  - T T   - z*T   + z*T  ), ({T , T }, -
         12      14      4   9    4 9    5 10      17      19      2   8    
      -----------------------------------------------------------------------
      T T  - T T  + y*T  ), ({T , T }, - T T  - T T  - T T  + z*T   + x*T  ),
       2 8    5 9      15      5   7      3 6    5 7    1 8      12      14  
      -----------------------------------------------------------------------
      ({T , T }, T T  + T T  + T T  + y*T   - z*T  ), ({T , T  }, T T  +
         4   9    2 6    3 8    4 9      14      17      3   10    5 6  
      -----------------------------------------------------------------------
      T T   - z*T   + y*T  ), ({T , T }, T T  + T T   - z*T   + y*T  ), ({T ,
       3 10      18      20      5   6    5 6    3 10      18      20      4 
      -----------------------------------------------------------------------
      T  }, - T T  - T T   + z*T   + z*T  ), ({T , T }, - T T  - T T  +
       10      5 7    4 10      12      20      1   6      1 6    4 7  
      -----------------------------------------------------------------------
      x*T  ), ({T , T }, T T  + T T  - z*T   + x*T  ), ({T , T }, T T  + T T 
         11      3   9    5 8    3 9      15      16      4   6    4 6    3 7
      -----------------------------------------------------------------------
      - z*T   + y*T  ), ({T , T  }, - T T   + y*T  ), ({T , T }, T T  - T T  
           11      13      5   10      5 10      18      4   6    4 6    1 10
      -----------------------------------------------------------------------
      + x*T  ), ({T , T }, - T T  - T T  + x*T  ), ({T , T }, T T  + T T  +
           20      4   7      1 6    4 7      11      2   6    2 6    3 8  
      -----------------------------------------------------------------------
      T T  + y*T   - z*T  ), ({T , T  }, T T  - T T   - z*T   + z*T  ), ({T ,
       4 9      14      17      5   10    4 9    5 10      17      19      3 
      -----------------------------------------------------------------------
      T }, T T  + T T  + T T  + y*T   - z*T  ), ({T , T }, T T  + y*T   -
       8    2 6    3 8    4 9      14      17      3   6    3 6      11  
      -----------------------------------------------------------------------
      z*T  ), ({T , T }, - T T  - T T   + z*T   + z*T  ), ({T , T }, T T  +
         12      5   7      5 7    4 10      12      20      3   7    4 6  
      -----------------------------------------------------------------------
      T T  - z*T   + y*T  ), ({T , T }, - T T  + y*T  ), ({T , T }, - T T  -
       3 7      11      13      2   9      2 9      16      1   9      5 6  
      -----------------------------------------------------------------------
      T T  - z*T   + x*T  ), ({T , T }, - T T  + z*T  ), ({T , T  }, T T  -
       1 9      14      17      4   7      4 7      13      1   10    4 6  
      -----------------------------------------------------------------------
      T T   + x*T  ), ({T , T }, - T T  + z*T  ), ({T , T }, T T  - z*T   +
       1 10      20      5   9      5 9      16      3   7    3 7      11  
      -----------------------------------------------------------------------
      x*T  ), ({T , T }, - T T  - T T  - z*T   + x*T  ), ({T , T }, T T  +
         12      5   6      5 6    1 9      14      17      5   8    5 8  
      -----------------------------------------------------------------------
      T T  - z*T   + x*T  ), ({T , T }, - T T  - T T  + y*T   + z*T  ), ({T ,
       3 9      15      16      4   8      2 7    4 8      12      14      3 
      -----------------------------------------------------------------------
      T }, T T  - z*T   + y*T  ), ({T , T }, - T T  - T T  - T T  + z*T   +
       9    3 9      15      17      3   6      3 6    5 7    1 8      12  
      -----------------------------------------------------------------------
      x*T  ), ({T , T }, - T T  + x*T  ), ({T , T }, - T T  - T T  + y*T  ),
         14      1   7      1 7      13      5   9      2 8    5 9      15  
      -----------------------------------------------------------------------
      ({T , T  }, - T T  + T T   - z*T   + x*T  ), ({T , T }, - T T  - T T  +
         3   10      4 8    3 10      18      19      2   7      2 7    4 8  
      -----------------------------------------------------------------------
      y*T   + z*T  ), ({T , T }, - T T  + T T   - z*T   + x*T  ), ({T , T  },
         12      14      4   8      4 8    3 10      18      19      2   10  
      -----------------------------------------------------------------------
      - T T  - T T   + y*T  ), ({T , T  }, - T T   + x*T  ), ({T , T }, -
         5 8    2 10      19      4   10      4 10      18      5   8    
      -----------------------------------------------------------------------
      T T  - T T   + y*T  )}
       5 8    2 10      19

o15 : List

i16 : H#(H'_0)

o16 = 1

o16 : S[T ..T  ]
         1   99

i17 : bracketMatrix(A,1,2)

o17 = | 0    -T_8 -T_6 -T_7 -T_10 |
      | -T_6 0    -T_8 T_10 -T_9  |
      | T_7  T_9  0    T_6  T_8   |

                         3                  5
o17 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                 1   99             1   99

i18 : bracketMatrix(A,2,1)

o18 = | 0    T_6   -T_7 |
      | T_8  0     -T_9 |
      | T_6  T_8   0    |
      | T_7  -T_10 -T_6 |
      | T_10 T_9   -T_8 |

                         5                  3
o18 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                 1   99             1   99

i19 : bracketMatrix(A,1,1)

o19 = | 2T_1 -T_3 T_4  |
      | -T_3 2T_2 T_5  |
      | T_4  T_5  2T_3 |

                         3                  3
o19 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                 1   99             1   99

i20 : 
