-- -*- M2-comint -*- hash: -990893115

i1 : kk = ZZ/101

o1 = kk

o1 : QuotientRing

i2 : S = kk[x,y,z]

o2 = S

o2 : PolynomialRing

i3 : R = S/ideal(x^2,y^2,z^2-x*y,x*z, y*z)

o3 = R

o3 : QuotientRing

i4 : lastCyclesDegree = 4

o4 = 4

i5 : KR = koszulComplexDGA(ideal R)

o5 = {Ring => S                                     }
      Underlying algebra => S[T ..T ]
                               1   5
                        2   2           2
      Differential => {x , y , - x*y + z , x*z, y*z}

o5 : DGAlgebra

i6 : A = acyclicClosure(KR, EndDegree => lastCyclesDegree);

i7 : p1 = allgens(A,0) -- dual generators of Pi^1

o7 = {x, y, z}

o7 : List

i8 : p2 = allgens(A,1) -- dual generators of Pi^3

o8 = {T , T , T , T , T }
       1   2   3   4   5

o8 : List

i9 : p3 = allgens(A,2) -- dual generators of Pi^4

o9 = {T , T , T , T , T  }
       6   7   8   9   10

o9 : List

i10 : bracketMatrix(A,2,1)

o10 = | 0    T_6   -T_7 |
      | T_8  0     -T_9 |
      | T_6  T_8   0    |
      | T_7  -T_10 -T_6 |
      | T_10 T_9   -T_8 |

                         5                  3
o10 : Matrix (S[T ..T  ])  <--- (S[T ..T  ])
                 1   99             1   99

i11 : 
