-- -*- M2-comint -*- hash: -1767537798

i1 : t = 2

o1 = 2

i2 : d = 5

o2 = 5

i3 : diagonalMultidegrees(d,t)

o3 = {{0, 5}, {1, 4}, {2, 3}, {3, 2}, {4, 1}, {5, 0}}

o3 : List

i4 : diagonalMultidegrees(d, {0,1,2})

o4 = {{0, 2, 3}, {1, 1, 3}, {1, 2, 2}}

o4 : List

i5 : 
