-- -*- M2-comint -*- hash: -1322134720

i1 : R = multigradedPolynomialRing {1,2}

o1 = R

o1 : PolynomialRing

i2 : irrelevantIdeal R

o2 = ideal (x   x   , x   x   , x   x   , x   x   , x   x   , x   x   )
             0,1 1,2   0,0 1,2   0,1 1,1   0,0 1,1   0,1 1,0   0,0 1,0

o2 : Ideal of R

i3 : R = multigradedPolynomialRing 3

o3 = R

o3 : PolynomialRing

i4 : irrelevantIdeal R

o4 = ideal (x   x   x   , x   x   x   , x   x   x   , x   x   x   ,
             0,1 1,1 2,1   0,0 1,1 2,1   0,1 1,0 2,1   0,0 1,0 2,1 
     ------------------------------------------------------------------------
     x   x   x   , x   x   x   , x   x   x   , x   x   x   )
      0,1 1,1 2,0   0,0 1,1 2,0   0,1 1,0 2,0   0,0 1,0 2,0

o4 : Ideal of R

i5 : 
