-- -*- M2-comint -*- hash: -1182736064

i1 : S = multigradedPolynomialRing({1,3,4})

o1 = S

o1 : PolynomialRing

i2 : gens S

o2 = {x   , x   , x   , x   , x   , x   , x   , x   , x   , x   , x   }
       0,0   0,1   1,0   1,1   1,2   1,3   2,0   2,1   2,2   2,3   2,4

o2 : List

i3 : degrees S

o3 = {{1, 0, 0}, {1, 0, 0}, {0, 1, 0}, {0, 1, 0}, {0, 1, 0}, {0, 1, 0}, {0,
     ------------------------------------------------------------------------
     0, 1}, {0, 0, 1}, {0, 0, 1}, {0, 0, 1}, {0, 0, 1}}

o3 : List

i4 : gens multigradedPolynomialRing 4

o4 = {x   , x   , x   , x   , x   , x   , x   , x   }
       0,0   0,1   1,0   1,1   2,0   2,1   3,0   3,1

o4 : List

i5 : multigradedPolynomialRing({1,2},CoefficientField => ZZ/5,Variables=>"y")

     ZZ
o5 = --[y   ..y   , y   ..y   ]
      5  0,0   0,1   1,0   1,2

o5 : PolynomialRing

i6 : multigradedPolynomialRing(3,Standard=>false)

       ZZ
o6 = -----[a..f]
     32003

o6 : PolynomialRing

i7 : 
