-- -*- M2-comint -*- hash: -2042463672

i1 : S = multigradedPolynomialRing {1,2}

o1 = S

o1 : PolynomialRing

i2 : B = irrelevantIdeal S

o2 = ideal (x   x   , x   x   , x   x   , x   x   , x   x   , x   x   )
             0,1 1,2   0,0 1,2   0,1 1,1   0,0 1,1   0,1 1,0   0,0 1,0

o2 : Ideal of S

i3 : M = S^1/B

o3 = cokernel | x_(0,1)x_(1,2) x_(0,0)x_(1,2) x_(0,1)x_(1,1) x_(0,0)x_(1,1) x_(0,1)x_(1,0) x_(0,0)x_(1,0) |

                            1
o3 : S-module, quotient of S

i4 : F = res prune M

      1      6      9      5      1
o4 = S  <-- S  <-- S  <-- S  <-- S  <-- 0
                                         
     0      1      2      3      4      5

o4 : ChainComplex

i5 : multigraded betti F

        0   1         2          3    4
o5 = 0: 1   .         .          .    .
     2: . 6ab         .          .    .
     3: .   . 3a2b+6ab2          .    .
     4: .   .         . 3a2b2+2ab3    .
     5: .   .         .          . a2b3

o5 : MultigradedBettiTally

i6 : supportOfTor M

o6 = {{{0, 0}}, {{1, 1}}, {{2, 1}, {1, 2}}, {{2, 2}, {1, 3}}, {{2, 3}}}

o6 : List

i7 : netList supportOfTor M

     +------+------+
o7 = |{0, 0}|      |
     +------+------+
     |{1, 1}|      |
     +------+------+
     |{2, 1}|{1, 2}|
     +------+------+
     |{2, 2}|{1, 3}|
     +------+------+
     |{2, 3}|      |
     +------+------+

i8 : netList supportOfTor F

     +------+------+
o8 = |{0, 0}|      |
     +------+------+
     |{1, 1}|      |
     +------+------+
     |{2, 1}|{1, 2}|
     +------+------+
     |{2, 2}|{1, 3}|
     +------+------+
     |{2, 3}|      |
     +------+------+

i9 : 
