-- -*- M2-comint -*- hash: 373210725

i1 : setRandomSeed("alpha");

i2 : p=nextPrime 10000

o2 = 10007

i3 : kk=ZZ/p

o3 = kk

o3 : QuotientRing

i4 : R=kk[t_0,t_1]

o4 = R

o4 : PolynomialRing

i5 : I=ideal 0_R

o5 = ideal 0

o5 : Ideal of R

i6 : L=matrix{{t_0^4,t_0^3*t_1,t_0*t_1^3,t_1^4}}

o6 = | t_0^4 t_0^3t_1 t_0t_1^3 t_1^4 |

             1       4
o6 : Matrix R  <--- R

i7 : J=imageUnderRationalMap(I,L)

                          3      2     2    2     3    2
o7 = ideal (x x  - x x , x  - x x , x x  - x x , x  - x x )
             1 2    0 3   2    1 3   0 2    1 3   1    0 2

o7 : Ideal of kk[x ..x ]
                  0   3

i8 : betti J

            0 1
o8 = total: 1 4
         0: 1 .
         1: . 1
         2: . 3

o8 : BettiTally

i9 : 
