-- -*- M2-comint -*- hash: -1195064421

i1 : setRandomSeed("alpha");

i2 : R=ZZ/32003[x_0..x_2];

i3 : F=(random nodalPlaneCurve)(8,5,R);

o3 : Ideal of R

i4 : (dim F, degree F)

o4 = (2, 8)

o4 : Sequence

i5 : singF = F + ideal jacobian F;

o5 : Ideal of R

i6 : (dim singF,degree singF)

o6 = (1, 5)

o6 : Sequence

i7 : R=ZZ/3[x_0..x_2];

i8 : tally apply(3^4,i-> null===((random nodalPlaneCurve)(8,5,R,Certify=>true, Attempts=>1)))

o8 = Tally{false => 17}
           true => 64

o8 : Tally

i9 : 
