-- -*- M2-comint -*- hash: 1132431875

i1 : needsPackage "NormalToricVarieties"

o1 = NormalToricVarieties

o1 : Package

i2 : Rho = {{1,0,0},{0,1,0},{0,0,1},{-1,-1,0},{0,0,-1}}

o2 = {{1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {-1, -1, 0}, {0, 0, -1}}

o2 : List

i3 : Sigma = {{0,1,2},{1,2,3},{0,2,3},{0,1,4},{1,3,4},{0,3,4}}

o3 = {{0, 1, 2}, {1, 2, 3}, {0, 2, 3}, {0, 1, 4}, {1, 3, 4}, {0, 3, 4}}

o3 : List

i4 : X = normalToricVariety(Rho,Sigma,CoefficientRing =>ZZ/32749)

o4 = X

o4 : NormalToricVariety

i5 : R=ring X

o5 = R

o5 : PolynomialRing

i6 : Ch=ToricChowRing(X)

o6 = Ch

o6 : QuotientRing

i7 : f=random({1,0},R)

o7 = 107x  + 4376x  - 6316x
         0        1        3

o7 : R

i8 : ClassInToricChowRing(Ch,f)

o8 = -1833x
           3

o8 : Ch

i9 : 
