-- -*- M2-comint -*- hash: -514865079

i1 : needsPackage "NormalToricVarieties"

o1 = NormalToricVarieties

o1 : Package

i2 : Rho = {{1,0,0},{0,1,0},{0,0,1},{-1,-1,0},{0,0,-1}}

o2 = {{1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {-1, -1, 0}, {0, 0, -1}}

o2 : List

i3 : Sigma = {{0,1,2},{1,2,3},{0,2,3},{0,1,4},{1,3,4},{0,3,4}}

o3 = {{0, 1, 2}, {1, 2, 3}, {0, 2, 3}, {0, 1, 4}, {1, 3, 4}, {0, 3, 4}}

o3 : List

i4 : X = normalToricVariety(Rho,Sigma,CoefficientRing =>ZZ/32749)

o4 = X

o4 : NormalToricVariety

i5 : CheckToricVarietyValid(X)

o5 = true

i6 : R=ring(X)

o6 = R

o6 : PolynomialRing

i7 : I=ideal(R_0^4*R_1,R_0*R_3*R_4*R_2-R_2^2*R_0^2)

             4       2 2
o7 = ideal (x x , - x x  + x x x x )
             0 1     0 2    0 2 3 4

o7 : Ideal of R

i8 : Segre(X,I)

          2       2
o8 = - 72x x  + 3x  + 8x x  + x
          3 4     3     3 4    3

                     ZZ[x ..x ]
                         0   4
o8 : -----------------------------------------
     (x x , x x x , x  - x , x  - x , x  - x )
       2 4   0 1 3   0    3   1    3   2    4

i9 : W = smoothFanoToricVariety(4,123)

o9 = W

o9 : NormalToricVariety

i10 : CheckToricVarietyValid(W)

o10 = false

i11 : Ch=ToricChowRing W

o11 = Ch

o11 : QuotientRing

i12 : CSM W

           4       2       2        2        2      3     2     2     2  
o12 = - 24x  + 5x x  + 5x x  + 10x x  + 10x x  - 10x  + 3x  + 3x  - 3x  +
           8     2 8     5 8      6 8      7 8      8     2     5     6  
      -----------------------------------------------------------------------
               2                                   2
      x x  - 3x  + 9x x  + 9x x  + x x  + x x  + 6x  + 3x  + 3x  - x  - x  +
       6 7     7     2 8     5 8    6 8    7 8     8     2     5    6    7  
      -----------------------------------------------------------------------
      5x  + 1
        8

                                                                                                            ZZ[x ..x ]
                                                                                                                0   8
o12 : ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      (x x , x x , x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x  - x  + x  - x , x  - x  + x  - x , x  - x  + x  - x , x  - x  + x  - x )
        0 3   1 4   2 5   0 1 2   0 1 8   0 2 7   0 7 8   1 2 6   1 6 8   2 6 7   3 4 5   3 4 8   3 5 7   3 7 8   4 5 6   4 6 8   5 6 7   6 7 8   0    2    6    8   1    2    7    8   3    5    6    8   4    5    7    8

i13 : CSM(Ch,W)

           4       2       2        2        2      3     2     2     2  
o13 = - 24x  + 5x x  + 5x x  + 10x x  + 10x x  - 10x  + 3x  + 3x  - 3x  +
           8     2 8     5 8      6 8      7 8      8     2     5     6  
      -----------------------------------------------------------------------
               2                                   2
      x x  - 3x  + 9x x  + 9x x  + x x  + x x  + 6x  + 3x  + 3x  - x  - x  +
       6 7     7     2 8     5 8    6 8    7 8     8     2     5    6    7  
      -----------------------------------------------------------------------
      5x  + 1
        8

o13 : Ch

i14 : 
