-- -*- M2-comint -*- hash: 2014090153

i1 : setRandomSeed 438;

i2 : R = QQ[v,y,z,w]

o2 = R

o2 : PolynomialRing

i3 : B = matrix{{v,y,z},{y,z,w}}

o3 = | v y z |
     | y z w |

             2       3
o3 : Matrix R  <--- R

i4 : Chern minors(2,B)

       3     2
o4 = 2h  + 3h
       1     1

     ZZ[h ]
         1
o4 : ------
        4
       h
        1

i5 : Chern(minors(2,B),CompMethod=>PnResidual)

       3     2
o5 = 2H  + 3H

     ZZ[H]
o5 : -----
        4
       H

i6 : A=ChowRing(R)

o6 = A

o6 : QuotientRing

i7 : c1=Chern(A, minors(2,B))

       3     2
o7 = 2h  + 3h
       1     1

o7 : A

i8 : cHash=Chern(A,minors(2,B),Output=>HashForm)

o8 = MutableHashTable{...6...}

o8 : MutableHashTable

i9 : peek cHash

                                            2      3
o9 = MutableHashTable{SegreList => {0, 0, 3h , -10h }}
                                            1      1
                                         2
                      Glist => {1, 2h , h , 0}
                                     1   1
                                    3     2
                      Segre => - 10h  + 3h
                                    1     1
                                 3     2
                      Chern => 2h  + 3h
                                 1     1
                              3     2
                      CF => 2h  + 3h
                              1     1
                            2
                      G => h  + 2h  + 1
                            1     1

i10 : c1==cHash#"Chern"

o10 = true

i11 : R=MultiProjCoordRing({2,2})

o11 = R

o11 : PolynomialRing

i12 : r=gens R

o12 = {x , x , x , x , x , x }
        0   1   2   3   4   5

o12 : List

i13 : I=ideal(r_0^2*r_3-r_4*r_1*r_2,r_2^2*r_5)

              2              2
o13 = ideal (x x  - x x x , x x )
              0 3    1 2 4   2 5

o13 : Ideal of R

i14 : Chern I

         2 2       2     2            2
o14 = 15h h  + 3h h  + 4h  + 4h h  + h
         1 2     1 2     1     1 2    2

      ZZ[h ..h ]
          1   2
o14 : ----------
         3   3
       (h , h )
         1   2

i15 : needsPackage "NormalToricVarieties"

o15 = NormalToricVarieties

o15 : Package

i16 : Rho = {{1,0,0},{0,1,0},{0,0,1},{-1,-1,0},{0,0,-1}}

o16 = {{1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {-1, -1, 0}, {0, 0, -1}}

o16 : List

i17 : Sigma = {{0,1,2},{1,2,3},{0,2,3},{0,1,4},{1,3,4},{0,3,4}}

o17 = {{0, 1, 2}, {1, 2, 3}, {0, 2, 3}, {0, 1, 4}, {1, 3, 4}, {0, 3, 4}}

o17 : List

i18 : X = normalToricVariety(Rho,Sigma,CoefficientRing =>ZZ/32749)

o18 = X

o18 : NormalToricVariety

i19 : CheckToricVarietyValid(X)

o19 = true

i20 : R=ring(X)

o20 = R

o20 : PolynomialRing

i21 : I=ideal(R_0^4*R_1,R_0*R_3*R_4*R_2-R_2^2*R_0^2)

              4       2 2
o21 = ideal (x x , - x x  + x x x x )
              0 1     0 2    0 2 3 4

o21 : Ideal of R

i22 : Chern(X,I)

           2       2
o22 = - 36x x  + 6x  + 10x x  + x
           3 4     3      3 4    3

                      ZZ[x ..x ]
                          0   4
o22 : -----------------------------------------
      (x x , x x x , x  - x , x  - x , x  - x )
        2 4   0 1 3   0    3   1    3   2    4

i23 : Ch=ToricChowRing(X)

o23 = Ch

o23 : QuotientRing

i24 : s3=Chern(Ch,X,I)

           2       2
o24 = - 36x x  + 6x  + 10x x  + x
           3 4     3      3 4    3

o24 : Ch

i25 : s3==(product(gens(Ch),a->a+1)*Segre(Ch,X,I))

o25 = true

i26 : 
