-- -*- M2-comint -*- hash: -522358164

i1 : R=MultiProjCoordRing({3,4})

o1 = R

o1 : PolynomialRing

i2 : A=ChowRing(R)

o2 = A

o2 : QuotientRing

i3 : I=ideal(random({1,0},R));

o3 : Ideal of R

i4 : K=ideal(random({1,1},R));

o4 : Ideal of R

i5 : c=Chern(A,I)

        3 4      3 3      2 4      3 2      2 3       4      3        2 2  
o5 = 15h h  + 30h h  + 15h h  + 30h h  + 30h h  + 5h h  + 15h h  + 30h h  +
        1 2      1 2      1 2      1 2      1 2     1 2      1 2      1 2  
     ------------------------------------------------------------------------
          3     3      2          2     2
     10h h  + 3h  + 15h h  + 10h h  + 3h  + 5h h  + h
        1 2     1      1 2      1 2     1     1 2    1

o5 : A

i6 : s=Segre(A,K)

        3 4      3 3      2 4      3 2      2 3       4     3       2 2  
o6 = 35h h  - 20h h  - 15h h  + 10h h  + 10h h  + 5h h  - 4h h  - 6h h  -
        1 2      1 2      1 2      1 2      1 2     1 2     1 2     1 2  
     ------------------------------------------------------------------------
         3    4    3     2         2    3    2            2
     4h h  - h  + h  + 3h h  + 3h h  + h  - h  - 2h h  - h  + h  + h
       1 2    2    1     1 2     1 2    2    1     1 2    2    1    2

o6 : A

i7 : s-c

        3 4      3 3      2 4      3 2      2 3      3        2 2        3  
o7 = 20h h  - 50h h  - 30h h  - 20h h  - 20h h  - 19h h  - 36h h  - 14h h  -
        1 2      1 2      1 2      1 2      1 2      1 2      1 2      1 2  
     ------------------------------------------------------------------------
      4     3      2         2    3     2            2
     h  - 2h  - 12h h  - 7h h  + h  - 4h  - 7h h  - h  + h
      2     1      1 2     1 2    2     1     1 2    2    2

o7 : A

i8 : s*c

        3 4      3 3      2 4      3 2      2 3       4      3        2 2  
o8 = 12h h  + 21h h  + 12h h  + 20h h  + 19h h  + 4h h  + 10h h  + 15h h  +
        1 2      1 2      1 2      1 2      1 2     1 2      1 2      1 2  
     ------------------------------------------------------------------------
         3     3     2         2    2
     6h h  + 2h  + 6h h  + 4h h  + h  + h h
       1 2     1     1 2     1 2    1    1 2

o8 : A

i9 : A2=ChowRing(R,symbol v)

o9 = A2

o9 : QuotientRing

i10 : describe A2

      ZZ[v ..v ]
          1   2
o10 = ----------
         4   5
       (v , v )
         1   2

i11 : 
