-- -*- M2-comint -*- hash: -1832538060

i1 : S=MultiProjCoordRing(QQ,symbol z,{1,3,3})

o1 = S

o1 : PolynomialRing

i2 : degrees S

o2 = {{1, 0, 0}, {1, 0, 0}, {0, 1, 0}, {0, 1, 0}, {0, 1, 0}, {0, 1, 0}, {0,
     ------------------------------------------------------------------------
     0, 1}, {0, 0, 1}, {0, 0, 1}, {0, 0, 1}}

o2 : List

i3 : R=MultiProjCoordRing {2,3}

o3 = R

o3 : PolynomialRing

i4 : coefficientRing R

       ZZ
o4 = -----
     32749

o4 : QuotientRing

i5 : describe R

       ZZ
o5 = -----[x ..x , Degrees => {3:{1}, 4:{0}}, Heft => {2:1}]
     32749  0   6                {0}    {1}

i6 : A=ChowRing R

o6 = A

o6 : QuotientRing

i7 : describe A

     ZZ[h ..h ]
         1   2
o7 = ----------
        3   4
      (h , h )
        1   2

i8 : Segre(A,ideal random({1,1},R))

        2 3     2 2       3     2         2    3    2            2
o8 = 10h h  - 6h h  - 4h h  + 3h h  + 3h h  + h  - h  - 2h h  - h  + h  + h
        1 2     1 2     1 2     1 2     1 2    2    1     1 2    2    1    2

o8 : A

i9 : 
