-- -*- M2-comint -*- hash: 1921860832

i1 : needsPackage "NormalToricVarieties"

o1 = NormalToricVarieties

o1 : Package

i2 : Rho = {{1,0,0},{0,1,0},{0,0,1},{-1,-1,0},{0,0,-1}}

o2 = {{1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {-1, -1, 0}, {0, 0, -1}}

o2 : List

i3 : Sigma = {{0,1,2},{1,2,3},{0,2,3},{0,1,4},{1,3,4},{0,3,4}}

o3 = {{0, 1, 2}, {1, 2, 3}, {0, 2, 3}, {0, 1, 4}, {1, 3, 4}, {0, 3, 4}}

o3 : List

i4 : X = normalToricVariety(Rho,Sigma,CoefficientRing =>ZZ/32749)

o4 = X

o4 : NormalToricVariety

i5 : R=ring X

o5 = R

o5 : PolynomialRing

i6 : Ch=ToricChowRing(X)

o6 = Ch

o6 : QuotientRing

i7 : describe Ch

                     ZZ[x ..x ]
                         0   4
o7 = -----------------------------------------
     (x x , x x x , x  - x , x  - x , x  - x )
       2 4   0 1 3   0    3   1    3   2    4

i8 : r=gens R

o8 = {x , x , x , x , x }
       0   1   2   3   4

o8 : List

i9 : I=ideal(random({1,0},R))

o9 = ideal(107x  + 4376x  - 6316x )
               0        1        3

o9 : Ideal of R

i10 : K=ideal(random({1,1},R))

o10 = ideal(3187x x  - 6053x x  - 16090x x  + 3783x x  + 8570x x  + 8444x x )
                 0 2        1 2         2 3        0 4        1 4        3 4

o10 : Ideal of R

i11 : c=Chern(Ch,X,I)

        2       2
o11 = 4x x  + 2x  + 2x x  + x
        3 4     3     3 4    3

o11 : Ch

i12 : s=Segre(Ch,X,K)

        2      2
o12 = 3x x  - x  - 2x x  + x  + x
        3 4    3     3 4    3    4

o12 : Ch

i13 : s-c

         2       2
o13 = - x x  - 3x  - 4x x  + x
         3 4     3     3 4    4

o13 : Ch

i14 : s*c

        2      2
o14 = 2x x  + x  + x x
        3 4    3    3 4

o14 : Ch

i15 : 
