-- -*- M2-comint -*- hash: -141771958

i1 : S = QQ[x,y]

o1 = S

o1 : PolynomialRing

i2 : J = inverseSystem x^2

                3
o2 = ideal (y, x )

o2 : Ideal of S

i3 : J' = inverseSystem (x+y)^2

                    3
o3 = ideal (x - y, y )

o3 : Ideal of S

i4 : J'' = inverseSystem(matrix{{(x+y)^2}}, DividedPowers=>true)

                    2   2    2
o4 = ideal (x*y - 2y , x  - y )

o4 : Ideal of S

i5 : betti res J''

            0 1 2
o5 = total: 1 2 1
         0: 1 . .
         1: . 2 .
         2: . . 1

o5 : BettiTally

i6 : kk = QQ

o6 = QQ

o6 : Ring

i7 : n = 3

o7 = 3

i8 : S = kk[a,b,c]

o8 = S

o8 : PolynomialRing

i9 : M = matrix{{a^2,b^3+c^3}}

o9 = | a2 b3+c3 |

             1       2
o9 : Matrix S  <--- S

i10 : G = random(S^3, S^3)

o10 = | 9/2 1/2 3/2 |
      | 1/2 1   3/4 |
      | 9/4 3/4 7/4 |

              3       3
o10 : Matrix S  <--- S

i11 : g = map(S,S,(vars S)*G)

                  9    1    9   1        3   3    3    7
o11 = map (S, S, {-a + -b + -c, -a + b + -c, -a + -b + -c})
                  2    2    4   2        4   2    4    4

o11 : RingMap S <--- S

i12 : g' = map(S,S,(vars S)*(transpose G))

                  9    1    3   1        3   9    3    7
o12 = map (S, S, {-a + -b + -c, -a + b + -c, -a + -b + -c})
                  2    2    2   2        4   4    4    4

o12 : RingMap S <--- S

i13 : h =  map(S,S,(vars S)*(transpose G)^(-1))

                  19     4    18   13    72    42     30    36    68
o13 = map (S, S, {--a + --b - --c, --a + --b - --c, - --a - --b + --c})
                  47    47    47   47    47    47     47    47    47

o13 : RingMap S <--- S

i14 : inverseSystem M

                             3    3   3
o14 = ideal (b*c, a*c, a*b, b  - c , a )

o14 : Ideal of S

i15 : g'(inverseSystem g(M))

               24675      7943      50901     4935      1833      893      
o15 = ideal (- -----a*b - ----a*c - -----b*c, ----a*b + ----a*c + ---b*c, -
                 2          8         8         2         2        4       
      -----------------------------------------------------------------------
                                   73467 3   26433 2    42111   2   8379 3  
      2961a*b - 5076a*c - 47b*c, - -----a  + -----a b + -----a*b  + ----b  -
                                     64        64         64         64     
      -----------------------------------------------------------------------
      128133 2    34989        37563 2    65989   2   38437   2   8379 3 
      ------a c + -----a*b*c + -----b c - -----a*c  + -----b*c  - ----c ,
        64          32           64         64          64         64    
      -----------------------------------------------------------------------
      78003 3   48033 2    6021   2   441 3   122067 2    17379       
      -----a  + -----a b + ----a*b  - ---b  + ------a c + -----a*b*c -
        32        32        32         32       32          16        
      -----------------------------------------------------------------------
      1977 2    48321   2   2023   2   441 3
      ----b c + -----a*c  - ----b*c  + ---c )
       32         32         32         32

o15 : Ideal of S

i16 : g'(inverseSystem g(M)) == inverseSystem M

o16 = true

i17 : h(inverseSystem M) == inverseSystem g(M)

o17 = true

i18 : S = ZZ/101[a,b,c]

o18 = S

o18 : PolynomialRing

i19 : M = random(S^{0,1}, S^{-1,-1,-2,-2})

o19 = {0}  | -13a-15b-47c                 -43a-28b+38c                 
      {-1} | 22a2-47ab+43b2+7ac+36bc+33c2 45a2+47ab-17b2+15ac+35bc+40c2
      -----------------------------------------------------------------------
      2a2-34ab-23b2+19ac-11bc+11c2                          
      11a3-28a2b-47ab2+15b3-3a2c-7abc-13b2c+29ac2+30bc2+39c3
      -----------------------------------------------------------------------
      16a2-48ab+39b2-16ac+48bc-38c2                         |
      46a3+a2b-23ab2-37b3+22a2c+2abc-10b2c-47ac2-18bc2+27c3 |

              2       4
o19 : Matrix S  <--- S

i20 : d = 6

o20 = 6

i21 : N = inverseSystem(d, M)

o21 = {0}  | 36a5-23a4b-48a3b2+43a2b3+40ab4-25b5+36a4c
      {-1} | 9a6+32a5b-18a4b2+38a3b3+9a2b4-43ab5-11b6-
      -----------------------------------------------------------------------
      -31a3bc-49a2b2c+4ab3c-10b4c-50a3c2+48a2bc2+13ab2c2+45b3c2-29a2c3+46abc3
      3a5c-30a4bc+33a3b2c+26a2b3c+28ab4c-7b5c-41a4c2-34a3bc2+22a2b2c2+14ab3c2
      -----------------------------------------------------------------------
      -39b2c3+22ac4+49bc4+16c5                                              
      +26b4c2+38a3c3+49a2bc3+9ab2c3+31b3c3+10a2c4+45abc4-39b2c4-32ac5-11bc5+
      -----------------------------------------------------------------------
           -3a4+4a3b-8a2b2-17ab3+b4-22a3c+32a2bc-9ab2c+
      11c6 -24a5+8a4b-17a3b2-44a2b3-30ab4-b5-9a4c-2a3bc
      -----------------------------------------------------------------------
      29b3c-a2c2+13abc2-25b2c2                                            
      -14a2b2c-23ab3c-47b4c-46a3c2-36a2bc2-ab2c2-b3c2+31a2c3+41abc3+3b2c3-
      -----------------------------------------------------------------------
                       |
      43ac4-33bc4+43c5 |

              2       2
o21 : Matrix S  <--- S

i22 : image M == inverseSystem N

o22 = true

i23 : d = 5

o23 = 5

i24 : N = inverseSystem(d, M)

o24 = {0}  | -49a4-42a3b-47a2b2-30ab3+50b4+10a3c-2a2bc+41ab2c+13b3c+36a2c2+
      {-1} | -42a5-39a4b+7a3b2+8a2b3-21ab4+17b5-23a4c-48a3bc-50a2b2c+11ab3c
      -----------------------------------------------------------------------
      2abc2+17ac3                                                           
      -21b4c-32a3c2+33a2bc2+31ab2c2-31b3c2+37a2c3-44abc3+38b2c3+24ac4-48bc4+
      -----------------------------------------------------------------------
           9a4+13a3b+24a2b2+15ab3+47b4+29a3c+30ab2c-41b3c-
      15c5 -24a5+28a4b-a3b2-23a2b3+27ab4-27b5+20a4c+19a3bc
      -----------------------------------------------------------------------
      29a2c2-25abc2+17bc3                                                   
      -44a2b2c-39ab3c-4b4c+5a3c2+25a2bc2-8ab2c2-27b3c2+50a2c3+25abc3+10b2c3+
      -----------------------------------------------------------------------
                    -18a4+43a3b-30a2b2+45ab3-10b4+13a3c-32a2bc-9ab2c-
      2ac4-45bc4-c5 -23a5-37a4b-40a3b2+36a2b3-33ab4-20b5-15a4c-24a3bc
      -----------------------------------------------------------------------
      31b3c-3a2c2+24abc2-21c4                                               
      +27a2b2c+30ab3c+9b4c+5a3c2+4a2bc2-28ab2c2-28b3c2+44a2c3-31abc3+27b2c3+
      -----------------------------------------------------------------------
                       -3a4+4a3b-8a2b2-17ab3+b4-22a3c+32a2bc-9ab2c+
      42ac4+44bc4+13c5 -24a5+8a4b-17a3b2-44a2b3-30ab4-b5-9a4c-2a3bc
      -----------------------------------------------------------------------
      29b3c-a2c2+13abc2-25b2c2                                            
      -14a2b2c-23ab3c-47b4c-46a3c2-36a2bc2-ab2c2-b3c2+31a2c3+41abc3+3b2c3-
      -----------------------------------------------------------------------
                       |
      43ac4-33bc4+43c5 |

              2       4
o24 : Matrix S  <--- S

i25 : image M != inverseSystem N

o25 = true

i26 : M = random(S^{0,1}, S^{-1,-1,-2,-2})

o26 = {0}  | -22a-9b-20c                  32a-32b+24c                  
      {-1} | -15a2-49ab+9b2-20ac-26bc-8c2 39a2-33ab-39b2+44ac+22bc+43c2
      -----------------------------------------------------------------------
      -30a2-39b2-19ac+4bc-49c2                           
      -8a3-3a2b+16ab2+6b3-30a2c-6abc+3b2c-9ac2+25bc2-41c3
      -----------------------------------------------------------------------
      -48a2+33ab+36b2+17ac+13bc-11c2                          |
      36a3-22a2b-28ab2+40b3+41a2c+35abc-31b2c-35ac2-2bc2-49c3 |

              2       4
o26 : Matrix S  <--- S

i27 : inverseSystem(inverseSystem(d,gens inverseSystem M)) == inverseSystem M

o27 = true

i28 : 
