-- -*- M2-comint -*- hash: -1999946762

i1 : setRandomSeed 0

o1 = 0

i2 : kk = QQ

o2 = QQ

o2 : Ring

i3 : S = kk[a,b,c]

o3 = S

o3 : PolynomialRing

i4 : map(S,S,0_S*vars S)

o4 = map (S, S, {0, 0, 0})

o4 : RingMap S <--- S

i5 : p = (a+b)^2

      2           2
o5 = a  + 2a*b + b

o5 : S

i6 : q = toDividedPowers p

       2            2
o6 = 2a  + 2a*b + 2b

o6 : S

i7 : p' = fromDividedPowers q

      2           2
o7 = a  + 2a*b + b

o7 : S

i8 : p'==p

o8 = true

i9 : kk = ZZ/101

o9 = kk

o9 : QuotientRing

i10 : S = kk[a..d]

o10 = S

o10 : PolynomialRing

i11 : f1 = matrix"a2b2+c2d2"; -- gives 1,4,6,4,1

              1       1
o11 : Matrix S  <--- S

i12 : f2 = matrix"a2b2+b2c2+c2d2"; --gives 1,4,7,4,1;

              1       1
o12 : Matrix S  <--- S

i13 : f3 = matrix"a2b2+b2c2+c2d2+c2a2"; -- gives 1,4,8,4,1

              1       1
o13 : Matrix S  <--- S

i14 : f4 = matrix"a2b2+b2c2+c2d2+c2a2+a2d2"; --gives 1,4,8,4,1

              1       1
o14 : Matrix S  <--- S

i15 : f5 = matrix"a2b2+b2c2+c2d2+c2a2+a2d2+b2d2+b4"; --gives 1,4,9,4,1

              1       1
o15 : Matrix S  <--- S

i16 : f6 = matrix"a2b2+b2c2+c2d2+c2a2+a2d2+b2d2"; --gives 1,4,10,4,1

              1       1
o16 : Matrix S  <--- S

i17 : F = {f1,f2,f3,f4,f5,f6};

i18 : netList (F/(f->betti res inverseSystem f))

      +-------------------+
      |       0 1  2 3 4  |
o18 = |total: 1 9 16 9 1  |
      |    0: 1 .  . . .  |
      |    1: . 4  4 1 .  |
      |    2: . 4  8 4 .  |
      |    3: . 1  4 4 .  |
      |    4: . .  . . 1  |
      +-------------------+
      |       0 1  2 3 4  |
      |total: 1 9 16 9 1  |
      |    0: 1 .  . . .  |
      |    1: . 3  2 . .  |
      |    2: . 6 12 6 .  |
      |    3: . .  2 3 .  |
      |    4: . .  . . 1  |
      +-------------------+
      |       0  1  2  3 4|
      |total: 1 11 20 11 1|
      |    0: 1  .  .  . .|
      |    1: .  2  1  . .|
      |    2: .  9 18  9 .|
      |    3: .  .  1  2 .|
      |    4: .  .  .  . 1|
      +-------------------+
      |       0  1  2  3 4|
      |total: 1 10 18 10 1|
      |    0: 1  .  .  . .|
      |    1: .  2  .  . .|
      |    2: .  8 18  8 .|
      |    3: .  .  .  2 .|
      |    4: .  .  .  . 1|
      +-------------------+
      |       0  1  2  3 4|
      |total: 1 16 30 16 1|
      |    0: 1  .  .  . .|
      |    1: .  .  .  . .|
      |    2: . 16 30 16 .|
      |    3: .  .  .  . .|
      |    4: .  .  .  . 1|
      +-------------------+
      |       0  1  2  3 4|
      |total: 1 16 30 16 1|
      |    0: 1  .  .  . .|
      |    1: .  .  .  . .|
      |    2: . 16 30 16 .|
      |    3: .  .  .  . .|
      |    4: .  .  .  . 1|
      +-------------------+

i19 : 
