-- -*- M2-comint -*- hash: 136164344

i1 : R = QQ[a..d];

i2 : I = ideal(a^2*b-c^2, a*b^2-d^3, c^5-d);

o2 : Ideal of R

i3 : J = ideal(a^2,b^2,c^2,d^2);

o3 : Ideal of R

i4 : I:J

               2    3   2     2   5
o4 = ideal (a*b  - d , a b - c , c  - d)

o4 : Ideal of R

i5 : P = quotient(I,J)

               2    3   2     2   5
o5 = ideal (a*b  - d , a b - c , c  - d)

o5 : Ideal of R

i6 : R = ZZ/32003[a..d];

i7 : I = ideal(a^3-b, a^4-c)

             3       4
o7 = ideal (a  - b, a  - c)

o7 : Ideal of R

i8 : Ih = homogenize(I, d)

                        2     2    3      2   3      2
o8 = ideal (a*b - c*d, a c - b d, b  - a*c , a  - b*d )

o8 : Ideal of R

i9 : saturate(Ih, d)

                        2     2    3      2   3      2
o9 = ideal (a*b - c*d, a c - b d, b  - a*c , a  - b*d )

o9 : Ideal of R

i10 : 
