-- -*- M2-comint -*- hash: -101384261

i1 : R = ZZ/32003[a..d];

i2 : m = ideal vars R

o2 = ideal (a, b, c, d)

o2 : Ideal of R

i3 : M = R^1 / (a * m^2)

o3 = cokernel | a3 a2b a2c a2d ab2 abc abd ac2 acd ad2 |

                            1
o3 : R-module, quotient of R

i4 : M / saturate 0_M

o4 = cokernel | a a3 a2b a2c a2d ab2 abc abd ac2 acd ad2 |

                            1
o4 : R-module, quotient of R

i5 : R = QQ[a..i];

i6 : M = cokernel genericMatrix(R,a,3,3)

o6 = cokernel | a d g |
              | b e h |
              | c f i |

                            3
o6 : R-module, quotient of R

i7 : annihilator M

o7 = ideal(c*e*g - b*f*g - c*d*h + a*f*h + b*d*i - a*e*i)

o7 : Ideal of R

i8 : ann (M/(a*M))

o8 = ideal (a, c*e*g - b*f*g - c*d*h + b*d*i)

o8 : Ideal of R

i9 : 
