-- -*- M2-comint -*- hash: 1997319033

i1 : R = ZZ/32003[a..d];

i2 : J = monomialCurveIdeal(R,{1,4,7})

             2         3     3    4    3
o2 = ideal (c  - b*d, b c - a d, b  - a c)

o2 : Ideal of R

i3 : I = ideal(J_1-a^2*J_0,J_2-d*c*J_0)

             3     2 2    3     2      4    3     3         2
o3 = ideal (b c - a c  - a d + a b*d, b  - a c - c d + b*c*d )

o3 : Ideal of R

i4 : I : J

             3    2       2   3    2     2
o4 = ideal (b  - a c + c*d , a  - a b + c d)

o4 : Ideal of R

i5 : R = ZZ[a,b,c];

i6 : F = a^3-b^2*c-11*c^2

      3    2       2
o6 = a  - b c - 11c

o6 : R

i7 : I = ideal(F,diff(a,F),diff(b,F),diff(c,F))

             3    2       2    2            2
o7 = ideal (a  - b c - 11c , 3a , -2b*c, - b  - 22c)

o7 : Ideal of R

i8 : I : (ideal(a,b,c))^3

                                2        2
o8 = ideal (11c, 3b, 33a, b*c, b , a*b, a )

o8 : Ideal of R

i9 : S = QQ[x,y,z];

i10 : J = image vars S

o10 = image | x y z |

                              1
o10 : S-module, submodule of S

i11 : I = image symmetricPower(2,vars S)

o11 = image | x2 xy xz y2 yz z2 |

                              1
o11 : S-module, submodule of S

i12 : (I++I) : (J++J)

o12 = ideal (z, y, x)

o12 : Ideal of S

i13 : (I++I) : x+y+z

o13 = image | z y x 0 0 0 |
            | 0 0 0 z y x |

                              2
o13 : S-module, submodule of S

i14 : quotient(I,J)

o14 = ideal (z, y, x)

o14 : Ideal of S

i15 : quotient(gens I, gens J)

o15 = {1} | x y z 0 0 0 |
      {1} | 0 0 0 y z 0 |
      {1} | 0 0 0 0 0 z |

              3       6
o15 : Matrix S  <--- S

i16 : I = ideal(x^2-y^2, y^3)

              2    2   3
o16 = ideal (x  - y , y )

o16 : Ideal of S

i17 : J = ideal((x+y+z)^3, z^2)

              3     2        2    3     2               2        2       2  
o17 = ideal (x  + 3x y + 3x*y  + y  + 3x z + 6x*y*z + 3y z + 3x*z  + 3y*z  +
      -----------------------------------------------------------------------
       3   2
      z , z )

o17 : Ideal of S

i18 : L = intersect(I,J)

              2 2    2 2    3      2 2       3     4     3      2          2 
o18 = ideal (x z  - y z , 2x y + 6x y  + 6x*y  + 2y  - 3x z - 3x y*z + 3x*y z
      -----------------------------------------------------------------------
          3    4     2 2       3     4     3      2          2      3    3 2
      + 3y z, x  - 6x y  - 8x*y  - 3y  + 6x z + 6x y*z - 6x*y z - 6y z, y z )

o18 : Ideal of S

i19 : L : z^2

              2    2   3
o19 = ideal (x  - y , y )

o19 : Ideal of S

i20 : L : I == J

o20 = true

i21 : 
