-- -*- M2-comint -*- hash: 1205316095

i1 : R = ZZ/101[a..e];

i2 : B = betti res ideal"ab,ac,bd,be,ae,cd,ce,a3,b3,c3,d3,e3"

            0  1  2  3  4 5
o2 = total: 1 12 29 30 15 3
         0: 1  .  .  .  . .
         1: .  7 11  6  1 .
         2: .  5 14 13  4 .
         3: .  .  1  2  1 .
         4: .  .  3  9  9 3

o2 : BettiTally

i3 : B1 = lowestDegrees B

o3 = {0, 2, 3, 4, 5, 9}

o3 : List

i4 : pureBettiDiagram B1

            0  1   2   3  4 5
o4 = total: 7 90 210 189 63 1
         0: 7  .   .   .  . .
         1: . 90 210 189 63 .
         2: .  .   .   .  . .
         3: .  .   .   .  . .
         4: .  .   .   .  . 1

o4 : BettiTally

i5 : 
