-- -*- M2-comint -*- hash: 796943535

i1 : makePureBetti{0,2,4,5}

o1 = {3, 10, 15, 8}

o1 : List

i2 : makePureBetti({0,2,4,5},TableEntries => HerzogKuhl)

       1   1  1   1
o2 = {--, --, -, --}
      40  12  8  15

o2 : List

i3 : makePureBetti({0,2,4,5},TableEntries => RealizationModules)

o3 = {3, 10, 15, 8}

o3 : List

i4 : makePureBetti{0,3,4,5,6,7,10}

o4 = {1, 50, 175, 252, 175, 50, 1}

o4 : List

i5 : makePureBetti({0,3,4,5,6,7,10},TableEntries => HerzogKuhl)

        1     1    1    1    1    1     1
o5 = {-----, ---, ---, ---, ---, ---, -----}
      25200  504  144  100  144  504  25200

o5 : List

i6 : makePureBetti({0,3,4,5,6,7,10},TableEntries => RealizationModules)

o6 = {36, 1800, 6300, 9072, 6300, 1800, 36}

o6 : List

i7 : 
