-- -*- M2-comint -*- hash: 498500333

i1 : M = matrix"1,0,0,0;0,3,0,0;0,0,5,3"

o1 = | 1 0 0 0 |
     | 0 3 0 0 |
     | 0 0 5 3 |

              3        4
o1 : Matrix ZZ  <--- ZZ

i2 : mat2betti M

            0 1 2 3
o2 = total: 1 3 5 3
         0: 1 . . .
         1: . 3 . .
         2: . . 5 3

o2 : BettiTally

i3 : mat2betti(M,3)

            0 1 2 3
o3 = total: 1 3 5 3
         3: 1 . . .
         4: . 3 . .
         5: . . 5 3

o3 : BettiTally

i4 : 
