-- -*- M2-comint -*- hash: 541747935

i1 : L = {0,2,3,9}

o1 = {0, 2, 3, 9}

o1 : List

i2 : B = pureBettiDiagram L

            0  1  2 3
o2 = total: 7 27 21 1
         0: 7  .  . .
         1: . 27 21 .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: .  .  . .
         6: .  .  . 1

o2 : BettiTally

i3 : pureTwoInvariant L 

o3 = 196

i4 : L1 = {0,4,5,7}

o4 = {0, 4, 5, 7}

o4 : List

i5 : B1 = pureBettiDiagram L1

            0  1  2  3
o5 = total: 3 35 42 10
         0: 3  .  .  .
         1: .  .  .  .
         2: .  .  .  .
         3: . 35 42  .
         4: .  .  . 10

o5 : BettiTally

i6 : pureTwoInvariant L1

o6 = 15

i7 : betti res randomSocleModule(L,1)

            0  1  2 3
o7 = total: 7 27 21 1
         0: 7  .  . .
         1: . 27 21 .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: .  .  . .
         6: .  .  . 1

o7 : BettiTally

i8 : betti res randomModule(L,1)

            0  1  2  3
o8 = total: 7 27 35 15
         0: 7  .  .  .
         1: . 27 11  .
         2: .  . 24 15

o8 : BettiTally

i9 : betti res randomModule({0,6,7,9},1)

            0  1  2 3
o9 = total: 1 21 27 7
         0: 1  .  . .
         1: .  .  . .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: . 21 27 .
         6: .  .  . 7

o9 : BettiTally

i10 : betti res randomSocleModule(L1,1)

             0  1  2  3
o10 = total: 3 35 42 10
          0: 3  .  .  .
          1: .  .  .  .
          2: .  .  .  .
          3: . 35 42  .
          4: .  .  . 10

o10 : BettiTally

i11 : betti res randomModule(L1,1)

             0  1  2  3
o11 = total: 3 35 42 10
          0: 3  .  .  .
          1: .  .  .  .
          2: .  .  .  .
          3: . 35 42  .
          4: .  .  . 10

o11 : BettiTally

i12 : betti res randomModule({0,2,3,7},1)

              0  1  2  3
o12 = total: 10 42 50 18
          0: 10  .  .  .
          1:  . 42 26  .
          2:  .  . 24 18

o12 : BettiTally

i13 : betti res randomSocleModule({0,2,3,7},1)

              0  1  2 3
o13 = total: 10 42 35 3
          0: 10  .  . .
          1:  . 42 35 .
          2:  .  .  . .
          3:  .  .  . .
          4:  .  .  . 3

o13 : BettiTally

i14 : 
