-- -*- M2-comint -*- hash: 1488109680

i1 : L = {0,2,3,9}

o1 = {0, 2, 3, 9}

o1 : List

i2 : B = pureBettiDiagram L

            0  1  2 3
o2 = total: 7 27 21 1
         0: 7  .  . .
         1: . 27 21 .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: .  .  . .
         6: .  .  . 1

o2 : BettiTally

i3 : pureCharFree L

o3 = 56

i4 : L1 = {0,3,4,6}

o4 = {0, 3, 4, 6}

o4 : List

i5 : B1 = pureBettiDiagram L1

            0 1 2 3
o5 = total: 1 8 9 2
         0: 1 . . .
         1: . . . .
         2: . 8 9 .
         3: . . . 2

o5 : BettiTally

i6 : pureCharFree L1

o6 = 5

i7 : betti res randomSocleModule(L,1)

            0  1  2 3
o7 = total: 7 27 21 1
         0: 7  .  . .
         1: . 27 21 .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: .  .  . .
         6: .  .  . 1

o7 : BettiTally

i8 : betti res randomModule(L,1)

            0  1  2  3
o8 = total: 7 27 35 15
         0: 7  .  .  .
         1: . 27 11  .
         2: .  . 24 15

o8 : BettiTally

i9 : betti res randomModule({0,6,7,9},1)

            0  1  2 3
o9 = total: 1 21 27 7
         0: 1  .  . .
         1: .  .  . .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: . 21 27 .
         6: .  .  . 7

o9 : BettiTally

i10 : betti res randomSocleModule(L1,1)

             0 1 2 3
o10 = total: 1 8 9 2
          0: 1 . . .
          1: . . . .
          2: . 8 9 .
          3: . . . 2

o10 : BettiTally

i11 : betti res randomModule(L1,1)

             0 1 2 3
o11 = total: 1 8 9 2
          0: 1 . . .
          1: . . . .
          2: . 8 9 .
          3: . . . 2

o11 : BettiTally

i12 : betti res randomModule({0,2,3,6},1)

             0 1  2 3
o12 = total: 2 9 10 3
          0: 2 .  . .
          1: . 9  7 .
          2: . .  3 3

o12 : BettiTally

i13 : betti res randomSocleModule({0,2,3,6},1)

             0 1 2 3
o13 = total: 2 9 8 1
          0: 2 . . .
          1: . 9 8 .
          2: . . . .
          3: . . . 1

o13 : BettiTally

i14 : 
