-- -*- M2-comint -*- hash: -327206983

i1 : L = {0,2,3,9}

o1 = {0, 2, 3, 9}

o1 : List

i2 : B = pureBettiDiagram L

            0  1  2 3
o2 = total: 7 27 21 1
         0: 7  .  . .
         1: . 27 21 .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: .  .  . .
         6: .  .  . 1

o2 : BettiTally

i3 : pureCharFree L

o3 = 56

i4 : pureTwoInvariant L 

o4 = 196

i5 : pureWeyman L

o5 = 21

i6 : pureAll L

o6 = (56, 196, 21)

o6 : Sequence

i7 : gcd pureAll L

o7 = 7

i8 : betti res randomSocleModule(L,1)

            0  1  2 3
o8 = total: 7 27 21 1
         0: 7  .  . .
         1: . 27 21 .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: .  .  . .
         6: .  .  . 1

o8 : BettiTally

i9 : betti res randomModule(L,1)

            0  1  2  3
o9 = total: 7 27 35 15
         0: 7  .  .  .
         1: . 27 11  .
         2: .  . 24 15

o9 : BettiTally

i10 : betti res randomModule({0,6,7,9},1)

             0  1  2 3
o10 = total: 1 21 27 7
          0: 1  .  . .
          1: .  .  . .
          2: .  .  . .
          3: .  .  . .
          4: .  .  . .
          5: . 21 27 .
          6: .  .  . 7

o10 : BettiTally

i11 : 
