-- -*- M2-comint -*- hash: -863403435

i1 : R = QQ[x,y,z,w];

i2 : I = monomialIdeal(x*y, x*z, y*z, y*w, z*w^2);

o2 : MonomialIdeal of R

i3 : jumpingNumbers(I)

          7  5  8     10  7  11                                              
o3 = {{2, -, -, -, 3, --, -, --, 4}, {monomialIdeal (y, z), monomialIdeal (y,
          3  2  3      3  2   3
     ------------------------------------------------------------------------
           2                             2                      
     x*z, z , z*w), monomialIdeal (x*y, y , x*z, y*z, y*w, z*w),
     ------------------------------------------------------------------------
                          2                  2      2                     2 
     monomialIdeal (x*y, y , x*z, y*z, y*w, z w, z*w ), monomialIdeal (x*y ,
     ------------------------------------------------------------------------
             2      2     2   2           2 2                     2        
     x*y*z, y z, x*z , y*z , y w, y*z*w, z w ), monomialIdeal (x*y , x*y*z,
     ------------------------------------------------------------------------
      2    2 2     3     3   2      2      2        2   3 2   2 3  
     y z, x z , x*z , y*z , y w, x*z w, y*z w, y*z*w , z w , z w ),
     ------------------------------------------------------------------------
                     2 2     3   2        2    3    2 2       2   2 2     2  
     monomialIdeal (x y , x*y , x y*z, x*y z, y z, x z , x*y*z , y z , x*y w,
     ------------------------------------------------------------------------
      3             2        2      2    2 2       2   2 3                
     y w, x*y*z*w, y z*w, x*z w, y*z w, y w , y*z*w , z w ), monomialIdeal
     ------------------------------------------------------------------------
       2 2     3   2        2    3    2 2       2   2 2     2    3           
     (x y , x*y , x y*z, x*y z, y z, x z , x*y*z , y z , x*y w, y w, x*y*z*w,
     ------------------------------------------------------------------------
      2        3      3    2 2     2 2     2 2       3   3 3   2 4  
     y z*w, x*z w, y*z w, y w , x*z w , y*z w , y*z*w , z w , z w ),
     ------------------------------------------------------------------------
                     2 3   2 2      3    2   2     2 2   3 2   2 3       3 
     monomialIdeal (x y , x y z, x*y z, x y*z , x*y z , y z , x z , x*y*z ,
     ------------------------------------------------------------------------
      2 3     3      2      3          2    2 2    3 2   2   2     3 2 
     y z , x*y w, x*y z*w, y z*w, x*y*z w, y z w, y w , y z*w , x*z w ,
     ------------------------------------------------------------------------
        3 2     2 3   3 4
     y*z w , y*z w , z w )}}

o3 : List

i4 : R = QQ[x,y,z,w];

i5 : I = monomialIdeal(x*y, x*z, y*z, y*w, z*w^2);

o5 : MonomialIdeal of R

i6 : jumpingNumbers(I,Interval=>{2,3},IntervalType=>"OpenClosed")

       7  5  8                               2                             2 
o6 = {{-, -, -, 3}, {monomialIdeal (y, x*z, z , z*w), monomialIdeal (x*y, y ,
       3  2  3
     ------------------------------------------------------------------------
                                               2                  2      2  
     x*z, y*z, y*w, z*w), monomialIdeal (x*y, y , x*z, y*z, y*w, z w, z*w ),
     ------------------------------------------------------------------------
                       2          2      2     2   2           2 2
     monomialIdeal (x*y , x*y*z, y z, x*z , y*z , y w, y*z*w, z w )}}

o6 : List

i7 : 
