-- -*- M2-comint -*- hash: 1529879804

i1 : R = QQ[x,y];

i2 : I = monomialIdeal(y^2,x^3);

o2 : MonomialIdeal of R

i3 : multiplierIdeal(I,5/6)

o3 = monomialIdeal (x, y)

o3 : MonomialIdeal of R

i4 : J = monomialIdeal(x^8,y^6); -- Example 2 of [Howald 2000]

o4 : MonomialIdeal of R

i5 : multiplierIdeal(J,1)

                     6   5    4 2   2 3     4   5
o5 = monomialIdeal (x , x y, x y , x y , x*y , y )

o5 : MonomialIdeal of R

i6 : R = QQ[x,y,z];

i7 : f = toList factor((x^2 - y^2)*(x^2 - z^2)*(y^2 - z^2)*z) / first;

i8 : A = arrangement f;

i9 : multiplierIdeal(A,3/7)

o9 = ideal (z, y, x)

o9 : Ideal of R

i10 : R = QQ[x,y,z];

i11 : n = {2,3,4};

i12 : t = 5/2;

i13 : I = multiplierIdeal(R,n,t)

              2         2
o13 = ideal (y  - x*z, x  - z)

o13 : Ideal of R

i14 : x = symbol x;

i15 : R = QQ[x_1..x_20];

i16 : X = genericMatrix(R,4,5);

              4       5
o16 : Matrix R  <--- R

i17 : multiplierIdeal(X,2,5/7)

o17 = ideal 1

o17 : Ideal of R

i18 : 
