-- -*- M2-comint -*- hash: 569373693

i1 : needsPackage "ReflexivePolytopesDB"

o1 = ReflexivePolytopesDB

o1 : Package

i2 : topes = kreuzerSkarke(5, Limit => 20);
using offline data file: ks5-n50.txt

i3 : A = matrix topes_15

o3 = | 1 1 0 1 -1 -2 1  |
     | 0 2 0 0 -4 0  6  |
     | 0 0 1 0 2  -1 -4 |
     | 0 0 0 2 -2 0  0  |

              4        7
o3 : Matrix ZZ  <--- ZZ

i4 : P = convexHull A

o4 = P

o4 : Polyhedron

i5 : X = normalToricVariety P

o5 = X

o5 : NormalToricVariety

i6 : H = cohomCalg X

o6 = MutableHashTable{}

o6 : MutableHashTable

i7 : cohomCalg(X, {-4, 10, -9})

o7 = {0, 0, 0, 12960, 0}

o7 : List

i8 : for i from 0 to dim X list rank HH^i(X, OO_X(-4, 10, -9))

o8 = {0, 0, 0, 12960, 0}

o8 : List

i9 : peek cohomCalg X

o9 = MutableHashTable{{-4, 10, -9} => {{0, 0, 0, 12960, 0}, {{3,
     ------------------------------------------------------------------------
     1x0*x1*x2*x6}, {3, 1x0*x1*x2*x3*x6}, {3, 1x0*x1*x2*x4*x6}}}}

i10 : 
