-- -*- M2-comint -*- hash: 1479900933

i1 : S = ZZ/101[a,b,Degrees => {{1,0},{0,1}}]

o1 = S

o1 : PolynomialRing

i2 : A = S^{{2,1}}

      1
o2 = S

o2 : S-module, free, degrees {{-2, -1}}

i3 : B = S^{{1,1}}

      1
o3 = S

o3 : S-module, free, degrees {{-1, -1}}

i4 : B' = S^{{3,3}}**B

      1
o4 = S

o4 : S-module, free, degrees {{-4, -4}}

i5 : C = S^{{1,1}, {2,3}}

      2
o5 = S

o5 : S-module, free, degrees {{-1, -1}, {-2, -3}}

i6 : checkDegrees(A,B)

o6 = (true, {-1, 0})

o6 : Sequence

i7 : checkDegrees(A,C)

o7 = (false, )

o7 : Sequence

i8 : d = checkDegrees(B',B)

o8 = (true, {-3, -3})

o8 : Sequence

i9 : degrees (S^{d_1}**B') == degrees B

o9 = true

i10 : degrees (B') == degrees (S^{-d_1}**B)

o10 = true

i11 : checkDegrees(B',B,Strict=>true)

o11 = (false, )

o11 : Sequence

i12 : 
