-- -*- M2-comint -*- hash: 4695353

i1 : R=QQ[x_0..x_4];

i2 : I=monomialIdeal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0);

o2 : MonomialIdeal of R

i3 : betti res I

            0 1 2 3
o3 = total: 1 5 5 1
         0: 1 . . .
         1: . 5 5 .
         2: . . . 1

o3 : BettiTally

i4 : D=simplicialComplex I

o4 = simplicialComplex | x_2x_4 x_1x_4 x_1x_3 x_0x_3 x_0x_2 |

o4 : SimplicialComplex

i5 : fc=facets(D) / face

o5 = {x  x  , x  x  , x  x  , x  x  , x  x  }
       2  4    1  4    1  3    0  3    0  2

o5 : List

i6 : S=QQ[x_5]

o6 = S

o6 : PolynomialRing

i7 : D5=stellarSubdivision(D,fc#0,S)

o7 = simplicialComplex | x_4x_5 x_2x_5 x_1x_4 x_1x_3 x_0x_3 x_0x_2 |

o7 : SimplicialComplex

i8 : I5=ideal D5

o8 = ideal (x x , x x , x x , x x , x x , x x , x x , x x , x x )
             0 1   1 2   2 3   0 4   2 4   3 4   0 5   1 5   3 5

o8 : Ideal of QQ[x ..x ]
                  0   5

i9 : betti res I5

            0 1  2 3 4
o9 = total: 1 9 16 9 1
         0: 1 .  . . .
         1: . 9 16 9 .
         2: . .  . . 1

o9 : BettiTally

i10 : R=QQ[x_1..x_6]

o10 = R

o10 : PolynomialRing

i11 : I=monomialIdeal product gens R

o11 = monomialIdeal(x x x x x x )
                     1 2 3 4 5 6

o11 : MonomialIdeal of R

i12 : D=simplicialComplex I

o12 = simplicialComplex | x_2x_3x_4x_5x_6 x_1x_3x_4x_5x_6 x_1x_2x_4x_5x_6 x_1x_2x_3x_5x_6 x_1x_2x_3x_4x_6 x_1x_2x_3x_4x_5 |

o12 : SimplicialComplex

i13 : S=QQ[x_7]

o13 = S

o13 : PolynomialRing

i14 : Dsigma=stellarSubdivision(D,face {x_1,x_2,x_3},S)

o14 = simplicialComplex | x_2x_3x_5x_6x_7 x_1x_3x_5x_6x_7 x_1x_2x_5x_6x_7 x_2x_3x_4x_6x_7 x_1x_3x_4x_6x_7 x_1x_2x_4x_6x_7 x_2x_3x_4x_5x_7 x_1x_3x_4x_5x_7 x_1x_2x_4x_5x_7 x_2x_3x_4x_5x_6 x_1x_3x_4x_5x_6 x_1x_2x_4x_5x_6 |

o14 : SimplicialComplex

i15 : betti res ideal Dsigma

             0 1 2
o15 = total: 1 2 1
          0: 1 . .
          1: . . .
          2: . 1 .
          3: . 1 .
          4: . . .
          5: . . 1

o15 : BettiTally

i16 : 
