-- -*- M2-comint -*- hash: 1180213631

i1 : R=QQ[x_1..x_4,z_1];

i2 : cc=res ideal(x_4*x_3, -x_1*x_2+x_4*z_1);

i3 : cs=substitute(cc,QQ[x_1..x_4])

                 1                 2                 1
o3 = (QQ[x ..x ])  <-- (QQ[x ..x ])  <-- (QQ[x ..x ])  <-- 0
          1   4             1   4             1   4         
                                                           3
     0                 1                 2

o3 : ChainComplex

i4 : cs.dd_1

o4 = | x_1x_2 x_3x_4 |

                        1                  2
o4 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                 1   4              1   4

i5 : 
