-- -*- M2-comint -*- hash: 1095162440

i1 : R = QQ[x_1..x_4,z_1..z_4, T]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(z_2*z_3-z_1*z_4,x_4*z_3-x_3*z_4,x_2*z_2-x_1*z_4,x_4*z_1-x_3*z_2,x_2*z_1-x_1*z_3)

o2 = ideal (z z  - z z , x z  - x z , x z  - x z , x z  - x z , x z  - x z )
             2 3    1 4   4 3    3 4   2 2    1 4   4 1    3 2   2 1    1 3

o2 : Ideal of R

i3 : J = ideal (z_1..z_4)

o3 = ideal (z , z , z , z )
             1   2   3   4

o3 : Ideal of R

i4 : phi = unprojectionHomomorphism(I,J)

o4 = | x_2x_4 x_2x_3 x_1x_4 x_1x_3 |

o4 : Matrix

i5 : S = ring target phi;

i6 : I == ideal S

o6 = true

i7 : source phi

o7 = image | z_4 z_3 z_2 z_1 |

                             1
o7 : S-module, submodule of S

i8 : target phi

      1
o8 = S

o8 : S-module, free

i9 : 
