-- -*- M2-comint -*- hash: -1025474355

i1 : R = QQ[x_0..x_4];

i2 : I = monomialIdeal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0);

o2 : MonomialIdeal of R

i3 : D = simplicialComplex I

o3 = simplicialComplex | x_2x_4 x_1x_4 x_1x_3 x_0x_3 x_0x_2 |

o3 : SimplicialComplex

i4 : fc = facets(D)

o4 = {x x , x x , x x , x x , x x }
       2 4   1 4   1 3   0 3   0 2

o4 : List

i5 : (faces D)#(1)

o5 = {x x , x x , x x , x x , x x }
       0 2   0 3   1 3   1 4   2 4

o5 : List

i6 : 
