-- -*- M2-comint -*- hash: 1151825033

i1 : AA1 = affineSpace 1;

i2 : rays AA1

o2 = {{1}}

o2 : List

i3 : max AA1

o3 = {{0}}

o3 : List

i4 : dim AA1

o4 = 1

i5 : assert (isWellDefined AA1 and not isComplete AA1 and isSmooth AA1)

i6 : AA3 = affineSpace (3, CoefficientRing => ZZ/32003, Variable => y);

i7 : rays AA3

o7 = {{1, 0, 0}, {0, 1, 0}, {0, 0, 1}}

o7 : List

i8 : max AA3

o8 = {{0, 1, 2}}

o8 : List

i9 : dim AA3

o9 = 3

i10 : ring AA3

        ZZ
o10 = -----[y ..y ]
      32003  0   2

o10 : PolynomialRing

i11 : assert (isWellDefined AA3 and not isComplete AA3 and isSmooth AA3)

i12 : 
