-- -*- M2-comint -*- hash: 468761876

i1 : X = toricProjectiveSpace 1;

i2 : Y = toricProjectiveSpace 2;

i3 : Z = toricProjectiveSpace 3;

i4 : Seq = (X, Y, Z);

i5 : P = cartesianProduct Seq;

i6 : dim P

o6 = 6

i7 : assert (dim P == 1+2+3)

i8 : factors = components P

o8 = {X, Y, Z}

o8 : List

i9 : # factors

o9 = 3

i10 : assert (factors#0 === X and factors#1 === Y and factors#2 === Z)

i11 : 
