-- -*- M2-comint -*- hash: -485802226

i1 : W = weightedProjectiveSpace {2,5,7};

i2 : assert isSimplicial W

i3 : assert not isCartier W_0

i4 : assert isQQCartier W_0

i5 : assert isCartier (35*W_0)

i6 : X = normalToricVariety (id_(ZZ^3) | -id_(ZZ^3));

i7 : assert not isCartier X_0

i8 : assert not isQQCartier X_0

i9 : K = toricDivisor X;

o9 : ToricDivisor on X

i10 : assert isCartier K

i11 : 
