-- -*- M2-comint -*- hash: -348763979

i1 : X = hirzebruchSurface 2;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map(Y, X, matrix {{1, 0}})

o3 = | 1 0 |

o3 : ToricMap Y <--- X

i4 : g = matrix f

o4 = | 1 0 |

              1        2
o4 : Matrix ZZ  <--- ZZ

i5 : assert (isWellDefined f and ring g === ZZ)

i6 : X2 = X ** X;

i7 : iota0 = X2_[0]

o7 = | 1 0 |
     | 0 1 |
     | 0 0 |
     | 0 0 |

o7 : ToricMap X2 <--- X

i8 : assert (isWellDefined iota0 and source iota0 === X)

i9 : iota1 = X2_[1]

o9 = | 0 0 |
     | 0 0 |
     | 1 0 |
     | 0 1 |

o9 : ToricMap X2 <--- X

i10 : assert (isWellDefined iota1 and source iota1 === X)

i11 : assert (numColumns g == dim X)

i12 : assert (numRows g == dim Y)

i13 : code (net, ToricMap)

o13 = -- code for method: net(ToricMap)
      ../../macaulay2-20220222-18701-1jdl0nm/M2-release-1.19.1/M2/Macaulay2/
      net ToricMap := f -> net matrix f
      -----------------------------------------------------------------------
      packages/NormalToricVarieties/ToricMaps.m2:10:19-10:33: --source code:

i14 : 
