-- -*- M2-comint -*- hash: -1542027864

i1 : PP2 = toricProjectiveSpace 2;

i2 : D1 = 2*PP2_0 - 7*PP2_1 + 3*PP2_2

o2 = 2*PP2  - 7*PP2  + 3*PP2
          0        1        2

o2 : ToricDivisor on PP2

i3 : variety D1

o3 = PP2

o3 : NormalToricVariety

i4 : normalToricVariety D1

o4 = PP2

o4 : NormalToricVariety

i5 : assert(variety D1 === PP2 and normalToricVariety D1 === PP2)

i6 : X = normalToricVariety(id_(ZZ^3) | - id_(ZZ^3));

i7 : D2 = X_0 - 5 * X_3

o7 = X  - 5*X
      0      3

o7 : ToricDivisor on X

i8 : variety D2

o8 = X

o8 : NormalToricVariety

i9 : assert(X === variety D2 and X === normalToricVariety D2)

i10 : 
