-- -*- M2-comint -*- hash: 7828735

i1 : R = ZZ/5[x,y,z];

i2 : I = ideal(x^50*z^95, y^100 + z^27);

o2 : Ideal of R

i3 : frobeniusRoot(2, I)

                4
o3 = ideal (z, y )

o3 : Ideal of R

i4 : p = 3;

i5 : R = GF(p^2)[x,y,z];

i6 : I = ideal(a^(2*p)*x^p + y*z^p + x^p*y^p);

o6 : Ideal of R

i7 : frobeniusRoot(1, I)

o7 = ideal (z, x*y + (a + 1)x)

o7 : Ideal of R

i8 : R = ZZ/2[a,b,c,d];

i9 : A = matrix {{a^4  + a*b*c^2  + a*b*c*d, a^2* b}, {a^2*c*d^3 , a^3* c*d + a^3 *d^2  + b*c*d^3}};

             2       2
o9 : Matrix R  <--- R

i10 : M = image A;

i11 : frobeniusRoot(1, M)

o11 = image {-2} | 1 0 0 |
            {0}  | 0 d a |

                              2
o11 : R-module, submodule of R

i12 : frobeniusRoot(1, A)

o12 = {-2} | 1 0 0 |
      {0}  | 0 d a |

              2       3
o12 : Matrix R  <--- R

i13 : R =  ZZ/5[x,y,z];

i14 : I1 = ideal(x^10, y^10, z^10);

o14 : Ideal of R

i15 : I2 = ideal(x^20*y^100, x + z^100);

o15 : Ideal of R

i16 : I3 = ideal(x^50*y^50*z^50);

o16 : Ideal of R

i17 : time J1 = frobeniusRoot(1, {8, 10, 12}, {I1, I2, I3});
     -- used 0.805386 seconds

o17 : Ideal of R

i18 : time J2 = frobeniusRoot(1, I1^8*I2^10*I3^12);
     -- used 3.23151 seconds

o18 : Ideal of R

i19 : J1 == J2

o19 = true

i20 : 
