-- -*- M2-comint -*- hash: -1761581723

i1 : T = ZZ/5[x,y];

i2 : S = ZZ/5[a,b,c,d];

i3 : g = map(T, S, {x^3, x^2*y, x*y^2, y^3});

o3 : RingMap T <--- S

i4 : R = S/(ker g);

i5 : isFRational(R)

o5 = true

i6 : R = ZZ/7[x,y,z]/(x^3 + y^3 + z^3);

i7 : isFRational(R)

o7 = false

i8 : S = ZZ/3[a,b,c,d,t];

i9 : M = matrix{{a^2 + t^4, b, d}, {c, a^2, b^3 - d}};

             2       3
o9 : Matrix S  <--- S

i10 : I = minors(2, M);

o10 : Ideal of S

i11 : R = S/I;

i12 : isFRational(R)

o12 = true

i13 : 
