-- -*- M2-comint -*- hash: -1941596634

i1 : R = ZZ/5[x,y,z]/(x^2 + y*z);

i2 : isFRegular(R)

o2 = true

i3 : R = ZZ/7[x,y,z]/(x^3 + y^3 + z^3);

i4 : isFRegular(R)

o4 = false

i5 : R = ZZ/5[x,y];

i6 : f = y^2 - x^3;

i7 : isFRegular(1/2, f)

o7 = true

i8 : isFRegular(5/6, f)

o8 = false

i9 : isFRegular(4/5, f)

o9 = false

i10 : isFRegular(4/5 - 1/100000, f)

o10 = true

i11 : R = ZZ/7[x,y,z]/((x - 1)^3 + (y + 1)^3 + z^3);

i12 : isFRegular(R)

o12 = false

i13 : isFRegular(R, AtOrigin => true)

o13 = true

i14 : S = ZZ/13[x,y,z]/(x^3 + y^3 + z^3);

i15 : isFRegular(S)

o15 = false

i16 : isFRegular(S, AtOrigin => true)

o16 = false

i17 : R = ZZ/13[x,y];

i18 : f = (y - 2)^2 - (x - 3)^3;

i19 : isFRegular(5/6, f)

o19 = false

i20 : isFRegular(5/6, f, AtOrigin => true)

o20 = true

i21 : g = y^2 - x^3;

i22 : isFRegular(5/6, g)

o22 = false

i23 : isFRegular(5/6, g, AtOrigin => true)

o23 = false

i24 : S = ZZ/7[x,y,z,u,v,w];

i25 : I = minors(2, matrix {{x, y, z}, {u, v, w}});

o25 : Ideal of S

i26 : debugLevel = 1;

i27 : time isFRegular(S/I, QGorensteinIndex => infinity, DepthOfSearch => 1)
isFRegular: This ring does not appear to be F-regular.  Increasing DepthOfSearch will let the function search more deeply.
     -- used 0.163401 seconds

o27 = false

i28 : time isFRegular(S/I, QGorensteinIndex => infinity, DepthOfSearch => 2)
     -- used 0.17635 seconds

o28 = true

i29 : debugLevel = 0;

i30 : 
