-- -*- M2-comint -*- hash: 2062667485

i1 : S = schurRing(QQ,s,4)

o1 = S

o1 : SchurRing

i2 : Q = schurRing(QQ,q,4,GroupActing => "Sn")

o2 = Q

o2 : SchurRing

i3 : s_{3,2,1}

o3 = s
      3,2,1

o3 : S

i4 : s_(3,2,1)

o4 = s
      3,2,1

o4 : S

i5 : q_4

o5 = q
      4

o5 : Q

i6 : Q_{2,2}

o6 = q
      2,2

o6 : Q

i7 : S_5

o7 = s
      5

o7 : S

i8 : dim s_{3,2,1}

o8 = 64

i9 : s_{3,2,1} * s_{1,1}

o9 = s      + s      + s        + s      + s        + s
      4,3,1    4,2,2    4,2,1,1    3,3,2    3,3,1,1    3,2,2,1

o9 : S

i10 : q_{2,1} * q_{2,1}

o10 = q  + q    + q
       3    2,1    1,1,1

o10 : Q

i11 : listForm (s_{3})^2

o11 = {({6}, 1), ({5, 1}, 1), ({4, 2}, 1), ({3, 3}, 1)}

o11 : List

i12 : q_{2,1} * q_{2,1}

o12 = q  + q    + q
       3    2,1    1,1,1

o12 : Q

i13 : listForm oo

o13 = {({3}, 1), ({2, 1}, 1), ({1, 1, 1}, 1)}

o13 : List

i14 : 
