-- -*- M2-comint -*- hash: -1113278181

i1 : S = schurRing(s,3)

o1 = S

o1 : SchurRing

i2 : dim s_2

o2 = 6

i3 : T = schurRing(t,4,GroupActing => "Sn")

o3 = T

o3 : SchurRing

i4 : dim t_{2,2}

o4 = 2

i5 : U = schurRing(T,u,3)

o5 = U

o5 : SchurRing

i6 : dim (t_{2,2}*u_2)

o6 = 12

i7 : S = schurRing(s,3)

o7 = S

o7 : SchurRing

i8 : dim(n,s_2)

     n(n + 1)
o8 = --------
         2

o8 : Expression of class Divide

i9 : dim(n,s_{1,1})

     (n - 1)n
o9 = --------
         2

o9 : Expression of class Divide

i10 : dim(n,s_{2,1})

      (n - 1)n(n + 1)
o10 = ---------------
             3

o10 : Expression of class Divide

i11 : S = schurRing(s,3)

o11 = S

o11 : SchurRing

i12 : T = schurRing(S,t,4)

o12 = T

o12 : SchurRing

i13 : Q = schurRing(T,q,5,GroupActing => "Sn")

o13 = Q

o13 : SchurRing

i14 : dExpr = dim({a,b,c},s_{2}*t_{1,1}*q_{4,1})

      c(c + 1) (b - 1)b
o14 = --------*--------*4
          2        2

o14 : Expression of class Product

i15 : P = QQ[a,b,c]

o15 = P

o15 : PolynomialRing

i16 : value dExpr

       2 2    2       2
o16 = b c  + b c - b*c  - b*c

o16 : P

i17 : dim({1,2,3},s_{2}*t_{1,1}*q_{4,1})

o17 = 24

o17 : QQ

i18 : 
