-- -*- M2-comint -*- hash: 932632364

i1 : cF = new ClassFunction from {{2} => 1, {1,1} => -1};

i2 : pl1 = plethysm({1,1},cF)

o2 = ClassFunction{{1, 1} => 1}
                   {2} => 1

o2 : ClassFunction

i3 : R = symmetricRing 5;

i4 : pl2 = plethysm(e_1+e_2,cF)

o4 = ClassFunction{{1, 1} => 0}
                   {2} => 2

o4 : ClassFunction

i5 : S = schurRing R;

i6 : symmetricFunction(cF,S)

o6 = -s
       1,1

o6 : S

i7 : symmetricFunction(pl1,S)

o7 = s
      2

o7 : S

i8 : symmetricFunction(pl2,S)

o8 = s  - s
      2    1,1

o8 : S

i9 : 
