-- -*- M2-comint -*- hash: 2122917771

i1 : S = schurRing(QQ[x],s,3);

i2 : (x*s_{2,1}+s_3)^2

                           2                   2                 2           
o2 = s  + (2x + 1)s    + (x  + 2x + 1)s    + (x  + 2x)s      + (x  + 1)s    +
      6            5,1                 4,2             4,1,1            3,3  
     ------------------------------------------------------------------------
        2                2
     (2x  + 2x)s      + x s
                3,2,1      2,2,2

o2 : S

i3 : S = schurRing(s,4,GroupActing => "Sn");

i4 : exteriorPower(2,s_(3,1))

o4 = s
      2,1,1

o4 : S

i5 : S = schurRing(ZZ/5,t)

o5 = S

o5 : SchurRing

i6 : (t_(2,1)-t_3)^2

o6 = t  - t    - t      + 2t    + t        + t      + t
      6    5,1    4,1,1     3,3    3,1,1,1    2,2,2    2,2,1,1

o6 : S

i7 : S = schurRing(r,2,EHPVariables => (re,rh,rp))

o7 = S

o7 : SchurRing

i8 : toH r_(2,1)

       3
o8 = rh  - rh rh
       1     1  2

o8 : QQ[re ..re , rp ..rp , rh ..rh ]
          1    2    1    2    1    2

i9 : 
