-- -*- M2-comint -*- hash: -879598926

i1 : S = schurRing(QQ,s,3)

o1 = S

o1 : SchurRing

i2 : rep = s_{2}

o2 = s
      2

o2 : S

i3 : M = {1_S,s_{2},s_{4},s_{6},s_{8},s_{10},s_{12}}

o3 = {s  , s , s , s , s , s  , s  }
       ()   2   4   6   8   10   12

o3 : List

i4 : schurResolution(rep,M)

o4 = {{(0, s  )}, {(2, s   )}, {(3, s     )}, {(4, s     )}}
            ()          2,2          3,2,1          3,3,2

o4 : List

i5 : rep = s_{3}

o5 = s
      3

o5 : S

i6 : M = {1_S,s_{3},s_{6},s_{9},s_{12},s_{15},s_{18},s_{21},s_{24},s_{27}}

o6 = {s  , s , s , s , s  , s  , s  , s  , s  , s  }
       ()   3   6   9   12   15   18   21   24   27

o6 : List

i7 : d = 7

o7 = 7

i8 : schurResolution(rep,M,DegreeLimit => d)

o8 = {{(0, s  )}, {(2, s   )}, {(3, s      + s    + s      + s     )}, {(4,
            ()          4,2          6,2,1    5,4    5,3,1    4,3,2        
     ------------------------------------------------------------------------
     s      + s      + s      + s      + s      + s      + s     )}, {(5,
      7,4,1    7,3,2    6,5,1    6,4,2    6,3,3    5,5,2    5,4,3        
     ------------------------------------------------------------------------
     s      + s      + s      + s      + s      + s      + s     )}, {(6,
      8,5,2    8,4,3    7,6,2    7,5,3    7,4,4    6,6,3    6,5,4        
     ------------------------------------------------------------------------
     s      + s      + s      + s     )}, {(7, s     )}}
      9,5,4    8,7,3    8,6,4    7,6,5          9,7,5

o8 : List

i9 : T = schurRing(S,t,4)

o9 = T

o9 : SchurRing

i10 : rep = s_1 * t_1

o10 = s t
       1 1

o10 : T

i11 : M = {1_T} | apply(splice{1..8},i -> s_i * t_i)

o11 = {t  , s t , s t , s t , s t , s t , s t , s t , s t }
        ()   1 1   2 2   3 3   4 4   5 5   6 6   7 7   8 8

o11 : List

i12 : schurResolution(rep,M)

o12 = {{(0, t  )}, {(2, s   t   )}, {(3, s     t    + s   t     )}, {(4,
             ()          1,1 1,1          1,1,1 2,1    2,1 1,1,1        
      -----------------------------------------------------------------------
      s     t      + s   t       )}, {(5, s     t       ), (6,
       2,1,1 2,1,1    3,1 1,1,1,1          3,1,1 2,1,1,1      
      -----------------------------------------------------------------------
      s     t     )}, {(7, s     t       )}, {(8, s     t       )}}
       2,2,2 2,2,2          3,2,2 2,2,2,1          3,3,2 2,2,2,2

o12 : List

i13 : n = 5;

i14 : S = schurRing(QQ,s,n,GroupActing => "Sn");

i15 : rep = s_n + s_{n-1,1};

i16 : M = {s_n}

o16 = {s }
        5

o16 : List

i17 : schurResolution(rep,M,DegreeLimit => n)

o17 = {{(0, s )}, {(1, s  + s   )}, {(2, s    + s     )}, {(3, s      +
             5          5    4,1          4,1    3,1,1          3,1,1  
      -----------------------------------------------------------------------
      s       )}, {(4, s        + s         )}, {(5, s         )}}
       2,1,1,1          2,1,1,1    1,1,1,1,1          1,1,1,1,1

o17 : List

i18 : M = {s_n} | splice{n:rep};

i19 : schurResolution(rep,M)

o19 = {{(0, s )}, {(2, s  + s    + s   )}, {(3, s    + s    + s      +
             5          5    4,1    3,2          4,1    3,2    3,1,1  
      -----------------------------------------------------------------------
      s     )}, {(4, s      + s      + s       )}, {(5, s       )}}
       2,2,1          3,1,1    2,2,1    2,1,1,1          2,1,1,1

o19 : List

i20 : 
