-- -*- M2-comint -*- hash: -659363519

i1 : A = schurRing(a,3,GroupActing => "Sn");

i2 : B = schurRing(A,b,2);

i3 : rep = (a_3 + a_{2,1}) * b_1

o3 = (a  + a   )b
       3    2,1  1

o3 : B

i4 : d = dim rep

o4 = 6

i5 : M = {a_3 * 1_B};

i6 : sR = schurResolution(rep,M,DegreeLimit => d)

o6 = {{(0, a b  )}, {(1, (a  + a   )b )}, {(2, (a    + a     )b  + (2a  +
            3 ()           3    2,1  1           2,1    1,1,1  2      3  
     ------------------------------------------------------------------------
     2a   )b   )}, {(3, a     b  + (a  + 3a    + a     )b   )}, {(4, (a    +
       2,1  1,1          1,1,1 3     3     2,1    1,1,1  2,1           2,1  
     ------------------------------------------------------------------------
     a     )b    + (2a  + 2a   )b   )}, {(5, (a  + a   )b   )}, {(6,
      1,1,1  3,1      3     2,1  2,2           3    2,1  3,2        
     ------------------------------------------------------------------------
     a b   )}}
      3 3,3

o6 : List

i7 : 
