-- -*- M2-comint -*- hash: 1375134362

i1 : R = symmetricRing(QQ,4);

i2 : fs = toS(e_1*h_2+p_3)

o2 = 2s  + s
       3    1,1,1

o2 : schurRing (QQ, s, 4)

i3 : S = schurRing(s,2);

i4 : toS(fs,S)

o4 = 2s
       3

o4 : S

i5 : R = symmetricRing(4, EHPVariables => (a,b,c), SVariable => r);

i6 : S = symmetricRing(R, 2, EHPVariables => (x,y,z), SVariable => s);

i7 : T = symmetricRing(S, 3, SVariable => t);

i8 : A = schurRing T;

i9 : f = a_3*x_2*e_1 - b_1*z_2*p_3

o9 = - b z p  + a x e
        1 2 3    3 2 1

o9 : T

i10 : toS f

o10 = (- r s  + r s   )t  + (r s  - r s   )t    + (- r s  + r s   )t      +
          1 2    1 1,1  3     1 2    1 1,1  2,1       1 2    1 1,1  1,1,1  
      -----------------------------------------------------------------------
      r     s   t
       1,1,1 1,1 1

o10 : A

i11 : 
