-- -*- M2-comint -*- hash: -1888954028

i1 : R = symmetricRing 7;

i2 : toP(h_3*e_3)

      1 6   1 2 2   1 3     1 2
o2 = --p  - -p p  + -p p  + -p
     36 1   4 1 2   9 1 3   9 3

o2 : R

i3 : S = schurRing(s,4)

o3 = S

o3 : SchurRing

i4 : toP S_{3,2,1}

      1 6    1 4     1 2 2    5 3     1         1 2   1 2
o4 = --p  + --p p  - -p p  - --p p  + -p p p  - -p  + -p p
     72 1   12 1 2   8 1 2   18 1 3   6 1 2 3   9 3   4 1 4

o4 : QQ[e ..e , p ..p , h ..h ]
         1   4   1   4   1   4

i5 : R = schurRing(r, 4, EHPVariables => (a,b,c));

i6 : S = schurRing(R, s, 2, EHPVariables => (x,y,z));

i7 : T = schurRing(S, t, 3);

i8 : A = symmetricRing T;

i9 : f = (r_1+s_1+t_1)^2

o9 = t  + t    + (2r  s  + 2r s  )t  + (s  + s    + 2r s  + (r  +
      2    1,1      () 1     1 ()  1     2    1,1     1 1     2  
     ------------------------------------------------------------------------
     r   )s  )t
      1,1  ()  ()

o9 : T

i10 : toP f

       2                    2            2
o10 = p  + (2z  + 2c )p  + z  + 2c z  + c
       1      1     1  1    1     1 1    1

o10 : A

i11 : 
