-- -*- M2-comint -*- hash: -10263175

i1 : R = symmetricRing 7;

i2 : toE(h_3*e_3)

      3                2
o2 = e e  - 2e e e  + e
      1 3     1 2 3    3

o2 : R

i3 : S = schurRing(s,4)

o3 = S

o3 : SchurRing

i4 : toE S_{3,2,1}

               2    2
o4 = e e e  - e  - e e
      1 2 3    3    1 4

o4 : QQ[e ..e , p ..p , h ..h ]
         1   4   1   4   1   4

i5 : R = schurRing(r, 4, EHPVariables => (a,b,c));

i6 : S = schurRing(R, s, 2, EHPVariables => (x,y,z));

i7 : T = schurRing(S, t, 3);

i8 : A = symmetricRing T;

i9 : f = (r_1+s_1+t_1)^2

o9 = t  + t    + (2r  s  + 2r s  )t  + (s  + s    + 2r s  + (r  +
      2    1,1      () 1     1 ()  1     2    1,1     1 1     2  
     ------------------------------------------------------------------------
     r   )s  )t
      1,1  ()  ()

o9 : T

i10 : toE f

       2                    2            2
o10 = e  + (2x  + 2a )e  + x  + 2a x  + a
       1      1     1  1    1     1 1    1

o10 : A

i11 : 
