-- -*- M2-comint -*- hash: -1412228732

i1 : S=ZZ/101[x,y,z];

i2 : M=labeledModule(S^3);

o2 : free S-module with labeled basis

i3 : E=exteriorPower(2,M)

      3
o3 = S

o3 : free S-module with labeled basis

i4 : basisList E

o4 = {{0, 1}, {0, 2}, {1, 2}}

o4 : List

i5 : underlyingModules E

       3
o5 = {S }

o5 : List

i6 : F=exteriorPower(2,E);

o6 : free S-module with labeled basis

i7 : basisList F

o7 = {{{0, 1}, {0, 2}}, {{0, 1}, {1, 2}}, {{0, 2}, {1, 2}}}

o7 : List

i8 : S=ZZ/101[x,y,z];

i9 : M=labeledModule(S^2);

o9 : free S-module with labeled basis

i10 : E=exteriorPower(1,M);

o10 : free S-module with labeled basis

i11 : basisList M

o11 = {0, 1}

o11 : List

i12 : basisList E

o12 = {{0}, {1}}

o12 : List

i13 : underlyingModules M

o13 = {}

o13 : List

i14 : underlyingModules E

        2
o14 = {S }

o14 : List

i15 : S=ZZ/101[x,y,z];

i16 : M=labeledModule(S^2);

o16 : free S-module with labeled basis

i17 : E=exteriorPower(0,M)

       1
o17 = S

o17 : free S-module with labeled basis

i18 : basisList E

o18 = {{}}

o18 : List

i19 : underlyingModules E

o19 = {}

o19 : List

i20 : 
