-- -*- M2-comint -*- hash: -1940564406

i1 : d={0,2,4,5};

i2 : FF=pureResES(d,ZZ/32003)

        ZZ          3        ZZ          10        ZZ          15        ZZ          8
o2 = (-----[x ..x ])  <-- (-----[x ..x ])   <-- (-----[x ..x ])   <-- (-----[x ..x ])  <-- 0
      32003  0   2         32003  0   2          32003  0   2          32003  0   2         
                                                                                           4
     0                    1                     2                     3

o2 : ChainComplex

i3 : betti FF

            0  1  2 3
o3 = total: 3 10 15 8
         0: 3  .  . .
         1: . 10  . .
         2: .  . 15 8

o3 : BettiTally

i4 : 
