-- -*- M2-comint -*- hash: -2133213459

i1 : S=ZZ/101[x,y,z];

i2 : F=labeledModule(S^2);

o2 : free S-module with labeled basis

i3 : G=symmetricPower(2,F);

o3 : free S-module with labeled basis

i4 : f=map(F,G,{{x,y,z},{y,z,x}})

o4 = | x y z |
     | y z x |

             2       3
o4 : Matrix S  <--- S

i5 : target f

      2
o5 = S

o5 : free S-module with labeled basis

i6 : basisList target f

o6 = {0, 1}

o6 : List

i7 : 
