-- -*- M2-comint -*- hash: 1838967123

i1 : S=ZZ/101[x,y,z];

i2 : F=labeledModule(S^2);

o2 : free S-module with labeled basis

i3 : E=labeledModule(S^3);

o3 : free S-module with labeled basis

i4 : G=tensor(F,E)

      6
o4 = S

o4 : free S-module with labeled basis

i5 : basisList G

o5 = {{0, 0}, {0, 1}, {0, 2}, {1, 0}, {1, 1}, {1, 2}}

o5 : List

i6 : 
