-- -*- M2-comint -*- hash: 2105925599

i1 : S = ZZ/101[x,y]

o1 = S

o1 : PolynomialRing

i2 : M = labeledModule(S^4)

      4
o2 = S

o2 : free S-module with labeled basis

i3 : basisList M

o3 = {0, 1, 2, 3}

o3 : List

i4 : E = exteriorPower(2,M)

      6
o4 = S

o4 : free S-module with labeled basis

i5 : basisList E

o5 = {{0, 1}, {0, 2}, {1, 2}, {0, 3}, {1, 3}, {2, 3}}

o5 : List

i6 : underlyingModules E

       4
o6 = {S }

o6 : List

i7 : N = tensorProduct(E,labeledModule(S^2))

      12
o7 = S

o7 : free S-module with labeled basis

i8 : basisList N

o8 = {{{0, 1}, 0}, {{0, 1}, 1}, {{0, 2}, 0}, {{0, 2}, 1}, {{1, 2}, 0}, {{1,
     ------------------------------------------------------------------------
     2}, 1}, {{0, 3}, 0}, {{0, 3}, 1}, {{1, 3}, 0}, {{1, 3}, 1}, {{2, 3}, 0},
     ------------------------------------------------------------------------
     {{2, 3}, 1}}

o8 : List

i9 : underlyingModules N

       6   2
o9 = {S , S }

o9 : List

i10 : 
