-- -*- M2-comint -*- hash: 2098717950

i1 : S=ZZ/101[x,y,z];

i2 : A=labeledModule(S^2);

o2 : free S-module with labeled basis

i3 : B=labeledModule(S^3);

o3 : free S-module with labeled basis

i4 : C=labeledModule(S^3);

o4 : free S-module with labeled basis

i5 : D=labeledModule(S^{2:-1});

o5 : free S-module with labeled basis

i6 : f=map(A,B,{{1,1,1},{0,3,5}})

o6 = | 1 1 1 |
     | 0 3 5 |

             2       3
o6 : Matrix S  <--- S

i7 : g=map(C,D,{{x,y},{0,z},{y,0}})

o7 = | x y |
     | 0 z |
     | y 0 |

             3       2
o7 : Matrix S  <--- S

i8 : tensor(f,g)

o8 = | x y x  y  x  y  |
     | 0 z 0  z  0  z  |
     | y 0 y  0  y  0  |
     | 0 0 3x 3y 5x 5y |
     | 0 0 0  3z 0  5z |
     | 0 0 3y 0  5y 0  |

             6       6
o8 : Matrix S  <--- S

i9 : 
