-- -*- M2-comint -*- hash: 1731131202

i1 : R = ZZ/101[x,y,z,w];

i2 : X = quadricSurface(R);

i3 : Y = cubicSurface(R);

i4 : Z = quarticSurfaceRational(R);

i5 : LD = smoothDivisors(4,X) | smoothDivisors(4,Y) | smoothDivisors(4,Z)

o5 = {{1, 3}, {2, 2}, {2, 2, 0, 0, 0, 0, 0}, {2, 1, 1, 0, 0, 0, 0}, {3, 1, 1,
     ------------------------------------------------------------------------
     1, 1, 1, 0}, {2, 0, 1, 1, 1, 1, 0, 0, 0, 0}, {3, 1, 1, 1, 1, 1, 1, 1, 0,
     ------------------------------------------------------------------------
     0}}

o5 : List

i6 : LC = apply(LD,D->curve D);

i7 : C = curve(5,2);

i8 : degree C, genus C, isPrime C, isSmooth C

o8 = (5, 2, true, true)

o8 : Sequence

i9 : G = positiveChars(8);

i10 : L = G / allACMBetti;

i11 : netList L

      +------------+------------+
      |       0 1 2|            |
o11 = |total: 1 3 2|            |
      |    0: 1 . .|            |
      |    1: . 2 1|            |
      |    2: . . .|            |
      |    3: . . .|            |
      |    4: . . .|            |
      |    5: . . .|            |
      |    6: . 1 1|            |
      +------------+------------+
      |       0 1 2|            |
      |total: 1 3 2|            |
      |    0: 1 . .|            |
      |    1: . 1 .|            |
      |    2: . 1 1|            |
      |    3: . . .|            |
      |    4: . . .|            |
      |    5: . 1 1|            |
      +------------+------------+
      |       0 1 2|       0 1 2|
      |total: 1 2 1|total: 1 3 2|
      |    0: 1 . .|    0: 1 . .|
      |    1: . 1 .|    1: . 1 .|
      |    2: . . .|    2: . . .|
      |    3: . 1 .|    3: . 1 1|
      |    4: . . 1|    4: . 1 1|
      +------------+------------+
      |       0 1 2|            |
      |total: 1 4 3|            |
      |    0: 1 . .|            |
      |    1: . . .|            |
      |    2: . 3 2|            |
      |    3: . . .|            |
      |    4: . 1 1|            |
      +------------+------------+
      |       0 1 2|       0 1 2|
      |total: 1 3 2|total: 1 4 3|
      |    0: 1 . .|    0: 1 . .|
      |    1: . . .|    1: . . .|
      |    2: . 2 .|    2: . 2 1|
      |    3: . 1 2|    3: . 2 2|
      +------------+------------+

i12 : apply(L, g 
          -> apply(g, B -> randomDeterminantalIdeal(ZZ/101[x,y,z,w], degreeMatrix B)));

i13 : I = monomialCurveIdeal(R,{1,3,4})

                         3      2     2    2    3    2
o13 = ideal (y*z - x*w, z  - y*w , x*z  - y w, y  - x z)

o13 : Ideal of R

i14 : M = raoModule(I)

o14 = cokernel {1} | w -z y -x |

                             1
o14 : R-module, quotient of R

i15 : J = minimalCurve M;

o15 : Ideal of R

i16 : betti res J

             0 1 2 3
o16 = total: 1 4 4 1
          0: 1 . . .
          1: . 4 4 1

o16 : BettiTally

i17 : 
