-- -*- M2-comint -*- hash: -1790613826

i1 : R = QQ[x_1,x_2,D_1,D_2,WeylAlgebra=>{x_1=>D_1,x_2=>D_2}]

o1 = R

o1 : PolynomialRing, 2 differential variables

i2 : I = ideal(x_1*D_1+3*x_2*D_2-1, D_1^3-D_2)

                               3
o2 = ideal (x D  + 3x D  - 1, D  - D )
             1 1     2 2       1    2

o2 : Ideal of R

i3 : Dresolution(I,{-1,-1,1,1})

      1      5      6      2
o3 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o3 : ChainComplex

i4 : 
