-- -*- M2-comint -*- hash: -515211925

i1 : R = QQ[x_1,x_2,D_1,D_2,WeylAlgebra=>{x_1=>D_1,x_2=>D_2}]

o1 = R

o1 : PolynomialRing, 2 differential variables

i2 : I = ideal(x_1, D_2-1) 

o2 = ideal (x , D  - 1)
             1   2

o2 : Ideal of R

i3 : DrestrictionComplex(I,{1,0})

                              1                 1
o3 = 0  <-- 0 <-- (QQ[x , D ])  <-- (QQ[x , D ])
                       2   2             2   2
     -1     0                        
                  1                 2

o3 : ChainComplex

i4 : 
