-- -*- M2-comint -*- hash: 668958897

i1 : R = QQ[x_1,x_2,D_1,D_2,WeylAlgebra=>{x_1=>D_1,x_2=>D_2}]

o1 = R

o1 : PolynomialRing, 2 differential variables

i2 : I = ideal(x_1, D_2-1)

o2 = ideal (x , D  - 1)
             1   2

o2 : Ideal of R

i3 : bFunction(I,{1, 0})

o3 = s + 1

o3 : QQ[s]

i4 : 
