-- -*- M2-comint -*- hash: 1941848854

i1 : W = QQ[x,y,Dx,Dy, WeylAlgebra => {x=>Dx,y=>Dy}]

o1 = W

o1 : PolynomialRing, 2 differential variables

i2 : createDpairs W 

i3 : W.dpairVars

o3 = {{x, y}, {Dx, Dy}, {}}

o3 : List

i4 : W.dpairInds

o4 = {{0, 1}, {2, 3}, {}}

o4 : List

i5 : 
