-- -*- M2-comint -*- hash: 1940208495

i1 : R1 = QQ[z]

o1 = R1

o1 : PolynomialRing

i2 : W1 = makeWA R1

o2 = W1

o2 : PolynomialRing, 1 differential variables

i3 : a=1/2

     1
o3 = -
     2

o3 : QQ

i4 : b=3

o4 = 3

i5 : c=5/3

     5
o5 = -
     3

o5 : QQ

i6 : J = ideal(z*(1-z)*dz^2+(c-(a+b+1)*z)*dz-a*b) -- the Gauss hypergeometric equation, exponents 0, 1-c

              2  2       2   9       5     3
o6 = ideal(- z dz  + z*dz  - -z*dz + -dz - -)
                             2       3     2

o6 : Ideal of W1

i7 : cssExpts(J,{1})

              2
o7 = {{0}, {- -}}
              3

o7 : List

i8 : c=1  -- Now we have a single exponent of multiplicity 2

o8 = 1

i9 : J = ideal(z*(1-z)*dz^2+(c-(a+b+1)*z)*dz-a*b)

              2  2       2   9            3
o9 = ideal(- z dz  + z*dz  - -z*dz + dz - -)
                             2            2

o9 : Ideal of W1

i10 : cssExpts(J,{1})

o10 = {{0}}

o10 : List

i11 : cssExptsMult(J,{1})

o11 = {{2, {0}}}

o11 : List

i12 : 
