-- -*- M2-comint -*- hash: -274622271

i1 : R = QQ[x, dx, WeylAlgebra => {x=>dx}]

o1 = R

o1 : PolynomialRing, 1 differential variables

i2 : f = x^10

      10
o2 = x

o2 : R

i3 : b = globalBFunction f

      10   11 9   66 8   363 7   157773 6   180411 5   341693 4   16819 3  
o3 = s   + --s  + --s  + ---s  + ------s  + ------s  + ------s  + -----s  +
            2      5      20      10000      20000     100000     20000    
     ------------------------------------------------------------------------
      1594197 2    66429       567
     --------s  + -------s + -------
     12500000     6250000    1562500

o3 : QQ[s]

i4 : factorBFunction b

                 1      1      2      3      4       1       3       7       9
o4 = (s + 1)(s + -)(s + -)(s + -)(s + -)(s + -)(s + --)(s + --)(s + --)(s + --)
                 2      5      5      5      5      10      10      10      10

o4 : Expression of class Product

i5 : 
