-- -*- M2-comint -*- hash: 1344483513

i1 : A = matrix{{1,1,1},{0,1,2}}

o1 = | 1 1 1 |
     | 0 1 2 |

              2        3
o1 : Matrix ZZ  <--- ZZ

i2 : b = {3,4}

o2 = {3, 4}

o2 : List

i3 : I = gkz (A,b)

                                                         2
o3 = ideal (x D  + x D  + x D  - 3, x D  + 2x D  - 4, - D  + D D )
             1 1    2 2    3 3       2 2     3 3         2    1 3

o3 : Ideal of QQ[x ..x , D ..D ]
                  1   3   1   3

i4 : describe ring I

o4 = QQ[x ..x , D ..D , Degrees => {6:1}, Heft => {1}, WeylAlgebra => {{x , D }, {x , D }, {x , D }}]
         1   3   1   3                                                   1   1     2   2     3   3

i5 : D = makeWA(QQ[x_1..x_3])

o5 = D

o5 : PolynomialRing, 3 differential variables

i6 : gkz(A,b,D)

                                                               2
o6 = ideal (x dx  + x dx  + x dx  - 3, x dx  + 2x dx  - 4, - dx  + dx dx )
             1  1    2  2    3  3       2  2     3  3          2     1  3

o6 : Ideal of D

i7 : toricIdealPartials(A,D)

               2
o7 = ideal(- dx  + dx dx )
               2     1  3

o7 : Ideal of QQ[dx ..dx ]
                   1    3

i8 : eulerOperators(A,b,D)

o8 = {x dx  + x dx  + x dx  - 3, x dx  + 2x dx  - 4}
       1  1    2  2    3  3       2  2     3  3

o8 : List

i9 : 
