-- -*- M2-comint -*- hash: -333576171

i1 : R = QQ[x, dx, WeylAlgebra => {x=>dx}]

o1 = R

o1 : PolynomialRing, 1 differential variables

i2 : f = x^7

      7
o2 = x

o2 : R

i3 : b = globalB(ideal dx, f)

                              7
o3 = HashTable{Boperator => dx                                                                                   }
                                     7           6           5           4           3          2
               Bpolynomial => 823543s  + 3294172s  + 5411854s  + 4705960s  + 2321767s  + 643468s  + 91476s + 5040

o3 : HashTable

i4 : factorBFunction b.Bpolynomial 

                 1      2      3      4      5      6
o4 = (s + 1)(s + -)(s + -)(s + -)(s + -)(s + -)(s + -)
                 7      7      7      7      7      7

o4 : Expression of class Product

i5 : 
