-- -*- M2-comint -*- hash: -1668663223

i1 : S=QQ[x_0..x_4];

i2 : I=minors(2,matrix {{x_0,x_1,x_2,x_3},{x_1,x_2,x_3,x_4}});

o2 : Ideal of S

i3 : F0=gens I

o3 = | -x_1^2+x_0x_2 -x_1x_2+x_0x_3 -x_2^2+x_1x_3 -x_1x_3+x_0x_4
     ------------------------------------------------------------------------
     -x_2x_3+x_1x_4 -x_3^2+x_2x_4 |

             1       6
o3 : Matrix S  <--- S

i4 : T1=cotangentCohomology1(F0);

             6       4
o4 : Matrix S  <--- S

i5 : R0=gens ker F0;

             6       8
o5 : Matrix S  <--- S

i6 : (f,r)=firstOrderDeformations(F0,R0,T1);

i7 : A:=(ring f_0)/(image f_0);

i8 : T2=cotangentCohomology2(F0);

             8       3
o8 : Matrix S  <--- S

i9 : NT2:=lift(sub(T2,A)%sub(transpose r_0,A),ring f_0);

                       8                 3
o9 : Matrix (S[t ..t ])  <--- (S[t ..t ])
                1   4             1   4

i10 : c={NT2};

i11 : g={};

i12 : (F,R,G,C)=liftDeformation(f,r,g,c);

i13 : T=ring first F;

i14 : sum F -- equations for family

o14 = | x_1t_1+x_0t_2-x_1^2+x_0x_2 -t_1t_3+x_0t_4-x_1x_2+x_0x_3
      -----------------------------------------------------------------------
      -t_2t_3+t_3^2-t_1t_4-x_3t_1-x_2t_2+x_1t_4-x_2^2+x_1x_3
      -----------------------------------------------------------------------
      t_2t_3-t_3^2+x_2t_3-x_1x_3+x_0x_4 -x_4t_1-x_3t_2+x_3t_3-x_2x_3+x_1x_4
      -----------------------------------------------------------------------
      x_4t_3-x_3t_4-x_3^2+x_2x_4 |

              1       6
o14 : Matrix T  <--- T

i15 : sum G -- base equations

o15 = | t_2t_3-t_3^2 |
      | -t_1t_3      |
      | t_3t_4       |

              3       1
o15 : Matrix T  <--- T

i16 : 
