-- -*- M2-comint -*- hash: 1826618659

i1 : S=QQ[x,y,z,w];

i2 : F=matrix {{x*z,y*z,z^2,x^3}}

o2 = | xz yz z2 x3 |

             1       4
o2 : Matrix S  <--- S

i3 : N=normalMatrix(0,F)

o3 = {-2} | 0   0  0   0   0   0   0   0   0   zw 0  x2 xy xw 0  0  |
     {-2} | 0   0  0   0   0   0   0   0   0   0  zw xy y2 yw 0  x2 |
     {-2} | 0   0  0   0   0   0   0   0   0   0  0  0  0  0  zw 0  |
     {-3} | zw2 y3 y2w yw2 x2y x2w xy2 xyw xw2 0  0  0  0  0  0  0  |

             4       16
o3 : Matrix S  <--- S

i4 : 
