-- -*- M2-comint -*- hash: 1664399976

i1 : S=QQ[x_0..x_4];

i2 : I=minors(2,matrix {{x_0,x_1,x_2,x_3},{x_1,x_2,x_3,x_4}});

o2 : Ideal of S

i3 : F0=gens I

o3 = | -x_1^2+x_0x_2 -x_1x_2+x_0x_3 -x_2^2+x_1x_3 -x_1x_3+x_0x_4
     ------------------------------------------------------------------------
     -x_2x_3+x_1x_4 -x_3^2+x_2x_4 |

             1       6
o3 : Matrix S  <--- S

i4 : (F,R,G,C)=versalDeformation(F0,Verbose=>2);
Calculating first order deformations and obstruction space
Calculating first order relations
Calculating standard expressions for obstructions
Starting lifting
Order 2
Order 3
Solution is polynomial

i5 : T=ring first G;

i6 : sum G

o6 = | t_2t_3-t_3^2 |
     | -t_1t_3      |
     | t_3t_4       |

             3       1
o6 : Matrix T  <--- T

i7 : sum F

o7 = | x_1t_1+x_0t_2-x_1^2+x_0x_2 -t_1t_3+x_0t_4-x_1x_2+x_0x_3
     ------------------------------------------------------------------------
     -t_2t_3+t_3^2-t_1t_4-x_3t_1-x_2t_2+x_1t_4-x_2^2+x_1x_3
     ------------------------------------------------------------------------
     t_2t_3-t_3^2+x_2t_3-x_1x_3+x_0x_4 -x_4t_1-x_3t_2+x_3t_3-x_2x_3+x_1x_4
     ------------------------------------------------------------------------
     x_4t_3-x_3t_4-x_3^2+x_2x_4 |

             1       6
o7 : Matrix T  <--- T

i8 : S=QQ[x1,x2,x3,x4,x5,x6,z];

i9 : I=ideal {x1*x4-z^2,x2*x5-z^2,x3*x6-z^2,x1*x3-z*x2,x2*x4-z*x3,x3*x5-z*x4,x4*x6-z*x5,x5*x1-z*x6,x6*x2-z*x1};

o9 : Ideal of S

i10 : F0=gens I;

              1       9
o10 : Matrix S  <--- S

i11 : (F,R,G,C)=versalDeformation(F0,Verbose=>2);
Calculating first order deformations and obstruction space
Calculating first order relations
Calculating standard expressions for obstructions
Starting lifting
Order 2
Order 3
Solution is polynomial

i12 : T=ring first G;

i13 : sum G

o13 = | t_2t_3       |
      | t_1t_3-t_3^2 |

              2       1
o13 : Matrix T  <--- T

i14 : sum F

o14 = | -t_1t_2+zt_1+zt_2+x1x4-z2 zt_2+zt_3+x2x5-z2 zt_1+x3x6-z2
      -----------------------------------------------------------------------
      x2t_1+x1x3-x2z x3t_2+x2x4-x3z x4t_3+x3x5-x4z x5t_1-x5t_3+x4x6-x5z
      -----------------------------------------------------------------------
      x6t_2+x6t_3+x1x5-x6z x2x6-x1z |

              1       9
o14 : Matrix T  <--- T

i15 : 
