-- -*- M2-comint -*- hash: 338781635

i1 : S=QQ[x1,x2,x3,y1,y2,y3,z1,z2,z3,Degrees=>
     	  {{1,0,0},{1,0,0},{1,0,0},{0,1,0},{0,1,0},{0,1,0},{0,0,1},{0,0,1},{0,0,1}}];

i2 : I=ideal {y1*z2, x1*z2, y2*z1, y1*z1, x2*z1, x1*z1, x1*y2, x2*y1,
     	   x1*y1, x2*y2*z2};

o2 : Ideal of S

i3 : (F,R,G,C)=versalDeformation(gens I,normalMatrix({0,0,0},gens I),
     	  CT^2({0,0,0},gens I),Verbose=>2);
Calculating first order relations
Calculating standard expressions for obstructions
Starting lifting
Order 2
Order 3
Order 4
Order 5
Order 6
Solution is polynomial

i4 : T=ring first G;

i5 : sum G

o5 = | -t_2t_3t_4+t_2t_4t_7+t_1t_3t_8-t_1t_7t_8-t_1t_3t_13+t_2t_3t_13+t_1t_7t
     | t_1t_3t_4-t_2t_3t_4-t_1t_7t_8+t_2t_7t_8-t_1t_3t_13+t_2t_3t_13+t_1t_7t_
     | -t_1t_3t_16+t_2t_7t_16+t_1t_14t_16-t_2t_14t_16+t_3t_15t_16-t_7t_15t_16
     | -t_1t_3t_18+t_2t_7t_18+t_1t_14t_18-t_2t_14t_18+t_3t_15t_18-t_7t_15t_18
     | -t_2t_4t_17+t_1t_8t_17-t_1t_13t_17+t_2t_13t_17+t_4t_15t_17-t_8t_15t_17
     | t_2t_4t_18-t_1t_8t_18+t_1t_13t_18-t_2t_13t_18-t_4t_15t_18+t_8t_15t_18 
     | -t_3t_4t_17+t_7t_8t_17+t_3t_13t_17-t_7t_13t_17+t_4t_14t_17-t_8t_14t_17
     | -t_3t_4t_16+t_7t_8t_16+t_3t_13t_16-t_7t_13t_16+t_4t_14t_16-t_8t_14t_16
     ------------------------------------------------------------------------
     _13-t_2t_7t_13+t_3t_4t_15-t_4t_7t_15-t_3t_8t_15+t_7t_8t_15 |
     13-t_2t_7t_13-t_1t_4t_14+t_2t_4t_14+t_1t_8t_14-t_2t_8t_14  |
                                                                |
                                                                |
                                                                |
                                                                |
                                                                |
                                                                |

             8       1
o5 : Matrix T  <--- T

i6 : # primaryDecomposition ideal sum G

o6 = 7

i7 : S=QQ[x,y]/ideal {x^4+y^3};

i8 : f= matrix {{x,-y^2},{y,x^3}};

             2       2
o8 : Matrix S  <--- S

i9 : (F,R,G,C)=versalDeformation(f,CT^1(f),extMatrix(f),Verbose=>2);
Calculating first order relations
Calculating standard expressions for obstructions
Starting lifting
Order 2
Order 3
Order 4
Order 5
Solution is polynomial

i10 : T=ring first G;

i11 : ideal sum G

              4    3
o11 = ideal (t  - t , 0)
              2    1

o11 : Ideal of T

i12 : S = QQ[a, b];

i13 : f =  matrix{{a, b, 0, 0}, {0, 0, a, b}};

              2       4
o13 : Matrix S  <--- S

i14 : (F,R,G,C)=versalDeformation(f,normalMatrix(f),extMatrix(f),Verbose=>2);
Calculating first order relations
Calculating standard expressions for obstructions
Starting lifting
Order 2
Order 3
Solution is polynomial

i15 : T=ring first G;

i16 : ideal sum G

o16 = ideal (t t  - t t , t t  - t t  + t t  - t t , - t t  + t t  - t t  +
              4 5    2 7   2 3    1 4    4 6    2 8     3 5    1 7    6 7  
      -----------------------------------------------------------------------
      t t , - t t  + t t )
       5 8     4 5    2 7

o16 : Ideal of T

i17 : 
