-- -*- M2-comint -*- hash: 215487284

i1 : S = ZZ/101[a,b,c]

o1 = S

o1 : PolynomialRing

i2 : R = S/(ideal(a)*ideal(a,b,c))

o2 = R

o2 : QuotientRing

i3 : mR = aInfinity R;

i4 : res coker presentation R

      1      3      3      1
o4 = S  <-- S  <-- S  <-- S  <-- 0
                                  
     0      1      2      3      4

o4 : ChainComplex

i5 : mR#{2,2}

o5 = {3} | 0 -a 0  a 0 0  0 -c 0 |
     {3} | 0 0  -a 0 0 0  a b  0 |
     {3} | 0 0  0  0 0 -a 0 0  0 |

             3       9
o5 : Matrix S  <--- S

i6 : X = coker vars R

o6 = cokernel | a b c |

                            1
o6 : R-module, quotient of R

i7 : A = betti burkeResolution(X,8)

            0 1 2  3  4  5   6   7   8
o7 = total: 1 3 6 13 28 60 129 277 595
         0: 1 3 6 13 28 60 129 277 595

o7 : BettiTally

i8 : B = betti res(X, LengthLimit => 8)

            0 1 2  3  4  5   6   7   8
o8 = total: 1 3 6 13 28 60 129 277 595
         0: 1 3 6 13 28 60 129 277 595

o8 : BettiTally

i9 : A == B

o9 = true

i10 : 
