-- -*- M2-comint -*- hash: -102071319

i1 : S = ZZ/101[x_1..x_4]

o1 = S

o1 : PolynomialRing

i2 : I = x_1^2*ideal(vars S)

             3   2     2     2
o2 = ideal (x , x x , x x , x x )
             1   1 2   1 3   1 4

o2 : Ideal of S

i3 : R = S/I

o3 = R

o3 : QuotientRing

i4 : M = R^1/ideal(x_1..x_3)

o4 = cokernel | x_1 x_2 x_3 |

                            1
o4 : R-module, quotient of R

i5 : F = burkeResolution(M, 4, Check =>true)

      1      3      7      19      50
o5 = R  <-- R  <-- R  <-- R   <-- R
                                   
     0      1      2      3       4

o5 : Complex

i6 : golodBetti (M,12)

            0 1 2  3  4   5   6   7    8    9    10    11     12
o6 = total: 1 3 7 19 50 131 345 907 2385 6272 16493 43371 114051
         0: 1 3 3  1  .   .   .   .    .    .     .     .      .
         1: . . 4 18 34  35  21   7    1    .     .     .      .
         2: . . .  . 16  96 260 420  448  328   165    55     11
         3: . . .  .  .   .  64 480 1680 3640  5448  5940   4840
         4: . . .  .  .   .   .   .  256 2304  9856 26624  50832
         5: . . .  .  .   .   .   .    .    .  1024 10752  54272
         6: . . .  .  .   .   .   .    .    .     .     .   4096

o6 : BettiTally

i7 : betti F

            0 1 2  3  4
o7 = total: 1 3 7 19 50
         0: 1 3 3  1  .
         1: . . 4 18 34
         2: . . .  . 16

o7 : BettiTally

i8 : picture F

     +---------------------------------------+
     |+---+---+                              |
o8 = ||   |{1}|                              |
     |+---+---+                              |
     ||{0}| * |                              |
     |+---+---+                              |
     +---------------------------------------+
     |+---+---+------+                       |
     ||   |{2}|{2, 0}|                       |
     |+---+---+------+                       |
     ||{1}| * |   *  |                       |
     |+---+---+------+                       |
     +---------------------------------------+
     |+------+---+------+------+             |
     ||      |{3}|{3, 0}|{2, 1}|             |
     |+------+---+------+------+             |
     ||  {2} | * |   .  |   *  |             |
     |+------+---+------+------+             |
     ||{2, 0}| . |   *  |   *  |             |
     |+------+---+------+------+             |
     +---------------------------------------+
     |+------+------+------+------+---------+|
     ||      |{4, 0}|{3, 1}|{2, 2}|{2, 2, 0}||
     |+------+------+------+------+---------+|
     ||  {3} |   .  |   *  |   *  |    .    ||
     |+------+------+------+------+---------+|
     ||{3, 0}|   *  |   *  |   .  |    *    ||
     |+------+------+------+------+---------+|
     ||{2, 1}|   .  |   *  |   *  |    *    ||
     |+------+------+------+------+---------+|
     +---------------------------------------+

i9 : displayBlocks F.dd_2

     +---+----------------------+----------------------------------+
o9 = |   |          {2}         |              {2, 0}              |
     +---+----------------------+----------------------------------+
     |{1}|{1} | -x_2 -x_3 0    ||{1} | x_1^2 x_1x_2 x_1x_3 x_1x_4 ||
     |   |{1} | x_1  0    -x_3 ||{1} | 0     0      0      0      ||
     |   |{1} | 0    x_1  x_2  ||{1} | 0     0      0      0      ||
     +---+----------------------+----------------------------------+

i10 : extractBlocks(F.dd_4, {{2,1}},{{3,1},{2,2}})

o10 = {4} | x_2  0    0    x_3  0    0    0    0    0    x_4  0    0    0   
      {4} | 0    x_2  0    0    x_3  0    0    0    0    0    x_4  0    0   
      {4} | 0    0    x_2  0    0    x_3  0    0    0    0    0    x_4  0   
      {4} | -x_1 0    0    0    0    0    x_3  0    0    0    0    0    x_4 
      {4} | 0    -x_1 0    0    0    0    0    x_3  0    0    0    0    0   
      {4} | 0    0    -x_1 0    0    0    0    0    x_3  0    0    0    0   
      {4} | 0    0    0    -x_1 0    0    -x_2 0    0    0    0    0    0   
      {4} | 0    0    0    0    -x_1 0    0    -x_2 0    0    0    0    0   
      {4} | 0    0    0    0    0    -x_1 0    0    -x_2 0    0    0    0   
      {4} | 0    0    0    0    0    0    0    0    0    -x_1 0    0    -x_2
      {4} | 0    0    0    0    0    0    0    0    0    0    -x_1 0    0   
      {4} | 0    0    0    0    0    0    0    0    0    0    0    -x_1 0   
      -----------------------------------------------------------------------
      0    0    0    0    0    -x_2 -x_3 0    0    0    0    0    0    0   
      0    0    0    0    0    x_1  0    -x_3 0    0    0    0    0    0   
      0    0    0    0    0    0    x_1  x_2  0    0    0    0    0    0   
      0    0    0    0    0    0    0    0    -x_2 -x_3 0    0    0    0   
      x_4  0    0    0    0    0    0    0    x_1  0    -x_3 0    0    0   
      0    x_4  0    0    0    0    0    0    0    x_1  x_2  0    0    0   
      0    0    x_4  0    0    0    0    0    0    0    0    -x_2 -x_3 0   
      0    0    0    x_4  0    0    0    0    0    0    0    x_1  0    -x_3
      0    0    0    0    x_4  0    0    0    0    0    0    0    x_1  x_2 
      0    0    -x_3 0    0    0    0    0    0    0    0    0    0    0   
      -x_2 0    0    -x_3 0    0    0    0    0    0    0    0    0    0   
      0    -x_2 0    0    -x_3 0    0    0    0    0    0    0    0    0   
      -----------------------------------------------------------------------
      0    0    0    |
      0    0    0    |
      0    0    0    |
      0    0    0    |
      0    0    0    |
      0    0    0    |
      0    0    0    |
      0    0    0    |
      0    0    0    |
      -x_2 -x_3 0    |
      x_1  0    -x_3 |
      0    x_1  x_2  |

              12       30
o10 : Matrix R   <--- R

i11 : 
