-- -*- M2-comint -*- hash: -1979086252

i1 : n = xmlParse ///<foo a="hi there">  ho there  <bar/></foo>///

o1 = <foo a="hi there">  ho there  <bar/></foo>

o1 : LibxmlNode (xmlTypeDescription)

i2 : x = toXMLnode n

o2 = <foo a="hi there"
       "ho there"
       <bar

o2 : XMLnode

i3 : peek'_3 x

o3 = XMLnode{"a" => "hi there"                              }
             children => {"ho there", XMLnode{tag => "bar"}}
             tag => "foo"

i4 : x#"a"

o4 = hi there

i5 : x.children

o5 = {ho there, <bar}

o5 : List

i6 : class \ oo

o6 = {String, XMLnode}

o6 : List

i7 : x.tag

o7 = foo

i8 : x = toXMLnode(n,Trim=>false)

o8 = <foo a="hi there"
       "  ho there  "
       <bar

o8 : XMLnode

i9 : 
