-- -*- M2-comint -*- hash: -1243490926

i1 : xmlParse ///<bar><a/><b/></bar>///

o1 = <bar>
           <a/>
           <b/>
         </bar>

o1 : LibxmlNode (xmlTypeDescription)

i2 : xmlFirstChild oo

o2 = <a/>

o2 : LibxmlNode (xmlTypeDescription)

i3 : xmlGetNext oo

o3 = <b/>

o3 : LibxmlNode (xmlTypeDescription)

i4 : xmlGetNext oo

i5 : xmlParse ///<bar id="foo" name="too"/>///

o5 = <bar id="foo" name="too"/>

o5 : LibxmlNode (xmlTypeDescription)

i6 : xmlFirstAttribute oo

o6 = id = "foo"

o6 : LibxmlAttribute

i7 : xmlGetNext oo

o7 = name = "too"

o7 : LibxmlAttribute

i8 : xmlGetNext oo

i9 : 
