-- -*- M2-comint -*- hash: 2084625909

i1 : A = ZZ [s,t,u,v,w] ;

i2 : D0 = simplicialComplex {s} ;

i3 : D1 = simplicialComplex {s,t} ;

i4 : D2 = simplicialComplex {s,t,u} ;

i5 : D3 = simplicialComplex {s*t, u} ;

i6 : D4 = simplicialComplex {s*t, u, v} ;

i7 : D5 = simplicialComplex {s*t, u, v, w} ;

i8 : D6 = simplicialComplex {s*t, s*w ,u, v} ;

i9 : D7 = simplicialComplex {s*t, s*w ,t * w, u, v} ;

i10 : D8 = simplicialComplex {s*t, s*w ,t * w, u * v} ;

i11 : D9 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v} ;

i12 : D10 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v, s*u} ;

i13 : D11 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v, s*u, u * w} ;

i14 : D12 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v, s*u, u * w, t* u} ;

i15 : D13 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v, s*u, u * w, t* u, t*u*w} ;

i16 : D14 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v, s*u, u * w, t* u, t*u*w, s*u*w} ;

i17 : D15 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v, s*u, u * w, t* u, t*u*w, s*u*w,s*t*u} ;

i18 : D16 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v, s*u, u * w, t* u, t*u*w, s*u*w,s*t*u, s*u*v} ;

i19 : D17 = simplicialComplex {s*t, s*w ,t * w, u * v, s * v, s*u, u * w, t* u, t*u*w, s*u*w,s*t*u, s*u*v, s*t*w} ;

i20 : L = reverse {D0, D1, D2, D3, D4, D5, D6, D7, D8, D9, D10, D11, D12, D13, D14, D15, D16, D17} ;

i21 : K = filteredComplex (L, ReducedHomology => false) ;

i22 : E = prune spectralSequence K ;

i23 : E^0

      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |  1     |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
o23 = |ZZ      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, 0}  |{1, 0}  |{2, 0}  |{3, 0}  |{4, 0}  |{5, 0}  |{6, 0}  |{7, 0}  |{8, 0}  |{9, 0}  |{10, 0}  |{11, 0}  |{12, 0}  |{13, 0}  |{14, 0}  |{15, 0}  |{16, 0}  |{17, 0}  |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |  1     |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |0       |ZZ      |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -1} |{1, -1} |{2, -1} |{3, -1} |{4, -1} |{5, -1} |{6, -1} |{7, -1} |{8, -1} |{9, -1} |{10, -1} |{11, -1} |{12, -1} |{13, -1} |{14, -1} |{15, -1} |{16, -1} |{17, -1} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |  1     |  1     |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |0       |0       |ZZ      |ZZ      |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -2} |{1, -2} |{2, -2} |{3, -2} |{4, -2} |{5, -2} |{6, -2} |{7, -2} |{8, -2} |{9, -2} |{10, -2} |{11, -2} |{12, -2} |{13, -2} |{14, -2} |{15, -2} |{16, -2} |{17, -2} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -3} |{1, -3} |{2, -3} |{3, -3} |{4, -3} |{5, -3} |{6, -3} |{7, -3} |{8, -3} |{9, -3} |{10, -3} |{11, -3} |{12, -3} |{13, -3} |{14, -3} |{15, -3} |{16, -3} |{17, -3} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |  1     |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |0       |0       |0       |0       |ZZ      |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -4} |{1, -4} |{2, -4} |{3, -4} |{4, -4} |{5, -4} |{6, -4} |{7, -4} |{8, -4} |{9, -4} |{10, -4} |{11, -4} |{12, -4} |{13, -4} |{14, -4} |{15, -4} |{16, -4} |{17, -4} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |  1     |  1     |        |        |        |         |         |         |         |         |         |         |         |
      |0       |0       |0       |0       |0       |ZZ      |ZZ      |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -5} |{1, -5} |{2, -5} |{3, -5} |{4, -5} |{5, -5} |{6, -5} |{7, -5} |{8, -5} |{9, -5} |{10, -5} |{11, -5} |{12, -5} |{13, -5} |{14, -5} |{15, -5} |{16, -5} |{17, -5} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |  1     |        |        |         |         |         |         |         |         |         |         |
      |0       |0       |0       |0       |0       |0       |0       |ZZ      |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -6} |{1, -6} |{2, -6} |{3, -6} |{4, -6} |{5, -6} |{6, -6} |{7, -6} |{8, -6} |{9, -6} |{10, -6} |{11, -6} |{12, -6} |{13, -6} |{14, -6} |{15, -6} |{16, -6} |{17, -6} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |  1     |        |         |         |         |         |         |         |         |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |ZZ      |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -7} |{1, -7} |{2, -7} |{3, -7} |{4, -7} |{5, -7} |{6, -7} |{7, -7} |{8, -7} |{9, -7} |{10, -7} |{11, -7} |{12, -7} |{13, -7} |{14, -7} |{15, -7} |{16, -7} |{17, -7} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |  1     |         |         |         |         |         |         |         |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |ZZ      |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -8} |{1, -8} |{2, -8} |{3, -8} |{4, -8} |{5, -8} |{6, -8} |{7, -8} |{8, -8} |{9, -8} |{10, -8} |{11, -8} |{12, -8} |{13, -8} |{14, -8} |{15, -8} |{16, -8} |{17, -8} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |  1      |         |         |         |         |         |         |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |ZZ       |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -9} |{1, -9} |{2, -9} |{3, -9} |{4, -9} |{5, -9} |{6, -9} |{7, -9} |{8, -9} |{9, -9} |{10, -9} |{11, -9} |{12, -9} |{13, -9} |{14, -9} |{15, -9} |{16, -9} |{17, -9} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |  1      |         |         |         |         |         |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |ZZ       |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -10}|{1, -10}|{2, -10}|{3, -10}|{4, -10}|{5, -10}|{6, -10}|{7, -10}|{8, -10}|{9, -10}|{10, -10}|{11, -10}|{12, -10}|{13, -10}|{14, -10}|{15, -10}|{16, -10}|{17, -10}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |  1      |  1      |         |         |         |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |ZZ       |ZZ       |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -11}|{1, -11}|{2, -11}|{3, -11}|{4, -11}|{5, -11}|{6, -11}|{7, -11}|{8, -11}|{9, -11}|{10, -11}|{11, -11}|{12, -11}|{13, -11}|{14, -11}|{15, -11}|{16, -11}|{17, -11}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |  1      |         |         |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |ZZ       |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -12}|{1, -12}|{2, -12}|{3, -12}|{4, -12}|{5, -12}|{6, -12}|{7, -12}|{8, -12}|{9, -12}|{10, -12}|{11, -12}|{12, -12}|{13, -12}|{14, -12}|{15, -12}|{16, -12}|{17, -12}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |  1      |         |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |ZZ       |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -13}|{1, -13}|{2, -13}|{3, -13}|{4, -13}|{5, -13}|{6, -13}|{7, -13}|{8, -13}|{9, -13}|{10, -13}|{11, -13}|{12, -13}|{13, -13}|{14, -13}|{15, -13}|{16, -13}|{17, -13}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |  1      |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |ZZ       |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -14}|{1, -14}|{2, -14}|{3, -14}|{4, -14}|{5, -14}|{6, -14}|{7, -14}|{8, -14}|{9, -14}|{10, -14}|{11, -14}|{12, -14}|{13, -14}|{14, -14}|{15, -14}|{16, -14}|{17, -14}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |  1      |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |ZZ       |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -15}|{1, -15}|{2, -15}|{3, -15}|{4, -15}|{5, -15}|{6, -15}|{7, -15}|{8, -15}|{9, -15}|{10, -15}|{11, -15}|{12, -15}|{13, -15}|{14, -15}|{15, -15}|{16, -15}|{17, -15}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+

o23 : SpectralSequencePage

i24 : E^1 .dd

o24 = {10, -11} : 0 <----- 0 : {11, -11}
                       0

                             1
      {10, -10} : 0 <----- ZZ  : {11, -10}
                       0

                   1
      {10, -9} : ZZ  <----- 0 : {11, -9}
                        0

      {9, -11} : 0 <----- 0 : {10, -11}
                      0

      {9, -10} : 0 <----- 0 : {10, -10}
                      0

                           1
      {9, -9} : 0 <----- ZZ  : {10, -9}
                     0

                  1
      {9, -8} : ZZ  <----- 0 : {10, -8}
                       0

      {8, -10} : 0 <----- 0 : {9, -10}
                      0

      {8, -9} : 0 <----- 0 : {9, -9}
                     0

                           1
      {8, -8} : 0 <----- ZZ  : {9, -8}
                     0

                  1
      {8, -7} : ZZ  <----- 0 : {9, -7}
                       0

      {7, -9} : 0 <----- 0 : {8, -9}
                     0

      {7, -8} : 0 <----- 0 : {8, -8}
                     0

                           1
      {7, -7} : 0 <----- ZZ  : {8, -7}
                     0

                  1
      {7, -6} : ZZ  <----- 0 : {8, -6}
                       0

      {6, -8} : 0 <----- 0 : {7, -8}
                     0

      {6, -7} : 0 <----- 0 : {7, -7}
                     0

                           1
      {6, -6} : 0 <----- ZZ  : {7, -6}
                     0

                  1
      {6, -5} : ZZ  <----- 0 : {7, -5}
                       0

      {5, -7} : 0 <----- 0 : {6, -7}
                     0

      {5, -6} : 0 <----- 0 : {6, -6}
                     0

                  1               1
      {5, -5} : ZZ  <---------- ZZ  : {6, -5}
                       | -1 |

      {5, -4} : 0 <----- 0 : {6, -4}
                     0

      {4, -6} : 0 <----- 0 : {5, -6}
                     0

                           1
      {4, -5} : 0 <----- ZZ  : {5, -5}
                     0

                  1
      {4, -4} : ZZ  <----- 0 : {5, -4}
                       0

      {4, -3} : 0 <----- 0 : {5, -3}
                     0

      {3, -5} : 0 <----- 0 : {4, -5}
                     0

                           1
      {3, -4} : 0 <----- ZZ  : {4, -4}
                     0

      {3, -3} : 0 <----- 0 : {4, -3}
                     0

                  1
      {3, -2} : ZZ  <----- 0 : {4, -2}
                       0

      {2, -4} : 0 <----- 0 : {3, -4}
                     0

      {2, -3} : 0 <----- 0 : {3, -3}
                     0

                  1          1
      {2, -2} : ZZ  <----- ZZ  : {3, -2}
                       0

      {2, -1} : 0 <----- 0 : {3, -1}
                     0

      {1, -3} : 0 <----- 0 : {2, -3}
                     0

                           1
      {1, -2} : 0 <----- ZZ  : {2, -2}
                     0

                  1
      {1, -1} : ZZ  <----- 0 : {2, -1}
                       0

      {1, 0} : 0 <----- 0 : {2, 0}
                    0

      {16, -18} : 0 <----- 0 : {17, -18}
                       0

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {16, -17} : 0 <----- 0 : {17, -17}
                       0

                           1
      {0, -1} : 0 <----- ZZ  : {1, -1}
                     0

      {16, -16} : 0 <----- 0 : {17, -16}
                       0

                 1
      {0, 0} : ZZ  <----- 0 : {1, 0}
                      0

                             1
      {16, -15} : 0 <----- ZZ  : {17, -15}
                       0

      {0, 1} : 0 <----- 0 : {1, 1}
                    0

      {15, -17} : 0 <----- 0 : {16, -17}
                       0

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

      {15, -16} : 0 <----- 0 : {16, -16}
                       0

                           1
      {-1, 0} : 0 <----- ZZ  : {0, 0}
                     0

      {15, -15} : 0 <----- 0 : {16, -15}
                       0

      {-1, 1} : 0 <----- 0 : {0, 1}
                     0

                             1
      {15, -14} : 0 <----- ZZ  : {16, -14}
                       0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {14, -16} : 0 <----- 0 : {15, -16}
                       0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

      {14, -15} : 0 <----- 0 : {15, -15}
                       0

      {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {14, -14} : 0 <----- 0 : {15, -14}
                       0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

                             1
      {14, -13} : 0 <----- ZZ  : {15, -13}
                       0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {13, -15} : 0 <----- 0 : {14, -15}
                       0

      {13, -14} : 0 <----- 0 : {14, -14}
                       0

      {13, -13} : 0 <----- 0 : {14, -13}
                       0

                             1
      {13, -12} : 0 <----- ZZ  : {14, -12}
                       0

      {12, -14} : 0 <----- 0 : {13, -14}
                       0

      {12, -13} : 0 <----- 0 : {13, -13}
                       0

      {12, -12} : 0 <----- 0 : {13, -12}
                       0

                    1               1
      {12, -11} : ZZ  <---------- ZZ  : {13, -11}
                         | -1 |

      {11, -13} : 0 <----- 0 : {12, -13}
                       0

      {11, -12} : 0 <----- 0 : {12, -12}
                       0

                             1
      {11, -11} : 0 <----- ZZ  : {12, -11}
                       0

                    1
      {11, -10} : ZZ  <----- 0 : {12, -10}
                         0

      {10, -12} : 0 <----- 0 : {11, -12}
                       0

o24 : SpectralSequencePageMap

i25 : E^8

      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |  1     |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
o25 = |ZZ      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, 0}  |{1, 0}  |{2, 0}  |{3, 0}  |{4, 0}  |{5, 0}  |{6, 0}  |{7, 0}  |{8, 0}  |{9, 0}  |{10, 0}  |{11, 0}  |{12, 0}  |{13, 0}  |{14, 0}  |{15, 0}  |{16, 0}  |{17, 0}  |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -1} |{1, -1} |{2, -1} |{3, -1} |{4, -1} |{5, -1} |{6, -1} |{7, -1} |{8, -1} |{9, -1} |{10, -1} |{11, -1} |{12, -1} |{13, -1} |{14, -1} |{15, -1} |{16, -1} |{17, -1} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -2} |{1, -2} |{2, -2} |{3, -2} |{4, -2} |{5, -2} |{6, -2} |{7, -2} |{8, -2} |{9, -2} |{10, -2} |{11, -2} |{12, -2} |{13, -2} |{14, -2} |{15, -2} |{16, -2} |{17, -2} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -3} |{1, -3} |{2, -3} |{3, -3} |{4, -3} |{5, -3} |{6, -3} |{7, -3} |{8, -3} |{9, -3} |{10, -3} |{11, -3} |{12, -3} |{13, -3} |{14, -3} |{15, -3} |{16, -3} |{17, -3} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -4} |{1, -4} |{2, -4} |{3, -4} |{4, -4} |{5, -4} |{6, -4} |{7, -4} |{8, -4} |{9, -4} |{10, -4} |{11, -4} |{12, -4} |{13, -4} |{14, -4} |{15, -4} |{16, -4} |{17, -4} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -5} |{1, -5} |{2, -5} |{3, -5} |{4, -5} |{5, -5} |{6, -5} |{7, -5} |{8, -5} |{9, -5} |{10, -5} |{11, -5} |{12, -5} |{13, -5} |{14, -5} |{15, -5} |{16, -5} |{17, -5} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |  1     |        |        |         |         |         |         |         |         |         |         |
      |0       |0       |0       |0       |0       |0       |0       |ZZ      |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -6} |{1, -6} |{2, -6} |{3, -6} |{4, -6} |{5, -6} |{6, -6} |{7, -6} |{8, -6} |{9, -6} |{10, -6} |{11, -6} |{12, -6} |{13, -6} |{14, -6} |{15, -6} |{16, -6} |{17, -6} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -7} |{1, -7} |{2, -7} |{3, -7} |{4, -7} |{5, -7} |{6, -7} |{7, -7} |{8, -7} |{9, -7} |{10, -7} |{11, -7} |{12, -7} |{13, -7} |{14, -7} |{15, -7} |{16, -7} |{17, -7} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -8} |{1, -8} |{2, -8} |{3, -8} |{4, -8} |{5, -8} |{6, -8} |{7, -8} |{8, -8} |{9, -8} |{10, -8} |{11, -8} |{12, -8} |{13, -8} |{14, -8} |{15, -8} |{16, -8} |{17, -8} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -9} |{1, -9} |{2, -9} |{3, -9} |{4, -9} |{5, -9} |{6, -9} |{7, -9} |{8, -9} |{9, -9} |{10, -9} |{11, -9} |{12, -9} |{13, -9} |{14, -9} |{15, -9} |{16, -9} |{17, -9} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -10}|{1, -10}|{2, -10}|{3, -10}|{4, -10}|{5, -10}|{6, -10}|{7, -10}|{8, -10}|{9, -10}|{10, -10}|{11, -10}|{12, -10}|{13, -10}|{14, -10}|{15, -10}|{16, -10}|{17, -10}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -11}|{1, -11}|{2, -11}|{3, -11}|{4, -11}|{5, -11}|{6, -11}|{7, -11}|{8, -11}|{9, -11}|{10, -11}|{11, -11}|{12, -11}|{13, -11}|{14, -11}|{15, -11}|{16, -11}|{17, -11}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -12}|{1, -12}|{2, -12}|{3, -12}|{4, -12}|{5, -12}|{6, -12}|{7, -12}|{8, -12}|{9, -12}|{10, -12}|{11, -12}|{12, -12}|{13, -12}|{14, -12}|{15, -12}|{16, -12}|{17, -12}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |  1      |         |         |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |ZZ       |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -13}|{1, -13}|{2, -13}|{3, -13}|{4, -13}|{5, -13}|{6, -13}|{7, -13}|{8, -13}|{9, -13}|{10, -13}|{11, -13}|{12, -13}|{13, -13}|{14, -13}|{15, -13}|{16, -13}|{17, -13}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -14}|{1, -14}|{2, -14}|{3, -14}|{4, -14}|{5, -14}|{6, -14}|{7, -14}|{8, -14}|{9, -14}|{10, -14}|{11, -14}|{12, -14}|{13, -14}|{14, -14}|{15, -14}|{16, -14}|{17, -14}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |  1      |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |ZZ       |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -15}|{1, -15}|{2, -15}|{3, -15}|{4, -15}|{5, -15}|{6, -15}|{7, -15}|{8, -15}|{9, -15}|{10, -15}|{11, -15}|{12, -15}|{13, -15}|{14, -15}|{15, -15}|{16, -15}|{17, -15}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+

o25 : SpectralSequencePage

i26 : E^8 .dd

o26 = {3, -4} : 0 <----- 0 : {11, -11}
                     0

      {3, -3} : 0 <----- 0 : {11, -10}
                     0

      {3, -2} : 0 <----- 0 : {11, -9}
                     0

      {2, -4} : 0 <----- 0 : {10, -11}
                     0

      {2, -3} : 0 <----- 0 : {10, -10}
                     0

      {2, -2} : 0 <----- 0 : {10, -9}
                     0

      {2, -1} : 0 <----- 0 : {10, -8}
                     0

      {1, -3} : 0 <----- 0 : {9, -10}
                     0

      {1, -2} : 0 <----- 0 : {9, -9}
                     0

      {1, -1} : 0 <----- 0 : {9, -8}
                     0

      {1, 0} : 0 <----- 0 : {9, -7}
                    0

      {0, -2} : 0 <----- 0 : {8, -9}
                     0

      {0, -1} : 0 <----- 0 : {8, -8}
                     0

                 1
      {0, 0} : ZZ  <----- 0 : {8, -7}
                      0

      {0, 1} : 0 <----- 0 : {8, -6}
                    0

      {-1, -1} : 0 <----- 0 : {7, -8}
                      0

      {-1, 0} : 0 <----- 0 : {7, -7}
                     0

                           1
      {-1, 1} : 0 <----- ZZ  : {7, -6}
                     0

      {-1, 2} : 0 <----- 0 : {7, -5}
                     0

      {-2, 0} : 0 <----- 0 : {6, -7}
                     0

      {-2, 1} : 0 <----- 0 : {6, -6}
                     0

      {-2, 2} : 0 <----- 0 : {6, -5}
                     0

      {-2, 3} : 0 <----- 0 : {6, -4}
                     0

      {-3, 1} : 0 <----- 0 : {5, -6}
                     0

      {-3, 2} : 0 <----- 0 : {5, -5}
                     0

      {-3, 3} : 0 <----- 0 : {5, -4}
                     0

      {-3, 4} : 0 <----- 0 : {5, -3}
                     0

      {-4, 2} : 0 <----- 0 : {4, -5}
                     0

      {-4, 3} : 0 <----- 0 : {4, -4}
                     0

      {-4, 4} : 0 <----- 0 : {4, -3}
                     0

      {-4, 5} : 0 <----- 0 : {4, -2}
                     0

      {-5, 3} : 0 <----- 0 : {3, -4}
                     0

      {-5, 4} : 0 <----- 0 : {3, -3}
                     0

      {-5, 5} : 0 <----- 0 : {3, -2}
                     0

      {-5, 6} : 0 <----- 0 : {3, -1}
                     0

      {-6, 4} : 0 <----- 0 : {2, -3}
                     0

      {-6, 5} : 0 <----- 0 : {2, -2}
                     0

      {-6, 6} : 0 <----- 0 : {2, -1}
                     0

      {-6, 7} : 0 <----- 0 : {2, 0}
                     0

      {9, -11} : 0 <----- 0 : {17, -18}
                      0

      {-7, 5} : 0 <----- 0 : {1, -2}
                     0

      {9, -10} : 0 <----- 0 : {17, -17}
                      0

      {-7, 6} : 0 <----- 0 : {1, -1}
                     0

      {9, -9} : 0 <----- 0 : {17, -16}
                     0

      {-7, 7} : 0 <----- 0 : {1, 0}
                     0

                           1
      {9, -8} : 0 <----- ZZ  : {17, -15}
                     0

      {-7, 8} : 0 <----- 0 : {1, 1}
                     0

      {8, -10} : 0 <----- 0 : {16, -17}
                      0

      {-8, 6} : 0 <----- 0 : {0, -1}
                     0

      {8, -9} : 0 <----- 0 : {16, -16}
                     0

                           1
      {-8, 7} : 0 <----- ZZ  : {0, 0}
                     0

      {8, -8} : 0 <----- 0 : {16, -15}
                     0

      {-8, 8} : 0 <----- 0 : {0, 1}
                     0

      {8, -7} : 0 <----- 0 : {16, -14}
                     0

      {-8, 9} : 0 <----- 0 : {0, 2}
                     0

      {7, -9} : 0 <----- 0 : {15, -16}
                     0

      {-9, 7} : 0 <----- 0 : {-1, 0}
                     0

      {7, -8} : 0 <----- 0 : {15, -15}
                     0

      {-9, 8} : 0 <----- 0 : {-1, 1}
                     0

      {7, -7} : 0 <----- 0 : {15, -14}
                     0

      {-9, 9} : 0 <----- 0 : {-1, 2}
                     0

                  1               1
      {7, -6} : ZZ  <---------- ZZ  : {15, -13}
                       | -1 |

      {-9, 10} : 0 <----- 0 : {-1, 3}
                      0

      {6, -8} : 0 <----- 0 : {14, -15}
                     0

      {6, -7} : 0 <----- 0 : {14, -14}
                     0

      {6, -6} : 0 <----- 0 : {14, -13}
                     0

      {6, -5} : 0 <----- 0 : {14, -12}
                     0

      {5, -7} : 0 <----- 0 : {13, -14}
                     0

      {5, -6} : 0 <----- 0 : {13, -13}
                     0

      {5, -5} : 0 <----- 0 : {13, -12}
                     0

      {5, -4} : 0 <----- 0 : {13, -11}
                     0

      {4, -6} : 0 <----- 0 : {12, -13}
                     0

      {4, -5} : 0 <----- 0 : {12, -12}
                     0

      {4, -4} : 0 <----- 0 : {12, -11}
                     0

      {4, -3} : 0 <----- 0 : {12, -10}
                     0

      {3, -5} : 0 <----- 0 : {11, -12}
                     0

o26 : SpectralSequencePageMap

i27 : E^9

      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |  1     |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
o27 = |ZZ      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, 0}  |{1, 0}  |{2, 0}  |{3, 0}  |{4, 0}  |{5, 0}  |{6, 0}  |{7, 0}  |{8, 0}  |{9, 0}  |{10, 0}  |{11, 0}  |{12, 0}  |{13, 0}  |{14, 0}  |{15, 0}  |{16, 0}  |{17, 0}  |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -1} |{1, -1} |{2, -1} |{3, -1} |{4, -1} |{5, -1} |{6, -1} |{7, -1} |{8, -1} |{9, -1} |{10, -1} |{11, -1} |{12, -1} |{13, -1} |{14, -1} |{15, -1} |{16, -1} |{17, -1} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -2} |{1, -2} |{2, -2} |{3, -2} |{4, -2} |{5, -2} |{6, -2} |{7, -2} |{8, -2} |{9, -2} |{10, -2} |{11, -2} |{12, -2} |{13, -2} |{14, -2} |{15, -2} |{16, -2} |{17, -2} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -3} |{1, -3} |{2, -3} |{3, -3} |{4, -3} |{5, -3} |{6, -3} |{7, -3} |{8, -3} |{9, -3} |{10, -3} |{11, -3} |{12, -3} |{13, -3} |{14, -3} |{15, -3} |{16, -3} |{17, -3} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -4} |{1, -4} |{2, -4} |{3, -4} |{4, -4} |{5, -4} |{6, -4} |{7, -4} |{8, -4} |{9, -4} |{10, -4} |{11, -4} |{12, -4} |{13, -4} |{14, -4} |{15, -4} |{16, -4} |{17, -4} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -5} |{1, -5} |{2, -5} |{3, -5} |{4, -5} |{5, -5} |{6, -5} |{7, -5} |{8, -5} |{9, -5} |{10, -5} |{11, -5} |{12, -5} |{13, -5} |{14, -5} |{15, -5} |{16, -5} |{17, -5} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -6} |{1, -6} |{2, -6} |{3, -6} |{4, -6} |{5, -6} |{6, -6} |{7, -6} |{8, -6} |{9, -6} |{10, -6} |{11, -6} |{12, -6} |{13, -6} |{14, -6} |{15, -6} |{16, -6} |{17, -6} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -7} |{1, -7} |{2, -7} |{3, -7} |{4, -7} |{5, -7} |{6, -7} |{7, -7} |{8, -7} |{9, -7} |{10, -7} |{11, -7} |{12, -7} |{13, -7} |{14, -7} |{15, -7} |{16, -7} |{17, -7} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -8} |{1, -8} |{2, -8} |{3, -8} |{4, -8} |{5, -8} |{6, -8} |{7, -8} |{8, -8} |{9, -8} |{10, -8} |{11, -8} |{12, -8} |{13, -8} |{14, -8} |{15, -8} |{16, -8} |{17, -8} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -9} |{1, -9} |{2, -9} |{3, -9} |{4, -9} |{5, -9} |{6, -9} |{7, -9} |{8, -9} |{9, -9} |{10, -9} |{11, -9} |{12, -9} |{13, -9} |{14, -9} |{15, -9} |{16, -9} |{17, -9} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -10}|{1, -10}|{2, -10}|{3, -10}|{4, -10}|{5, -10}|{6, -10}|{7, -10}|{8, -10}|{9, -10}|{10, -10}|{11, -10}|{12, -10}|{13, -10}|{14, -10}|{15, -10}|{16, -10}|{17, -10}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -11}|{1, -11}|{2, -11}|{3, -11}|{4, -11}|{5, -11}|{6, -11}|{7, -11}|{8, -11}|{9, -11}|{10, -11}|{11, -11}|{12, -11}|{13, -11}|{14, -11}|{15, -11}|{16, -11}|{17, -11}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -12}|{1, -12}|{2, -12}|{3, -12}|{4, -12}|{5, -12}|{6, -12}|{7, -12}|{8, -12}|{9, -12}|{10, -12}|{11, -12}|{12, -12}|{13, -12}|{14, -12}|{15, -12}|{16, -12}|{17, -12}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -13}|{1, -13}|{2, -13}|{3, -13}|{4, -13}|{5, -13}|{6, -13}|{7, -13}|{8, -13}|{9, -13}|{10, -13}|{11, -13}|{12, -13}|{13, -13}|{14, -13}|{15, -13}|{16, -13}|{17, -13}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -14}|{1, -14}|{2, -14}|{3, -14}|{4, -14}|{5, -14}|{6, -14}|{7, -14}|{8, -14}|{9, -14}|{10, -14}|{11, -14}|{12, -14}|{13, -14}|{14, -14}|{15, -14}|{16, -14}|{17, -14}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |  1      |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |ZZ       |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -15}|{1, -15}|{2, -15}|{3, -15}|{4, -15}|{5, -15}|{6, -15}|{7, -15}|{8, -15}|{9, -15}|{10, -15}|{11, -15}|{12, -15}|{13, -15}|{14, -15}|{15, -15}|{16, -15}|{17, -15}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+

o27 : SpectralSequencePage

i28 : E^9 .dd

o28 = {2, -3} : 0 <----- 0 : {11, -11}
                     0

      {2, -2} : 0 <----- 0 : {11, -10}
                     0

      {2, -1} : 0 <----- 0 : {11, -9}
                     0

      {1, -3} : 0 <----- 0 : {10, -11}
                     0

      {1, -2} : 0 <----- 0 : {10, -10}
                     0

      {1, -1} : 0 <----- 0 : {10, -9}
                     0

      {1, 0} : 0 <----- 0 : {10, -8}
                    0

      {0, -2} : 0 <----- 0 : {9, -10}
                     0

      {0, -1} : 0 <----- 0 : {9, -9}
                     0

                 1
      {0, 0} : ZZ  <----- 0 : {9, -8}
                      0

      {0, 1} : 0 <----- 0 : {9, -7}
                    0

      {-1, -1} : 0 <----- 0 : {8, -9}
                      0

      {-1, 0} : 0 <----- 0 : {8, -8}
                     0

      {-1, 1} : 0 <----- 0 : {8, -7}
                     0

      {-1, 2} : 0 <----- 0 : {8, -6}
                     0

      {-2, 0} : 0 <----- 0 : {7, -8}
                     0

      {-2, 1} : 0 <----- 0 : {7, -7}
                     0

      {-2, 2} : 0 <----- 0 : {7, -6}
                     0

      {-2, 3} : 0 <----- 0 : {7, -5}
                     0

      {-3, 1} : 0 <----- 0 : {6, -7}
                     0

      {-3, 2} : 0 <----- 0 : {6, -6}
                     0

      {-3, 3} : 0 <----- 0 : {6, -5}
                     0

      {-3, 4} : 0 <----- 0 : {6, -4}
                     0

      {-4, 2} : 0 <----- 0 : {5, -6}
                     0

      {-4, 3} : 0 <----- 0 : {5, -5}
                     0

      {-4, 4} : 0 <----- 0 : {5, -4}
                     0

      {-4, 5} : 0 <----- 0 : {5, -3}
                     0

      {-5, 3} : 0 <----- 0 : {4, -5}
                     0

      {-5, 4} : 0 <----- 0 : {4, -4}
                     0

      {-5, 5} : 0 <----- 0 : {4, -3}
                     0

      {-5, 6} : 0 <----- 0 : {4, -2}
                     0

      {-6, 4} : 0 <----- 0 : {3, -4}
                     0

      {-6, 5} : 0 <----- 0 : {3, -3}
                     0

      {-6, 6} : 0 <----- 0 : {3, -2}
                     0

      {-6, 7} : 0 <----- 0 : {3, -1}
                     0

      {-7, 5} : 0 <----- 0 : {2, -3}
                     0

      {-7, 6} : 0 <----- 0 : {2, -2}
                     0

      {-7, 7} : 0 <----- 0 : {2, -1}
                     0

      {-7, 8} : 0 <----- 0 : {2, 0}
                     0

      {8, -10} : 0 <----- 0 : {17, -18}
                      0

      {-8, 6} : 0 <----- 0 : {1, -2}
                     0

      {8, -9} : 0 <----- 0 : {17, -17}
                     0

      {-8, 7} : 0 <----- 0 : {1, -1}
                     0

      {8, -8} : 0 <----- 0 : {17, -16}
                     0

      {-8, 8} : 0 <----- 0 : {1, 0}
                     0

                           1
      {8, -7} : 0 <----- ZZ  : {17, -15}
                     0

      {-8, 9} : 0 <----- 0 : {1, 1}
                     0

      {7, -9} : 0 <----- 0 : {16, -17}
                     0

      {-9, 7} : 0 <----- 0 : {0, -1}
                     0

      {7, -8} : 0 <----- 0 : {16, -16}
                     0

                           1
      {-9, 8} : 0 <----- ZZ  : {0, 0}
                     0

      {7, -7} : 0 <----- 0 : {16, -15}
                     0

      {-9, 9} : 0 <----- 0 : {0, 1}
                     0

      {7, -6} : 0 <----- 0 : {16, -14}
                     0

      {-9, 10} : 0 <----- 0 : {0, 2}
                      0

      {6, -8} : 0 <----- 0 : {15, -16}
                     0

      {-10, 8} : 0 <----- 0 : {-1, 0}
                      0

      {6, -7} : 0 <----- 0 : {15, -15}
                     0

      {-10, 9} : 0 <----- 0 : {-1, 1}
                      0

      {6, -6} : 0 <----- 0 : {15, -14}
                     0

      {-10, 10} : 0 <----- 0 : {-1, 2}
                       0

      {6, -5} : 0 <----- 0 : {15, -13}
                     0

      {-10, 11} : 0 <----- 0 : {-1, 3}
                       0

      {5, -7} : 0 <----- 0 : {14, -15}
                     0

      {5, -6} : 0 <----- 0 : {14, -14}
                     0

      {5, -5} : 0 <----- 0 : {14, -13}
                     0

      {5, -4} : 0 <----- 0 : {14, -12}
                     0

      {4, -6} : 0 <----- 0 : {13, -14}
                     0

      {4, -5} : 0 <----- 0 : {13, -13}
                     0

      {4, -4} : 0 <----- 0 : {13, -12}
                     0

      {4, -3} : 0 <----- 0 : {13, -11}
                     0

      {3, -5} : 0 <----- 0 : {12, -13}
                     0

      {3, -4} : 0 <----- 0 : {12, -12}
                     0

      {3, -3} : 0 <----- 0 : {12, -11}
                     0

      {3, -2} : 0 <----- 0 : {12, -10}
                     0

      {2, -4} : 0 <----- 0 : {11, -12}
                     0

o28 : SpectralSequencePageMap

i29 : E^infinity

      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |  1     |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
o29 = |ZZ      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, 0}  |{1, 0}  |{2, 0}  |{3, 0}  |{4, 0}  |{5, 0}  |{6, 0}  |{7, 0}  |{8, 0}  |{9, 0}  |{10, 0}  |{11, 0}  |{12, 0}  |{13, 0}  |{14, 0}  |{15, 0}  |{16, 0}  |{17, 0}  |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -1} |{1, -1} |{2, -1} |{3, -1} |{4, -1} |{5, -1} |{6, -1} |{7, -1} |{8, -1} |{9, -1} |{10, -1} |{11, -1} |{12, -1} |{13, -1} |{14, -1} |{15, -1} |{16, -1} |{17, -1} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -2} |{1, -2} |{2, -2} |{3, -2} |{4, -2} |{5, -2} |{6, -2} |{7, -2} |{8, -2} |{9, -2} |{10, -2} |{11, -2} |{12, -2} |{13, -2} |{14, -2} |{15, -2} |{16, -2} |{17, -2} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -3} |{1, -3} |{2, -3} |{3, -3} |{4, -3} |{5, -3} |{6, -3} |{7, -3} |{8, -3} |{9, -3} |{10, -3} |{11, -3} |{12, -3} |{13, -3} |{14, -3} |{15, -3} |{16, -3} |{17, -3} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -4} |{1, -4} |{2, -4} |{3, -4} |{4, -4} |{5, -4} |{6, -4} |{7, -4} |{8, -4} |{9, -4} |{10, -4} |{11, -4} |{12, -4} |{13, -4} |{14, -4} |{15, -4} |{16, -4} |{17, -4} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -5} |{1, -5} |{2, -5} |{3, -5} |{4, -5} |{5, -5} |{6, -5} |{7, -5} |{8, -5} |{9, -5} |{10, -5} |{11, -5} |{12, -5} |{13, -5} |{14, -5} |{15, -5} |{16, -5} |{17, -5} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -6} |{1, -6} |{2, -6} |{3, -6} |{4, -6} |{5, -6} |{6, -6} |{7, -6} |{8, -6} |{9, -6} |{10, -6} |{11, -6} |{12, -6} |{13, -6} |{14, -6} |{15, -6} |{16, -6} |{17, -6} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -7} |{1, -7} |{2, -7} |{3, -7} |{4, -7} |{5, -7} |{6, -7} |{7, -7} |{8, -7} |{9, -7} |{10, -7} |{11, -7} |{12, -7} |{13, -7} |{14, -7} |{15, -7} |{16, -7} |{17, -7} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -8} |{1, -8} |{2, -8} |{3, -8} |{4, -8} |{5, -8} |{6, -8} |{7, -8} |{8, -8} |{9, -8} |{10, -8} |{11, -8} |{12, -8} |{13, -8} |{14, -8} |{15, -8} |{16, -8} |{17, -8} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -9} |{1, -9} |{2, -9} |{3, -9} |{4, -9} |{5, -9} |{6, -9} |{7, -9} |{8, -9} |{9, -9} |{10, -9} |{11, -9} |{12, -9} |{13, -9} |{14, -9} |{15, -9} |{16, -9} |{17, -9} |
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -10}|{1, -10}|{2, -10}|{3, -10}|{4, -10}|{5, -10}|{6, -10}|{7, -10}|{8, -10}|{9, -10}|{10, -10}|{11, -10}|{12, -10}|{13, -10}|{14, -10}|{15, -10}|{16, -10}|{17, -10}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -11}|{1, -11}|{2, -11}|{3, -11}|{4, -11}|{5, -11}|{6, -11}|{7, -11}|{8, -11}|{9, -11}|{10, -11}|{11, -11}|{12, -11}|{13, -11}|{14, -11}|{15, -11}|{16, -11}|{17, -11}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -12}|{1, -12}|{2, -12}|{3, -12}|{4, -12}|{5, -12}|{6, -12}|{7, -12}|{8, -12}|{9, -12}|{10, -12}|{11, -12}|{12, -12}|{13, -12}|{14, -12}|{15, -12}|{16, -12}|{17, -12}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -13}|{1, -13}|{2, -13}|{3, -13}|{4, -13}|{5, -13}|{6, -13}|{7, -13}|{8, -13}|{9, -13}|{10, -13}|{11, -13}|{12, -13}|{13, -13}|{14, -13}|{15, -13}|{16, -13}|{17, -13}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |0        |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -14}|{1, -14}|{2, -14}|{3, -14}|{4, -14}|{5, -14}|{6, -14}|{7, -14}|{8, -14}|{9, -14}|{10, -14}|{11, -14}|{12, -14}|{13, -14}|{14, -14}|{15, -14}|{16, -14}|{17, -14}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |  1      |
      |0       |0       |0       |0       |0       |0       |0       |0       |0       |0       |0        |0        |0        |0        |0        |0        |0        |ZZ       |
      |        |        |        |        |        |        |        |        |        |        |         |         |         |         |         |         |         |         |
      |{0, -15}|{1, -15}|{2, -15}|{3, -15}|{4, -15}|{5, -15}|{6, -15}|{7, -15}|{8, -15}|{9, -15}|{10, -15}|{11, -15}|{12, -15}|{13, -15}|{14, -15}|{15, -15}|{16, -15}|{17, -15}|
      +--------+--------+--------+--------+--------+--------+--------+--------+--------+--------+---------+---------+---------+---------+---------+---------+---------+---------+

o29 : Page

i30 : prune HH K_infinity

o30 = -1 : 0  

             1
       0 : ZZ

       1 : 0  

             1
       2 : ZZ

o30 : GradedModule

i31 : 
