-- -*- M2-comint -*- hash: 628797896

i1 : A = QQ[x,y,z,w];

i2 : M = monomialCurveIdeal(A,{1,2,3});

o2 : Ideal of A

i3 : N = monomialCurveIdeal(A,{1,3,4});

o3 : Ideal of A

i4 : K = res M

      1      3      2
o4 = A  <-- A  <-- A  <-- 0
                           
     0      1      2      3

o4 : ChainComplex

i5 : J = res N

      1      4      4      1
o5 = A  <-- A  <-- A  <-- A  <-- 0
                                  
     0      1      2      3      4

o5 : ChainComplex

i6 : E = prune spectralSequence((filteredComplex K) ** J)

o6 = E

o6 : SpectralSequence

i7 : F = prune spectralSequence((K ** (filteredComplex J)))

o7 = F

o7 : SpectralSequence

i8 : E^0

     +------+------+------+
     | 1    | 3    | 2    |
o8 = |A     |A     |A     |
     |      |      |      |
     |{0, 3}|{1, 3}|{2, 3}|
     +------+------+------+
     | 4    | 12   | 8    |
     |A     |A     |A     |
     |      |      |      |
     |{0, 2}|{1, 2}|{2, 2}|
     +------+------+------+
     | 4    | 12   | 8    |
     |A     |A     |A     |
     |      |      |      |
     |{0, 1}|{1, 1}|{2, 1}|
     +------+------+------+
     | 1    | 3    | 2    |
     |A     |A     |A     |
     |      |      |      |
     |{0, 0}|{1, 0}|{2, 0}|
     +------+------+------+

o8 : SpectralSequencePage

i9 : E^0 .dd

o9 = {2, -3} : 0 <----- 0 : {2, -2}
                    0

     {2, -2} : 0 <----- 0 : {2, -1}
                    0

                         2
     {2, -1} : 0 <----- A  : {2, 0}
                    0

               2                                                                       8
     {2, 0} : A  <------------------------------------------------------------------- A  : {2, 1}
                    {3} | yz-xw y3-x2z xz2-y2w z3-yw2 0     0      0       0      |
                    {3} | 0     0      0       0      yz-xw y3-x2z xz2-y2w z3-yw2 |

               8                                               8
     {2, 1} : A  <------------------------------------------- A  : {2, 2}
                    {5} | -y2 -xz -yw -z2 0   0   0   0   |
                    {6} | z   w   0   0   0   0   0   0   |
                    {6} | x   y   -z  -w  0   0   0   0   |
                    {6} | 0   0   x   y   0   0   0   0   |
                    {5} | 0   0   0   0   -y2 -xz -yw -z2 |
                    {6} | 0   0   0   0   z   w   0   0   |
                    {6} | 0   0   0   0   x   y   -z  -w  |
                    {6} | 0   0   0   0   0   0   x   y   |

               8                     2
     {2, 2} : A  <----------------- A  : {2, 3}
                    {7} | w  0  |
                    {7} | -z 0  |
                    {7} | -y 0  |
                    {7} | x  0  |
                    {7} | 0  w  |
                    {7} | 0  -z |
                    {7} | 0  -y |
                    {7} | 0  x  |

               2
     {2, 3} : A  <----- 0 : {2, 4}
                    0

     {2, 4} : 0 <----- 0 : {2, 5}
                   0

     {1, -2} : 0 <----- 0 : {1, -1}
                    0

                         3
     {1, -1} : 0 <----- A  : {1, 0}
                    0

               3                                                                                                               12
     {1, 0} : A  <----------------------------------------------------------------------------------------------------------- A   : {1, 1}
                    {2} | -yz+xw -y3+x2z -xz2+y2w -z3+yw2 0      0       0        0       0      0       0        0       |
                    {2} | 0      0       0        0       -yz+xw -y3+x2z -xz2+y2w -z3+yw2 0      0       0        0       |
                    {2} | 0      0       0        0       0      0       0        0       -yz+xw -y3+x2z -xz2+y2w -z3+yw2 |

               12                                                   12
     {1, 1} : A   <----------------------------------------------- A   : {1, 2}
                     {4} | y2 xz yw z2 0  0  0  0  0  0  0  0  |
                     {5} | -z -w 0  0  0  0  0  0  0  0  0  0  |
                     {5} | -x -y z  w  0  0  0  0  0  0  0  0  |
                     {5} | 0  0  -x -y 0  0  0  0  0  0  0  0  |
                     {4} | 0  0  0  0  y2 xz yw z2 0  0  0  0  |
                     {5} | 0  0  0  0  -z -w 0  0  0  0  0  0  |
                     {5} | 0  0  0  0  -x -y z  w  0  0  0  0  |
                     {5} | 0  0  0  0  0  0  -x -y 0  0  0  0  |
                     {4} | 0  0  0  0  0  0  0  0  y2 xz yw z2 |
                     {5} | 0  0  0  0  0  0  0  0  -z -w 0  0  |
                     {5} | 0  0  0  0  0  0  0  0  -x -y z  w  |
                     {5} | 0  0  0  0  0  0  0  0  0  0  -x -y |

               12                        3
     {1, 2} : A   <-------------------- A  : {1, 3}
                     {6} | -w 0  0  |
                     {6} | z  0  0  |
                     {6} | y  0  0  |
                     {6} | -x 0  0  |
                     {6} | 0  -w 0  |
                     {6} | 0  z  0  |
                     {6} | 0  y  0  |
                     {6} | 0  -x 0  |
                     {6} | 0  0  -w |
                     {6} | 0  0  z  |
                     {6} | 0  0  y  |
                     {6} | 0  0  -x |

               3
     {1, 3} : A  <----- 0 : {1, 4}
                    0

     {1, 4} : 0 <----- 0 : {1, 5}
                   0

     {1, 5} : 0 <----- 0 : {1, 6}
                   0

                         1
     {0, -1} : 0 <----- A  : {0, 0}
                    0

               1                                       4
     {0, 0} : A  <----------------------------------- A  : {0, 1}
                    | yz-xw y3-x2z xz2-y2w z3-yw2 |

               4                               4
     {0, 1} : A  <--------------------------- A  : {0, 2}
                    {2} | -y2 -xz -yw -z2 |
                    {3} | z   w   0   0   |
                    {3} | x   y   -z  -w  |
                    {3} | 0   0   x   y   |

               4                  1
     {0, 2} : A  <-------------- A  : {0, 3}
                    {4} | w  |
                    {4} | -z |
                    {4} | -y |
                    {4} | x  |

               1
     {0, 3} : A  <----- 0 : {0, 4}
                    0

     {0, 4} : 0 <----- 0 : {0, 5}
                   0

     {0, 5} : 0 <----- 0 : {0, 6}
                   0

     {0, 6} : 0 <----- 0 : {0, 7}
                   0

     {-1, 0} : 0 <----- 0 : {-1, 1}
                    0

     {-1, 1} : 0 <----- 0 : {-1, 2}
                    0

     {-1, 2} : 0 <----- 0 : {-1, 3}
                    0

     {-1, 3} : 0 <----- 0 : {-1, 4}
                    0

     {-1, 4} : 0 <----- 0 : {-1, 5}
                    0

     {-1, 5} : 0 <----- 0 : {-1, 6}
                    0

     {-1, 6} : 0 <----- 0 : {-1, 7}
                    0

     {-1, 7} : 0 <----- 0 : {-1, 8}
                    0

o9 : SpectralSequencePageMap

i10 : F^0

      +------+------+------+------+
      | 2    | 8    | 8    | 2    |
o10 = |A     |A     |A     |A     |
      |      |      |      |      |
      |{0, 2}|{1, 2}|{2, 2}|{3, 2}|
      +------+------+------+------+
      | 3    | 12   | 12   | 3    |
      |A     |A     |A     |A     |
      |      |      |      |      |
      |{0, 1}|{1, 1}|{2, 1}|{3, 1}|
      +------+------+------+------+
      | 1    | 4    | 4    | 1    |
      |A     |A     |A     |A     |
      |      |      |      |      |
      |{0, 0}|{1, 0}|{2, 0}|{3, 0}|
      +------+------+------+------+

o10 : SpectralSequencePage

i11 : E^1

      +----------------------------------------+----------------------------------------------------------------------------------------------------+------------------------------------------------------------------------+
o11 = |cokernel | yz-xw z3-yw2 xz2-y2w y3-x2z ||cokernel {2} | yz-xw 0     0     z3-yw2 xz2-y2w y3-x2z 0      0       0      0      0       0      ||cokernel {3} | yz-xw 0     z3-yw2 xz2-y2w y3-x2z 0      0       0      ||
      |                                        |         {2} | 0     yz-xw 0     0      0       0      z3-yw2 xz2-y2w y3-x2z 0      0       0      ||         {3} | 0     yz-xw 0      0       0      z3-yw2 xz2-y2w y3-x2z ||
      |{0, 0}                                  |         {2} | 0     0     yz-xw 0      0       0      0      0       0      z3-yw2 xz2-y2w y3-x2z ||                                                                        |
      |                                        |                                                                                                    |{2, 0}                                                                  |
      |                                        |{1, 0}                                                                                              |                                                                        |
      +----------------------------------------+----------------------------------------------------------------------------------------------------+------------------------------------------------------------------------+

o11 : SpectralSequencePage

i12 : F^1

      +------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------+
o12 = |cokernel | z2-yw yz-xw y2-xz ||cokernel {2} | z2-yw yz-xw y2-xz 0     0     0     0     0     0     0     0     0     ||cokernel {4} | z2-yw yz-xw y2-xz 0     0     0     0     0     0     0     0     0     ||cokernel {5} | z2-yw yz-xw y2-xz ||
      |                              |         {3} | 0     0     0     z2-yw yz-xw y2-xz 0     0     0     0     0     0     ||         {4} | 0     0     0     z2-yw yz-xw y2-xz 0     0     0     0     0     0     ||                                  |
      |{0, 0}                        |         {3} | 0     0     0     0     0     0     z2-yw yz-xw y2-xz 0     0     0     ||         {4} | 0     0     0     0     0     0     z2-yw yz-xw y2-xz 0     0     0     ||{3, 0}                            |
      |                              |         {3} | 0     0     0     0     0     0     0     0     0     z2-yw yz-xw y2-xz ||         {4} | 0     0     0     0     0     0     0     0     0     z2-yw yz-xw y2-xz ||                                  |
      |                              |                                                                                        |                                                                                        |                                  |
      |                              |{1, 0}                                                                                  |{2, 0}                                                                                  |                                  |
      +------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------+

o12 : SpectralSequencePage

i13 : E^2

      +------------------------------------------------------+--------------------------------------------------------------------------+
o13 = |cokernel | z2-yw yz-xw y2-xz xw2-yw2 xyw-xzw x2z-x2w ||cokernel {2} | z2-yw yz-xw y2-xz xw2-yw2 xzw-yw2 xyw-yw2 x2w-yw2 x2z-yw2 ||
      |                                                      |                                                                          |
      |{0, 0}                                                |{1, 0}                                                                    |
      +------------------------------------------------------+--------------------------------------------------------------------------+

o13 : SpectralSequencePage

i14 : F^2

      +------------------------------------------------------+--------------------------------------------------------------------------+
o14 = |cokernel | z2-yw yz-xw y2-xz xw2-yw2 xyw-xzw x2z-x2w ||cokernel {2} | z2-yw yz-xw y2-xz xw2-yw2 xzw-yw2 xyw-yw2 x2w-yw2 x2z-yw2 ||
      |                                                      |                                                                          |
      |{0, 0}                                                |{1, 0}                                                                    |
      +------------------------------------------------------+--------------------------------------------------------------------------+

o14 : SpectralSequencePage

i15 : 
