-- -*- M2-comint -*- hash: 2057195357

i1 : B = QQ[a_0..a_2,b_0..b_2,c_0..c_2,d_0..d_2];

i2 : l1 = {a_0*b_0*b_1*c_1,a_0*b_0*c_0*c_1,a_0*a_1*b_1*c_1,b_0*b_1*c_1*d_1,b_0*c_0*c_1*d_2,a_0*a_1*c_1*d_2,a_0*c_0*c_1*d_2,b_0*c_1*d_1*d_2};

i3 : l2 = {b_1*c_1*c_2*a_2,b_1*c_1*a_1*a_2,b_1*b_2*c_2*a_2,c_1*c_2*a_2*d_1,c_1*a_1*a_2*d_2,b_1*b_2*a_2*d_2,b_1*a_1*a_2*d_2,c_1*a_2*d_1*d_2};

i4 : l3 = {c_2*a_2*a_0*b_0,c_2*a_2*b_2*b_0,c_2*c_0*a_0*b_0,a_2*a_0*b_0*d_1,a_2*b_2*b_0*d_2,c_2*c_0*b_0*d_2,c_2*b_2*b_0*d_2,a_2*b_0*d_1*d_2};

i5 : l4 = {a_0*b_0*b_1*d_1,a_0*b_1*d_0*d_1,b_1*c_1*c_2*d_1,b_1*c_2*d_0*d_1,a_0*a_2*c_2*d_1,a_0*c_2*d_0*d_1};

i6 : l5 = {a_0*b_1*d_0*d_2,a_0*a_1*b_1*d_2,b_1*c_2*d_0*d_2,b_1*b_2*c_2*d_2,a_0*c_2*d_0*d_2,a_0*c_0*c_2*d_2};

i7 : S3 = simplicialComplex(join(l1,l2,l3,l4,l5));

i8 : f1l1 = {a_0*b_0*b_1,a_0*a_1*b_1,a_0*c_0*c_1,a_0*a_1*c_1,a_0*a_1*d_2,d_1*d_2,b_0*b_1*c_1,b_0*c_0*c_1,b_0*b_1*d_1,b_0*d_1*d_2,c_1*d_1*d_2,c_0*c_1*d_2};

i9 : f1l2 = {b_1*a_1*a_2,b_1*b_2*a_2,c_1*c_2*a_2,c_1*a_1*a_2,a_1*a_2*d_2,a_2*d_1*d_2,b_1*c_1*c_2,b_1*b_2*c_2,b_1*b_2*d_2,d_1*d_2,c_1*d_1*d_2,c_1*c_2*d_1};

i10 : f1l3 = {a_2*a_0*b_0,a_2*b_2*b_0, c_2*a_2*a_0,c_2*c_0*a_0,a_2*a_0*d_1,a_2*d_1*d_2,b_2*b_0*c_2,c_2*c_0*b_0,b_2*b_0*d_2,b_0*d_1*d_2,c_2*c_0*d_2,d_1*d_2};

i11 : f1l4 = {a_0*b_0*b_1,a_0*a_2,a_0*a_2*c_2,c_1*c_2,a_0*d_0*d_1,a_0*a_2*d_1,b_1*c_1*c_2,b_0*b_1,b_0*b_1*d_1,b_1*d_0*d_1,c_1*c_2*d_1,c_2*d_0*d_1}

o11 = {a b b , a a , a a c , c c , a d d , a a d , b c c , b b , b b d ,
        0 0 1   0 2   0 2 2   1 2   0 0 1   0 2 1   1 1 2   0 1   0 1 1 
      -----------------------------------------------------------------------
      b d d , c c d , c d d }
       1 0 1   1 2 1   2 0 1

o11 : List

i12 : f1l5 = {a_0*a_1*b_1,b_1*b_2,a_0*c_0*c_2,a_0*a_1,a_0*d_0*d_2,a_0*a_1*d_2,b_1*b_2*c_2,c_0*c_2,b_1*d_0*d_2,b_1*b_2*d_2,c_2*d_0*d_2,c_0*c_2*d_2};

i13 : F1S3 = simplicialComplex(join(f1l1,f1l2,f1l3,f1l4,f1l5));

i14 : f0l1 = {a_0*a_1,b_0*b_1,c_0*c_1,d_1*d_2};

i15 : f0l2 = {a_1*a_2,b_1*b_2,c_1*c_2,d_1*d_2};

i16 : f0l3 = {a_0*a_2,b_0*b_2,c_0*c_2,d_1*d_2};

i17 : f0l4 = {a_0*a_2,b_0*b_1,c_1*c_2,d_0*d_1};

i18 : f0l5 = {a_0*a_1,b_1*b_2,c_0*c_2,d_0*d_2};

i19 : F0S3 = simplicialComplex(join(f0l1,f0l2,f0l3,f0l4,f0l5));

i20 : K = filteredComplex({S3,F1S3,F0S3}, ReducedHomology => false);

i21 : E = prune spectralSequence K;

i22 : E0 = E^0

      +------+------+------+
      |  12  |  36  |  36  |
o22 = |QQ    |QQ    |QQ    |
      |      |      |      |
      |{0, 1}|{1, 1}|{2, 1}|
      +------+------+------+
      |  12  |  36  |  36  |
      |QQ    |QQ    |QQ    |
      |      |      |      |
      |{0, 0}|{1, 0}|{2, 0}|
      +------+------+------+

o22 : SpectralSequencePage

i23 : E0.dd

o23 = {-1, 0} : 0 <----- 0 : {-1, 1}
                     0

      {-1, 1} : 0 <----- 0 : {-1, 2}
                     0

      {-1, 2} : 0 <----- 0 : {-1, 3}
                     0

      {-1, 3} : 0 <----- 0 : {-1, 4}
                     0

      {2, -4} : 0 <----- 0 : {2, -3}
                     0

      {2, -3} : 0 <----- 0 : {2, -2}
                     0

      {2, -2} : 0 <----- 0 : {2, -1}
                     0

                           36
      {2, -1} : 0 <----- QQ   : {2, 0}
                     0

                 36                                                                                                                        36
      {2, 0} : QQ   <------------------------------------------------------------------------------------------------------------------- QQ   : {2, 1}
                       | 0  0  0  0  0  0  0  0  1  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  -1 0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  1  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  1  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 1  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  1  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  1  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  1  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  1  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  1  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  -1 0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 1  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 -1 0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  1  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  -1 0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  1  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  -1 0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  1  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  -1 0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  -1 |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  -1 0  0  0  |

      {1, -3} : 0 <----- 0 : {1, -2}
                     0

      {1, -2} : 0 <----- 0 : {1, -1}
                     0

                           36
      {1, -1} : 0 <----- QQ   : {1, 0}
                     0

                 36                                                                                                                        36
      {1, 0} : QQ   <------------------------------------------------------------------------------------------------------------------- QQ   : {1, 1}
                       | 0  0  0  1  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 1  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  1  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  1  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  1  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  1  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | -1 0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  -1 0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  -1 0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  -1 0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  1  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  1  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 -1 0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  1  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  -1 0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  1  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  -1 0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  1  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 -1 |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  1  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  1  |

                 36
      {1, 1} : QQ   <----- 0 : {1, 2}
                       0

      {0, -2} : 0 <----- 0 : {0, -1}
                     0

                           12
      {0, -1} : 0 <----- QQ   : {0, 0}
                     0

                 12                                                12
      {0, 0} : QQ   <------------------------------------------- QQ   : {0, 1}
                       | 1  1  0  0  0  0  0  0  0  0  0  0  |
                       | -1 0  1  0  0  0  0  0  0  0  0  0  |
                       | 0  -1 -1 0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  1  1  0  0  0  0  0  0  0  |
                       | 0  0  0  -1 0  1  0  0  0  0  0  0  |
                       | 0  0  0  0  -1 -1 0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  1  1  0  0  0  0  |
                       | 0  0  0  0  0  0  -1 0  1  0  0  0  |
                       | 0  0  0  0  0  0  0  -1 -1 0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  1  1  0  |
                       | 0  0  0  0  0  0  0  0  0  -1 0  1  |
                       | 0  0  0  0  0  0  0  0  0  0  -1 -1 |

                 12
      {0, 1} : QQ   <----- 0 : {0, 2}
                       0

      {0, 2} : 0 <----- 0 : {0, 3}
                    0

      {-1, -1} : 0 <----- 0 : {-1, 0}
                      0

o23 : SpectralSequencePageMap

i24 : E1 = E^1

      +------+------+------+
      |  4   |  6   |  4   |
o24 = |QQ    |QQ    |QQ    |
      |      |      |      |
      |{0, 1}|{1, 1}|{2, 1}|
      +------+------+------+
      |  4   |  6   |  4   |
      |QQ    |QQ    |QQ    |
      |      |      |      |
      |{0, 0}|{1, 0}|{2, 0}|
      +------+------+------+

o24 : SpectralSequencePage

i25 : E1.dd

o25 = {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {-2, 4} : 0 <----- 0 : {-1, 4}
                     0

      {1, -3} : 0 <----- 0 : {2, -3}
                     0

      {1, -2} : 0 <----- 0 : {2, -2}
                     0

      {1, -1} : 0 <----- 0 : {2, -1}
                     0

                 6                        4
      {1, 0} : QQ  <------------------- QQ  : {2, 0}
                      | -1 -1 0  0  |
                      | 1  0  -1 0  |
                      | 0  1  1  0  |
                      | -1 0  0  -1 |
                      | 0  -1 0  1  |
                      | 0  0  -1 -1 |

                 6                      4
      {1, 1} : QQ  <----------------- QQ  : {2, 1}
                      | 1 -1 0 0  |
                      | 0 1  1 0  |
                      | 1 0  1 0  |
                      | 0 -1 0 -1 |
                      | 1 0  0 1  |
                      | 0 0  1 -1 |

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {0, -1} : 0 <----- 0 : {1, -1}
                     0

                 4                              6
      {0, 0} : QQ  <------------------------- QQ  : {1, 0}
                      | 1  1  1  0  0  0  |
                      | -1 0  0  1  1  0  |
                      | 0  -1 0  -1 0  1  |
                      | 0  0  -1 0  -1 -1 |

                 4                            6
      {0, 1} : QQ  <----------------------- QQ  : {1, 1}
                      | 1  1  -1 0  0 0 |
                      | -1 0  0  1  1 0 |
                      | 0  -1 0  -1 0 1 |
                      | 0  0  -1 0  1 1 |

      {0, 2} : 0 <----- 0 : {1, 2}
                    0

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           4
      {-1, 0} : 0 <----- QQ  : {0, 0}
                     0

                           4
      {-1, 1} : 0 <----- QQ  : {0, 1}
                     0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {-1, 3} : 0 <----- 0 : {0, 3}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o25 : SpectralSequencePageMap

i26 : E2 = E^2

      +------+------+------+
      |  1   |      |  1   |
o26 = |QQ    |0     |QQ    |
      |      |      |      |
      |{0, 1}|{1, 1}|{2, 1}|
      +------+------+------+
      |  1   |      |  1   |
      |QQ    |0     |QQ    |
      |      |      |      |
      |{0, 0}|{1, 0}|{2, 0}|
      +------+------+------+

o26 : SpectralSequencePage

i27 : E2.dd

o27 = {-3, 2} : 0 <----- 0 : {-1, 1}
                     0

      {-3, 3} : 0 <----- 0 : {-1, 2}
                     0

      {-3, 4} : 0 <----- 0 : {-1, 3}
                     0

      {-3, 5} : 0 <----- 0 : {-1, 4}
                     0

      {0, -2} : 0 <----- 0 : {2, -3}
                     0

      {0, -1} : 0 <----- 0 : {2, -2}
                     0

                 1
      {0, 0} : QQ  <----- 0 : {2, -1}
                      0

                 1              1
      {0, 1} : QQ  <--------- QQ  : {2, 0}
                      | 1 |

                          1
      {0, 2} : 0 <----- QQ  : {2, 1}
                    0

      {-1, -1} : 0 <----- 0 : {1, -2}
                      0

      {-1, 0} : 0 <----- 0 : {1, -1}
                     0

      {-1, 1} : 0 <----- 0 : {1, 0}
                     0

      {-1, 2} : 0 <----- 0 : {1, 1}
                     0

      {-1, 3} : 0 <----- 0 : {1, 2}
                     0

      {-2, 0} : 0 <----- 0 : {0, -1}
                     0

                           1
      {-2, 1} : 0 <----- QQ  : {0, 0}
                     0

                           1
      {-2, 2} : 0 <----- QQ  : {0, 1}
                     0

      {-2, 3} : 0 <----- 0 : {0, 2}
                     0

      {-2, 4} : 0 <----- 0 : {0, 3}
                     0

      {-3, 1} : 0 <----- 0 : {-1, 0}
                     0

o27 : SpectralSequencePageMap

i28 : E3 = E^3

      +------+------+------+
      |      |      |  1   |
o28 = |0     |0     |QQ    |
      |      |      |      |
      |{0, 1}|{1, 1}|{2, 1}|
      +------+------+------+
      |  1   |      |      |
      |QQ    |0     |0     |
      |      |      |      |
      |{0, 0}|{1, 0}|{2, 0}|
      +------+------+------+

o28 : SpectralSequencePage

i29 : E3.dd

o29 = {-4, 3} : 0 <----- 0 : {-1, 1}
                     0

      {-4, 4} : 0 <----- 0 : {-1, 2}
                     0

      {-4, 5} : 0 <----- 0 : {-1, 3}
                     0

      {-4, 6} : 0 <----- 0 : {-1, 4}
                     0

      {-1, -1} : 0 <----- 0 : {2, -3}
                      0

      {-1, 0} : 0 <----- 0 : {2, -2}
                     0

      {-1, 1} : 0 <----- 0 : {2, -1}
                     0

      {-1, 2} : 0 <----- 0 : {2, 0}
                     0

                           1
      {-1, 3} : 0 <----- QQ  : {2, 1}
                     0

      {-2, 0} : 0 <----- 0 : {1, -2}
                     0

      {-2, 1} : 0 <----- 0 : {1, -1}
                     0

      {-2, 2} : 0 <----- 0 : {1, 0}
                     0

      {-2, 3} : 0 <----- 0 : {1, 1}
                     0

      {-2, 4} : 0 <----- 0 : {1, 2}
                     0

      {-3, 1} : 0 <----- 0 : {0, -1}
                     0

                           1
      {-3, 2} : 0 <----- QQ  : {0, 0}
                     0

      {-3, 3} : 0 <----- 0 : {0, 1}
                     0

      {-3, 4} : 0 <----- 0 : {0, 2}
                     0

      {-3, 5} : 0 <----- 0 : {0, 3}
                     0

      {-4, 2} : 0 <----- 0 : {-1, 0}
                     0

o29 : SpectralSequencePageMap

i30 : 
