-- -*- M2-comint -*- hash: -311144652

i1 : k=QQ;

i2 : R=k[a,b,c];

i3 : S=k[s,t];

i4 : f = map(S,R,{s^2,s*t,t^2});

o4 : RingMap S <--- R

i5 : N = coker vars S;

i6 : M = coker vars R --;

o6 = cokernel | a b c |

                            1
o6 : R-module, quotient of R

i7 : F := complete res N;

i8 : pushFwdF := pushFwd(f,F);

i9 : G := complete res M;

i10 : E := spectralSequence(filteredComplex(G) ** pushFwdF);

i11 : EE := spectralSequence(G ** (filteredComplex pushFwdF));

i12 : e = prune E;

i13 : ee = prune EE;

i14 : e^0

      +------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------+
o14 = |cokernel | 0  0  b2-ac |            |cokernel {1} | 0  0  0  0  0  0  b2-ac 0     0     |                                    |cokernel {2} | 0  0  0  0  0  0  b2-ac 0     0     |                                    |cokernel {3} | 0  0  b2-ac |            |
      |         | -c -b 0     |            |         {1} | -c -b 0  0  0  0  0     0     0     |                                    |         {2} | -c -b 0  0  0  0  0     0     0     |                                    |         {3} | -c -b 0     |            |
      |         | b  a  0     |            |         {1} | b  a  0  0  0  0  0     0     0     |                                    |         {2} | b  a  0  0  0  0  0     0     0     |                                    |         {3} | b  a  0     |            |
      |                                    |         {1} | 0  0  0  0  0  0  0     b2-ac 0     |                                    |         {2} | 0  0  0  0  0  0  0     b2-ac 0     |                                    |                                        |
      |{0, 2}                              |         {1} | 0  0  -c -b 0  0  0     0     0     |                                    |         {2} | 0  0  -c -b 0  0  0     0     0     |                                    |{3, 2}                                  |
      |                                    |         {1} | 0  0  b  a  0  0  0     0     0     |                                    |         {2} | 0  0  b  a  0  0  0     0     0     |                                    |                                        |
      |                                    |         {1} | 0  0  0  0  0  0  0     0     b2-ac |                                    |         {2} | 0  0  0  0  0  0  0     0     b2-ac |                                    |                                        |
      |                                    |         {1} | 0  0  0  0  -c -b 0     0     0     |                                    |         {2} | 0  0  0  0  -c -b 0     0     0     |                                    |                                        |
      |                                    |         {1} | 0  0  0  0  b  a  0     0     0     |                                    |         {2} | 0  0  0  0  b  a  0     0     0     |                                    |                                        |
      |                                    |                                                                                        |                                                                                        |                                        |
      |                                    |{1, 2}                                                                                  |{2, 2}                                                                                  |                                        |
      +------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------+
      |cokernel | 0  0  0  0  b2-ac 0     ||cokernel {1} | 0  0  0  0  0  0  0  0  0  0  0  0  b2-ac 0     0     0     0     0     ||cokernel {2} | 0  0  0  0  0  0  0  0  0  0  0  0  b2-ac 0     0     0     0     0     ||cokernel {3} | 0  0  0  0  b2-ac 0     ||
      |         | 0  0  0  0  0     b2-ac ||         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     b2-ac 0     0     0     0     ||         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     b2-ac 0     0     0     0     ||         {3} | 0  0  0  0  0     b2-ac ||
      |         | -c -b 0  0  0     0     ||         {1} | -c -b 0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | -c -b 0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {3} | -c -b 0  0  0     0     ||
      |         | 0  0  -c -b 0     0     ||         {1} | 0  0  -c -b 0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  -c -b 0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {3} | 0  0  -c -b 0     0     ||
      |         | b  a  0  0  0     0     ||         {1} | b  a  0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | b  a  0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {3} | b  a  0  0  0     0     ||
      |         | 0  0  b  a  0     0     ||         {1} | 0  0  b  a  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  b  a  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {3} | 0  0  b  a  0     0     ||
      |                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     b2-ac 0     0     0     ||         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     b2-ac 0     0     0     ||                                        |
      |{0, 1}                              |         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     b2-ac 0     0     ||         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     b2-ac 0     0     ||{3, 1}                                  |
      |                                    |         {1} | 0  0  0  0  -c -b 0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  0  0  -c -b 0  0  0  0  0  0  0     0     0     0     0     0     ||                                        |
      |                                    |         {1} | 0  0  0  0  0  0  -c -b 0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  0  0  0  0  -c -b 0  0  0  0  0     0     0     0     0     0     ||                                        |
      |                                    |         {1} | 0  0  0  0  b  a  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  0  0  b  a  0  0  0  0  0  0  0     0     0     0     0     0     ||                                        |
      |                                    |         {1} | 0  0  0  0  0  0  b  a  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  0  0  0  0  b  a  0  0  0  0  0     0     0     0     0     0     ||                                        |
      |                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     0     b2-ac 0     ||         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     0     b2-ac 0     ||                                        |
      |                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     b2-ac ||         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     b2-ac ||                                        |
      |                                    |         {1} | 0  0  0  0  0  0  0  0  -c -b 0  0  0     0     0     0     0     0     ||         {2} | 0  0  0  0  0  0  0  0  -c -b 0  0  0     0     0     0     0     0     ||                                        |
      |                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  -c -b 0     0     0     0     0     0     ||         {2} | 0  0  0  0  0  0  0  0  0  0  -c -b 0     0     0     0     0     0     ||                                        |
      |                                    |         {1} | 0  0  0  0  0  0  0  0  b  a  0  0  0     0     0     0     0     0     ||         {2} | 0  0  0  0  0  0  0  0  b  a  0  0  0     0     0     0     0     0     ||                                        |
      |                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  b  a  0     0     0     0     0     0     ||         {2} | 0  0  0  0  0  0  0  0  0  0  b  a  0     0     0     0     0     0     ||                                        |
      |                                    |                                                                                        |                                                                                        |                                        |
      |                                    |{1, 1}                                                                                  |{2, 1}                                                                                  |                                        |
      +------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------+
      |cokernel | 0  0  b2-ac |            |cokernel | 0  0  0  0  0  0  b2-ac 0     0     |                                        |cokernel | 0  0  0  0  0  0  b2-ac 0     0     |                                        |cokernel | 0  0  b2-ac |                |
      |         | -c -b 0     |            |         | -c -b 0  0  0  0  0     0     0     |                                        |         | -c -b 0  0  0  0  0     0     0     |                                        |         | -c -b 0     |                |
      |         | b  a  0     |            |         | b  a  0  0  0  0  0     0     0     |                                        |         | b  a  0  0  0  0  0     0     0     |                                        |         | b  a  0     |                |
      |                                    |         | 0  0  0  0  0  0  0     b2-ac 0     |                                        |         | 0  0  0  0  0  0  0     b2-ac 0     |                                        |                                        |
      |{0, 0}                              |         | 0  0  -c -b 0  0  0     0     0     |                                        |         | 0  0  -c -b 0  0  0     0     0     |                                        |{3, 0}                                  |
      |                                    |         | 0  0  b  a  0  0  0     0     0     |                                        |         | 0  0  b  a  0  0  0     0     0     |                                        |                                        |
      |                                    |         | 0  0  0  0  0  0  0     0     b2-ac |                                        |         | 0  0  0  0  0  0  0     0     b2-ac |                                        |                                        |
      |                                    |         | 0  0  0  0  -c -b 0     0     0     |                                        |         | 0  0  0  0  -c -b 0     0     0     |                                        |                                        |
      |                                    |         | 0  0  0  0  b  a  0     0     0     |                                        |         | 0  0  0  0  b  a  0     0     0     |                                        |                                        |
      |                                    |                                                                                        |                                                                                        |                                        |
      |                                    |{1, 0}                                                                                  |{2, 0}                                                                                  |                                        |
      +------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------+

o14 : SpectralSequencePage

i15 : e^1

      +------------------+------------------------------+------------------------------+------------------+
o15 = |cokernel | c b a ||cokernel | c b a 0 0 0 0 0 0 ||cokernel | c b a 0 0 0 0 0 0 ||cokernel | c b a ||
      |                  |         | 0 0 0 c b a 0 0 0 ||         | 0 0 0 c b a 0 0 0 ||                  |
      |{0, 0}            |         | 0 0 0 0 0 0 c b a ||         | 0 0 0 0 0 0 c b a ||{3, 0}            |
      |                  |                              |                              |                  |
      |                  |{1, 0}                        |{2, 0}                        |                  |
      +------------------+------------------------------+------------------------------+------------------+

o15 : SpectralSequencePage

i16 : e^2

      +------------------+------------------------------+------------------------------+------------------+
o16 = |cokernel | c b a ||cokernel | c b a 0 0 0 0 0 0 ||cokernel | c b a 0 0 0 0 0 0 ||cokernel | c b a ||
      |                  |         | 0 0 0 c b a 0 0 0 ||         | 0 0 0 c b a 0 0 0 ||                  |
      |{0, 0}            |         | 0 0 0 0 0 0 c b a ||         | 0 0 0 0 0 0 c b a ||{3, 0}            |
      |                  |                              |                              |                  |
      |                  |{1, 0}                        |{2, 0}                        |                  |
      +------------------+------------------------------+------------------------------+------------------+

o16 : SpectralSequencePage

i17 : e^infinity

      +------------------+------------------------------+------------------------------+------------------+
o17 = |cokernel | c b a ||cokernel | c b a 0 0 0 0 0 0 ||cokernel | c b a 0 0 0 0 0 0 ||cokernel | c b a ||
      |                  |         | 0 0 0 c b a 0 0 0 ||         | 0 0 0 c b a 0 0 0 ||                  |
      |{0, 0}            |         | 0 0 0 0 0 0 c b a ||         | 0 0 0 0 0 0 c b a ||{3, 0}            |
      |                  |                              |                              |                  |
      |                  |{1, 0}                        |{2, 0}                        |                  |
      +------------------+------------------------------+------------------------------+------------------+

o17 : Page

i18 : ee^0

      +----------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------+
o18 = |cokernel {3} | 0  0  b2-ac |                        |cokernel {3} | 0  0  0  0  b2-ac 0     |                                                |cokernel {3} | 0  0  b2-ac |                        |
      |         {3} | -c -b 0     |                        |         {3} | 0  0  0  0  0     b2-ac |                                                |         {3} | -c -b 0     |                        |
      |         {3} | b  a  0     |                        |         {3} | -c -b 0  0  0     0     |                                                |         {3} | b  a  0     |                        |
      |                                                    |         {3} | 0  0  -c -b 0     0     |                                                |                                                    |
      |{0, 3}                                              |         {3} | b  a  0  0  0     0     |                                                |{2, 3}                                              |
      |                                                    |         {3} | 0  0  b  a  0     0     |                                                |                                                    |
      |                                                    |                                                                                        |                                                    |
      |                                                    |{1, 3}                                                                                  |                                                    |
      +----------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------+
      |cokernel {2} | 0  0  0  0  0  0  b2-ac 0     0     ||cokernel {2} | 0  0  0  0  0  0  0  0  0  0  0  0  b2-ac 0     0     0     0     0     ||cokernel {2} | 0  0  0  0  0  0  b2-ac 0     0     ||
      |         {2} | -c -b 0  0  0  0  0     0     0     ||         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     b2-ac 0     0     0     0     ||         {2} | -c -b 0  0  0  0  0     0     0     ||
      |         {2} | b  a  0  0  0  0  0     0     0     ||         {2} | -c -b 0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | b  a  0  0  0  0  0     0     0     ||
      |         {2} | 0  0  0  0  0  0  0     b2-ac 0     ||         {2} | 0  0  -c -b 0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  0  0  0  0  0     b2-ac 0     ||
      |         {2} | 0  0  -c -b 0  0  0     0     0     ||         {2} | b  a  0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  -c -b 0  0  0     0     0     ||
      |         {2} | 0  0  b  a  0  0  0     0     0     ||         {2} | 0  0  b  a  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  b  a  0  0  0     0     0     ||
      |         {2} | 0  0  0  0  0  0  0     0     b2-ac ||         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     b2-ac 0     0     0     ||         {2} | 0  0  0  0  0  0  0     0     b2-ac ||
      |         {2} | 0  0  0  0  -c -b 0     0     0     ||         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     b2-ac 0     0     ||         {2} | 0  0  0  0  -c -b 0     0     0     ||
      |         {2} | 0  0  0  0  b  a  0     0     0     ||         {2} | 0  0  0  0  -c -b 0  0  0  0  0  0  0     0     0     0     0     0     ||         {2} | 0  0  0  0  b  a  0     0     0     ||
      |                                                    |         {2} | 0  0  0  0  0  0  -c -b 0  0  0  0  0     0     0     0     0     0     ||                                                    |
      |{0, 2}                                              |         {2} | 0  0  0  0  b  a  0  0  0  0  0  0  0     0     0     0     0     0     ||{2, 2}                                              |
      |                                                    |         {2} | 0  0  0  0  0  0  b  a  0  0  0  0  0     0     0     0     0     0     ||                                                    |
      |                                                    |         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     0     b2-ac 0     ||                                                    |
      |                                                    |         {2} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     b2-ac ||                                                    |
      |                                                    |         {2} | 0  0  0  0  0  0  0  0  -c -b 0  0  0     0     0     0     0     0     ||                                                    |
      |                                                    |         {2} | 0  0  0  0  0  0  0  0  0  0  -c -b 0     0     0     0     0     0     ||                                                    |
      |                                                    |         {2} | 0  0  0  0  0  0  0  0  b  a  0  0  0     0     0     0     0     0     ||                                                    |
      |                                                    |         {2} | 0  0  0  0  0  0  0  0  0  0  b  a  0     0     0     0     0     0     ||                                                    |
      |                                                    |                                                                                        |                                                    |
      |                                                    |{1, 2}                                                                                  |                                                    |
      +----------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------+
      |cokernel {1} | 0  0  0  0  0  0  b2-ac 0     0     ||cokernel {1} | 0  0  0  0  0  0  0  0  0  0  0  0  b2-ac 0     0     0     0     0     ||cokernel | 0  0  0  0  0  0  b2-ac 0     0     |    |
      |         {1} | -c -b 0  0  0  0  0     0     0     ||         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     b2-ac 0     0     0     0     ||         | -c -b 0  0  0  0  0     0     0     |    |
      |         {1} | b  a  0  0  0  0  0     0     0     ||         {1} | -c -b 0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         | b  a  0  0  0  0  0     0     0     |    |
      |         {1} | 0  0  0  0  0  0  0     b2-ac 0     ||         {1} | 0  0  -c -b 0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         | 0  0  0  0  0  0  0     b2-ac 0     |    |
      |         {1} | 0  0  -c -b 0  0  0     0     0     ||         {1} | b  a  0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         | 0  0  -c -b 0  0  0     0     0     |    |
      |         {1} | 0  0  b  a  0  0  0     0     0     ||         {1} | 0  0  b  a  0  0  0  0  0  0  0  0  0     0     0     0     0     0     ||         | 0  0  b  a  0  0  0     0     0     |    |
      |         {1} | 0  0  0  0  0  0  0     0     b2-ac ||         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     b2-ac 0     0     0     ||         | 0  0  0  0  0  0  0     0     b2-ac |    |
      |         {1} | 0  0  0  0  -c -b 0     0     0     ||         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     b2-ac 0     0     ||         | 0  0  0  0  -c -b 0     0     0     |    |
      |         {1} | 0  0  0  0  b  a  0     0     0     ||         {1} | 0  0  0  0  -c -b 0  0  0  0  0  0  0     0     0     0     0     0     ||         | 0  0  0  0  b  a  0     0     0     |    |
      |                                                    |         {1} | 0  0  0  0  0  0  -c -b 0  0  0  0  0     0     0     0     0     0     ||                                                    |
      |{0, 1}                                              |         {1} | 0  0  0  0  b  a  0  0  0  0  0  0  0     0     0     0     0     0     ||{2, 1}                                              |
      |                                                    |         {1} | 0  0  0  0  0  0  b  a  0  0  0  0  0     0     0     0     0     0     ||                                                    |
      |                                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     0     b2-ac 0     ||                                                    |
      |                                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  0  0  0     0     0     0     0     b2-ac ||                                                    |
      |                                                    |         {1} | 0  0  0  0  0  0  0  0  -c -b 0  0  0     0     0     0     0     0     ||                                                    |
      |                                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  -c -b 0     0     0     0     0     0     ||                                                    |
      |                                                    |         {1} | 0  0  0  0  0  0  0  0  b  a  0  0  0     0     0     0     0     0     ||                                                    |
      |                                                    |         {1} | 0  0  0  0  0  0  0  0  0  0  b  a  0     0     0     0     0     0     ||                                                    |
      |                                                    |                                                                                        |                                                    |
      |                                                    |{1, 1}                                                                                  |                                                    |
      +----------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------+
      |cokernel | 0  0  b2-ac |                            |cokernel | 0  0  0  0  b2-ac 0     |                                                    |cokernel | 0  0  b2-ac |                            |
      |         | -c -b 0     |                            |         | 0  0  0  0  0     b2-ac |                                                    |         | -c -b 0     |                            |
      |         | b  a  0     |                            |         | -c -b 0  0  0     0     |                                                    |         | b  a  0     |                            |
      |                                                    |         | 0  0  -c -b 0     0     |                                                    |                                                    |
      |{0, 0}                                              |         | b  a  0  0  0     0     |                                                    |{2, 0}                                              |
      |                                                    |         | 0  0  b  a  0     0     |                                                    |                                                    |
      |                                                    |                                                                                        |                                                    |
      |                                                    |{1, 0}                                                                                  |                                                    |
      +----------------------------------------------------+----------------------------------------------------------------------------------------+----------------------------------------------------+

o18 : SpectralSequencePage

i19 : 
