-- -*- M2-comint -*- hash: 1152470548

i1 : A = QQ[a,b,c]

o1 = A

o1 : PolynomialRing

i2 : D = simplicialComplex {a*b*c}

o2 = simplicialComplex | abc |

o2 : SimplicialComplex

i3 : F2D = D

o3 = simplicialComplex | abc |

o3 : SimplicialComplex

i4 : F1D = simplicialComplex {a*b,a*c,b*c}

o4 = simplicialComplex | bc ac ab |

o4 : SimplicialComplex

i5 : F0D = simplicialComplex {a,b,c}

o5 = simplicialComplex | c b a |

o5 : SimplicialComplex

i6 : K = filteredComplex({F2D,F1D,F0D}, ReducedHomology => false)

o6 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                               
          -1          0           1           2

     0 : image 0 <-- image | 1 0 0 | <-- image 0 <-- image 0
                           | 0 1 0 |                  
         -1                | 0 0 1 |     1           2
                      
                     0

     1 : image 0 <-- image | 1 0 0 | <-- image | 1 0 0 | <-- image 0
                           | 0 1 0 |           | 0 1 0 |      
         -1                | 0 0 1 |           | 0 0 1 |     2
                                          
                     0                   1

                       3       3       1
     2 : image 0 <-- QQ  <-- QQ  <-- QQ
                                      
         -1          0       1       2

o6 : FilteredComplex

i7 : C = K_infinity

                   3       3       1
o7 = image 0 <-- QQ  <-- QQ  <-- QQ
                                  
     -1          0       1       2

o7 : ChainComplex

i8 : E = prune spectralSequence K

o8 = E

o8 : SpectralSequence

i9 : E^0

     +------+------+------+
     |  3   |  3   |  1   |
o9 = |QQ    |QQ    |QQ    |
     |      |      |      |
     |{0, 0}|{1, 0}|{2, 0}|
     +------+------+------+

o9 : SpectralSequencePage

i10 : E^0 .dd

o10 = {-1, 0} : 0 <----- 0 : {-1, 1}
                     0

      {-1, 1} : 0 <----- 0 : {-1, 2}
                     0

      {-1, 2} : 0 <----- 0 : {-1, 3}
                     0

      {2, -4} : 0 <----- 0 : {2, -3}
                     0

      {2, -3} : 0 <----- 0 : {2, -2}
                     0

      {2, -2} : 0 <----- 0 : {2, -1}
                     0

                           1
      {2, -1} : 0 <----- QQ  : {2, 0}
                     0

      {1, -3} : 0 <----- 0 : {1, -2}
                     0

      {1, -2} : 0 <----- 0 : {1, -1}
                     0

                           3
      {1, -1} : 0 <----- QQ  : {1, 0}
                     0

                 3
      {1, 0} : QQ  <----- 0 : {1, 1}
                      0

      {0, -2} : 0 <----- 0 : {0, -1}
                     0

                           3
      {0, -1} : 0 <----- QQ  : {0, 0}
                     0

                 3
      {0, 0} : QQ  <----- 0 : {0, 1}
                      0

      {0, 1} : 0 <----- 0 : {0, 2}
                    0

      {-1, -1} : 0 <----- 0 : {-1, 0}
                      0

o10 : SpectralSequencePageMap

i11 : E^1

      +------+------+------+
      |  3   |  3   |  1   |
o11 = |QQ    |QQ    |QQ    |
      |      |      |      |
      |{0, 0}|{1, 0}|{2, 0}|
      +------+------+------+

o11 : SpectralSequencePage

i12 : E^1 .dd

o12 = {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {1, -3} : 0 <----- 0 : {2, -3}
                     0

      {1, -2} : 0 <----- 0 : {2, -2}
                     0

      {1, -1} : 0 <----- 0 : {2, -1}
                     0

                 3               1
      {1, 0} : QQ  <---------- QQ  : {2, 0}
                      | -1 |
                      | 1  |
                      | -1 |

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {0, -1} : 0 <----- 0 : {1, -1}
                     0

                 3                     3
      {0, 0} : QQ  <---------------- QQ  : {1, 0}
                      | 1  1  0  |
                      | -1 0  1  |
                      | 0  -1 -1 |

      {0, 1} : 0 <----- 0 : {1, 1}
                    0

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           3
      {-1, 0} : 0 <----- QQ  : {0, 0}
                     0

      {-1, 1} : 0 <----- 0 : {0, 1}
                     0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o12 : SpectralSequencePageMap

i13 : E^2

      +------+
      |  1   |
o13 = |QQ    |
      |      |
      |{0, 0}|
      +------+

o13 : SpectralSequencePage

i14 : E^2 .dd

o14 = {-3, 2} : 0 <----- 0 : {-1, 1}
                     0

      {-3, 3} : 0 <----- 0 : {-1, 2}
                     0

      {-3, 4} : 0 <----- 0 : {-1, 3}
                     0

      {0, -2} : 0 <----- 0 : {2, -3}
                     0

      {0, -1} : 0 <----- 0 : {2, -2}
                     0

                 1
      {0, 0} : QQ  <----- 0 : {2, -1}
                      0

      {0, 1} : 0 <----- 0 : {2, 0}
                    0

      {-1, -1} : 0 <----- 0 : {1, -2}
                      0

      {-1, 0} : 0 <----- 0 : {1, -1}
                     0

      {-1, 1} : 0 <----- 0 : {1, 0}
                     0

      {-1, 2} : 0 <----- 0 : {1, 1}
                     0

      {-2, 0} : 0 <----- 0 : {0, -1}
                     0

                           1
      {-2, 1} : 0 <----- QQ  : {0, 0}
                     0

      {-2, 2} : 0 <----- 0 : {0, 1}
                     0

      {-2, 3} : 0 <----- 0 : {0, 2}
                     0

      {-3, 1} : 0 <----- 0 : {-1, 0}
                     0

o14 : SpectralSequencePageMap

i15 : E^infinity

      +------+
      |  1   |
o15 = |QQ    |
      |      |
      |{0, 0}|
      +------+

o15 : Page

i16 : prune HH K_infinity

o16 = -1 : 0  

             1
       0 : QQ

       1 : 0  

       2 : 0  

o16 : GradedModule

i17 : 
