-- -*- M2-comint -*- hash: -730838427

i1 : A = QQ[a,b,c,d];

i2 : D = simplicialComplex {a*d*c, a*b, a*c, b*c};

i3 : F2D = D

o3 = simplicialComplex | bc ab acd |

o3 : SimplicialComplex

i4 : F1D = simplicialComplex {a*c, d}

o4 = simplicialComplex | d ac |

o4 : SimplicialComplex

i5 : F0D = simplicialComplex {a,d}

o5 = simplicialComplex | d a |

o5 : SimplicialComplex

i6 : K= filteredComplex({F2D, F1D, F0D},ReducedHomology => false)

o6 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                               
          -1          0           1           2

     0 : image 0 <-- image | 1 0 | <-- image 0 <-- image 0
                           | 0 0 |                  
         -1                | 0 0 |     1           2
                           | 0 1 |
                      
                     0

     1 : image 0 <-- image | 1 0 0 | <-- image | 0 | <-- image 0
                           | 0 0 0 |           | 1 |      
         -1                | 0 1 0 |           | 0 |     2
                           | 0 0 1 |           | 0 |
                                               | 0 |
                     0                    
                                         1

                       4       5       1
     2 : image 0 <-- QQ  <-- QQ  <-- QQ
                                      
         -1          0       1       2

o6 : FilteredComplex

i7 : E = prune spectralSequence(K)

o7 = E

o7 : SpectralSequence

i8 : E^0

     +-------+-------+-------+
     |  2    |  1    |  1    |
o8 = |QQ     |QQ     |QQ     |
     |       |       |       |
     |{0, 0} |{1, 0} |{2, 0} |
     +-------+-------+-------+
     |       |  1    |  4    |
     |0      |QQ     |QQ     |
     |       |       |       |
     |{0, -1}|{1, -1}|{2, -1}|
     +-------+-------+-------+
     |       |       |  1    |
     |0      |0      |QQ     |
     |       |       |       |
     |{0, -2}|{1, -2}|{2, -2}|
     +-------+-------+-------+

o8 : SpectralSequencePage

i9 : E^1

     +-------+-------+-------+
     |  2    |       |       |
o9 = |QQ     |0      |0      |
     |       |       |       |
     |{0, 0} |{1, 0} |{2, 0} |
     +-------+-------+-------+
     |       |       |  2    |
     |0      |0      |QQ     |
     |       |       |       |
     |{0, -1}|{1, -1}|{2, -1}|
     +-------+-------+-------+

o9 : SpectralSequencePage

i10 : E^2

      +-------+-------+-------+
      |  2    |       |       |
o10 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  2    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o10 : SpectralSequencePage

i11 : E^3

      +-------+-------+-------+
      |  1    |       |       |
o11 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o11 : SpectralSequencePage

i12 : E^infinity

      +-------+-------+-------+
      |  1    |       |       |
o12 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o12 : Page

i13 : C = K_infinity

                    4       5       1
o13 = image 0 <-- QQ  <-- QQ  <-- QQ
                                   
      -1          0       1       2

o13 : ChainComplex

i14 : prune HH C

o14 = -1 : 0  

             1
       0 : QQ

             1
       1 : QQ

       2 : 0  

o14 : GradedModule

i15 : E^2 .dd

o15 = {-3, 2} : 0 <----- 0 : {-1, 1}
                     0

      {-3, 3} : 0 <----- 0 : {-1, 2}
                     0

      {-3, 4} : 0 <----- 0 : {-1, 3}
                     0

      {0, -2} : 0 <----- 0 : {2, -3}
                     0

      {0, -1} : 0 <----- 0 : {2, -2}
                     0

                 2                 2
      {0, 0} : QQ  <------------ QQ  : {2, -1}
                      | 0 1  |
                      | 0 -1 |

      {0, 1} : 0 <----- 0 : {2, 0}
                    0

      {-1, -1} : 0 <----- 0 : {1, -2}
                      0

      {-1, 0} : 0 <----- 0 : {1, -1}
                     0

      {-1, 1} : 0 <----- 0 : {1, 0}
                     0

      {-1, 2} : 0 <----- 0 : {1, 1}
                     0

      {-2, 0} : 0 <----- 0 : {0, -1}
                     0

                           2
      {-2, 1} : 0 <----- QQ  : {0, 0}
                     0

      {-2, 2} : 0 <----- 0 : {0, 1}
                     0

      {-2, 3} : 0 <----- 0 : {0, 2}
                     0

      {-3, 1} : 0 <----- 0 : {-1, 0}
                     0

o15 : SpectralSequencePageMap

i16 : rank ker E^2 .dd_{2,-1}

o16 = 1

i17 : rank image E^2 .dd_{2,-1}

o17 = 1

i18 : 
