-- -*- M2-comint -*- hash: -154040975

i1 : A = QQ[a,b,c];

i2 : D = simplicialComplex({a*b*c})

o2 = simplicialComplex | abc |

o2 : SimplicialComplex

i3 : F3D = D;

i4 : F2D = simplicialComplex({a*b,a*c,b*c})

o4 = simplicialComplex | bc ac ab |

o4 : SimplicialComplex

i5 : F1D = simplicialComplex({a*b,c})

o5 = simplicialComplex | c ab |

o5 : SimplicialComplex

i6 : F0D = simplicialComplex({a,b})

o6 = simplicialComplex | b a |

o6 : SimplicialComplex

i7 : K = filteredComplex({F3D,F2D,F1D,F0D}, ReducedHomology => false)

o7 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                               
          -1          0           1           2

     0 : image 0 <-- image | 1 0 | <-- image 0 <-- image 0
                           | 0 1 |                  
         -1                | 0 0 |     1           2
                      
                     0

     1 : image 0 <-- image | 1 0 0 | <-- image | 1 | <-- image 0
                           | 0 1 0 |           | 0 |      
         -1                | 0 0 1 |           | 0 |     2
                                          
                     0                   1

     2 : image 0 <-- image | 1 0 0 | <-- image | 1 0 0 | <-- image 0
                           | 0 1 0 |           | 0 1 0 |      
         -1                | 0 0 1 |           | 0 0 1 |     2
                                          
                     0                   1

                       3       3       1
     3 : image 0 <-- QQ  <-- QQ  <-- QQ
                                      
         -1          0       1       2

o7 : FilteredComplex

i8 : E = prune spectralSequence K

o8 = E

o8 : SpectralSequence

i9 : E^0

     +-------+-------+-------+-------+
     |  2    |  1    |       |       |
o9 = |QQ     |QQ     |0      |0      |
     |       |       |       |       |
     |{0, 0} |{1, 0} |{2, 0} |{3, 0} |
     +-------+-------+-------+-------+
     |       |  1    |  2    |  1    |
     |0      |QQ     |QQ     |QQ     |
     |       |       |       |       |
     |{0, -1}|{1, -1}|{2, -1}|{3, -1}|
     +-------+-------+-------+-------+

o9 : SpectralSequencePage

i10 : E^0 .dd

o10 = {3, -4} : 0 <----- 0 : {3, -3}
                     0

      {-1, 0} : 0 <----- 0 : {-1, 1}
                     0

      {3, -3} : 0 <----- 0 : {3, -2}
                     0

      {-1, 1} : 0 <----- 0 : {-1, 2}
                     0

                           1
      {3, -2} : 0 <----- QQ  : {3, -1}
                     0

      {-1, 2} : 0 <----- 0 : {-1, 3}
                     0

      {2, -4} : 0 <----- 0 : {2, -3}
                     0

      {2, -3} : 0 <----- 0 : {2, -2}
                     0

                           2
      {2, -2} : 0 <----- QQ  : {2, -1}
                     0

                  2
      {2, -1} : QQ  <----- 0 : {2, 0}
                       0

      {1, -3} : 0 <----- 0 : {1, -2}
                     0

                           1
      {1, -2} : 0 <----- QQ  : {1, -1}
                     0

                  1          1
      {1, -1} : QQ  <----- QQ  : {1, 0}
                       0

                 1
      {1, 0} : QQ  <----- 0 : {1, 1}
                      0

      {0, -2} : 0 <----- 0 : {0, -1}
                     0

                           2
      {0, -1} : 0 <----- QQ  : {0, 0}
                     0

                 2
      {0, 0} : QQ  <----- 0 : {0, 1}
                      0

      {0, 1} : 0 <----- 0 : {0, 2}
                    0

      {3, -5} : 0 <----- 0 : {3, -4}
                     0

      {-1, -1} : 0 <----- 0 : {-1, 0}
                      0

o10 : SpectralSequencePageMap

i11 : E^0

      +-------+-------+-------+-------+
      |  2    |  1    |       |       |
o11 = |QQ     |QQ     |0      |0      |
      |       |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |{3, 0} |
      +-------+-------+-------+-------+
      |       |  1    |  2    |  1    |
      |0      |QQ     |QQ     |QQ     |
      |       |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|{3, -1}|
      +-------+-------+-------+-------+

o11 : SpectralSequencePage

i12 : E^1

      +-------+-------+-------+-------+
      |  2    |  1    |       |       |
o12 = |QQ     |QQ     |0      |0      |
      |       |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |{3, 0} |
      +-------+-------+-------+-------+
      |       |  1    |  2    |  1    |
      |0      |QQ     |QQ     |QQ     |
      |       |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|{3, -1}|
      +-------+-------+-------+-------+

o12 : SpectralSequencePage

i13 : E^0 .dd_{1,0}

o13 = 0

               1        1
o13 : Matrix QQ  <--- QQ

i14 : E^1 .dd

o14 = {2, -3} : 0 <----- 0 : {3, -3}
                     0

      {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {2, -2} : 0 <----- 0 : {3, -2}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

                  2               1
      {2, -1} : QQ  <---------- QQ  : {3, -1}
                       | 1  |
                       | -1 |

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {1, -3} : 0 <----- 0 : {2, -3}
                     0

      {1, -2} : 0 <----- 0 : {2, -2}
                     0

                  1                  2
      {1, -1} : QQ  <------------- QQ  : {2, -1}
                       | -1 -1 |

                 1
      {1, 0} : QQ  <----- 0 : {2, 0}
                      0

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

                           1
      {0, -1} : 0 <----- QQ  : {1, -1}
                     0

                 2               1
      {0, 0} : QQ  <---------- QQ  : {1, 0}
                      | 1  |
                      | -1 |

      {0, 1} : 0 <----- 0 : {1, 1}
                    0

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           2
      {-1, 0} : 0 <----- QQ  : {0, 0}
                     0

      {-1, 1} : 0 <----- 0 : {0, 1}
                     0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {2, -4} : 0 <----- 0 : {3, -4}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o14 : SpectralSequencePageMap

i15 : E^1

      +-------+-------+-------+-------+
      |  2    |  1    |       |       |
o15 = |QQ     |QQ     |0      |0      |
      |       |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |{3, 0} |
      +-------+-------+-------+-------+
      |       |  1    |  2    |  1    |
      |0      |QQ     |QQ     |QQ     |
      |       |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|{3, -1}|
      +-------+-------+-------+-------+

o15 : SpectralSequencePage

i16 : E^0

      +-------+-------+-------+-------+
      |  2    |  1    |       |       |
o16 = |QQ     |QQ     |0      |0      |
      |       |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |{3, 0} |
      +-------+-------+-------+-------+
      |       |  1    |  2    |  1    |
      |0      |QQ     |QQ     |QQ     |
      |       |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|{3, -1}|
      +-------+-------+-------+-------+

o16 : SpectralSequencePage

i17 : E^2

      +------+
      |  1   |
o17 = |QQ    |
      |      |
      |{0, 0}|
      +------+

o17 : SpectralSequencePage

i18 : prune HH K_infinity

o18 = -1 : 0  

             1
       0 : QQ

       1 : 0  

       2 : 0  

o18 : GradedModule

i19 : E^infinity

      +------+
      |  1   |
o19 = |QQ    |
      |      |
      |{0, 0}|
      +------+

o19 : Page

i20 : 
