-- -*- M2-comint -*- hash: 227346559

i1 : A = QQ[x,y,z,w];

i2 : F2D = simplicialComplex {x*y*z, w*z};

i3 : F1D = simplicialComplex {x*y, w};

i4 : F0D = simplicialComplex {x,w};

i5 : K = filteredComplex{F2D, F1D, F0D}

o5 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                               
          -1          0           1           2

     0 : image | 1 | <-- image | 1 0 | <-- image 0 <-- image 0
                               | 0 0 |                  
         -1                    | 0 0 |     1           2
                               | 0 1 |
                          
                         0

     1 : image | 1 | <-- image | 1 0 0 | <-- image | 1 | <-- image 0
                               | 0 1 0 |           | 0 |      
         -1                    | 0 0 0 |           | 0 |     2
                               | 0 0 1 |           | 0 |
                                              
                         0                   1

           1       4       4       1
     2 : QQ  <-- QQ  <-- QQ  <-- QQ
                                  
         -1      0       1       2

o5 : FilteredComplex

i6 : E = prune spectralSequence K;

i7 : E^0

     +-------+-------+-------+
     |  2    |  1    |  1    |
o7 = |QQ     |QQ     |QQ     |
     |       |       |       |
     |{0, 0} |{1, 0} |{2, 0} |
     +-------+-------+-------+
     |  1    |  1    |  3    |
     |QQ     |QQ     |QQ     |
     |       |       |       |
     |{0, -1}|{1, -1}|{2, -1}|
     +-------+-------+-------+
     |       |       |  1    |
     |0      |0      |QQ     |
     |       |       |       |
     |{0, -2}|{1, -2}|{2, -2}|
     +-------+-------+-------+

o7 : SpectralSequencePage

i8 : E^0 .dd

o8 = {-1, 0} : 0 <----- 0 : {-1, 1}
                    0

     {-1, 1} : 0 <----- 0 : {-1, 2}
                    0

     {-1, 2} : 0 <----- 0 : {-1, 3}
                    0

     {2, -4} : 0 <----- 0 : {2, -3}
                    0

                          1
     {2, -3} : 0 <----- QQ  : {2, -2}
                    0

                 1                    3
     {2, -2} : QQ  <--------------- QQ  : {2, -1}
                      | -1 -1 1 |

                 3               1
     {2, -1} : QQ  <---------- QQ  : {2, 0}
                      | 1  |
                      | -1 |
                      | 0  |

     {1, -3} : 0 <----- 0 : {1, -2}
                    0

                          1
     {1, -2} : 0 <----- QQ  : {1, -1}
                    0

                 1               1
     {1, -1} : QQ  <---------- QQ  : {1, 0}
                      | -1 |

                1
     {1, 0} : QQ  <----- 0 : {1, 1}
                     0

                          1
     {0, -2} : 0 <----- QQ  : {0, -1}
                    0

                 1                  2
     {0, -1} : QQ  <------------- QQ  : {0, 0}
                      | -1 -1 |

                2
     {0, 0} : QQ  <----- 0 : {0, 1}
                     0

     {0, 1} : 0 <----- 0 : {0, 2}
                   0

     {-1, -1} : 0 <----- 0 : {-1, 0}
                     0

o8 : SpectralSequencePageMap

i9 : E^1

     +-------+-------+-------+
     |  1    |       |       |
o9 = |QQ     |0      |0      |
     |       |       |       |
     |{0, 0} |{1, 0} |{2, 0} |
     +-------+-------+-------+
     |       |       |  1    |
     |0      |0      |QQ     |
     |       |       |       |
     |{0, -1}|{1, -1}|{2, -1}|
     +-------+-------+-------+

o9 : SpectralSequencePage

i10 : E^1 .dd

o10 = {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {1, -3} : 0 <----- 0 : {2, -3}
                     0

      {1, -2} : 0 <----- 0 : {2, -2}
                     0

                           1
      {1, -1} : 0 <----- QQ  : {2, -1}
                     0

      {1, 0} : 0 <----- 0 : {2, 0}
                    0

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {0, -1} : 0 <----- 0 : {1, -1}
                     0

                 1
      {0, 0} : QQ  <----- 0 : {1, 0}
                      0

      {0, 1} : 0 <----- 0 : {1, 1}
                    0

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           1
      {-1, 0} : 0 <----- QQ  : {0, 0}
                     0

      {-1, 1} : 0 <----- 0 : {0, 1}
                     0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o10 : SpectralSequencePageMap

i11 : E^2

      +-------+-------+-------+
      |  1    |       |       |
o11 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o11 : SpectralSequencePage

i12 : E^2 .dd

o12 = {-3, 2} : 0 <----- 0 : {-1, 1}
                     0

      {-3, 3} : 0 <----- 0 : {-1, 2}
                     0

      {-3, 4} : 0 <----- 0 : {-1, 3}
                     0

      {0, -2} : 0 <----- 0 : {2, -3}
                     0

      {0, -1} : 0 <----- 0 : {2, -2}
                     0

                 1               1
      {0, 0} : QQ  <---------- QQ  : {2, -1}
                      | -1 |

      {0, 1} : 0 <----- 0 : {2, 0}
                    0

      {-1, -1} : 0 <----- 0 : {1, -2}
                      0

      {-1, 0} : 0 <----- 0 : {1, -1}
                     0

      {-1, 1} : 0 <----- 0 : {1, 0}
                     0

      {-1, 2} : 0 <----- 0 : {1, 1}
                     0

      {-2, 0} : 0 <----- 0 : {0, -1}
                     0

                           1
      {-2, 1} : 0 <----- QQ  : {0, 0}
                     0

      {-2, 2} : 0 <----- 0 : {0, 1}
                     0

      {-2, 3} : 0 <----- 0 : {0, 2}
                     0

      {-3, 1} : 0 <----- 0 : {-1, 0}
                     0

o12 : SpectralSequencePageMap

i13 : E^infinity

o13 = ++
      ++

o13 : Page

i14 : k = filteredComplex({F2D, F1D, F0D}, ReducedHomology => false)

o14 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                                
           -1          0           1           2

      0 : image 0 <-- image | 1 0 | <-- image 0 <-- image 0
                            | 0 0 |                  
          -1                | 0 0 |     1           2
                            | 0 1 |
                       
                      0

      1 : image 0 <-- image | 1 0 0 | <-- image | 1 | <-- image 0
                            | 0 1 0 |           | 0 |      
          -1                | 0 0 0 |           | 0 |     2
                            | 0 0 1 |           | 0 |
                                           
                      0                   1

                        4       4       1
      2 : image 0 <-- QQ  <-- QQ  <-- QQ
                                       
          -1          0       1       2

o14 : FilteredComplex

i15 : e = prune spectralSequence k;

i16 : e^0

      +-------+-------+-------+
      |  2    |  1    |  1    |
o16 = |QQ     |QQ     |QQ     |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |  1    |  3    |
      |0      |QQ     |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -2}|{1, -2}|{2, -2}|
      +-------+-------+-------+

o16 : SpectralSequencePage

i17 : e^0 .dd

o17 = {-1, 0} : 0 <----- 0 : {-1, 1}
                     0

      {-1, 1} : 0 <----- 0 : {-1, 2}
                     0

      {-1, 2} : 0 <----- 0 : {-1, 3}
                     0

      {2, -4} : 0 <----- 0 : {2, -3}
                     0

                           1
      {2, -3} : 0 <----- QQ  : {2, -2}
                     0

                  1                    3
      {2, -2} : QQ  <--------------- QQ  : {2, -1}
                       | -1 -1 1 |

                  3               1
      {2, -1} : QQ  <---------- QQ  : {2, 0}
                       | 1  |
                       | -1 |
                       | 0  |

      {1, -3} : 0 <----- 0 : {1, -2}
                     0

                           1
      {1, -2} : 0 <----- QQ  : {1, -1}
                     0

                  1               1
      {1, -1} : QQ  <---------- QQ  : {1, 0}
                       | -1 |

                 1
      {1, 0} : QQ  <----- 0 : {1, 1}
                      0

      {0, -2} : 0 <----- 0 : {0, -1}
                     0

                           2
      {0, -1} : 0 <----- QQ  : {0, 0}
                     0

                 2
      {0, 0} : QQ  <----- 0 : {0, 1}
                      0

      {0, 1} : 0 <----- 0 : {0, 2}
                    0

      {-1, -1} : 0 <----- 0 : {-1, 0}
                      0

o17 : SpectralSequencePageMap

i18 : e^1 .dd

o18 = {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {1, -3} : 0 <----- 0 : {2, -3}
                     0

      {1, -2} : 0 <----- 0 : {2, -2}
                     0

                           1
      {1, -1} : 0 <----- QQ  : {2, -1}
                     0

      {1, 0} : 0 <----- 0 : {2, 0}
                    0

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {0, -1} : 0 <----- 0 : {1, -1}
                     0

                 2
      {0, 0} : QQ  <----- 0 : {1, 0}
                      0

      {0, 1} : 0 <----- 0 : {1, 1}
                    0

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           2
      {-1, 0} : 0 <----- QQ  : {0, 0}
                     0

      {-1, 1} : 0 <----- 0 : {0, 1}
                     0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o18 : SpectralSequencePageMap

i19 : e^2

      +-------+-------+-------+
      |  2    |       |       |
o19 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o19 : SpectralSequencePage

i20 : e^2 .dd

o20 = {-3, 2} : 0 <----- 0 : {-1, 1}
                     0

      {-3, 3} : 0 <----- 0 : {-1, 2}
                     0

      {-3, 4} : 0 <----- 0 : {-1, 3}
                     0

      {0, -2} : 0 <----- 0 : {2, -3}
                     0

      {0, -1} : 0 <----- 0 : {2, -2}
                     0

                 2               1
      {0, 0} : QQ  <---------- QQ  : {2, -1}
                      | 1  |
                      | -1 |

      {0, 1} : 0 <----- 0 : {2, 0}
                    0

      {-1, -1} : 0 <----- 0 : {1, -2}
                      0

      {-1, 0} : 0 <----- 0 : {1, -1}
                     0

      {-1, 1} : 0 <----- 0 : {1, 0}
                     0

      {-1, 2} : 0 <----- 0 : {1, 1}
                     0

      {-2, 0} : 0 <----- 0 : {0, -1}
                     0

                           2
      {-2, 1} : 0 <----- QQ  : {0, 0}
                     0

      {-2, 2} : 0 <----- 0 : {0, 1}
                     0

      {-2, 3} : 0 <----- 0 : {0, 2}
                     0

      {-3, 1} : 0 <----- 0 : {-1, 0}
                     0

o20 : SpectralSequencePageMap

i21 : e^infinity

      +------+
      |  1   |
o21 = |QQ    |
      |      |
      |{0, 0}|
      +------+

o21 : Page

i22 : 
