-- -*- M2-comint -*- hash: -1890292949

i1 : R = ZZ/101[a_0..b_1, Degrees=>{2:{1,0},2:{0,1}}]; -- PP^1 x PP^1

i2 : M = intersect(ideal(a_0,a_1),ideal(b_0,b_1)) ; -- irrelevant ideal

o2 : Ideal of R

i3 : M = M_*/(x -> x^5)//ideal ; -- Suitably high Frobenius power of M

o3 : Ideal of R

i4 : G = res image gens M ;

i5 : I = ideal random(R^1, R^{{-3,-3}}) -- ideal of C

              3 3      2   3       2 3      3 3      3 2        2   2    
o5 = ideal(24a b  + 19a a b  - 8a a b  - 38a b  - 36a b b  + 19a a b b  -
              0 0      0 1 0     0 1 0      1 0      0 0 1      0 1 0 1  
     ------------------------------------------------------------------------
          2 2        3 2        3   2      2     2        2   2      3   2  
     22a a b b  - 16a b b  - 30a b b  - 10a a b b  - 29a a b b  + 39a b b  -
        0 1 0 1      1 0 1      0 0 1      0 1 0 1      0 1 0 1      1 0 1  
     ------------------------------------------------------------------------
        3 3      2   3        2 3      3 3
     29a b  - 29a a b  - 24a a b  + 21a b )
        0 1      0 1 1      0 1 1      1 1

o5 : Ideal of R

i6 : b = chainComplex gradedModule R^{{1,0}} -- make line bundle a chain complex

      1
o6 = R
      
     0

o6 : ChainComplex

i7 : a = chainComplex gradedModule R^{{-2,-3}}

      1
o7 = R
      
     0

o7 : ChainComplex

i8 : f = chainComplexMap(b, a,{random(R^1, R^{{-3,-3}})}) ;

i9 : K = filteredComplex ({Hom(G,f)}) ; -- the two step filtered complex we want

i10 : E = prune spectralSequence K ;

i11 : E^1 .dd_{1,-2} -- the connecting map HH^1(C, OO_C(1,0)) --> HH^2(X, OO_X(-2,-3))

o11 = {-8, -7} | 0 0 -31b_0^4b_1^2-29b_0^3b_1^3+31b_0^2b_1^4
      -----------------------------------------------------------------------
      -22b_0^4b_1^2-9b_0^3b_1^3+34b_0^2b_1^4
      -----------------------------------------------------------------------
      8b_0^4b_1^2+50b_0^3b_1^3-9b_0^2b_1^4
      -----------------------------------------------------------------------
      27a_0b_0^4b_1+23a_1b_0^4b_1-35a_0b_0^3b_1^2-19a_1b_0^3b_1^2+42a_0b_0^2b
      -----------------------------------------------------------------------
      _1^3-23a_1b_0^2b_1^3-29a_0b_0b_1^4+14a_1b_0b_1^4
      -----------------------------------------------------------------------
      -27a_0b_0^4b_1+12a_1b_0^4b_1+23a_0b_0^3b_1^2-28a_1b_0^3b_1^2+34a_0b_0^
      -----------------------------------------------------------------------
      2b_1^3+10a_1b_0^2b_1^3-36a_0b_0b_1^4+40a_1b_0b_1^4
      -----------------------------------------------------------------------
      -20a_0b_0^4b_1-2a_1b_0^4b_1+41a_0b_0^3b_1^2-46a_1b_0^3b_1^2-8a_0b_0^2b_
      -----------------------------------------------------------------------
      1^3-17a_1b_0^2b_1^3-42a_0b_0b_1^4-3a_1b_0b_1^4
      -----------------------------------------------------------------------
      -34a_0^2b_0^3b_1+25a_0a_1b_0^3b_1+26a_1^2b_0^3b_1-33a_0^2b_0^2b_1^2-29a
      -----------------------------------------------------------------------
      _0a_1b_0^2b_1^2+4a_1^2b_0^2b_1^2+42a_0^2b_0b_1^3-45a_0a_1b_0b_1^3-5a_1^
      -----------------------------------------------------------------------
      2b_0b_1^3-7a_0^2b_1^4+5a_0a_1b_1^4
      -----------------------------------------------------------------------
      30a_0^2b_0^3b_1+22a_0a_1b_0^3b_1-28a_1^2b_0^3b_1-28a_0^2b_0^2b_1^2+32a_
      -----------------------------------------------------------------------
      0a_1b_0^2b_1^2-29a_1^2b_0^2b_1^2-9a_0^2b_0b_1^3+35a_0a_1b_0b_1^3+a_1^2b
      -----------------------------------------------------------------------
      _0b_1^3-17a_0^2b_1^4+45a_0a_1b_1^4-12a_1^2b_1^4
      -----------------------------------------------------------------------
      -50a_0^2b_0^3b_1-12a_0a_1b_0^3b_1-39a_1^2b_0^3b_1+35a_0^2b_0^2b_1^2+27a
      -----------------------------------------------------------------------
      _0a_1b_0^2b_1^2-2a_1^2b_0^2b_1^2+48a_0^2b_0b_1^3+33a_0a_1b_0b_1^3-36a_1
      -----------------------------------------------------------------------
      ^2b_0b_1^3+33a_0^2b_1^4-23a_0a_1b_1^4-15a_1^2b_1^4
      -----------------------------------------------------------------------
      -17a_0^2b_0^3b_1-5a_0a_1b_0^3b_1-13a_1^2b_0^3b_1-34a_0^2b_0^2b_1^2+26a_
      -----------------------------------------------------------------------
      0a_1b_0^2b_1^2+39a_1^2b_0^2b_1^2+38a_0^2b_0b_1^3-18a_0a_1b_0b_1^3+20a_1
      -----------------------------------------------------------------------
      ^2b_0b_1^3+47a_0^2b_1^4+47a_0a_1b_1^4-22a_1^2b_1^4
      -----------------------------------------------------------------------
      22a_0^3b_0^2b_1-5a_0^2a_1b_0^2b_1+25a_0a_1^2b_0^2b_1-12a_1^3b_0^2b_1+
      -----------------------------------------------------------------------
      32a_0^3b_0b_1^2+9a_0^2a_1b_0b_1^2+10a_0a_1^2b_0b_1^2-31a_1^3b_0b_1^2-
      -----------------------------------------------------------------------
      37a_0^3b_1^3+27a_0^2a_1b_1^3-15a_0a_1^2b_1^3+45a_1^3b_1^3
      -----------------------------------------------------------------------
      30a_0^3b_0^2b_1-17a_0^2a_1b_0^2b_1-34a_0a_1^2b_0^2b_1-50a_1^3b_0^2b_1-
      -----------------------------------------------------------------------
      10a_0^3b_0b_1^2-10a_0^2a_1b_0b_1^2-16a_0a_1^2b_0b_1^2-37a_1^3b_0b_1^2+a
      -----------------------------------------------------------------------
      _0^3b_1^3+43a_0^2a_1b_1^3-a_0a_1^2b_1^3-11a_1^3b_1^3
      -----------------------------------------------------------------------
      -28a_0^3b_0^2b_1-13a_0^2a_1b_0^2b_1+26a_0a_1^2b_0^2b_1-39a_1^3b_0^2b_1+
      -----------------------------------------------------------------------
      15a_0^3b_0b_1^2+21a_0^2a_1b_0b_1^2-8a_0a_1^2b_0b_1^2+26a_1^3b_0b_1^2-
      -----------------------------------------------------------------------
      33a_0^3b_1^3+33a_0^2a_1b_1^3+6a_0a_1^2b_1^3-5a_1^3b_1^3
      -----------------------------------------------------------------------
      23a_0^4b_0b_1+12a_0^3a_1b_0b_1-2a_0^2a_1^2b_0b_1-2a_0a_1^3b_0b_1-44a_1^
      -----------------------------------------------------------------------
      4b_0b_1-20a_0^4b_1^2-29a_0^3a_1b_1^2+16a_0^2a_1^2b_1^2+2a_0a_1^3b_1^2-
      -----------------------------------------------------------------------
      42a_1^4b_1^2 27a_0^4b_0b_1-27a_0^3a_1b_0b_1-20a_0^2a_1^2b_0b_1+2a_0a_1^
      -----------------------------------------------------------------------
      3b_0b_1+27a_1^4b_0b_1+18a_0^4b_1^2+19a_0^3a_1b_1^2+45a_0^2a_1^2b_1^2+
      -----------------------------------------------------------------------
      12a_0a_1^3b_1^2+7a_1^4b_1^2
      -----------------------------------------------------------------------
      23a_0^2b_0^4+27a_0a_1b_0^4-44a_1^2b_0^4+9a_0^2b_0^3b_1+5a_0a_1b_0^3b_1-
      -----------------------------------------------------------------------
      30a_1^2b_0^3b_1+8a_0^2b_0^2b_1^2-21a_0a_1b_0^2b_1^2+32a_1^2b_0^2b_1^2+
      -----------------------------------------------------------------------
      41a_0^2b_0b_1^3-14a_0a_1b_0b_1^3-35a_1^2b_0b_1^3+25a_0^2b_1^4-20a_0a_1b
      -----------------------------------------------------------------------
      _1^4+45a_1^2b_1^4 -a_0^2b_0^4+47a_0a_1b_0^4+27a_1^2b_0^4-21a_0^2b_0^3b_
      -----------------------------------------------------------------------
      1+4a_0a_1b_0^3b_1-42a_1^2b_0^3b_1-42a_0^2b_0^2b_1^2+31a_0a_1b_0^2b_1^2+
      -----------------------------------------------------------------------
      22a_1^2b_0^2b_1^2-3a_0^2b_0b_1^3+45a_0a_1b_0b_1^3-6a_1^2b_0b_1^3+21a_0^
      -----------------------------------------------------------------------
      2b_1^4-42a_0a_1b_1^4-33a_1^2b_1^4
      -----------------------------------------------------------------------
      43a_0^2b_0^4-a_0a_1b_0^4+23a_1^2b_0^4+50a_0^2b_0^3b_1-32a_0a_1b_0^3b_1+
      -----------------------------------------------------------------------
      49a_1^2b_0^3b_1+35a_0^2b_0^2b_1^2+50a_0a_1b_0^2b_1^2+6a_1^2b_0^2b_1^2-
      -----------------------------------------------------------------------
      42a_0^2b_0b_1^3+3a_0a_1b_0b_1^3+20a_1^2b_0b_1^3-41a_0^2b_1^4-12a_0a_1b_
      -----------------------------------------------------------------------
      1^4-a_1^2b_1^4 9a_0^3b_0^3-39a_0^2a_1b_0^3-37a_0a_1^2b_0^3-50a_1^3b_0^3
      -----------------------------------------------------------------------
      +43a_0^3b_0^2b_1-9a_0^2a_1b_0^2b_1-8a_0a_1^2b_0^2b_1+47a_1^3b_0^2b_1+
      -----------------------------------------------------------------------
      43a_0^3b_0b_1^2+4a_0^2a_1b_0b_1^2+35a_0a_1^2b_0b_1^2+26a_1^3b_0b_1^2+
      -----------------------------------------------------------------------
      46a_0^3b_1^3-38a_0^2a_1b_1^3-21a_0a_1^2b_1^3-29a_1^3b_1^3
      -----------------------------------------------------------------------
      -8a_0^3b_0^3-50a_0^2a_1b_0^3-42a_0a_1^2b_0^3-24a_1^3b_0^3+24a_0^3b_0^2b
      -----------------------------------------------------------------------
      _1-49a_0^2a_1b_0^2b_1-32a_0a_1^2b_0^2b_1-25a_1^3b_0^2b_1-4a_0^3b_0b_1^2
      -----------------------------------------------------------------------
      +35a_0^2a_1b_0b_1^2-44a_0a_1^2b_0b_1^2+13a_1^3b_0b_1^2-5a_0^3b_1^3-25a_
      -----------------------------------------------------------------------
      0^2a_1b_1^3+44a_0a_1^2b_1^3+9a_1^3b_1^3
      -----------------------------------------------------------------------
      -33a_0^3b_0^3-37a_0^2a_1b_0^3-23a_0a_1^2b_0^3-42a_1^3b_0^3+9a_0^3b_0^2b
      -----------------------------------------------------------------------
      _1+16a_0^2a_1b_0^2b_1-29a_0a_1^2b_0^2b_1-23a_1^3b_0^2b_1+30a_0^3b_0b_1^
      -----------------------------------------------------------------------
      2+45a_0^2a_1b_0b_1^2+27a_1^3b_0b_1^2-6a_0^3b_1^3+5a_0^2a_1b_1^3-44a_0a_
      -----------------------------------------------------------------------
      1^2b_1^3+20a_1^3b_1^3 -17a_0^3b_0^3+9a_0^2a_1b_0^3-33a_0a_1^2b_0^3-8a_1
      -----------------------------------------------------------------------
      ^3b_0^3-46a_0^3b_0^2b_1-16a_0^2a_1b_0^2b_1+32a_0a_1^2b_0^2b_1+22a_1^3b_
      -----------------------------------------------------------------------
      0^2b_1+38a_0^3b_0b_1^2-17a_0^2a_1b_0b_1^2-33a_0a_1^2b_0b_1^2+7a_1^3b_0b
      -----------------------------------------------------------------------
      _1^2+24a_0^3b_1^3-7a_0^2a_1b_1^3+28a_0a_1^2b_1^3-6a_1^3b_1^3
      -----------------------------------------------------------------------
      -8a_0^3a_1b_0^2-50a_0^2a_1^2b_0^2-42a_0a_1^3b_0^2-24a_1^4b_0^2+25a_0^4b
      -----------------------------------------------------------------------
      _0b_1+3a_0^3a_1b_0b_1-43a_0^2a_1^2b_0b_1-15a_0a_1^3b_0b_1-46a_1^4b_0b_1
      -----------------------------------------------------------------------
      +18a_0^4b_1^2+7a_0^3a_1b_1^2-50a_0^2a_1^2b_1^2-22a_0a_1^3b_1^2+49a_1^4b
      -----------------------------------------------------------------------
      _1^2 -33a_0^3a_1b_0^2-37a_0^2a_1^2b_0^2-23a_0a_1^3b_0^2-42a_1^4b_0^2+
      -----------------------------------------------------------------------
      17a_0^4b_0b_1-35a_0^3a_1b_0b_1+45a_0^2a_1^2b_0b_1+50a_0a_1^3b_0b_1-48a_
      -----------------------------------------------------------------------
      1^4b_0b_1+36a_0^4b_1^2-11a_0^3a_1b_1^2-3a_0^2a_1^2b_1^2+21a_0a_1^3b_1^2
      -----------------------------------------------------------------------
      -9a_1^4b_1^2 3a_0^4b_0^2+20a_0^3a_1b_0^2+24a_0^2a_1^2b_0^2+4a_0a_1^3b_0
      -----------------------------------------------------------------------
      ^2-41a_1^4b_0^2-16a_0^4b_0b_1+a_0^3a_1b_0b_1+22a_0^2a_1^2b_0b_1+17a_0a_
      -----------------------------------------------------------------------
      1^3b_0b_1+3a_1^4b_0b_1-20a_0^4b_1^2-50a_0^3a_1b_1^2-46a_0^2a_1^2b_1^2-
      -----------------------------------------------------------------------
      27a_0a_1^3b_1^2+5a_1^4b_1^2
      -----------------------------------------------------------------------
      -17a_0^3a_1b_0^2+9a_0^2a_1^2b_0^2-33a_0a_1^3b_0^2-8a_1^4b_0^2-28a_0^4b_
      -----------------------------------------------------------------------
      0b_1+7a_0^3a_1b_0b_1-32a_0^2a_1^2b_0b_1+39a_0a_1^3b_0b_1+36a_1^4b_0b_1+
      -----------------------------------------------------------------------
      17a_0^4b_1^2-12a_0^3a_1b_1^2+4a_0^2a_1^2b_1^2+40a_0a_1^3b_1^2+16a_1^4b_
      -----------------------------------------------------------------------
      1^2 9a_0^3a_1b_0^2-39a_0^2a_1^2b_0^2-37a_0a_1^3b_0^2-50a_1^4b_0^2+48a_0
      -----------------------------------------------------------------------
      ^4b_0b_1+20a_0^3a_1b_0b_1-a_0^2a_1^2b_0b_1-33a_0a_1^3b_0b_1-38a_1^4b_0b
      -----------------------------------------------------------------------
      _1+22a_0^4b_1^2+50a_0^3a_1b_1^2-4a_0^2a_1^2b_1^2+16a_0a_1^3b_1^2-37a_1^
      -----------------------------------------------------------------------
      4b_1^2 3a_0^4a_1b_0+20a_0^3a_1^2b_0+24a_0^2a_1^3b_0+4a_0a_1^4b_0-32a_0^
      -----------------------------------------------------------------------
      4a_1b_1+14a_0^3a_1^2b_1+3a_0^2a_1^3b_1+43a_0a_1^4b_1
      -----------------------------------------------------------------------
      -17a_0^3a_1^2b_0+9a_0^2a_1^3b_0-33a_0a_1^4b_0+3a_0^4a_1b_1+32a_0^3a_1^
      -----------------------------------------------------------------------
      2b_1-48a_0^2a_1^3b_1-11a_0a_1^4b_1
      -----------------------------------------------------------------------
      9a_0^3a_1^2b_0-39a_0^2a_1^3b_0-37a_0a_1^4b_0+44a_0^4a_1b_1+16a_0^3a_1^
      -----------------------------------------------------------------------
      2b_1-7a_0^2a_1^3b_1+4a_0a_1^4b_1 3a_0^4a_1^2+20a_0^3a_1^3+24a_0^2a_1^4
      -----------------------------------------------------------------------
      -17a_0^3a_1^3+9a_0^2a_1^4 9a_0^3a_1^3-39a_0^2a_1^4 |

o11 : Matrix

i12 : basis({0,0}, image E^1 .dd_{1,-2})  -- image 2-dimensional

o12 = {-11, 0}  | 0               0               |
      {-1, -10} | 0               0               |
      {-8, -1}  | 0               0               |
      {-8, -1}  | 0               0               |
      {-8, -1}  | 0               0               |
      {-7, -2}  | 0               0               |
      {-7, -2}  | 0               0               |
      {-7, -2}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-3, -6}  | 0               0               |
      {-3, -6}  | 0               0               |
      {-3, -6}  | 0               0               |
      {-2, -7}  | a_1^2b_0^4b_1^3 a_1^2b_0^3b_1^4 |
      {-2, -7}  | 0               0               |
      {-2, -7}  | 0               0               |

o12 : Matrix

i13 : basis({0,0}, ker E^1 .dd_{1,-2}) -- map is injective

o13 = 0

o13 : Matrix

i14 : basis({0,0}, target E^1 .dd_{1,-2}) -- target 2-dimensional

o14 = {-8, -7} | a_0^4a_1^4b_0^4b_1^3 a_0^4a_1^4b_0^3b_1^4 |

o14 : Matrix

i15 : basis({0,0}, source E^1 .dd_{1,-2}) -- source 2 dimensional

o15 = {-11, 0}  | 0               0               |
      {-1, -10} | 0               0               |
      {-8, -1}  | 0               0               |
      {-8, -1}  | 0               0               |
      {-8, -1}  | 0               0               |
      {-7, -2}  | 0               0               |
      {-7, -2}  | 0               0               |
      {-7, -2}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-6, -3}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-5, -4}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-4, -5}  | 0               0               |
      {-3, -6}  | 0               0               |
      {-3, -6}  | 0               0               |
      {-3, -6}  | 0               0               |
      {-2, -7}  | a_1^2b_0^4b_1^3 a_1^2b_0^3b_1^4 |
      {-2, -7}  | 0               0               |
      {-2, -7}  | 0               0               |

o15 : Matrix

i16 : prune connectingMorphism(Hom(G, f), - 2) ;

o16 : Matrix

i17 : prune connectingMorphism(Hom(G, f), - 2) == E^1 .dd_{1, -2}

o17 = true

i18 : 
