-- -*- M2-comint -*- hash: -1310364050

i1 : S = ZZ/101[x,y];

i2 : I = ideal(x^2,x*y,y^2);

o2 : Ideal of S

i3 : R = S/I;

i4 : kR = coker vars R;

i5 : kS = coker vars S;

i6 : CS = res kS;

i7 : CR = res(kR,LengthLimit=>6);

i8 : CS' = CS**R;

i9 : E = prune spectralSequence (CS' ** filteredComplex CR);

i10 : use ZZ[t]

o10 = ZZ[t]

o10 : PolynomialRing

i11 : easyPresentation = (P,n,m) -> (
         transpose matrix apply(n,
             i-> apply(m,
                 j-> (length (P_{i,j}))*t^(
                     if (L = unique flatten degrees P_{i,j})!= {} then first L else 0)
                 )
             ));

i12 : easyPresentation(E_infinity,6,3)

o12 = {-2} | 1 2t t2 0 0    0    |
      {-7} | 0 0  0  0 0    96t7 |
      {-8} | 0 0  0  0 32t7 64t8 |

                    3             6
o12 : Matrix (ZZ[t])  <--- (ZZ[t])

i13 : easyPresentation(E_1,6,3)

o13 = {-5} | 1   2t  4t2  8t3  16t4 32t5 |
      {-7} | 3t2 6t3 12t4 24t5 48t6 96t7 |
      {-8} | 2t3 4t4 8t5  16t6 32t7 64t8 |

                    3             6
o13 : Matrix (ZZ[t])  <--- (ZZ[t])

i14 : easyPresentation(E_2,6,3)

o14 = {-5} | 1   2t  4t2  8t3  16t4 32t5 |
      {-7} | 3t2 6t3 12t4 24t5 48t6 96t7 |
      {-8} | 2t3 4t4 8t5  16t6 32t7 64t8 |

                    3             6
o14 : Matrix (ZZ[t])  <--- (ZZ[t])

i15 : easyPresentation(E_3,6,3)

o15 = {-5} | 1   2t  t2  2t3  4t4  8t5  |
      {-7} | 0   0   0   0    0    96t7 |
      {-8} | 2t3 4t4 8t5 16t6 32t7 64t8 |

                    3             6
o15 : Matrix (ZZ[t])  <--- (ZZ[t])

i16 : length image ((E_2).dd_{3,0})

o16 = 6

i17 : length image (E_3).dd_{3,0}

o17 = 2

i18 : 
