-- -*- M2-comint -*- hash: -1689229407

i1 : R = QQ[x,y,z,w, Degrees => {{1,0},{1,0},{0,1},{0,1}}];

i2 : B = ideal(x*z, x*w, y*z, y*w);

o2 : Ideal of R

i3 : p_0 = x^2*z;

i4 : p_1 = y^2*w;

i5 : p_2 = y^2*z+x^2*w;

i6 : I = ideal(p_0,p_1,p_2);

o6 : Ideal of R

i7 : B = B_*/(x -> x^2)//ideal;

o7 : Ideal of R

i8 : G = complete res image gens B;

i9 : F = koszul gens I;

i10 : K = Hom(G, filteredComplex(F));

i11 : E = prune spectralSequence K;

i12 : E^1

      +---------------------------------+---------------------------------------------------------+--------------------------------------------------------+--------------------------------+
      | 1                               | 3                                                       | 3                                                      | 1                              |
o12 = |R                                |R                                                        |R                                                       |R                               |
      |                                 |                                                         |                                                        |                                |
      |{0, 0}                           |{1, 0}                                                   |{2, 0}                                                  |{3, 0}                          |
      +---------------------------------+---------------------------------------------------------+--------------------------------------------------------+--------------------------------+
      |cokernel {-4, 0} | y2 x2 0  0  | |cokernel {-2, 1} | y2 x2 0  0  0  0  0  0  0  0  0  0  | |cokernel {0, 2}  | y2 x2 0  0  0  0  0  0  0  0  0  0  ||cokernel {2, 3}  | y2 x2 0  0  ||
      |         {0, -4} | 0  0  w2 z2 | |         {-2, 1} | 0  0  y2 x2 0  0  0  0  0  0  0  0  | |         {0, 2}  | 0  0  y2 x2 0  0  0  0  0  0  0  0  ||         {6, -1} | 0  0  w2 z2 ||
      |                                 |         {-2, 1} | 0  0  0  0  y2 x2 0  0  0  0  0  0  | |         {0, 2}  | 0  0  0  0  y2 x2 0  0  0  0  0  0  ||                                |
      |{0, -1}                          |         {2, -3} | 0  0  0  0  0  0  w2 z2 0  0  0  0  | |         {4, -2} | 0  0  0  0  0  0  w2 z2 0  0  0  0  ||{3, -1}                         |
      |                                 |         {2, -3} | 0  0  0  0  0  0  0  0  w2 z2 0  0  | |         {4, -2} | 0  0  0  0  0  0  0  0  w2 z2 0  0  ||                                |
      |                                 |         {2, -3} | 0  0  0  0  0  0  0  0  0  0  w2 z2 | |         {4, -2} | 0  0  0  0  0  0  0  0  0  0  w2 z2 ||                                |
      |                                 |                                                         |                                                        |                                |
      |                                 |{1, -1}                                                  |{2, -1}                                                 |                                |
      +---------------------------------+---------------------------------------------------------+--------------------------------------------------------+--------------------------------+
      |cokernel {-4, -4} | w2 z2 y2 x2 ||cokernel {-2, -3} | w2 z2 y2 x2 0  0  0  0  0  0  0  0  ||cokernel {0, -2} | w2 z2 y2 x2 0  0  0  0  0  0  0  0  ||cokernel {2, -1} | w2 z2 y2 x2 ||
      |                                 |         {-2, -3} | 0  0  0  0  w2 z2 y2 x2 0  0  0  0  ||         {0, -2} | 0  0  0  0  w2 z2 y2 x2 0  0  0  0  ||                                |
      |{0, -2}                          |         {-2, -3} | 0  0  0  0  0  0  0  0  w2 z2 y2 x2 ||         {0, -2} | 0  0  0  0  0  0  0  0  w2 z2 y2 x2 ||{3, -2}                         |
      |                                 |                                                         |                                                        |                                |
      |                                 |{1, -2}                                                  |{2, -2}                                                 |                                |
      +---------------------------------+---------------------------------------------------------+--------------------------------------------------------+--------------------------------+

o12 : SpectralSequencePage

i13 : E^2

      +------------------------------------------------+--------------------------------------------------------------------------+------------------------------------------------------------------+--------------------------------+
o13 = |cokernel | y2w y2z+x2w x2z |                    |cokernel {2, 3} | y2 x2 0 0 |                                             |0                                                                 |0                               |
      |                                                |         {6, 1} | 0  0  w z |                                             |                                                                  |                                |
      |{0, 0}                                          |                                                                          |{2, 0}                                                            |{3, 0}                          |
      |                                                |{1, 0}                                                                    |                                                                  |                                |
      +------------------------------------------------+--------------------------------------------------------------------------+------------------------------------------------------------------+--------------------------------+
      |cokernel {-4, 0} | y2 x2 0  0  0   0       0   ||cokernel {-2, 1} | y2 x2 0  0  0  0  0 0 0 0 0 0  0   0  0   0   0   0 0 ||cokernel {0, 2}  | y2 x2 0  0  0  0  0 0 0 0 0 0 0   0   0 0 0 0 ||cokernel {2, 3} | y2 x2 0 0 |   |
      |         {0, -4} | 0  0  w2 z2 y2w y2z+x2w x2z ||         {-2, 1} | 0  0  y2 x2 0  0  0 0 0 0 0 0  0   0  0   0   0   0 0 ||         {0, 2}  | 0  0  y2 x2 0  0  0 0 0 0 0 0 0   0   0 0 0 0 ||         {6, 1} | 0  0  w z |   |
      |                                                |         {-2, 1} | 0  0  0  0  y2 x2 0 0 0 0 0 0  0   0  0   0   0   0 0 ||         {0, 2}  | 0  0  0  0  y2 x2 0 0 0 0 0 0 0   0   0 0 0 0 ||                                |
      |{0, -1}                                         |         {2, -2} | 0  0  0  0  0  0  z 0 0 0 w w2 0   0  -y2 y2w 0   0 0 ||         {4, 0}  | 0  0  0  0  0  0  w z 0 0 0 0 x2  -y2 0 0 0 0 ||{3, -1}                         |
      |                                                |         {2, -2} | 0  0  0  0  0  0  0 w z 0 0 0  x2  0  0   0   0   0 0 ||         {4, 0}  | 0  0  0  0  0  0  0 0 w z 0 0 -y2 0   0 0 0 0 ||                                |
      |                                                |         {2, -2} | 0  0  0  0  0  0  0 0 w z 0 0  -y2 0  0   0   0   0 0 ||         {4, 0}  | 0  0  0  0  0  0  0 0 0 0 w z 0   x2  0 0 0 0 ||                                |
      |                                                |         {2, -2} | 0  0  0  0  0  0  0 0 0 w z 0  0   w2 x2  0   y2w 0 0 ||         {6, -1} | 0  0  0  0  0  0  0 0 0 0 0 0 0   0   w z 0 0 ||                                |
      |                                                |         {6, -3} | 0  0  0  0  0  0  0 0 0 0 0 0  0   0  0   0   0   w z ||         {6, -1} | 0  0  0  0  0  0  0 0 0 0 0 0 0   0   0 0 w z ||                                |
      |                                                |                                                                          |                                                                  |                                |
      |                                                |{1, -1}                                                                   |{2, -1}                                                           |                                |
      +------------------------------------------------+--------------------------------------------------------------------------+------------------------------------------------------------------+--------------------------------+
      |cokernel {-4, -4} | w2 z2 y2 x2 |               |cokernel {-2, -3} | w2 z2 y2 x2 0  0  0  0  0  0  0  0  |                 |cokernel {0, -2} | w2 z2 y2 x2 0  0  0  0  0  0  0  0  |          |cokernel {2, -1} | w2 z2 y2 x2 ||
      |                                                |         {-2, -3} | 0  0  0  0  w2 z2 y2 x2 0  0  0  0  |                 |         {0, -2} | 0  0  0  0  w2 z2 y2 x2 0  0  0  0  |          |                                |
      |{0, -2}                                         |         {-2, -3} | 0  0  0  0  0  0  0  0  w2 z2 y2 x2 |                 |         {0, -2} | 0  0  0  0  0  0  0  0  w2 z2 y2 x2 |          |{3, -2}                         |
      |                                                |                                                                          |                                                                  |                                |
      |                                                |{1, -2}                                                                   |{2, -2}                                                           |                                |
      +------------------------------------------------+--------------------------------------------------------------------------+------------------------------------------------------------------+--------------------------------+

o13 : SpectralSequencePage

i14 : E^2_{3,-1}

o14 = cokernel {2, 3} | y2 x2 0 0 |
               {6, 1} | 0  0  w z |

                             2
o14 : R-module, quotient of R

i15 : basis({0,0}, E^2_{3, -1} ** R^{{2, 3}})

o15 = {0, 0}  | 1 |
      {4, -2} | 0 |

o15 : Matrix

i16 : E^2 .dd_{3, -1}

o16 = {2, 3} | -1 0 |
      {6, 1} | 0  1 |

o16 : Matrix

i17 : basis({0,0}, image E^2 .dd_{3,-1} ** R^{{2,3}})

o17 = {0, 0}  | 1 |
      {4, -2} | 0 |

o17 : Matrix

i18 : basis({0,0}, E^2_{1,0} ** R^{{2,3}})

o18 = {0, 0}  | 1 |
      {4, -2} | 0 |

o18 : Matrix

i19 : basis({0,0}, E^2 _{3, -1} ** R^{{6,1}})

o19 = {-4, 2} | 0 |
      {0, 0}  | 1 |

o19 : Matrix

i20 : isIsomorphism(E^2 .dd_{3, -1})

o20 = true

i21 : 
