-- -*- M2-comint -*- hash: -1248941074

i1 : S = ZZ[a00,a10,a20,a01,a11,a21,a02,a12,a22];

i2 : Delta = simplicialComplex {a00*a10*a02, a02*a12*a10, a01*a02*a12, a01*a12*a11, a00*a01*a11, a00*a11*a10, a10*a12*a20, a12*a20*a22, a11*a12*a22, a11*a22*a21, a10*a11*a21, a10*a21*a20, a20*a22*a00, a22*a00*a01, a21*a22*a01, a21*a02*a01, a20*a21*a02, a20*a02*a00}

o2 = simplicialComplex | a11a12a22 a20a12a22 a11a21a22 a01a21a22 a00a01a22 a00a20a22 a01a02a12 a10a02a12 a01a11a12 a10a20a12 a01a21a02 a20a21a02 a00a20a02 a00a10a02 a10a11a21 a10a20a21 a00a01a11 a00a10a11 |

o2 : SimplicialComplex

i3 : C = truncate(chainComplex Delta,1)

                   9       27       18
o3 = image 0 <-- ZZ  <-- ZZ   <-- ZZ
                                   
     -1          0       1        2

o3 : ChainComplex

i4 : prune HH C

o4 = -1 : 0             

            1
      0 : ZZ            

      1 : cokernel | 2 |
                   | 0 |

      2 : 0             

o4 : GradedModule

i5 : F1Delta = Delta

o5 = simplicialComplex | a11a12a22 a20a12a22 a11a21a22 a01a21a22 a00a01a22 a00a20a22 a01a02a12 a10a02a12 a01a11a12 a10a20a12 a01a21a02 a20a21a02 a00a20a02 a00a10a02 a10a11a21 a10a20a21 a00a01a11 a00a10a11 |

o5 : SimplicialComplex

i6 : F0Delta = simplicialComplex {a00*a01,a01*a02,a00*a02,a10*a11,a10*a12,a11*a12,a21*a20,a20*a22,a21*a22}

o6 = simplicialComplex | a21a22 a20a22 a11a12 a10a12 a01a02 a00a02 a20a21 a10a11 a00a01 |

o6 : SimplicialComplex

i7 : K = filteredComplex({F1Delta, F0Delta}, ReducedHomology => false)

o7 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                               
          -1          0           1           2

     0 : image 0 <-- image | 1 0 0 0 0 0 0 0 0 | <-- image | 0 0 0 0 0 0 0 0 0 | <-- image 0
                           | 0 1 0 0 0 0 0 0 0 |           | 0 0 0 0 0 0 0 0 0 |      
         -1                | 0 0 1 0 0 0 0 0 0 |           | 1 0 0 0 0 0 0 0 0 |     2
                           | 0 0 0 1 0 0 0 0 0 |           | 0 0 0 0 0 0 0 0 0 |
                           | 0 0 0 0 1 0 0 0 0 |           | 0 1 0 0 0 0 0 0 0 |
                           | 0 0 0 0 0 1 0 0 0 |           | 0 0 0 0 0 0 0 0 0 |
                           | 0 0 0 0 0 0 1 0 0 |           | 0 0 0 0 0 0 0 0 0 |
                           | 0 0 0 0 0 0 0 1 0 |           | 0 0 1 0 0 0 0 0 0 |
                           | 0 0 0 0 0 0 0 0 1 |           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                     0                                     | 0 0 0 1 0 0 0 0 0 |
                                                           | 0 0 0 0 1 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 1 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 1 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 1 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 1 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                           | 0 0 0 0 0 0 0 0 0 |
                                                      
                                                     1

                       9       27       18
     1 : image 0 <-- ZZ  <-- ZZ   <-- ZZ
                                       
         -1          0       1        2

o7 : FilteredComplex

i8 : E = prune spectralSequence K

o8 = E

o8 : SpectralSequence

i9 : E^0

     +------+------+
     |  9   |  18  |
o9 = |ZZ    |ZZ    |
     |      |      |
     |{0, 1}|{1, 1}|
     +------+------+
     |  9   |  18  |
     |ZZ    |ZZ    |
     |      |      |
     |{0, 0}|{1, 0}|
     +------+------+

o9 : SpectralSequencePage

i10 : E^0 .dd

o10 = {-1, 0} : 0 <----- 0 : {-1, 1}
                     0

      {-1, 1} : 0 <----- 0 : {-1, 2}
                     0

      {-1, 2} : 0 <----- 0 : {-1, 3}
                     0

      {1, -3} : 0 <----- 0 : {1, -2}
                     0

      {1, -2} : 0 <----- 0 : {1, -1}
                     0

                           18
      {1, -1} : 0 <----- ZZ   : {1, 0}
                     0

                 18                                                                  18
      {1, 0} : ZZ   <------------------------------------------------------------- ZZ   : {1, 1}
                       | -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 1  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  1  0  1  0  0  0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  1  0  1  0  0  0  0  0  0  0  0  0  |
                       | 0  -1 0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  |
                       | 0  0  -1 0  0  0  0  0  0  0  1  0  0  0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  -1 0  0  0  -1 0  0  0  0  0  0  |
                       | 0  0  0  0  -1 0  0  0  0  0  0  0  -1 0  0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  -1 -1 0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  1  0  0  1  0  0  |
                       | 0  0  0  0  0  -1 0  0  0  0  0  0  0  0  1  0  0  0  |
                       | 0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  -1 0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  1  |
                       | 0  0  0  0  0  0  0  0  0  0  -1 0  0  -1 0  0  0  0  |
                       | 0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  -1 0  0  |
                       | 0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  0  -1 |

      {0, -2} : 0 <----- 0 : {0, -1}
                     0

                           9
      {0, -1} : 0 <----- ZZ  : {0, 0}
                     0

                 9                                       9
      {0, 0} : ZZ  <---------------------------------- ZZ  : {0, 1}
                      | 1  1  0  0  0  0  0  0  0  |
                      | 0  0  1  1  0  0  0  0  0  |
                      | 0  0  0  0  1  1  0  0  0  |
                      | -1 0  0  0  0  0  1  0  0  |
                      | 0  0  -1 0  0  0  0  1  0  |
                      | 0  0  0  0  -1 0  0  0  1  |
                      | 0  -1 0  0  0  0  -1 0  0  |
                      | 0  0  0  -1 0  0  0  -1 0  |
                      | 0  0  0  0  0  -1 0  0  -1 |

                 9
      {0, 1} : ZZ  <----- 0 : {0, 2}
                      0

      {-1, -1} : 0 <----- 0 : {-1, 0}
                      0

o10 : SpectralSequencePageMap

i11 : E^1

      +------+------+
      |  3   |  3   |
o11 = |ZZ    |ZZ    |
      |      |      |
      |{0, 1}|{1, 1}|
      +------+------+
      |  3   |  3   |
      |ZZ    |ZZ    |
      |      |      |
      |{0, 0}|{1, 0}|
      +------+------+

o11 : SpectralSequencePage

i12 : E^1 .dd

o12 = {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {0, -1} : 0 <----- 0 : {1, -1}
                     0

                 3                     3
      {0, 0} : ZZ  <---------------- ZZ  : {1, 0}
                      | -1 1  0  |
                      | 0  -1 1  |
                      | 1  0  -1 |

                 3                    3
      {0, 1} : ZZ  <--------------- ZZ  : {1, 1}
                      | 1 1  0  |
                      | 0 -1 1  |
                      | 1 0  -1 |

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           3
      {-1, 0} : 0 <----- ZZ  : {0, 0}
                     0

                           3
      {-1, 1} : 0 <----- ZZ  : {0, 1}
                     0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o12 : SpectralSequencePageMap

i13 : E^2

      +--------------+------+
o13 = |cokernel | 2 ||0     |
      |              |      |
      |{0, 1}        |{1, 1}|
      +--------------+------+
      |  1           |  1   |
      |ZZ            |ZZ    |
      |              |      |
      |{0, 0}        |{1, 0}|
      +--------------+------+

o13 : SpectralSequencePage

i14 : 
