-- -*- M2-comint -*- hash: 2088754600

i1 : S = ZZ/101[a00,a10,a20,a01,a11,a21,a02,a12,a22];

i2 : Delta = simplicialComplex {a00*a02*a10, a02*a12*a10, a01*a02*a12, a01*a11*a12, a00*a01*a11, a00*a10*a11, a12*a10*a20, a12*a20*a22, a11*a12*a22, a11*a22*a21, a10*a11*a21, a10*a21*a20, a20*a22*a00, a22*a00*a02, a21*a22*a02, a21*a02*a01, a20*a21*a01, a20*a01*a00}

o2 = simplicialComplex | a11a12a22 a20a12a22 a21a02a22 a00a02a22 a11a21a22 a00a20a22 a01a02a12 a10a02a12 a01a11a12 a10a20a12 a01a21a02 a00a10a02 a10a11a21 a20a01a21 a10a20a21 a00a01a11 a00a10a11 a00a20a01 |

o2 : SimplicialComplex

i3 : C = truncate(chainComplex Delta,1)

                   ZZ 9       ZZ 27       ZZ 18
o3 = image 0 <-- (---)  <-- (---)   <-- (---)
                  101        101         101
     -1                                  
                 0          1           2

o3 : ChainComplex

i4 : prune HH C

o4 = -1 : 0     

            ZZ 1
      0 : (---)
           101

            ZZ 2
      1 : (---)
           101

            ZZ 1
      2 : (---)
           101

o4 : GradedModule

i5 : F1Delta = Delta;

i6 : F0Delta = simplicialComplex {a00*a01, a01*a02, a00*a02, a10*a11,a11*a12,a10*a12, a21*a20,a21*a22,a20*a22};

i7 : K = filteredComplex({F1Delta, F0Delta}, ReducedHomology => false) ;

i8 : E = prune spectralSequence K

o8 = E

o8 : SpectralSequence

i9 : E^0

     +------+-------+
     |  ZZ 9|  ZZ 18|
o9 = |(---) |(---)  |
     | 101  | 101   |
     |      |       |
     |{0, 1}|{1, 1} |
     +------+-------+
     |  ZZ 9|  ZZ 18|
     |(---) |(---)  |
     | 101  | 101   |
     |      |       |
     |{0, 0}|{1, 0} |
     +------+-------+

o9 : SpectralSequencePage

i10 : E^0 .dd

o10 = {-1, 0} : 0 <----- 0 : {-1, 1}
                     0

      {-1, 1} : 0 <----- 0 : {-1, 2}
                     0

      {-1, 2} : 0 <----- 0 : {-1, 3}
                     0

      {1, -3} : 0 <----- 0 : {1, -2}
                     0

      {1, -2} : 0 <----- 0 : {1, -1}
                     0

                           ZZ 18
      {1, -1} : 0 <----- (---)   : {1, 0}
                     0    101

                 ZZ 18                                                                  ZZ 18
      {1, 0} : (---)   <------------------------------------------------------------- (---)   : {1, 1}
                101       | -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  |    101
                          | 0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                          | 1  0  0  0  1  0  0  0  0  0  0  0  0  0  0  0  0  0  |
                          | 0  0  0  1  0  1  0  0  0  0  0  0  0  0  0  0  0  0  |
                          | 0  0  0  0  0  0  -1 -1 0  0  0  0  0  0  0  0  0  0  |
                          | 0  0  0  0  0  0  1  0  1  0  0  0  0  0  0  0  0  0  |
                          | 0  -1 0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  0  |
                          | 0  0  -1 0  0  0  0  0  0  0  -1 0  0  0  0  0  0  0  |
                          | 0  0  0  0  0  0  0  -1 0  0  0  -1 0  0  0  0  0  0  |
                          | 0  0  0  0  -1 0  0  0  0  0  0  0  -1 0  0  0  0  0  |
                          | 0  0  0  0  0  0  0  0  0  0  -1 0  0  -1 0  0  0  0  |
                          | 0  0  0  0  0  0  0  0  0  0  0  0  1  0  1  0  0  0  |
                          | 0  0  0  0  0  0  0  0  -1 0  0  0  0  0  0  -1 0  0  |
                          | 0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  1  1  0  |
                          | 0  0  0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  -1 |
                          | 0  0  0  0  0  0  0  0  0  -1 0  0  0  0  -1 0  0  0  |
                          | 0  0  0  0  0  -1 0  0  0  0  0  0  0  0  0  0  0  -1 |
                          | 0  0  0  0  0  0  0  0  0  0  0  -1 0  0  0  0  -1 0  |

      {0, -2} : 0 <----- 0 : {0, -1}
                     0

                           ZZ 9
      {0, -1} : 0 <----- (---)  : {0, 0}
                     0    101

                 ZZ 9                                       ZZ 9
      {0, 0} : (---)  <---------------------------------- (---)  : {0, 1}
                101      | 1  1  0  0  0  0  0  0  0  |    101
                         | 0  0  1  1  0  0  0  0  0  |
                         | 0  0  0  0  1  1  0  0  0  |
                         | -1 0  0  0  0  0  1  0  0  |
                         | 0  0  -1 0  0  0  0  1  0  |
                         | 0  0  0  0  -1 0  0  0  1  |
                         | 0  -1 0  0  0  0  -1 0  0  |
                         | 0  0  0  -1 0  0  0  -1 0  |
                         | 0  0  0  0  0  -1 0  0  -1 |

                 ZZ 9
      {0, 1} : (---)  <----- 0 : {0, 2}
                101      0

      {-1, -1} : 0 <----- 0 : {-1, 0}
                      0

o10 : SpectralSequencePageMap

i11 : E^1

      +------+------+
      |  ZZ 3|  ZZ 3|
o11 = |(---) |(---) |
      | 101  | 101  |
      |      |      |
      |{0, 1}|{1, 1}|
      +------+------+
      |  ZZ 3|  ZZ 3|
      |(---) |(---) |
      | 101  | 101  |
      |      |      |
      |{0, 0}|{1, 0}|
      +------+------+

o11 : SpectralSequencePage

i12 : E^1 .dd

o12 = {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {0, -1} : 0 <----- 0 : {1, -1}
                     0

                 ZZ 3                     ZZ 3
      {0, 0} : (---)  <---------------- (---)  : {1, 0}
                101      | 1  1  0  |    101
                         | -1 0  1  |
                         | 0  -1 -1 |

                 ZZ 3                     ZZ 3
      {0, 1} : (---)  <---------------- (---)  : {1, 1}
                101      | -1 0  -1 |    101
                         | 1  -1 0  |
                         | 0  1  1  |

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           ZZ 3
      {-1, 0} : 0 <----- (---)  : {0, 0}
                     0    101

                           ZZ 3
      {-1, 1} : 0 <----- (---)  : {0, 1}
                     0    101

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o12 : SpectralSequencePageMap

i13 : E^2

      +------+------+
      |  ZZ 1|  ZZ 1|
o13 = |(---) |(---) |
      | 101  | 101  |
      |      |      |
      |{0, 1}|{1, 1}|
      +------+------+
      |  ZZ 1|  ZZ 1|
      |(---) |(---) |
      | 101  | 101  |
      |      |      |
      |{0, 0}|{1, 0}|
      +------+------+

o13 : SpectralSequencePage

i14 : 
