-- -*- M2-comint -*- hash: 695910904

i1 : R = QQ[x,y,z,w];

i2 : a = simplicialComplex {x*y*z, x*y, y*z, w*z}

o2 = simplicialComplex | zw xyz |

o2 : SimplicialComplex

i3 : b = simplicialComplex {x*y, w}

o3 = simplicialComplex | w xy |

o3 : SimplicialComplex

i4 : c = simplicialComplex {x,w}

o4 = simplicialComplex | w x |

o4 : SimplicialComplex

i5 : K = filteredComplex{a,b,c}

o5 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                               
          -1          0           1           2

     0 : image | 1 | <-- image | 1 0 | <-- image 0 <-- image 0
                               | 0 0 |                  
         -1                    | 0 0 |     1           2
                               | 0 1 |
                          
                         0

     1 : image | 1 | <-- image | 1 0 0 | <-- image | 1 | <-- image 0
                               | 0 1 0 |           | 0 |      
         -1                    | 0 0 0 |           | 0 |     2
                               | 0 0 1 |           | 0 |
                                              
                         0                   1

           1       4       4       1
     2 : QQ  <-- QQ  <-- QQ  <-- QQ
                                  
         -1      0       1       2

o5 : FilteredComplex

i6 : E = spectralSequence K

o6 = E

o6 : SpectralSequence

i7 : E^0

     +-----------------------------+----------------------------------------+---------------------+
     |                             |                                        |  1                  |
o7 = |image | 1 0 0 0 0 0 0 0 0 0 ||image | 1 |                             |QQ                   |
     |      | 0 0 0 0 0 0 0 0 0 0 ||      | 0 |                             |                     |
     |      | 0 0 0 0 0 0 0 0 0 0 ||      | 0 |                             |{2, 0}               |
     |      | 0 1 0 0 0 0 0 0 0 0 ||      | 0 |                             |                     |
     |                             |                                        |                     |
     |{0, 0}                       |{1, 0}                                  |                     |
     +-----------------------------+----------------------------------------+---------------------+
     |image | 1 0 0 0 0 0 |        |subquotient (| 1 0 0 1 0 |, | 1 0 |)    |cokernel | 1 |       |
     |                             |             | 0 1 0 0 0 |  | 0 0 |     |         | 0 |       |
     |{0, -1}                      |             | 0 0 0 0 0 |  | 0 0 |     |         | 0 |       |
     |                             |             | 0 0 1 0 1 |  | 0 1 |     |         | 0 |       |
     |                             |                                        |                     |
     |                             |{1, -1}                                 |{2, -1}              |
     +-----------------------------+----------------------------------------+---------------------+
     |0                            |subquotient (| 1 -1 -1 1 |, | -1 -1 1 |)|cokernel | 1  1 0 0 ||
     |                             |                                        |         | -1 0 1 0 ||
     |{0, -2}                      |{1, -2}                                 |         | 0  0 0 0 ||
     |                             |                                        |         | 0  0 0 1 ||
     |                             |                                        |                     |
     |                             |                                        |{2, -2}              |
     +-----------------------------+----------------------------------------+---------------------+

o7 : SpectralSequencePage

i8 : F0 = minimalPresentation(E^0)

     +-------+-------+-------+
     |  2    |  1    |  1    |
o8 = |QQ     |QQ     |QQ     |
     |       |       |       |
     |{0, 0} |{1, 0} |{2, 0} |
     +-------+-------+-------+
     |  1    |  1    |  3    |
     |QQ     |QQ     |QQ     |
     |       |       |       |
     |{0, -1}|{1, -1}|{2, -1}|
     +-------+-------+-------+
     |       |       |  1    |
     |0      |0      |QQ     |
     |       |       |       |
     |{0, -2}|{1, -2}|{2, -2}|
     +-------+-------+-------+

o8 : SpectralSequencePage

i9 : E^0 .dd

o9 = {-1, 0} : image 0 <----- image 0 : {-1, 1}
                          0

     {-1, 1} : image 0 <----- image 0 : {-1, 2}
                          0

     {-1, 2} : image 0 <----- image 0 : {-1, 3}
                          0

     {2, -4} : 0 <----- cokernel | -1 -1 -1 1 | : {2, -3}
                    0

     {2, -3} : cokernel | -1 -1 -1 1 | <----- cokernel | 1  1 0 0 | : {2, -2}
                                          0            | -1 0 1 0 |
                                                       | 0  0 0 0 |
                                                       | 0  0 0 1 |

     {2, -2} : cokernel | 1  1 0 0 | <----------------- cokernel | 1 | : {2, -1}
                        | -1 0 1 0 |    | 0 0  0  0 |            | 0 |
                        | 0  0 0 0 |    | 0 0  0  0 |            | 0 |
                        | 0  0 0 1 |    | 0 -1 -1 1 |            | 0 |
                                        | 0 0  0  0 |

                                            1
     {2, -1} : cokernel | 1 | <---------- QQ  : {2, 0}
                        | 0 |    | 0  |
                        | 0 |    | 1  |
                        | 0 |    | -1 |
                                 | 0  |

     {1, -3} : 0 <----- subquotient (| 1 -1 -1 1 |, | -1 -1 1 |) : {1, -2}
                    0

     {1, -2} : subquotient (| 1 -1 -1 1 |, | -1 -1 1 |) <----- subquotient (| 1 0 0 1 0 |, | 1 0 |) : {1, -1}
                                                           0                | 0 1 0 0 0 |  | 0 0 |
                                                                            | 0 0 0 0 0 |  | 0 0 |
                                                                            | 0 0 1 0 1 |  | 0 1 |

     {1, -1} : subquotient (| 1 0 0 1 0 |, | 1 0 |) <---------- image | 1 | : {1, 0}
                            | 0 1 0 0 0 |  | 0 0 |     | 0  |         | 0 |
                            | 0 0 0 0 0 |  | 0 0 |     | -1 |         | 0 |
                            | 0 0 1 0 1 |  | 0 1 |     | 0  |         | 0 |
                                                       | 0  |
                                                       | 0  |

     {1, 0} : image | 1 | <----- image 0 : {1, 1}
                    | 0 |    0
                    | 0 |
                    | 0 |

     {0, -2} : 0 <----- image | 1 0 0 0 0 0 | : {0, -1}
                    0

     {0, -1} : image | 1 0 0 0 0 0 | <----------------------------- image | 1 0 0 0 0 0 0 0 0 0 | : {0, 0}
                                        | -1 -1 0 0 0 0 0 0 0 0 |         | 0 0 0 0 0 0 0 0 0 0 |
                                        | 0  0  0 0 0 0 0 0 0 0 |         | 0 0 0 0 0 0 0 0 0 0 |
                                        | 0  0  0 0 0 0 0 0 0 0 |         | 0 1 0 0 0 0 0 0 0 0 |
                                        | 0  0  0 0 0 0 0 0 0 0 |
                                        | 0  0  0 0 0 0 0 0 0 0 |
                                        | 0  0  0 0 0 0 0 0 0 0 |

     {0, 0} : image | 1 0 0 0 0 0 0 0 0 0 | <----- image 0 : {0, 1}
                    | 0 0 0 0 0 0 0 0 0 0 |    0
                    | 0 0 0 0 0 0 0 0 0 0 |
                    | 0 1 0 0 0 0 0 0 0 0 |

     {0, 1} : image 0 <----- image 0 : {0, 2}
                         0

     {-1, -1} : 0 <----- image 0 : {-1, 0}
                     0

o9 : SpectralSequencePageMap

i10 : F0.dd

o10 = {-1, 0} : 0 <----- 0 : {-1, 1}
                     0

      {-1, 1} : 0 <----- 0 : {-1, 2}
                     0

      {-1, 2} : 0 <----- 0 : {-1, 3}
                     0

      {2, -4} : 0 <----- 0 : {2, -3}
                     0

                           1
      {2, -3} : 0 <----- QQ  : {2, -2}
                     0

                  1                    3
      {2, -2} : QQ  <--------------- QQ  : {2, -1}
                       | -1 -1 1 |

                  3               1
      {2, -1} : QQ  <---------- QQ  : {2, 0}
                       | 1  |
                       | -1 |
                       | 0  |

      {1, -3} : 0 <----- 0 : {1, -2}
                     0

                           1
      {1, -2} : 0 <----- QQ  : {1, -1}
                     0

                  1               1
      {1, -1} : QQ  <---------- QQ  : {1, 0}
                       | -1 |

                 1
      {1, 0} : QQ  <----- 0 : {1, 1}
                      0

                           1
      {0, -2} : 0 <----- QQ  : {0, -1}
                     0

                  1                  2
      {0, -1} : QQ  <------------- QQ  : {0, 0}
                       | -1 -1 |

                 2
      {0, 0} : QQ  <----- 0 : {0, 1}
                      0

      {0, 1} : 0 <----- 0 : {0, 2}
                    0

      {-1, -1} : 0 <----- 0 : {-1, 0}
                      0

o10 : SpectralSequencePageMap

i11 : E^1

      +----------------------------------------+------------------------------------------+---------------------------------------+
o11 = |image | -1 0 0 0 0 |                    |image 0                                   |image 0                                |
      |      | 0  0 0 0 0 |                    |                                          |                                       |
      |      | 0  0 0 0 0 |                    |{1, 0}                                    |{2, 0}                                 |
      |      | 1  0 0 0 0 |                    |                                          |                                       |
      |                                        |                                          |                                       |
      |{0, 0}                                  |                                          |                                       |
      +----------------------------------------+------------------------------------------+---------------------------------------+
      |subquotient (| 1 -1 -1 0 |, | -1 -1 0 |)|subquotient (| 1 0 0 1  1 0 |, | 1  1 0 |)|subquotient (| 1 0  0 -1 1 |, | -1 1 |)|
      |                                        |             | 0 1 0 -1 0 0 |  | -1 0 0 | |             | 0 -1 1 1  0 |  | 1  0 | |
      |{0, -1}                                 |             | 0 0 0 0  0 0 |  | 0  0 0 | |             | 0 1  0 -1 0 |  | -1 0 | |
      |                                        |             | 0 0 1 0  0 1 |  | 0  0 1 | |             | 0 0  1 0  0 |  | 0  0 | |
      |                                        |                                          |                                       |
      |                                        |{1, -1}                                   |{2, -1}                                |
      +----------------------------------------+------------------------------------------+---------------------------------------+

o11 : SpectralSequencePage

i12 : F1 = minimalPresentation(E^1)

      +-------+-------+-------+
      |  1    |       |       |
o12 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o12 : SpectralSequencePage

i13 : E^1 .dd

o13 = {-2, 1} : image 0 <----- image 0 : {-1, 1}
                           0

      {-2, 2} : image 0 <----- image 0 : {-1, 2}
                           0

      {-2, 3} : image 0 <----- image 0 : {-1, 3}
                           0

      {1, -3} : 0 <----- cokernel | -1 -1 -1 -1 1 | : {2, -3}
                     0

      {1, -2} : subquotient (| 1 -1 -1 -1 1 |, | -1 -1 -1 1 |) <----- cokernel | 1  1  0  0  1 0 0 | : {2, -2}
                                                                  0            | -1 0  1  0  0 1 0 |
                                                                               | 0  -1 -1 1  0 0 0 |
                                                                               | 0  0  0  -1 0 0 1 |

      {1, -1} : subquotient (| 1 0 0 1  1 0 |, | 1  1 0 |) <----- subquotient (| 1 0  0 -1 1 |, | -1 1 |) : {2, -1}
                             | 0 1 0 -1 0 0 |  | -1 0 0 |     0                | 0 -1 1 1  0 |  | 1  0 |
                             | 0 0 0 0  0 0 |  | 0  0 0 |                      | 0 1  0 -1 0 |  | -1 0 |
                             | 0 0 1 0  0 1 |  | 0  0 1 |                      | 0 0  1 0  0 |  | 0  0 |

      {1, 0} : image 0 <----- image 0 : {2, 0}
                          0

      {0, -2} : 0 <----- subquotient (| 1 -1 -1 -1 1 |, | -1 -1 -1 1 |) : {1, -2}
                     0

      {0, -1} : subquotient (| 1 -1 -1 0 |, | -1 -1 0 |) <----- subquotient (| 1 0 0 1  1 0 |, | 1  1 0 |) : {1, -1}
                                                            0                | 0 1 0 -1 0 0 |  | -1 0 0 |
                                                                             | 0 0 0 0  0 0 |  | 0  0 0 |
                                                                             | 0 0 1 0  0 1 |  | 0  0 1 |

      {0, 0} : image | -1 0 0 0 0 | <----- image 0 : {1, 0}
                     | 0  0 0 0 0 |    0
                     | 0  0 0 0 0 |
                     | 1  0 0 0 0 |

      {0, 1} : image 0 <----- image 0 : {1, 1}
                          0

      {-1, -1} : 0 <----- subquotient (| 1 -1 -1 0 |, | -1 -1 0 |) : {0, -1}
                      0

      {-1, 0} : image 0 <----- image | -1 0 0 0 0 | : {0, 0}
                           0         | 0  0 0 0 0 |
                                     | 0  0 0 0 0 |
                                     | 1  0 0 0 0 |

      {-1, 1} : image 0 <----- image 0 : {0, 1}
                           0

      {-1, 2} : image 0 <----- image 0 : {0, 2}
                           0

      {-2, 0} : 0 <----- image 0 : {-1, 0}
                     0

o13 : SpectralSequencePageMap

i14 : F1.dd

o14 = {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {1, -3} : 0 <----- 0 : {2, -3}
                     0

      {1, -2} : 0 <----- 0 : {2, -2}
                     0

                           1
      {1, -1} : 0 <----- QQ  : {2, -1}
                     0

      {1, 0} : 0 <----- 0 : {2, 0}
                    0

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {0, -1} : 0 <----- 0 : {1, -1}
                     0

                 1
      {0, 0} : QQ  <----- 0 : {1, 0}
                      0

      {0, 1} : 0 <----- 0 : {1, 1}
                    0

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           1
      {-1, 0} : 0 <----- QQ  : {0, 0}
                     0

      {-1, 1} : 0 <----- 0 : {0, 1}
                     0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o14 : SpectralSequencePageMap

i15 : E^2

      +-----------------------------------------------+------------------------------------------------------------+-------------------------------------+
o15 = |subquotient (| -1 1  0 0 0 0 |, | 1  0 0 0 0 |)|subquotient (| -1 |, | -1 |)                                |image 0                              |
      |             | 0  -1 0 0 0 0 |  | -1 0 0 0 0 | |             | 1  |  | 1  |                                 |                                     |
      |             | 0  0  0 0 0 0 |  | 0  0 0 0 0 | |             | -1 |  | -1 |                                 |{2, 0}                               |
      |             | 1  0  0 0 0 0 |  | 0  0 0 0 0 | |             | 0  |  | 0  |                                 |                                     |
      |                                               |                                                            |                                     |
      |{0, 0}                                         |{1, 0}                                                      |                                     |
      +-----------------------------------------------+------------------------------------------------------------+-------------------------------------+
      |subquotient (| 1 -1 -1 -1 0 |, | -1 -1 -1 0 |) |subquotient (| -1 -1 1  1  0  0  1 0 |, | 1  1  0  0  1 0 |)|subquotient (| 1  0 -1 1 |, | -1 1 |)|
      |                                               |             | 1  0  -1 0  1  0  0 0 |  | -1 0  1  0  0 0 | |             | -1 1 1  0 |  | 1  0 | |
      |{0, -1}                                        |             | 0  0  0  -1 -1 1  0 0 |  | 0  -1 -1 1  0 0 | |             | 1  0 -1 0 |  | -1 0 | |
      |                                               |             | 0  1  0  0  0  -1 0 1 |  | 0  0  0  -1 0 1 | |             | 0  1 0  0 |  | 0  0 | |
      |                                               |                                                            |                                     |
      |                                               |{1, -1}                                                     |{2, -1}                              |
      +-----------------------------------------------+------------------------------------------------------------+-------------------------------------+

o15 : SpectralSequencePage

i16 : F2 = minimalPresentation(E^2)

      +-------+-------+-------+
      |  1    |       |       |
o16 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o16 : SpectralSequencePage

i17 : E^2 .dd

o17 = {-3, 2} : image 0 <----- image 0 : {-1, 1}
                           0

      {-3, 3} : image 0 <----- image 0 : {-1, 2}
                           0

      {-3, 4} : image 0 <----- image 0 : {-1, 3}
                           0

      {0, -2} : 0 <----- cokernel | -1 -1 -1 -1 1 | : {2, -3}
                     0

      {0, -1} : subquotient (| 1 -1 -1 -1 0 |, | -1 -1 -1 0 |) <----- cokernel | 1  1  0  0  1 0 0 | : {2, -2}
                                                                  0            | -1 0  1  0  0 1 0 |
                                                                               | 0  -1 -1 1  0 0 0 |
                                                                               | 0  0  0  -1 0 0 1 |

      {0, 0} : subquotient (| -1 1  0 0 0 0 |, | 1  0 0 0 0 |) <---------------- subquotient (| 1  0 -1 1 |, | -1 1 |) : {2, -1}
                            | 0  -1 0 0 0 0 |  | -1 0 0 0 0 |     | 0 -1 0 0 |                | -1 1 1  0 |  | 1  0 |
                            | 0  0  0 0 0 0 |  | 0  0 0 0 0 |     | 0 0  0 0 |                | 1  0 -1 0 |  | -1 0 |
                            | 1  0  0 0 0 0 |  | 0  0 0 0 0 |     | 0 0  0 0 |                | 0  1 0  0 |  | 0  0 |
                                                                  | 0 0  0 0 |
                                                                  | 0 0  0 0 |
                                                                  | 0 0  0 0 |

      {0, 1} : image 0 <----- image 0 : {2, 0}
                          0

      {-1, -1} : 0 <----- subquotient (| 1 -1 -1 -1 -1 1 |, | -1 -1 -1 -1 1 |) : {1, -2}
                      0

      {-1, 0} : subquotient (| 0 -1 -1 0 |, | -1 -1 0 |) <----- subquotient (| -1 -1 1  1  0  0  1 0 |, | 1  1  0  0  1 0 |) : {1, -1}
                                                            0                | 1  0  -1 0  1  0  0 0 |  | -1 0  1  0  0 0 |
                                                                             | 0  0  0  -1 -1 1  0 0 |  | 0  -1 -1 1  0 0 |
                                                                             | 0  1  0  0  0  -1 0 1 |  | 0  0  0  -1 0 1 |

      {-1, 1} : image 0 <----- subquotient (| -1 |, | -1 |) : {1, 0}
                           0                | 1  |  | 1  |
                                            | -1 |  | -1 |
                                            | 0  |  | 0  |

      {-1, 2} : image 0 <----- image 0 : {1, 1}
                           0

      {-2, 0} : 0 <----- subquotient (| 1 -1 -1 -1 0 |, | -1 -1 -1 0 |) : {0, -1}
                     0

      {-2, 1} : image 0 <----- subquotient (| -1 1  0 0 0 0 |, | 1  0 0 0 0 |) : {0, 0}
                           0                | 0  -1 0 0 0 0 |  | -1 0 0 0 0 |
                                            | 0  0  0 0 0 0 |  | 0  0 0 0 0 |
                                            | 1  0  0 0 0 0 |  | 0  0 0 0 0 |

      {-2, 2} : image 0 <----- image 0 : {0, 1}
                           0

      {-2, 3} : image 0 <----- image 0 : {0, 2}
                           0

      {-3, 1} : 0 <----- subquotient (| 0 -1 -1 0 |, | -1 -1 0 |) : {-1, 0}
                     0

o17 : SpectralSequencePageMap

i18 : F2.dd

o18 = {-3, 2} : 0 <----- 0 : {-1, 1}
                     0

      {-3, 3} : 0 <----- 0 : {-1, 2}
                     0

      {-3, 4} : 0 <----- 0 : {-1, 3}
                     0

      {0, -2} : 0 <----- 0 : {2, -3}
                     0

      {0, -1} : 0 <----- 0 : {2, -2}
                     0

                 1               1
      {0, 0} : QQ  <---------- QQ  : {2, -1}
                      | -1 |

      {0, 1} : 0 <----- 0 : {2, 0}
                    0

      {-1, -1} : 0 <----- 0 : {1, -2}
                      0

      {-1, 0} : 0 <----- 0 : {1, -1}
                     0

      {-1, 1} : 0 <----- 0 : {1, 0}
                     0

      {-1, 2} : 0 <----- 0 : {1, 1}
                     0

      {-2, 0} : 0 <----- 0 : {0, -1}
                     0

                           1
      {-2, 1} : 0 <----- QQ  : {0, 0}
                     0

      {-2, 2} : 0 <----- 0 : {0, 1}
                     0

      {-2, 3} : 0 <----- 0 : {0, 2}
                     0

      {-3, 1} : 0 <----- 0 : {-1, 0}
                     0

o18 : SpectralSequencePageMap

i19 : E^infinity

o19 = ++
      ++

o19 : Page

i20 : (prune E) ^infinity

o20 = ++
      ++

o20 : Page

i21 : J = filteredComplex({a,b,c}, ReducedHomology => false)

o21 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                                
           -1          0           1           2

      0 : image 0 <-- image | 1 0 | <-- image 0 <-- image 0
                            | 0 0 |                  
          -1                | 0 0 |     1           2
                            | 0 1 |
                       
                      0

      1 : image 0 <-- image | 1 0 0 | <-- image | 1 | <-- image 0
                            | 0 1 0 |           | 0 |      
          -1                | 0 0 0 |           | 0 |     2
                            | 0 0 1 |           | 0 |
                                           
                      0                   1

                        4       4       1
      2 : image 0 <-- QQ  <-- QQ  <-- QQ
                                       
          -1          0       1       2

o21 : FilteredComplex

i22 : D = spectralSequence J

o22 = D

o22 : SpectralSequence

i23 : D^0

      +-----------------------------+------------------------------------+---------------------+
      |                             |                                    |  1                  |
o23 = |image | 1 0 0 0 0 0 0 0 0 0 ||image | 1 |                         |QQ                   |
      |      | 0 0 0 0 0 0 0 0 0 0 ||      | 0 |                         |                     |
      |      | 0 0 0 0 0 0 0 0 0 0 ||      | 0 |                         |{2, 0}               |
      |      | 0 1 0 0 0 0 0 0 0 0 ||      | 0 |                         |                     |
      |                             |                                    |                     |
      |{0, 0}                       |{1, 0}                              |                     |
      +-----------------------------+------------------------------------+---------------------+
      |image 0                      |subquotient (| 1 0 0 1 0 |, | 1 0 |)|cokernel | 1 |       |
      |                             |             | 0 1 0 0 0 |  | 0 0 | |         | 0 |       |
      |{0, -1}                      |             | 0 0 0 0 0 |  | 0 0 | |         | 0 |       |
      |                             |             | 0 0 1 0 1 |  | 0 1 | |         | 0 |       |
      |                             |                                    |                     |
      |                             |{1, -1}                             |{2, -1}              |
      +-----------------------------+------------------------------------+---------------------+
      |0                            |image 0                             |cokernel | 1  1 0 0 ||
      |                             |                                    |         | -1 0 1 0 ||
      |{0, -2}                      |{1, -2}                             |         | 0  0 0 0 ||
      |                             |                                    |         | 0  0 0 1 ||
      |                             |                                    |                     |
      |                             |                                    |{2, -2}              |
      +-----------------------------+------------------------------------+---------------------+

o23 : SpectralSequencePage

i24 : G0 = minimalPresentation(D^0)

      +-------+-------+-------+
      |  2    |  1    |  1    |
o24 = |QQ     |QQ     |QQ     |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |  1    |  3    |
      |0      |QQ     |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -2}|{1, -2}|{2, -2}|
      +-------+-------+-------+

o24 : SpectralSequencePage

i25 : G0.dd

o25 = {-1, 0} : 0 <----- 0 : {-1, 1}
                     0

      {-1, 1} : 0 <----- 0 : {-1, 2}
                     0

      {-1, 2} : 0 <----- 0 : {-1, 3}
                     0

      {2, -4} : 0 <----- 0 : {2, -3}
                     0

                           1
      {2, -3} : 0 <----- QQ  : {2, -2}
                     0

                  1                    3
      {2, -2} : QQ  <--------------- QQ  : {2, -1}
                       | -1 -1 1 |

                  3               1
      {2, -1} : QQ  <---------- QQ  : {2, 0}
                       | 1  |
                       | -1 |
                       | 0  |

      {1, -3} : 0 <----- 0 : {1, -2}
                     0

                           1
      {1, -2} : 0 <----- QQ  : {1, -1}
                     0

                  1               1
      {1, -1} : QQ  <---------- QQ  : {1, 0}
                       | -1 |

                 1
      {1, 0} : QQ  <----- 0 : {1, 1}
                      0

      {0, -2} : 0 <----- 0 : {0, -1}
                     0

                           2
      {0, -1} : 0 <----- QQ  : {0, 0}
                     0

                 2
      {0, 0} : QQ  <----- 0 : {0, 1}
                      0

      {0, 1} : 0 <----- 0 : {0, 2}
                    0

      {-1, -1} : 0 <----- 0 : {-1, 0}
                      0

o25 : SpectralSequencePageMap

i26 : D^1

      +---------------------+------------------------------------------+---------------------------------------+
o26 = |image | 1 0 0 0 0 0 ||image 0                                   |image 0                                |
      |      | 0 0 0 0 0 0 ||                                          |                                       |
      |      | 0 0 0 0 0 0 ||{1, 0}                                    |{2, 0}                                 |
      |      | 0 1 0 0 0 0 ||                                          |                                       |
      |                     |                                          |                                       |
      |{0, 0}               |                                          |                                       |
      +---------------------+------------------------------------------+---------------------------------------+
      |image 0              |subquotient (| 1 0 0 1  1 0 |, | 1  1 0 |)|subquotient (| 1 0  0 -1 1 |, | -1 1 |)|
      |                     |             | 0 1 0 -1 0 0 |  | -1 0 0 | |             | 0 -1 1 1  0 |  | 1  0 | |
      |{0, -1}              |             | 0 0 0 0  0 0 |  | 0  0 0 | |             | 0 1  0 -1 0 |  | -1 0 | |
      |                     |             | 0 0 1 0  0 1 |  | 0  0 1 | |             | 0 0  1 0  0 |  | 0  0 | |
      |                     |                                          |                                       |
      |                     |{1, -1}                                   |{2, -1}                                |
      +---------------------+------------------------------------------+---------------------------------------+

o26 : SpectralSequencePage

i27 : G1 = minimalPresentation(D^1)

      +-------+-------+-------+
      |  2    |       |       |
o27 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o27 : SpectralSequencePage

i28 : G1.dd

o28 = {-2, 1} : 0 <----- 0 : {-1, 1}
                     0

      {-2, 2} : 0 <----- 0 : {-1, 2}
                     0

      {-2, 3} : 0 <----- 0 : {-1, 3}
                     0

      {1, -3} : 0 <----- 0 : {2, -3}
                     0

      {1, -2} : 0 <----- 0 : {2, -2}
                     0

                           1
      {1, -1} : 0 <----- QQ  : {2, -1}
                     0

      {1, 0} : 0 <----- 0 : {2, 0}
                    0

      {0, -2} : 0 <----- 0 : {1, -2}
                     0

      {0, -1} : 0 <----- 0 : {1, -1}
                     0

                 2
      {0, 0} : QQ  <----- 0 : {1, 0}
                      0

      {0, 1} : 0 <----- 0 : {1, 1}
                    0

      {-1, -1} : 0 <----- 0 : {0, -1}
                      0

                           2
      {-1, 0} : 0 <----- QQ  : {0, 0}
                     0

      {-1, 1} : 0 <----- 0 : {0, 1}
                     0

      {-1, 2} : 0 <----- 0 : {0, 2}
                     0

      {-2, 0} : 0 <----- 0 : {-1, 0}
                     0

o28 : SpectralSequencePageMap

i29 : D^2

      +------------------------------------------------+------------------------------------------------------------+-------------------------------------+
o29 = |subquotient (| 1 0 1  0 0 0 0 |, | 1  0 0 0 0 |)|subquotient (| -1 |, | -1 |)                                |image 0                              |
      |             | 0 0 -1 0 0 0 0 |  | -1 0 0 0 0 | |             | 1  |  | 1  |                                 |                                     |
      |             | 0 0 0  0 0 0 0 |  | 0  0 0 0 0 | |             | -1 |  | -1 |                                 |{2, 0}                               |
      |             | 0 1 0  0 0 0 0 |  | 0  0 0 0 0 | |             | 0  |  | 0  |                                 |                                     |
      |                                                |                                                            |                                     |
      |{0, 0}                                          |{1, 0}                                                      |                                     |
      +------------------------------------------------+------------------------------------------------------------+-------------------------------------+
      |image 0                                         |subquotient (| 1 0 0 1  1  0  0  1 0 |, | 1  1  0  0  1 0 |)|subquotient (| 1  0 -1 1 |, | -1 1 |)|
      |                                                |             | 0 1 0 -1 0  1  0  0 0 |  | -1 0  1  0  0 0 | |             | -1 1 1  0 |  | 1  0 | |
      |{0, -1}                                         |             | 0 0 0 0  -1 -1 1  0 0 |  | 0  -1 -1 1  0 0 | |             | 1  0 -1 0 |  | -1 0 | |
      |                                                |             | 0 0 1 0  0  0  -1 0 1 |  | 0  0  0  -1 0 1 | |             | 0  1 0  0 |  | 0  0 | |
      |                                                |                                                            |                                     |
      |                                                |{1, -1}                                                     |{2, -1}                              |
      +------------------------------------------------+------------------------------------------------------------+-------------------------------------+

o29 : SpectralSequencePage

i30 : G2 = minimalPresentation(D^2)

      +-------+-------+-------+
      |  2    |       |       |
o30 = |QQ     |0      |0      |
      |       |       |       |
      |{0, 0} |{1, 0} |{2, 0} |
      +-------+-------+-------+
      |       |       |  1    |
      |0      |0      |QQ     |
      |       |       |       |
      |{0, -1}|{1, -1}|{2, -1}|
      +-------+-------+-------+

o30 : SpectralSequencePage

i31 : G2.dd

o31 = {-3, 2} : 0 <----- 0 : {-1, 1}
                     0

      {-3, 3} : 0 <----- 0 : {-1, 2}
                     0

      {-3, 4} : 0 <----- 0 : {-1, 3}
                     0

      {0, -2} : 0 <----- 0 : {2, -3}
                     0

      {0, -1} : 0 <----- 0 : {2, -2}
                     0

                 2               1
      {0, 0} : QQ  <---------- QQ  : {2, -1}
                      | 1  |
                      | -1 |

      {0, 1} : 0 <----- 0 : {2, 0}
                    0

      {-1, -1} : 0 <----- 0 : {1, -2}
                      0

      {-1, 0} : 0 <----- 0 : {1, -1}
                     0

      {-1, 1} : 0 <----- 0 : {1, 0}
                     0

      {-1, 2} : 0 <----- 0 : {1, 1}
                     0

      {-2, 0} : 0 <----- 0 : {0, -1}
                     0

                           2
      {-2, 1} : 0 <----- QQ  : {0, 0}
                     0

      {-2, 2} : 0 <----- 0 : {0, 1}
                     0

      {-2, 3} : 0 <----- 0 : {0, 2}
                     0

      {-3, 1} : 0 <----- 0 : {-1, 0}
                     0

o31 : SpectralSequencePageMap

i32 : D^infinity

      +------------------------------------------------------------------+
o32 = |subquotient (| 1 0 1  1  0  0  0 0 0 0 |, | 1  1  0  0  0 0 0 0 |)|
      |             | 0 0 -1 0  1  0  0 0 0 0 |  | -1 0  1  0  0 0 0 0 | |
      |             | 0 0 0  -1 -1 1  0 0 0 0 |  | 0  -1 -1 1  0 0 0 0 | |
      |             | 0 1 0  0  0  -1 0 0 0 0 |  | 0  0  0  -1 0 0 0 0 | |
      |                                                                  |
      |{0, 0}                                                            |
      +------------------------------------------------------------------+

o32 : Page

i33 : 
