-- -*- M2-comint -*- hash: 1504646163

i1 : A = QQ[a,b,c,d];

i2 : D = simplicialComplex {a*d*c, a*b, a*c, b*c};

i3 : F2D = D;

i4 : F1D = simplicialComplex {a*c, d};

i5 : F0D = simplicialComplex {a,d};

i6 : K = filteredComplex {F2D, F1D, F0D};

i7 : E = spectralSequence(K) ;

i8 : C = filteredComplex E

o8 = -1 : image 0 <-- image 0 <-- image 0 <-- image 0
                                               
          -1          0           1           2

     0 : image | 1 | <-- image | 1 0 | <-- image 0 <-- image 0
                               | 0 0 |                  
         -1                    | 0 0 |     1           2
                               | 0 1 |
                          
                         0

     1 : image | 1 | <-- image | 1 0 0 | <-- image | 0 | <-- image 0
                               | 0 0 0 |           | 1 |      
         -1                    | 0 1 0 |           | 0 |     2
                               | 0 0 1 |           | 0 |
                                                   | 0 |
                         0                    
                                             1

           1       4       5       1
     2 : QQ  <-- QQ  <-- QQ  <-- QQ
                                  
         -1      0       1       2

o8 : FilteredComplex

i9 : 
