-- -*- M2-comint -*- hash: -1630722227

i1 : R = QQ[x];

i2 : S = R/ideal"x2";

i3 : N = S^1/ideal"x";

i4 : M = R^1/R_0;

i5 : C = res M;

i6 : C' = C ** S;

i7 : D = res(N,LengthLimit => 10);

i8 : E0 = C' ** (filteredComplex D);

i9 : E = prune spectralSequence E0;

i10 : R = QQ[x];

i11 : S = R/ideal"x2";

i12 : N = S^1/ideal"x";

i13 : M = R^1/R_0;

i14 : C = res M;

i15 : C' = C ** S;

i16 : D = res(N,LengthLimit => 10);

i17 : E0 = C' ** (filteredComplex D);

i18 : E = prune spectralSequence E0;

i19 : netPage(E_2,{-5,0},{7,1})

      +------------------+------------------+------------------+------------------+------------------+------------------+------------------+------------------+
o19 = |cokernel {2} | x ||cokernel {3} | x ||cokernel {4} | x ||cokernel {5} | x ||cokernel {6} | x ||cokernel {7} | x ||cokernel {8} | x ||cokernel {9} | x ||
      |                  |                  |                  |                  |                  |                  |                  |                  |
      |{0, 1}            |{1, 1}            |{2, 1}            |{3, 1}            |{4, 1}            |{5, 1}            |{6, 1}            |{7, 1}            |
      +------------------+------------------+------------------+------------------+------------------+------------------+------------------+------------------+
      |cokernel | x |    |cokernel {1} | x ||cokernel {2} | x ||cokernel {3} | x ||cokernel {4} | x ||cokernel {5} | x ||cokernel {6} | x ||cokernel {7} | x ||
      |                  |                  |                  |                  |                  |                  |                  |                  |
      |{0, 0}            |{1, 0}            |{2, 0}            |{3, 0}            |{4, 0}            |{5, 0}            |{6, 0}            |{7, 0}            |
      +------------------+------------------+------------------+------------------+------------------+------------------+------------------+------------------+

i20 : 
