-- -*- M2-comint -*- hash: -1726740473

i1 : coneFromVData matrix {{0,0,-1,-1,1},{2,-2,1,-1,0},{1,1,1,1,0}}

o1 = Cone{...1...}

o1 : Cone

i2 : R = matrix{{1,2,3,1},{2,3,1,1},{3,1,2,1}}

o2 = | 1 2 3 1 |
     | 2 3 1 1 |
     | 3 1 2 1 |

              3        4
o2 : Matrix ZZ  <--- ZZ

i3 : C = coneFromVData R

o3 = C

o3 : Cone

i4 : rays C

o4 = | 2 3 1 |
     | 3 1 2 |
     | 1 2 3 |

              3        3
o4 : Matrix ZZ  <--- ZZ

i5 : LS = matrix{{1},{1},{-2}}

o5 = | 1  |
     | 1  |
     | -2 |

              3        1
o5 : Matrix ZZ  <--- ZZ

i6 : C = coneFromVData(R,LS)

o6 = C

o6 : Cone

i7 : rays C

o7 = | 0  0 |
     | -1 1 |
     | 4  5 |

              3        2
o7 : Matrix ZZ  <--- ZZ

i8 : HS = transpose R

o8 = | 1 2 3 |
     | 2 3 1 |
     | 3 1 2 |
     | 1 1 1 |

              4        3
o8 : Matrix ZZ  <--- ZZ

i9 : C = coneFromHData HS

o9 = C

o9 : Cone

i10 : rays C

o10 = | 1  7  -5 |
      | 7  -5 1  |
      | -5 1  7  |

               3        3
o10 : Matrix ZZ  <--- ZZ

i11 : hyperplanesTmp = transpose LS

o11 = | 1 1 -2 |

               1        3
o11 : Matrix ZZ  <--- ZZ

i12 : C = coneFromHData(HS,hyperplanesTmp)

o12 = C

o12 : Cone

i13 : rays C

o13 = | 7  -2 |
      | -5 4  |
      | 1  1  |

               3        2
o13 : Matrix ZZ  <--- ZZ

i14 : 
