-- -*- M2-comint -*- hash: 749520059

i1 : V = matrix {{0,2,-2,0},{-1,1,1,1}}

o1 = | 0  2 -2 0 |
     | -1 1 1  1 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : P = convexHull V

o2 = P

o2 : Polyhedron

i3 : vertices P

o3 = | 0  -2 2 |
     | -1 1  1 |

              2        3
o3 : Matrix QQ  <--- QQ

i4 : (HS,v) = facets P

o4 = (| -1 -1 |, | 1 |)
      | 1  -1 |  | 1 |
      | 0  1  |  | 1 |

o4 : Sequence

i5 : hyperplanes P

o5 = (0, 0)

o5 : Sequence

i6 : isFullDimensional P

o6 = true

i7 : ambDim P

o7 = 2

i8 : dim P

o8 = 2

i9 : rays P

o9 = 0

              2
o9 : Matrix QQ  <--- 0

i10 : linealitySpace P

o10 = 0

               2
o10 : Matrix QQ  <--- 0

i11 : C = cone P

o11 = C

o11 : Cone

i12 : rays C

o12 = | 1  1  1 |
      | 0  -2 2 |
      | -1 1  1 |

               3        3
o12 : Matrix ZZ  <--- ZZ

i13 : vertices P

o13 = | 0  -2 2 |
      | -1 1  1 |

               2        3
o13 : Matrix QQ  <--- QQ

i14 : R = matrix {{1},{0},{0}}

o14 = | 1 |
      | 0 |
      | 0 |

               3        1
o14 : Matrix ZZ  <--- ZZ

i15 : V1 = V || matrix {{1,1,1,1}}

o15 = | 0  2 -2 0 |
      | -1 1 1  1 |
      | 1  1 1  1 |

               3        4
o15 : Matrix ZZ  <--- ZZ

i16 : P1 = convexHull(V1,R)

o16 = P1

o16 : Polyhedron

i17 : vertices P1

o17 = | 0  -2 |
      | -1 1  |
      | 1  1  |

               3        2
o17 : Matrix QQ  <--- QQ

i18 : isCompact P1

o18 = false

i19 : isFullDimensional P1

o19 = false

i20 : rays P1

o20 = | 1 |
      | 0 |
      | 0 |

               3        1
o20 : Matrix QQ  <--- QQ

i21 : hyperplanes P1

o21 = (| 0 0 -1 |, | -1 |)

o21 : Sequence

i22 : inequalities = transpose (V || matrix {{-1,2,0,1}})

o22 = | 0  -1 -1 |
      | 2  1  2  |
      | -2 1  0  |
      | 0  1  1  |

               4        3
o22 : Matrix ZZ  <--- ZZ

i23 : v = matrix {{1},{1},{1},{1}}

o23 = | 1 |
      | 1 |
      | 1 |
      | 1 |

               4        1
o23 : Matrix ZZ  <--- ZZ

i24 : equations = matrix {{1,1,1}}

o24 = | 1 1 1 |

               1        3
o24 : Matrix ZZ  <--- ZZ

i25 : w = matrix {{3}}

o25 = | 3 |

               1        1
o25 : Matrix ZZ  <--- ZZ

i26 : P2 = polyhedronFromHData(inequalities,v,equations,w)

o26 = P2

o26 : Polyhedron

i27 : isFullDimensional P2

o27 = false

i28 : vertices P2

o28 = | 4   4  2  |
      | 9   5  5  |
      | -10 -6 -4 |

               3        3
o28 : Matrix QQ  <--- QQ

i29 : P3 = polyhedronFromHData(inequalities,v)

o29 = P3

o29 : Polyhedron

i30 : vertices P3

o30 = | 0 0  0  |
      | 1 1  -3 |
      | 0 -2 2  |

               3        3
o30 : Matrix QQ  <--- QQ

i31 : linealitySpace P3

o31 = | 1  |
      | 2  |
      | -2 |

               3        1
o31 : Matrix QQ  <--- QQ

i32 : isFullDimensional P3

o32 = true

i33 : P4 = hypercube(3,2)

o33 = P4

o33 : Polyhedron

i34 : vertices P4

o34 = | -2 2  -2 2  -2 2  -2 2 |
      | -2 -2 2  2  -2 -2 2  2 |
      | -2 -2 -2 -2 2  2  2  2 |

               3        8
o34 : Matrix QQ  <--- QQ

i35 : P5 = crossPolytope(3,3)

o35 = P5

o35 : Polyhedron

i36 : vertices P5

o36 = | -3 3 0  0 0  0 |
      | 0  0 -3 3 0  0 |
      | 0  0 0  0 -3 3 |

               3        6
o36 : Matrix QQ  <--- QQ

i37 : P6 = stdSimplex 2

o37 = P6

o37 : Polyhedron

i38 : vertices P6

o38 = | 1 0 0 |
      | 0 1 0 |
      | 0 0 1 |

               3        3
o38 : Matrix QQ  <--- QQ

i39 : P7 = convexHull(P4,P5)

o39 = P7

o39 : Polyhedron

i40 : vertices P7

o40 = | -3 3 0  0 0  -2 2  -2 2  -2 2  -2 2 0 |
      | 0  0 -3 3 0  -2 -2 2  2  -2 -2 2  2 0 |
      | 0  0 0  0 -3 -2 -2 -2 -2 2  2  2  2 3 |

               3        14
o40 : Matrix QQ  <--- QQ

i41 : P8 = intersection(P4,P5)

o41 = P8

o41 : Polyhedron

i42 : vertices P8

o42 = | -1 1  -2 2  -2 2 -1 1 -1 1  0  0  -2 2  0  0  -2 2 0  0 -1 1 0  0 |
      | -2 -2 -1 -1 1  1 2  2 0  0  -1 1  0  0  -2 2  0  0 -2 2 0  0 -1 1 |
      | 0  0  0  0  0  0 0  0 -2 -2 -2 -2 -1 -1 -1 -1 1  1 1  1 2  2 2  2 |

               3        24
o42 : Matrix QQ  <--- QQ

i43 : P9 = convexHull {(V1,R),P2,P6}

o43 = P9

o43 : Polyhedron

i44 : vertices P9

o44 = | 4   4  2  0  -2 |
      | 9   5  5  -1 1  |
      | -10 -6 -4 1  1  |

               3        5
o44 : Matrix QQ  <--- QQ

i45 : Q = convexHull (-V)

o45 = Q

o45 : Polyhedron

i46 : P10 = P + Q

o46 = P10

o46 : Polyhedron

i47 : vertices P10

o47 = | -4 4 -2 2  -2 2 |
      | 0  0 -2 -2 2  2 |

               2        6
o47 : Matrix QQ  <--- QQ

i48 : (C,L,M) = minkSummandCone P10

o48 = (C, HashTable{0 => Polyhedron{...1...}}, | 1 0 |)
                    1 => Polyhedron{...1...}   | 0 1 |
                    2 => Polyhedron{...1...}   | 1 0 |
                    3 => Polyhedron{...1...}   | 1 0 |
                    4 => Polyhedron{...1...}   | 0 1 |

o48 : Sequence

i49 : apply(values L, vertices)

o49 = {| 0 4 |, | 0 4 2  |, | 0 2 |, | 0 2  |, | 0 4 2 |}
       | 0 0 |  | 0 0 -2 |  | 0 2 |  | 0 -2 |  | 0 0 2 |

o49 : List

i50 : P11 = P * Q

o50 = P11

o50 : Polyhedron

i51 : vertices P11

o51 = | 0  -2 2  0  -2 2  0  -2 2 |
      | -1 1  1  -1 1  1  -1 1  1 |
      | -2 -2 -2 2  2  2  0  0  0 |
      | -1 -1 -1 -1 -1 -1 1  1  1 |

               4        9
o51 : Matrix QQ  <--- QQ

i52 : ambDim P11

o52 = 4

i53 : fVector P11

o53 = {9, 18, 15, 6, 1}

o53 : List

i54 : L = faces(1,P11)

o54 = {({0, 1, 3, 4, 6, 7}, {}), ({0, 2, 3, 5, 6, 8}, {}), ({1, 2, 4, 5, 7,
      -----------------------------------------------------------------------
      8}, {}), ({0, 1, 2, 3, 4, 5}, {}), ({0, 1, 2, 6, 7, 8}, {}), ({3, 4, 5,
      -----------------------------------------------------------------------
      6, 7, 8}, {})}

o54 : List

i55 : vertP11 = vertices P11

o55 = | 0  -2 2  0  -2 2  0  -2 2 |
      | -1 1  1  -1 1  1  -1 1  1 |
      | -2 -2 -2 2  2  2  0  0  0 |
      | -1 -1 -1 -1 -1 -1 1  1  1 |

               4        9
o55 : Matrix QQ  <--- QQ

i56 : apply(L, l -> vertP11_(l#0))

o56 = {| 0  -2 0  -2 0  -2 |, | 0  2  0  2  0  2 |, | -2 2  -2 2  -2 2 |, |
       | -1 1  -1 1  -1 1  |  | -1 1  -1 1  -1 1 |  | 1  1  1  1  1  1 |  |
       | -2 -2 2  2  0  0  |  | -2 -2 2  2  0  0 |  | -2 -2 2  2  0  0 |  |
       | -1 -1 -1 -1 1  1  |  | -1 -1 -1 -1 1  1 |  | -1 -1 -1 -1 1  1 |  |
      -----------------------------------------------------------------------
      0  -2 2  0  -2 2  |, | 0  -2 2  0  -2 2 |, | 0  -2 2  0  -2 2 |}
      -1 1  1  -1 1  1  |  | -1 1  1  -1 1  1 |  | -1 1  1  -1 1  1 |
      -2 -2 -2 2  2  2  |  | -2 -2 -2 0  0  0 |  | 2  2  2  0  0  0 |
      -1 -1 -1 -1 -1 -1 |  | -1 -1 -1 1  1  1 |  | -1 -1 -1 1  1  1 |

o56 : List

i57 : L = latticePoints P11

o57 = {| 1  |, | -2 |, | 2  |, | 0  |, | 1  |, | -1 |, | 1  |, | -1 |, | 0 
       | 0  |  | 1  |  | 1  |  | 1  |  | 1  |  | 1  |  | 1  |  | 0  |  | 0 
       | -2 |  | -2 |  | -2 |  | 2  |  | 2  |  | -2 |  | -2 |  | -2 |  | -2
       | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1
      -----------------------------------------------------------------------
      |, | 0  |, | 0  |, | 0  |, | 0  |, | 1  |, | -1 |, | 0  |, | 0  |, | 0 
      |  | -1 |  | 1  |  | -1 |  | -1 |  | 0  |  | 0  |  | 0  |  | -1 |  | -1
      |  | -2 |  | -2 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | 0  |  | 0 
      |  | -1 |  | -1 |  | -1 |  | 0  |  | -1 |  | -1 |  | -1 |  | -1 |  | 0 
      -----------------------------------------------------------------------
      |, | 1  |, | -1 |, | 0  |, | 0  |, | -2 |, | 2  |, | -1 |, | 1  |, | 0 
      |  | 0  |  | 0  |  | 0  |  | -1 |  | 1  |  | 1  |  | 1  |  | 1  |  | 1 
      |  | -1 |  | -1 |  | -1 |  | 0  |  | -1 |  | -1 |  | -1 |  | -1 |  | -1
      |  | 0  |  | 0  |  | 0  |  | 1  |  | -1 |  | -1 |  | -1 |  | -1 |  | -1
      -----------------------------------------------------------------------
      |, | 1  |, | -1 |, | 0  |, | 0  |, | 0  |, | 1 |, | -1 |, 0, | -2 |, |
      |  | 0  |  | 0  |  | 0  |  | -1 |  | -1 |  | 0 |  | 0  |     | 1  |  |
      |  | 0  |  | 0  |  | 0  |  | 1  |  | 1  |  | 0 |  | 0  |     | -1 |  |
      |  | -1 |  | -1 |  | -1 |  | -1 |  | 0  |  | 0 |  | 0  |     | 0  |  |
      -----------------------------------------------------------------------
      2  |, | -1 |, | 1  |, | 0  |, | 1 |, | -1 |, | 0 |, | -2 |, | 2  |, |
      1  |  | 1  |  | 1  |  | 1  |  | 0 |  | 0  |  | 0 |  | 1  |  | 1  |  |
      -1 |  | -1 |  | -1 |  | -1 |  | 0 |  | 0  |  | 0 |  | 0  |  | 0  |  |
      0  |  | 0  |  | 0  |  | 0  |  | 1 |  | 1  |  | 1 |  | -1 |  | -1 |  |
      -----------------------------------------------------------------------
      -1 |, | 1  |, | 0  |, | 1  |, | -1 |, | 0  |, | 0  |, | 1 |, | -1 |, |
      1  |  | 1  |  | 1  |  | 0  |  | 0  |  | 0  |  | -1 |  | 0 |  | 0  |  |
      0  |  | 0  |  | 0  |  | 1  |  | 1  |  | 1  |  | 2  |  | 1 |  | 1  |  |
      -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | 0 |  | 0  |  |
      -----------------------------------------------------------------------
      0 |, | -2 |, | 2 |, | -1 |, | 1 |, | 0 |, | -2 |, | 2 |, | -1 |, | 1 |,
      0 |  | 1  |  | 1 |  | 1  |  | 1 |  | 1 |  | 1  |  | 1 |  | 1  |  | 1 | 
      1 |  | 0  |  | 0 |  | 0  |  | 0 |  | 0 |  | 0  |  | 0 |  | 0  |  | 0 | 
      0 |  | 0  |  | 0 |  | 0  |  | 0 |  | 0 |  | 1  |  | 1 |  | 1  |  | 1 | 
      -----------------------------------------------------------------------
      | 0 |, | -2 |, | 2  |, | -1 |, | 1  |, | 0  |, | 1  |, | -1 |, | 0  |,
      | 1 |  | 1  |  | 1  |  | 1  |  | 1  |  | 1  |  | 0  |  | 0  |  | 0  | 
      | 0 |  | 1  |  | 1  |  | 1  |  | 1  |  | 1  |  | 2  |  | 2  |  | 2  | 
      | 1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 |  | -1 | 
      -----------------------------------------------------------------------
      | -2 |, | 2 |, | -1 |, | 1 |, | 0 |, | -2 |, | 2  |, | -1 |}
      | 1  |  | 1 |  | 1  |  | 1 |  | 1 |  | 1  |  | 1  |  | 1  |
      | 1  |  | 1 |  | 1  |  | 1 |  | 1 |  | 2  |  | 2  |  | 2  |
      | 0  |  | 0 |  | 0  |  | 0 |  | 0 |  | -1 |  | -1 |  | -1 |

o57 : List

i58 : #L

o58 = 81

i59 : C = tailCone P1

o59 = C

o59 : Cone

i60 : rays C

o60 = | 1 |
      | 0 |
      | 0 |

               3        1
o60 : Matrix ZZ  <--- ZZ

i61 : P12 = polar P11

o61 = P12

o61 : Polyhedron

i62 : vertices P12

o62 = | 1 -1 0  0 0  0  |
      | 1 1  -1 0 0  0  |
      | 0 0  0  0 1  -1 |
      | 0 0  0  1 -1 -1 |

               4        6
o62 : Matrix QQ  <--- QQ

i63 : 
