-- -*- M2-comint -*- hash: 1902203812

i1 : C1 = coneFromVData matrix {{1,1,-1,-1},{1,-1,1,-1},{1,1,1,1}};

i2 : C2 = coneFromVData matrix {{1,1,1},{0,1,-1},{-1,1,1}};

i3 : C3 = coneFromVData matrix {{-1,-1,-1},{0,1,-1},{-1,1,1}};

i4 : C4 = coneFromVData matrix {{1,-1},{0,0},{-1,-1}};

i5 : F = fan {C1,C2,C3,C4}

o5 = F

o5 : Fan

i6 : isComplete F

o6 = false

i7 : isPure F

o7 = false

i8 : C5 = coneFromVData matrix {{1,-1,1,-1},{-1,-1,0,0},{1,1,-1,-1}};

i9 : C6 = coneFromVData matrix {{1,-1,1,-1},{1,1,0,0},{1,1,-1,-1}};

i10 : F = addCone({C5,C6},F)

o10 = F

o10 : Fan

i11 : isComplete F

o11 = true

i12 : isPolytopal F

o12 = true

i13 : 
