-- -*- M2-comint -*- hash: 2007016211

i1 : C = coneFromVData matrix {{1,0,0},{0,1,0},{0,0,1}}

o1 = C

o1 : Cone

i2 : F = fan C

o2 = F

o2 : Fan

i3 : maxCones F

o3 = {{0, 1, 2}}

o3 : List

i4 : C1 = coneFromVData matrix {{1,0,0},{1,1,0},{0,0,-1}}

o4 = C1

o4 : Cone

i5 : commonFace(C,C1)

o5 = false

i6 : (b,C2) = areCompatible(C,C1)

o6 = (false, C2)

o6 : Sequence

i7 : rays C2

o7 = | 0 1 |
     | 1 1 |
     | 0 0 |

              3        2
o7 : Matrix ZZ  <--- ZZ

i8 : C1 = coneFromVData matrix {{1,0,0},{0,1,0},{0,0,-1}}

o8 = C1

o8 : Cone

i9 : F = addCone(C1,F)

o9 = F

o9 : Fan

i10 : C2 = coneFromVData matrix {{-1,0,0},{0,1,0},{0,0,1}};

i11 : C3 = coneFromVData matrix {{-1,0,0},{0,1,0},{0,0,-1}};

i12 : C4 = coneFromVData matrix {{-1,0,0},{0,-1,0},{0,0,1}};

i13 : C5 = coneFromVData matrix {{-1,0,0},{0,-1,0},{0,0,-1}};

i14 : F1 = fan {C2,C3,C4,C5}

o14 = F1

o14 : Fan

i15 : C6 = coneFromVData matrix {{1,0,0},{0,-1,0},{0,0,1}};

i16 : C7 = coneFromVData matrix {{1,0,0},{0,-1,0},{0,0,-1}};

i17 : F1 = addCone( {C6,C7}, F1)

o17 = F1

o17 : Fan

i18 : P = hypercube 4

o18 = P

o18 : Polyhedron

i19 : F2 = normalFan P

o19 = F2

o19 : Fan

i20 : F3 = fan {coneFromVData matrix {{1}},coneFromVData matrix {{-1}}}

o20 = F3

o20 : Fan

i21 : F1 = F3 * F1

o21 = F1

o21 : Fan

i22 : ambDim F1

o22 = 4

i23 : F1 == F2

o23 = false

i24 : 
