-- -*- M2-comint -*- hash: 137858269

i1 : P = convexHull matrix {{1,1,1,1,2,2,2,2},{0,0,1,1,0,0,1,1},{0,1,0,1,0,1,0,1}};

i2 : PC = polyhedralComplex P

o2 = PC

o2 : PolyhedralComplex

i3 : P = hypercube 3;

i4 : incompPolyhedra(P,PC)

o4 = {(P, Polyhedron{...1...})}

o4 : List

i5 : P1 = convexHull matrix {{1,1,1,1,-1,-1,-1,-1},{0,0,1,1,0,0,1,1},{0,1,0,1,0,1,0,1}};

i6 : P2 = convexHull matrix {{1,1,1,1,-1,-1,-1,-1},{0,1,1,-1,0,1,1,-1},{0,0,-1,-1,0,0,-1,-1}};

i7 : P3 = convexHull matrix {{1,1,1,1,-1,-1,-1,-1},{0,0,-1,-1,0,0,-1,-1},{0,1,1,-1,0,1,1,-1}};

i8 : P == convexHull {P1,P2,P3}

o8 = true

i9 : PC = addPolyhedron({P1,P2,P3},PC)

o9 = PC

o9 : PolyhedralComplex

i10 : 
