-- -*- M2-comint -*- hash: 1313868870

i1 : M = matrix {{1,1,-1,-1},{1,-1,1,-1}}

o1 = | 1 1  -1 -1 |
     | 1 -1 1  -1 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : P = convexHull M

o2 = P

o2 : Polyhedron

i3 : r = matrix {{1},{2}}

o3 = | 1 |
     | 2 |

              2        1
o3 : Matrix ZZ  <--- ZZ

i4 : P =convexHull(M,r)

o4 = P

o4 : Polyhedron

i5 : N = matrix {{-2,-2,0},{0,-2,-2}}

o5 = | -2 -2 0  |
     | 0  -2 -2 |

              2        3
o5 : Matrix ZZ  <--- ZZ

i6 : Q = convexHull(M|N)

o6 = Q

o6 : Polyhedron

i7 : Q1 = convexHull(M|N,r)

o7 = Q1

o7 : Polyhedron

i8 : P1 = convexHull {P,N}

o8 = P1

o8 : Polyhedron

i9 : P1 == Q1

o9 = true

i10 : P1 = convexHull(P,Q)

o10 = P1

o10 : Polyhedron

i11 : P1 == Q1

o11 = true

i12 : 
