-- -*- M2-comint -*- hash: -344612662

i1 : P = hypercube 3

o1 = P

o1 : Polyhedron

i2 : Q = crossPolytope 3

o2 = Q

o2 : Polyhedron

i3 : contains(Q,P)

o3 = false

i4 : contains(P,Q)

o4 = true

i5 : C = coneFromVData matrix {{1,0,0},{0,1,0},{0,0,1}};

i6 : contains(C,P)

o6 = false

i7 : P = affineImage(P,matrix{{1},{1},{1}})

o7 = P

o7 : Polyhedron

i8 : contains(C,P)

o8 = true

i9 : 
