-- -*- M2-comint -*- hash: -1665352273

i1 : R = matrix {{1,2},{2,1},{0,0}}

o1 = | 1 2 |
     | 2 1 |
     | 0 0 |

              3        2
o1 : Matrix ZZ  <--- ZZ

i2 : C = coneFromVData R

o2 = C

o2 : Cone

i3 : LS = matrix {{0},{0},{1}}

o3 = | 0 |
     | 0 |
     | 1 |

              3        1
o3 : Matrix ZZ  <--- ZZ

i4 : C1 = coneFromVData (R,LS)

o4 = C1

o4 : Cone

i5 : r = matrix {{0},{1},{2}}

o5 = | 0 |
     | 1 |
     | 2 |

              3        1
o5 : Matrix ZZ  <--- ZZ

i6 : C2 = coneFromVData {C,r}

o6 = C2

o6 : Cone

i7 : r = coneFromVData r

o7 = r

o7 : Cone

i8 : C3 = coneFromVData(C,r)

o8 = C3

o8 : Cone

i9 : C3 == C2

o9 = true

i10 : 
