-- -*- M2-comint -*- hash: -1839528015

i1 : C = coneFromVData matrix {{2,3},{3,2}}

o1 = C

o1 : Cone

i2 : dim C

o2 = 2

i3 : F = hirzebruch 3

o3 = F

o3 : Fan

i4 : dim F

o4 = 2

i5 : P = convexHull matrix {{1,-1,0,0},{0,0,1,-1}}

o5 = P

o5 : Polyhedron

i6 : dim P

o6 = 2

i7 : PC = polyhedralComplex crossPolytope 3

o7 = PC

o7 : PolyhedralComplex

i8 : dim PC

o8 = 3

i9 : 
