-- -*- M2-comint -*- hash: 807531306

i1 : C = hypercube 2

o1 = C

o1 : Polyhedron

i2 : F = faces(1,C)

o2 = {({0, 2}, {}), ({1, 3}, {}), ({0, 1}, {}), ({2, 3}, {})}

o2 : List

i3 : V = vertices C

o3 = | -1 1  -1 1 |
     | -1 -1 1  1 |

              2        4
o3 : Matrix QQ  <--- QQ

i4 : L = linealitySpace C

o4 = 0

              2
o4 : Matrix QQ  <--- 0

i5 : PC = polyhedralComplex(V,L,F)

o5 = PC

o5 : PolyhedralComplex

i6 : vertices PC

o6 = | -1 1  -1 1 |
     | -1 -1 1  1 |

              2        4
o6 : Matrix QQ  <--- QQ

i7 : maxPolyhedra PC

o7 = {({0, 2}, {}), ({1, 3}, {}), ({0, 1}, {}), ({2, 3}, {})}

o7 : List

i8 : dim PC

o8 = 1

i9 : 
