-- -*- M2-comint -*- hash: 315611517

i1 : P1 = convexHull matrix {{1,0,0},{1,1,0}};

i2 : P2 = convexHull matrix {{1,0,0},{0,-1,0}};

i3 : P3 = convexHull matrix {{-1,0,0},{0,1,0}};

i4 : P4 = convexHull matrix {{1,1,0},{0,1,0}};

i5 : P5 = convexHull matrix {{1,2,0},{2,1,0}};

i6 : L = {P1,P2,P3,P4,P5};

i7 : Lpairs = incompPolyhedra L

o7 = {(P1, P5), (P4, P5)}

o7 : List

i8 : Lpairs == {(P1,P4),(P1,P5)}

o8 = false

i9 : 
