-- -*- M2-comint -*- hash: 1173722240

i1 : C1 = coneFromVData matrix{{1,0},{1,1}};

i2 : C2 = coneFromVData matrix{{1,0},{0,-1}};

i3 : C3 = coneFromVData matrix{{-1,0},{0,1}};

i4 : C4 = coneFromVData matrix{{1,1},{0,1}};

i5 : C5 = coneFromVData matrix {{1,2},{2,1}};

i6 : L = {C1,C2,C3,C4,C5};

i7 : Lpairs = incompCones L

o7 = {(C1, C5), (C4, C5)}

o7 : List

i8 : Lpairs == {(C1,C4),(C1,C5)}

o8 = false

i9 : 
