-- -*- M2-comint -*- hash: 1248517029

i1 : P = convexHull matrix {{3,0,0,0,1},{0,3,0,0,1},{0,0,3,0,1}}

o1 = P

o1 : Polyhedron

i2 : isSimplicial P

o2 = true

i3 : P = hypercube 2

o3 = P

o3 : Polyhedron

i4 : isSimplicial P

o4 = true

i5 : C = coneFromVData matrix {{1,0,0,1},{0,1,0,1},{0,0,1,1}}

o5 = C

o5 : Cone

i6 : isSimplicial C

o6 = true

i7 : C = coneFromVData matrix {{1,1,-1,-1},{1,-1,1,-1},{1,1,1,1}}

o7 = C

o7 : Cone

i8 : isSimplicial C

o8 = false

i9 : F = normalFan hypercube 3

o9 = F

o9 : Fan

i10 : isSimplicial F

o10 = true

i11 : PC = skeleton(2,polyhedralComplex crossPolytope 3)

o11 = PC

o11 : PolyhedralComplex

i12 : isSimplicial PC

o12 = true

i13 : 
