-- -*- M2-comint -*- hash: -2067863744

i1 : C = hypercube 2

o1 = C

o1 : Polyhedron

i2 : dim C

o2 = 2

i3 : ambDim C

o3 = 2

i4 : isFullDimensional C

o4 = true

i5 : F = normalFan hypercube 2

o5 = F

o5 : Fan

i6 : dim F

o6 = 2

i7 : ambDim F

o7 = 2

i8 : isFullDimensional F

o8 = true

i9 : S = stdSimplex 2

o9 = S

o9 : Polyhedron

i10 : vertices S

o10 = | 1 0 0 |
      | 0 1 0 |
      | 0 0 1 |

               3        3
o10 : Matrix QQ  <--- QQ

i11 : dim S

o11 = 2

i12 : ambDim S

o12 = 3

i13 : isFullDimensional S

o13 = false

i14 : 
