-- -*- M2-comint -*- hash: -373394536

i1 : C1 = coneFromVData matrix {{1,0},{0,1}};

i2 : C2 = coneFromVData matrix {{1,-1},{0,-2}};

i3 : C3 = coneFromVData matrix {{0,-2},{1,-1}};

i4 : F = fan {C1,C2,C3}

o4 = F

o4 : Fan

i5 : isComplete F

o5 = false

i6 : C4 = coneFromVData matrix {{-1,-2},{-2,-1}};

i7 : F = addCone(C4,F)

o7 = F

o7 : Fan

i8 : isComplete F

o8 = true

i9 : 
