-- -*- M2-comint -*- hash: -900970416

i1 : C = coneFromVData matrix {{1,0,0},{0,1,0},{0,0,1}}

o1 = C

o1 : Cone

i2 : v = coneFromVData matrix {{-1},{-1},{-1}}

o2 = v

o2 : Cone

i3 : F = fan {C,v}

o3 = F

o3 : Fan

i4 : isPure F

o4 = false

i5 : C1 = coneFromVData (rays C)_((faces(1,C))#0)

o5 = C1

o5 : Cone

i6 : C1 = coneFromVData(C1, v)

o6 = C1

o6 : Cone

i7 : F = addCone(C1,F)

o7 = F

o7 : Fan

i8 : isPure F

o8 = true

i9 : 
