-- -*- M2-comint -*- hash: -1451131109

i1 : S = simplex 2

o1 = S

o1 : Polyhedron

i2 : facets S

o2 = (| -1 0  |, | 0 |)
      | 0  -1 |  | 0 |
      | 1  1  |  | 1 |

o2 : Sequence

i3 : SCopy = polyhedronFromHData facets S

o3 = SCopy

o3 : Polyhedron

i4 : assert(vertices S == vertices SCopy)

i5 : S = stdSimplex 2

o5 = S

o5 : Polyhedron

i6 : facets S

o6 = (| -1 0  0  |, 0)
      | 0  -1 0  |
      | 0  0  -1 |

o6 : Sequence

i7 : hyperplanes S

o7 = (| 1 1 1 |, | 1 |)

o7 : Sequence

i8 : SCopy = polyhedronFromHData(join(facets S, hyperplanes S))

o8 = SCopy

o8 : Polyhedron

i9 : assert(vertices S == vertices SCopy)

i10 : 
