-- -*- M2-comint -*- hash: -1857195389

i1 : P = convexHull matrix{{1,0,0,0},{0,1,0,0},{0,0,1,0}}

o1 = P

o1 : Polyhedron

i2 : F = normalFan P

o2 = F

o2 : Fan

i3 : F1 = skeleton(2,F)

o3 = F1

o3 : Fan

i4 : raysF = rays F

o4 = | 1 0 -1 0 |
     | 0 1 -1 0 |
     | 0 0 -1 1 |

              3        4
o4 : Matrix ZZ  <--- ZZ

i5 : apply(maxCones F1, mc -> raysF_mc)

o5 = {| 1 0 |, | 1 -1 |, | 1 0 |, | 0 -1 |, | 0 0 |, | -1 0 |}
      | 0 1 |  | 0 -1 |  | 0 0 |  | 1 -1 |  | 1 0 |  | -1 0 |
      | 0 0 |  | 0 -1 |  | 0 1 |  | 0 -1 |  | 0 1 |  | -1 1 |

o5 : List

i6 : PC = polyhedralComplex hypercube 3

o6 = PC

o6 : PolyhedralComplex

i7 : PC1 = skeleton(2,PC)

o7 = PC1

o7 : PolyhedralComplex

i8 : vertPC1 = vertices PC1

o8 = | -1 1  -1 1  -1 1  -1 1 |
     | -1 -1 1  1  -1 -1 1  1 |
     | -1 -1 -1 -1 1  1  1  1 |

              3        8
o8 : Matrix QQ  <--- QQ

i9 : apply(maxPolyhedra PC1, mp -> vertPC1_(mp#0))

o9 = {| -1 1  |, | -1 -1 |, | -1 -1 |, | 1  1  |, | 1  1  |, | -1 1  |, | -1
      | -1 -1 |  | -1 1  |  | -1 -1 |  | -1 1  |  | -1 -1 |  | 1  1  |  | 1 
      | -1 -1 |  | -1 -1 |  | -1 1  |  | -1 -1 |  | -1 1  |  | -1 -1 |  | -1
     ------------------------------------------------------------------------
     -1 |, | 1  1 |, | -1 1  |, | -1 -1 |, | 1  1 |, | -1 1 |}
     1  |  | 1  1 |  | -1 -1 |  | -1 1  |  | -1 1 |  | 1  1 |
     1  |  | -1 1 |  | 1  1  |  | 1  1  |  | 1  1 |  | 1  1 |

o9 : List

i10 : 
