-- -*- M2-comint -*- hash: -664014382

i1 : S = ZZ/32003[x_0..x_2]; 

i2 : E = ZZ/32003[e_0..e_2, SkewCommutative=>true];

i3 : M = coker matrix {{x_0^2, x_1^2, x_2^2}};

i4 : bgg(1,M,E)

o4 = {-2} | e_1 e_0 0   |
     {-2} | e_2 0   e_0 |
     {-2} | 0   e_2 e_1 |

             3       3
o4 : Matrix E  <--- E

i5 : bgg(2,M,E)

o5 = {-3} | e_2 e_1 e_0 |

             1       3
o5 : Matrix E  <--- E

i6 : 
