-- -*- M2-comint -*- hash: 864047428

i1 : (p,q) = (2,5) -- number of rows and columns

o1 = (2, 5)

o1 : Sequence

i2 : A=ZZ/101[a_(0,0)..a_(p-1,q-1)];

i3 : S = A [x_0..x_(p-1)];

i4 : M = sub(map(A^p, A^{q:-1},transpose genericMatrix(A,a_(0,0),q,p)), S)

o4 = | a_(0,0) a_(0,1) a_(0,2) a_(0,3) a_(0,4) |
     | a_(1,0) a_(1,1) a_(1,2) a_(1,3) a_(1,4) |

             2       5
o4 : Matrix S  <--- S

i5 : Y = map(S^1, S^{q:{-1,-1}}, (vars S)*M)

o5 = | a_(0,0)x_0+a_(1,0)x_1 a_(0,1)x_0+a_(1,1)x_1 a_(0,2)x_0+a_(1,2)x_1
     ------------------------------------------------------------------------
     a_(0,3)x_0+a_(1,3)x_1 a_(0,4)x_0+a_(1,4)x_1 |

             1       5
o5 : Matrix S  <--- S

i6 : F = koszul Y

      1      5      10      10      5      1
o6 = S  <-- S  <-- S   <-- S   <-- S  <-- S
                                           
     0      1      2       3       4      5

o6 : ChainComplex

i7 : L = for i from -1 to q-p+1 list directImageComplex(F**S^{{i,0}});

i8 : L/betti

             0  1  2  3 4         0  1  2  3 4         0 1  2  3 4         0
o8 = {total: 5 20 30 20 5, total: 1 10 20 15 4, total: 2 5 10 10 3, total: 3
          1: 5 20 30 20 5      0: 1  .  .  . .      0: 2 5  .  . .      0: 3
                               1: . 10 20 15 4      1: . . 10 10 3      1: .
     ------------------------------------------------------------------------
      1  2 3 4         0  1  2  3 4         0  1  2  3 4
     10 10 5 2, total: 4 15 20 10 1, total: 5 20 30 20 5}
     10 10 . .      0: 4 15 20 10 .      0: 5 20 30 20 5
      .  . 5 2      1: .  .  .  . 1

o8 : List

i9 : 
