-- -*- M2-comint -*- hash: -1068346407

i1 : M=universalExtension({-3}, {1})

o1 = cokernel {3, 0} | x_0 x_1 x_2 |
              {2, 1} | y_0 0   0   |
              {2, 1} | y_1 y_0 0   |
              {2, 1} | 0   y_1 y_0 |
              {2, 1} | 0   0   y_1 |

      ZZ                                       ZZ                 5
o1 : ---[x ..x ][y ..y ]-module, quotient of (---[x ..x ][y ..y ])
     101  0   2   0   1                       101  0   2   0   1

i2 : S = ring M;

i3 : A = coefficientRing S;

i4 : F = directImageComplex M

             2      2
o4 = 0  <-- A  <-- A  <-- 0
                           
     -2     -1     0      1

o4 : ChainComplex

i5 : F.dd_0

o5 = | x_1  x_0  |
     | -x_2 -x_1 |

             2       2
o5 : Matrix A  <--- A

i6 : det (F.dd_0)

        2
o6 = - x  + x x
        1    0 2

o6 : A

i7 : r=3;

i8 : d=6;

i9 : M=universalExtension(splice {(r-1):0}, {d})

o9 = cokernel {0, 0}  | x_0 x_1 x_2 x_3 x_4 |
              {0, 0}  | x_5 x_6 x_7 x_8 x_9 |
              {-1, 1} | y_0 0   0   0   0   |
              {-1, 1} | y_1 y_0 0   0   0   |
              {-1, 1} | 0   y_1 y_0 0   0   |
              {-1, 1} | 0   0   y_1 y_0 0   |
              {-1, 1} | 0   0   0   y_1 y_0 |
              {-1, 1} | 0   0   0   0   y_1 |

      ZZ                                       ZZ                 8
o9 : ---[x ..x ][y ..y ]-module, quotient of (---[x ..x ][y ..y ])
     101  0   9   0   1                       101  0   9   0   1

i10 : S = ring M;

i11 : A = coefficientRing S;

i12 : L = for i from -d to 0 list directImageComplex(S^{{i,0}}**M);

i13 : netList L

      +-----------------------+
      |        10      1      |
o13 = |0  <-- A   <-- A  <-- 0|
      |                       |
      |-2     -1      0      1|
      +-----------------------+
      |        8      2       |
      |0  <-- A  <-- A  <-- 0 |
      |                       |
      |-2     -1     0      1 |
      +-----------------------+
      |        6      3       |
      |0  <-- A  <-- A  <-- 0 |
      |                       |
      |-2     -1     0      1 |
      +-----------------------+
      |        4      4       |
      |0  <-- A  <-- A  <-- 0 |
      |                       |
      |-2     -1     0      1 |
      +-----------------------+
      |        2      5       |
      |0  <-- A  <-- A  <-- 0 |
      |                       |
      |-2     -1     0      1 |
      +-----------------------+
      |               6       |
      |0  <-- 0  <-- A  <-- 0 |
      |                       |
      |-2     -1     0      1 |
      +-----------------------+
      |               9       |
      |0  <-- 0  <-- A  <-- 0 |
      |                       |
      |-2     -1     0      1 |
      +-----------------------+

i14 : maps = apply(L, F-> F.dd_0)

o14 = {| x_0  |, | x_1  x_0  |, | x_2  -x_0 -x_1 |, | x_3  x_0  x_1  x_2  |,
       | x_5  |  | x_6  x_5  |  | x_7  -x_5 -x_6 |  | x_8  x_5  x_6  x_7  | 
       | -x_1 |  | -x_2 -x_1 |  | -x_3 x_1  x_2  |  | -x_4 -x_1 -x_2 -x_3 |
       | -x_6 |  | -x_7 -x_6 |  | -x_8 x_6  x_7  |  | -x_9 -x_6 -x_7 -x_8 |
       | x_2  |  | x_3  x_2  |  | x_4  -x_2 -x_3 |
       | x_7  |  | x_8  x_7  |  | x_9  -x_7 -x_8 |
       | -x_3 |  | -x_4 -x_3 |
       | -x_8 |  | -x_9 -x_8 |
       | x_4  |
       | x_9  |
      -----------------------------------------------------------------------
      | -x_0 -x_1 -x_2 x_4 -x_3 |, 0, 0}
      | -x_5 -x_6 -x_7 x_9 -x_8 |

o14 : List

i15 : 
