-- -*- M2-comint -*- hash: -428771400

i1 : kk = ZZ/101

o1 = kk

o1 : QuotientRing

i2 : A = kk[u,v,w]

o2 = A

o2 : PolynomialRing

i3 : T = A[x,y]

o3 = T

o3 : PolynomialRing

i4 : params = matrix"ux,uy+vx,vy+wx,wy"

o4 = | ux vx+uy wx+vy wy |

             1       4
o4 : Matrix T  <--- T

i5 : kn = koszul(params)

      1      4      6      4      1
o5 = T  <-- T  <-- T  <-- T  <-- T
                                  
     0      1      2      3      4

o5 : ChainComplex

i6 : directImageComplex kn

             1      6      8      3
o6 = 0  <-- A  <-- A  <-- A  <-- A
                                  
     -1     0      1      2      3

o6 : ChainComplex

i7 : for d from -1 to 3 do
       (print betti directImageComplex (T^{{d,0}}**kn);print())
       0  1  2 3
total: 4 12 12 4
    1: 4 12 12 4
()
       0 1 2 3
total: 1 6 8 3
    0: 1 . . .
    1: . 6 8 3
()
       0 1 2 3
total: 2 4 4 2
    0: 2 4 . .
    1: . . 4 2
()
       0 1 2 3
total: 3 8 6 1
    0: 3 8 6 .
    1: . . . 1
()
       0  1  2 3
total: 4 12 12 4
    0: 4 12 12 4
()

i8 : A = kk[a,b,c]

o8 = A

o8 : PolynomialRing

i9 : betti (pureResolution(A,{1,3,4,6}))

            0  1  2 3
o9 = total: 4 20 20 4
         1: 4  .  . .
         2: . 20 20 .
         3: .  .  . 4

o9 : BettiTally

i10 : betti (F = pureResolution(11,{0,2,4}))

             0 1 2
o10 = total: 3 6 3
          0: 3 . .
          1: . 6 .
          2: . . 3

o10 : BettiTally

i11 : describe ring F

      ZZ
o11 = --[a ..a , Degrees => {2:1}, Heft => {1}]
      11  0   1

i12 : A = kk[a,b]

o12 = A

o12 : PolynomialRing

i13 : M = random(A^4, A^{4:-1})

o13 = | 24a-36b  -8a-22b  34a+19b  -28a-47b |
      | -30a-29b -29a-24b -47a-39b 38a+2b   |
      | 19a+19b  -38a-16b -18a-13b 16a+22b  |
      | -10a-29b 39a+21b  -43a-15b 45a-34b  |

              4       4
o13 : Matrix A  <--- A

i14 : time betti (F = pureResolution(M,{0,2,4}))
     -- used 0.412062 seconds

             0 1 2
o14 = total: 3 6 3
          0: 3 . .
          1: . 6 .
          2: . . 3

o14 : BettiTally

i15 : time betti (F = pureResolution(11,4,{0,2,4}))
     -- used 0.53256 seconds

             0 1 2
o15 = total: 3 6 3
          0: 3 . .
          1: . 6 .
          2: . . 3

o15 : BettiTally

i16 : ring F

      ZZ
o16 = --[a ..a  ]
      11  0   15

o16 : PolynomialRing

i17 : 
