-- -*- M2-comint -*- hash: -334984278

i1 : R = QQ[x,y]

o1 = R

o1 : PolynomialRing

i2 : I = (ideal"xy5,x2y3,x3y2")^4

             4 20   5 18   6 17   6 16   7 15   8 14   7 14   8 13   9 12 
o2 = ideal (x y  , x y  , x y  , x y  , x y  , x y  , x y  , x y  , x y  ,
     ------------------------------------------------------------------------
      10 11   8 12   9 11   10 10   11 9   12 8
     x  y  , x y  , x y  , x  y  , x  y , x  y )

o2 : Ideal of R

i3 : elapsedTime monjMult I
 -- 0.359247 seconds elapsed

o3 = 192

i4 : elapsedTime jMult I
 -- 3.15811 seconds elapsed

o4 = 192

i5 : 
