-- -*- M2-comint -*- hash: 1964957802

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : I = ideal"xy2,yz3,zx4"

               2     3   4
o2 = ideal (x*y , y*z , x z)

o2 : Ideal of R

i3 : multiplicitySequence I

o3 = HashTable{2 => 9 }
               3 => 25

o3 : HashTable

i4 : analyticSpread I, jMult I

o4 = (3, 25)

o4 : Sequence

i5 : S = QQ[a..d]

o5 = S

o5 : PolynomialRing

i6 : J = ideal (a*d - b*c, c^2-b*d)

                          2
o6 = ideal (- b*c + a*d, c  - b*d)

o6 : Ideal of S

i7 : R = S/J

o7 = R

o7 : QuotientRing

i8 : I = ideal(R_0^2,R_0*R_1,R_1^3)

             2        3
o8 = ideal (a , a*b, b )

o8 : Ideal of R

i9 : multiplicitySequence I

o9 = HashTable{1 => 5}
               2 => 7

o9 : HashTable

i10 : multiplicitySequence_1 I

o10 = 5

i11 : 
