-- -*- M2-comint -*- hash: 1101910714

i1 : PP2 = toricProjectiveSpace 2;

i2 : PP2_0

o2 = PP2
        0

o2 : ToricDivisor on PP2

i3 : PP2_1

o3 = PP2
        1

o3 : ToricDivisor on PP2

i4 : PP2_2

o4 = PP2
        2

o4 : ToricDivisor on PP2

i5 : assert (- PP2_0 - PP2_1 - PP2_2 === toricDivisor PP2)

i6 : X = normalToricVariety (id_(ZZ^3) | -id_(ZZ^3));

i7 : X_0

o7 = X
      0

o7 : ToricDivisor on X

i8 : support X_0

o8 = {0}

o8 : List

i9 : assert( # support X_0 === 1)

i10 : K = toricDivisor X

o10 = - X  - X  - X  - X  - X  - X  - X  - X
         0    1    2    3    4    5    6    7

o10 : ToricDivisor on X

i11 : support K

o11 = {0, 1, 2, 3, 4, 5, 6, 7}

o11 : List

i12 : 
