-- -*- M2-comint -*- hash: 327795783

i1 : dim toricProjectiveSpace 1

o1 = 1

i2 : dim affineSpace 2

o2 = 2

i3 : dim toricProjectiveSpace 5

o3 = 5

i4 : dim hirzebruchSurface 7

o4 = 2

i5 : dim weightedProjectiveSpace {1,2,2,3,4}

o5 = 4

i6 : X = normalToricVariety ({{4,-1,0},{0,1,0}},{{0,1}})

o6 = X

o6 : NormalToricVariety

i7 : dim X

o7 = 3

i8 : isDegenerate X

o8 = true

i9 : 
