-- -*- M2-comint -*- hash: 2003070437

i1 : PP2 = toricProjectiveSpace 2;

i2 : D1 = 2*PP2_0 - 7*PP2_1 + 3*PP2_2

o2 = 2*PP2  - 7*PP2  + 3*PP2
          0        1        2

o2 : ToricDivisor on PP2

i3 : entries D1

o3 = {2, -7, 3}

o3 : List

i4 : assert( D1 == toricDivisor(entries D1, variety D1) )

i5 : assert all(entries toricDivisor PP2, i -> i === -1)

i6 : D2 = toricDivisor convexHull (id_(ZZ^3) | - id_(ZZ^3))

o6 = D  + D  + D  + D  + D  + D  + D  + D
      0    1    2    3    4    5    6    7

o6 : ToricDivisor on normalToricVariety ({{1, 1, 1}, {-1, 1, 1}, {1, -1, 1}, {-1, -1, 1}, {1, 1, -1}, {-1, 1, -1}, {1, -1, -1}, {-1, -1, -1}}, {{0, 1, 2, 3}, {0, 1, 4, 5}, {0, 2, 4, 6}, {1, 3, 5, 7}, {2, 3, 6, 7}, {4, 5, 6, 7}})

i7 : entries D2

o7 = {1, 1, 1, 1, 1, 1, 1, 1}

o7 : List

i8 : assert all(entries D2, i -> i === 1)

i9 : 
