-- -*- M2-comint -*- hash: -1566210687

i1 : toricProjectiveSpace 3

o1 = normalToricVariety ({{-1, -1, -1}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}}, {{0, 1, 2}, {0, 1, 3}, {0, 2, 3}, {1, 2, 3}})

o1 : NormalToricVariety

i2 : expression toricProjectiveSpace 3

o2 = normalToricVariety ({{-1, -1, -1}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}}, {{0, 1, 2}, {0, 1, 3}, {0, 2, 3}, {1, 2, 3}})

o2 : Expression of class Adjacent

i3 : rays toricProjectiveSpace 3

o3 = {{-1, -1, -1}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}}

o3 : List

i4 : max toricProjectiveSpace 3

o4 = {{0, 1, 2}, {0, 1, 3}, {0, 2, 3}, {1, 2, 3}}

o4 : List

i5 : hirzebruchSurface 7

o5 = normalToricVariety ({{1, 0}, {0, 1}, {-1, 7}, {0, -1}}, {{0, 1}, {0, 3}, {1, 2}, {2, 3}})

o5 : NormalToricVariety

i6 : expression hirzebruchSurface 7

o6 = normalToricVariety ({{1, 0}, {0, 1}, {-1, 7}, {0, -1}}, {{0, 1}, {0, 3}, {1, 2}, {2, 3}})

o6 : Expression of class Adjacent

i7 : rays hirzebruchSurface 7

o7 = {{1, 0}, {0, 1}, {-1, 7}, {0, -1}}

o7 : List

i8 : max hirzebruchSurface 7

o8 = {{0, 1}, {0, 3}, {1, 2}, {2, 3}}

o8 : List

i9 : PP2 = toricProjectiveSpace 3

o9 = PP2

o9 : NormalToricVariety

i10 : expression PP2

o10 = PP2

o10 : Expression of class Holder

i11 : FF7 = hirzebruchSurface 7

o11 = FF7

o11 : NormalToricVariety

i12 : expression FF7

o12 = FF7

o12 : Expression of class Holder

i13 : 
