-- -*- M2-comint -*- hash: 743771472

i1 : PP1 = toricProjectiveSpace 1;

i2 : assert (isSimplicial PP1 and isProjective PP1)

i3 : FF7 = hirzebruchSurface 7;

i4 : assert (isSimplicial FF7 and isProjective FF7)

i5 : AA3 = affineSpace 3;

i6 : assert (isSimplicial AA3 and not isComplete AA3 and # max AA3 === 1)

i7 : P12234 = weightedProjectiveSpace {1,2,2,3,4};

i8 : assert (isSimplicial P12234 and isProjective P12234)

i9 : U = normalToricVariety ({{4,-1},{0,1}},{{0,1}});

i10 : assert (isSimplicial U and not isSmooth U)

i11 : Q = normalToricVariety ({{1,0,0},{0,1,0},{0,0,1},{1,1,-1}},{{0,1,2,3}});

i12 : assert (not isSmooth Q and not isSimplicial Q and not isComplete Q)

i13 : Y = normalToricVariety ( id_(ZZ^3) | - id_(ZZ^3));

i14 : assert (not isSimplicial Y and isProjective Y)

i15 : 
