-- -*- M2-comint -*- hash: -280940000

i1 : PP3 = toricProjectiveSpace 3;

i2 : assert all (3, i -> isCartier PP3_i)

i3 : W = weightedProjectiveSpace {2,5,7};

i4 : assert isSimplicial W

i5 : assert not isCartier W_0

i6 : assert isQQCartier W_0

i7 : assert isCartier (35*W_0)

i8 : X = normalToricVariety (id_(ZZ^3) | -id_(ZZ^3));

i9 : assert not isCartier X_0

i10 : assert not isQQCartier X_0

i11 : K = toricDivisor X;

o11 : ToricDivisor on X

i12 : assert isCartier K

i13 : 
