-- -*- M2-comint -*- hash: -1777532147

i1 : X = hirzebruchSurface 2;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map(Y, X, matrix {{1,0}})

o3 = | 1 0 |

o3 : ToricMap Y <--- X

i4 : isProper f

o4 = true

i5 : assert (isWellDefined f and source f === X and
         target f === Y and isProper f)

i6 : A = affineSpace 2;

i7 : B = toricBlowup({0,1}, A);

i8 : g = B^[]

o8 = | 1 0 |
     | 0 1 |

o8 : ToricMap A <--- B

i9 : isProper g

o9 = true

i10 : assert(isWellDefined g and g == map(A, B, 1) and isProper g)

i11 : A = affineSpace 2;

i12 : P = toricProjectiveSpace 2;

i13 : f = map(P, A, 1)

o13 = | 1 0 |
      | 0 1 |

o13 : ToricMap P <--- A

i14 : isProper f

o14 = false

i15 : isDominant f

o15 = true

i16 : assert (isWellDefined f and not isProper f and isDominant f)

i17 : 
