-- -*- M2-comint -*- hash: 220931569

i1 : PP3 = toricProjectiveSpace 3;

i2 : assert all (# rays PP3, i -> isAmple PP3_i)

i3 : X1 = hirzebruchSurface 2;

i4 : assert not any (# rays X1, i -> isAmple X1_i)

i5 : D = X1_2 + X1_3

o5 = X1  + X1
       2     3

o5 : ToricDivisor on X1

i6 : assert isAmple D

i7 : assert isProjective X1

i8 : X2 = smoothFanoToricVariety (3,5);

i9 : K = toricDivisor X2

o9 = - X2  - X2  - X2  - X2  - X2  - X2
         0     1     2     3     4     5

o9 : ToricDivisor on X2

i10 : assert isAmple (- K)

i11 : X3 = kleinschmidt (9,{1,2,3});

i12 : K = toricDivisor X3

o12 = - X3  - X3  - X3  - X3  - X3  - X3  - X3  - X3  - X3  - X3  - X3
          0     1     2     3     4     5     6     7     8     9     10

o12 : ToricDivisor on X3

i13 : assert isAmple (-K)

i14 : 
