-- -*- M2-comint -*- hash: -245381985

i1 : X = toricProjectiveSpace 2;

i2 : Y = hirzebruchSurface 2;

i3 : XY = X ** Y;

i4 : pi0 = XY^[0]

o4 = | 1 0 0 0 |
     | 0 1 0 0 |

o4 : ToricMap X <--- XY

i5 : isSurjective pi0

o5 = true

i6 : assert (isWellDefined pi0 and isSurjective pi0)

i7 : pi1 = XY^[1]

o7 = | 0 0 1 0 |
     | 0 0 0 1 |

o7 : ToricMap Y <--- XY

i8 : isSurjective pi1

o8 = true

i9 : assert (isWellDefined pi1 and isSurjective pi1)

i10 : A = affineSpace 2;

i11 : f = map(X, A, 1)

o11 = | 1 0 |
      | 0 1 |

o11 : ToricMap X <--- A

i12 : isDominant f

o12 = true

i13 : isSurjective f

o13 = false

i14 : assert (isWellDefined f and isDominant f and not isSurjective f)

i15 : Y = (toricProjectiveSpace 1) ** (toricProjectiveSpace 1);

i16 : X = normalToricVariety(
          {{1,0},{1,1},{0,1},{-1,1},{-1,0},{-1,-1},{0,-1},{1,-1}},
          {{0},{1},{2},{3},{4},{5},{6},{7}});

i17 : g = map(Y,X,1)

o17 = | 1 0 |
      | 0 1 |

o17 : ToricMap Y <--- X

i18 : isSurjective g

o18 = true

i19 : isComplete X

o19 = false

i20 : assert (isWellDefined g and isSurjective g and not isComplete X)

i21 : 
