-- -*- M2-comint -*- hash: 538471787

i1 : PP3 = toricProjectiveSpace 3;

i2 : assert isAmple PP3_0

i3 : assert isVeryAmple PP3_0

i4 : FF2 = hirzebruchSurface 2;

i5 : assert isAmple (FF2_2 + FF2_3)

i6 : assert isVeryAmple (FF2_2 + FF2_3)

i7 : X = normalToricVariety matrix {{0,1,0,0,1},{0,0,1,0,1},{0,0,0,1,1},{0,0,0,0,3}};

i8 : assert (dim X === 4)

i9 : D = 3*X_0

o9 = 3*X
        0

o9 : ToricDivisor on X

i10 : assert isAmple D

i11 : assert not isVeryAmple D

i12 : assert not isVeryAmple (2*D)

i13 : assert isVeryAmple (3*D)

i14 : 
