-- -*- M2-comint -*- hash: -1023765744

i1 : PP3 = toricProjectiveSpace 3;

i2 : S = ring PP3

o2 = S

o2 : PolynomialRing

i3 : gens S

o3 = {x , x , x , x }
       0   1   2   3

o3 : List

i4 : degrees S

o4 = {{1}, {1}, {1}, {1}}

o4 : List

i5 : normalToricVariety S

o5 = PP3

o5 : NormalToricVariety

i6 : assert (PP3 === normalToricVariety S)

i7 : variety S

o7 = PP3

o7 : NormalToricVariety

i8 : assert (PP3 === variety S)

i9 : S = QQ[x_0..x_2];

i10 : gens S

o10 = {x , x , x }
        0   1   2

o10 : List

i11 : degrees S

o11 = {{1}, {1}, {1}}

o11 : List

i12 : assert (try (normalToricVariety S; false) else true)

i13 : assert (try (variety S; false) else true)

i14 : 
