-- -*- M2-comint -*- hash: -449930653

i1 : X = hirzebruchSurface 1;

i2 : Y = toricProjectiveSpace 2;

i3 : f = map(Y, X, matrix{{1,0},{0,-1}})

o3 = | 1 0  |
     | 0 -1 |

o3 : ToricMap Y <--- X

i4 : Omega = cotangentSheaf Y

o4 = cokernel {2} | x_2  |
              {2} | x_0  |
              {2} | -x_1 |

                                         3
o4 : coherent sheaf on Y, quotient of OO  (-2)
                                        Y

i5 : F = pullback(f, Omega)

o5 = cokernel {0, 2} | x_3     |
              {0, 2} | x_1x_2  |
              {0, 2} | -x_0x_1 |

                                         3
o5 : coherent sheaf on X, quotient of OO   (0, -2)
                                        X

i6 : (R = ring X, S = ring Y);

i7 : inducedMap f

o7 = map (R, S, {x x , x x , x })
                  1 2   0 1   3

o7 : RingMap R <--- S

i8 : presentation module Omega

o8 = {2} | x_2  |
     {2} | x_0  |
     {2} | -x_1 |

             3       1
o8 : Matrix S  <--- S

i9 : presentation module F

o9 = {0, 2} | x_3     |
     {0, 2} | x_1x_2  |
     {0, 2} | -x_0x_1 |

             3       1
o9 : Matrix R  <--- R

i10 : assert (isWellDefined f and isHomogeneous module F)

i11 : D = Y_0 + 2*Y_1 + 3*Y_2

o11 = Y  + 2*Y  + 3*Y
       0      1      2

o11 : ToricDivisor on Y

i12 : L = pullback(f, OO D)

         1
o12 = OO   (0, 6)
        X

o12 : coherent sheaf on X

i13 : D' = pullback(f, D)

o13 = 2*X  + 3*X  + X  + 3*X
         0      1    2      3

o13 : ToricDivisor on X

i14 : OO D'

         1
o14 = OO   (0, 6)
        X

o14 : coherent sheaf on X

i15 : assert (isWellDefined f and L === OO pullback(f, D))

i16 : 
