-- -*- M2-comint -*- hash: 691978913

i1 : P = toricProjectiveSpace 1;

i2 : X = P ** P;

i3 : f = X^[0]

o3 = | 1 0 |

o3 : ToricMap P <--- X

i4 : pullback(f, P_0)

o4 = X
      0

o4 : ToricDivisor on X

i5 : pullback(f, 2*P_0 - 6*P_1)

o5 = 2*X  - 6*X
        0      1

o5 : ToricDivisor on X

i6 : assert (isWellDefined f and f == map(P, X, matrix {{1,0}}))

i7 : A = affineSpace 2, max A

o7 = (A, {{0, 1}})

o7 : Sequence

i8 : B = toricBlowup({0,1}, A);

i9 : g = B^[]

o9 = | 1 0 |
     | 0 1 |

o9 : ToricMap A <--- B

i10 : pullback(g, A_0)

o10 = B  + B
       0    2

o10 : ToricDivisor on B

i11 : pullback(g, -3*A_0 + 7*A_1)

o11 = - 3*B  + 7*B  + 4*B
           0      1      2

o11 : ToricDivisor on B

i12 : 
