-- -*- M2-comint -*- hash: 1847010318

i1 : PP3 = toricProjectiveSpace 3;

i2 : S = ring PP3;

i3 : assert (isPolynomialRing S and isCommutative S)

i4 : gens S

o4 = {x , x , x , x }
       0   1   2   3

o4 : List

i5 : degrees S

o5 = {{1}, {1}, {1}, {1}}

o5 : List

i6 : assert (numgens S == #rays PP3)

i7 : coefficientRing S

o7 = QQ

o7 : Ring

i8 : X = toricProjectiveSpace(2) ** toricProjectiveSpace(3);

i9 : gens ring X

o9 = {x , x , x , x , x , x , x }
       0   1   2   3   4   5   6

o9 : List

i10 : degrees ring X

o10 = {{1, 0}, {1, 0}, {1, 0}, {0, 1}, {0, 1}, {0, 1}, {0, 1}}

o10 : List

i11 : FF3 = hirzebruchSurface 3;

i12 : gens ring FF3

o12 = {x , x , x , x }
        0   1   2   3

o12 : List

i13 : degrees ring FF3

o13 = {{1, 0}, {-3, 1}, {1, 0}, {0, 1}}

o13 : List

i14 : 
