-- -*- M2-comint -*- hash: -824105495

i1 : X = hirzebruchSurface 2;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map(Y, X, matrix {{1, 0}})

o3 = | 1 0 |

o3 : ToricMap Y <--- X

i4 : target f

o4 = Y

o4 : NormalToricVariety

i5 : assert (isWellDefined f and target f === Y)

i6 : X2 = X ** X

o6 = X2

o6 : NormalToricVariety

i7 : pi0 = X2^[0]

o7 = | 1 0 0 0 |
     | 0 1 0 0 |

o7 : ToricMap X <--- X2

i8 : target pi0

o8 = X

o8 : NormalToricVariety

i9 : assert (isWellDefined pi0 and target pi0 === X)

i10 : pi1 = X2^[1]

o10 = | 0 0 1 0 |
      | 0 0 0 1 |

o10 : ToricMap X <--- X2

i11 : target pi1

o11 = X

o11 : NormalToricVariety

i12 : assert (isWellDefined pi1 and target pi1 === X)

i13 : assert (numRows matrix f == dim Y)

i14 : 
