-- -*- M2-comint -*- hash: 2033208140

i1 : P1 = convexHull matrix{{0,1,0},{0,0,1}};

i2 : D1 = toricDivisor P1

o2 = D
      2

o2 : ToricDivisor on normalToricVariety ({{1, 0}, {0, 1}, {-1, -1}}, {{0, 1}, {0, 2}, {1, 2}})

i3 : X = variety D1;

i4 : D1

o4 = X
      2

o4 : ToricDivisor on X

i5 : P2 = convexHull matrix{{-1,0,-1},{0,0,1}};

i6 : D2 = toricDivisor P2

o6 = D
      0

o6 : ToricDivisor on normalToricVariety ({{1, 0}, {0, 1}, {-1, -1}}, {{0, 1}, {0, 2}, {1, 2}})

i7 : P3 = convexHull matrix{{0,1,0},{-1,-1,0}};

i8 : D3 = toricDivisor P3

o8 = D
      1

o8 : ToricDivisor on normalToricVariety ({{1, 0}, {0, 1}, {-1, -1}}, {{0, 1}, {0, 2}, {1, 2}})

i9 : P4 = convexHull matrix{{-1,2,-1},{-1,-1,2}};

i10 : D4 = toricDivisor(P4, CoefficientRing => ZZ/2)

o10 = D  + D  + D
       0    1    2

o10 : ToricDivisor on normalToricVariety ({{1, 0}, {0, 1}, {-1, -1}}, {{0, 1}, {0, 2}, {1, 2}})

i11 : ring variety D4

      ZZ
o11 = --[x ..x ]
       2  0   2

o11 : PolynomialRing

i12 : 
