-- -*- M2-comint -*- hash: 1757322539

i1 : PP2 = toricProjectiveSpace 2;

i2 : # rays PP2

o2 = 3

i3 : weilDivisorGroup PP2

       3
o3 = ZZ

o3 : ZZ-module, free

i4 : FF7 = hirzebruchSurface 7;

i5 : # rays FF7

o5 = 4

i6 : weilDivisorGroup FF7

       4
o6 = ZZ

o6 : ZZ-module, free

i7 : U = normalToricVariety ({{4,-1},{0,1}},{{0,1}});

i8 : # rays U

o8 = 2

i9 : weilDivisorGroup U

       2
o9 = ZZ

o9 : ZZ-module, free

i10 : 
