-- -*- M2-comint -*- hash: -538031107

i1 : betti res coker pureFree({0,1,2,4}, QQ[a,b,c]) -- degree sequence {0,1,2,4}

            0 1 2 3
o1 = total: 3 8 6 1
         0: 3 8 6 .
         1: . . . 1

o1 : BettiTally

i2 : betti res coker pureFree({0,1,2,4}, ZZ/2[a,b,c]) -- same map, but reduced mod 2

            0 1 2 3
o2 = total: 3 8 6 1
         0: 3 8 6 .
         1: . . . 1

o2 : BettiTally

i3 : betti res coker pureFree({0,1,2,4}, GF(4)[a,b,c]) -- can also use non prime fields

            0 1 2 3
o3 = total: 3 8 6 1
         0: 3 8 6 .
         1: . . . 1

o3 : BettiTally

i4 : 
