-- -*- M2-comint -*- hash: 1291296257

i1 : E=QQ[e_1..e_4,SkewCommutative=>true]

o1 = E

o1 : PolynomialRing, 4 skew commutative variables

i2 : hilbertSequence ideal {e_1*e_2,e_2*e_3*e_4}

o2 = {1, 4, 5, 1, 0}

o2 : List

i3 : hilbertSequence ideal {e_2*e_3*e_4}

o3 = {1, 4, 6, 3, 0}

o3 : List

i4 : 
