-- -*- M2-comint -*- hash: -436677528

i1 : E=QQ[e_1..e_4,SkewCommutative=>true]

o1 = E

o1 : PolynomialRing, 4 skew commutative variables

i2 : initialDegree ideal {e_1*e_2,e_2*e_3*e_4}

o2 = 2

i3 : initialDegree ideal {e_1*e_3*e_4}

o3 = 3

i4 : 
