-- -*- M2-comint -*- hash: -1232493627

i1 : E=QQ[e_1..e_5,SkewCommutative=>true]

o1 = E

o1 : PolynomialRing, 5 skew commutative variables

i2 : I=ideal {e_1*e_2+e_3*e_4*e_5,e_1*e_3+e_4*e_5,e_2*e_3*e_4}

o2 = ideal (e e e  + e e , e e  + e e , e e e )
             3 4 5    1 2   1 3    4 5   2 3 4

o2 : Ideal of E

i3 : initialIdeal I

o3 = ideal (e e e , e e e , e e e , e e e , e e , e e )
             2 3 4   1 4 5   2 4 5   3 4 5   1 2   1 3

o3 : Ideal of E

i4 : 
