-- -*- M2-comint -*- hash: -1064380375

i1 : E=QQ[e_1..e_4,SkewCommutative=>true]

o1 = E

o1 : PolynomialRing, 4 skew commutative variables

i2 : lexIdeal({1,4,3,1,0},E) 

o2 = ideal (e e , e e , e e )
             1 2   1 3   1 4

o2 : Ideal of E

i3 : Ilex=lexIdeal ideal {e_1*e_2,e_2*e_3}

o3 = ideal (e e , e e )
             1 2   1 3

o3 : Ideal of E

i4 : isLexIdeal Ilex

o4 = true

i5 : 
