-- -*- M2-comint -*- hash: -183429518

i1 : macaulayExpansion(8,4)

o1 = {{5, 4}, {3, 3}, {2, 2}, {1, 1}}

o1 : List

i2 : macaulayExpansion(3,1,Shift=>false)

o2 = {{3, 1}}

o2 : List

i3 : macaulayExpansion(8,4,Shift=>true)

o3 = {{5, 5}, {3, 4}, {2, 3}, {1, 2}}

o3 : List

i4 : macaulayExpansion(3,1,Shift=>true)

o4 = {{3, 2}}

o4 : List

i5 : 
