-- -*- M2-comint -*- hash: -392947999

i1 : kk= ZZ/101

o1 = kk

o1 : QuotientRing

i2 : S = kk[a,b,c]

o2 = S

o2 : PolynomialRing

i3 : R = S/ideal(a^3)

o3 = R

o3 : QuotientRing

i4 : M = R^1/ideal(a)

o4 = cokernel | a |

                            1
o4 : R-module, quotient of R

i5 : C = chainComplex{map(M,R^0,0)}

o5 = cokernel | a | <-- 0
                         
     0                  1

o5 : ChainComplex

i6 : n =resolutionOfChainComplex (C, LengthLimit => 10)

          1             1
o6 = 0 : R  <--------- R  : 0
               | 1 |

                   1
     1 : 0 <----- R  : 1
              0

o6 : ChainComplexMap

i7 : isExact(cone n, LengthLimit=> 10)

o7 = true

i8 : isExact(cone n, LengthLimit=> 12)

o8 = false

i9 : 
