-- -*- M2-comint -*- hash: 155661755

i1 : R = ZZ/101[s,t];

i2 : isVirtual(ideal(s,t),res ideal(t))

o2 = true

i3 : Y = toricProjectiveSpace(1)**toricProjectiveSpace(1);

i4 : S = ring Y;

i5 : B = ideal Y;

o5 : Ideal of S

i6 : J = saturate(intersect(
        ideal(x_1 - x_0, x_3 - 4*x_2),
        ideal(x_1 - 2*x_0, x_3 - 5*x_2),
        ideal(x_1 - 3*x_0, x_3 - 6*x_2)), B);

o6 : Ideal of S

i7 : minres = res J;

i8 : vres = virtualOfPair(J,{{3,1}});

i9 : isVirtual(B,vres)

o9 = true

i10 : isVirtual(B,vres,Strategy=>Determinantal)

o10 = true

i11 : 
