-- -*- M2-comint -*- hash: 668317575

i1 : R = CC[x_(1,1)..x_(2,4)];

i2 : F = (minors(2, genericMatrix(R, 2, 4)))_*;

i3 : numericalImageDim(F, ideal 0_R)

o3 = 5

i4 : R = QQ[x_(1,1)..x_(2,4)];

i5 : F = (minors(2, genericMatrix(R, 2, 4)))_*;

i6 : dim ker map(R,QQ[y_0..y_(#F-1)],F)

o6 = 5

i7 : R = CC[a_(1,1)..a_(14,5)];

i8 : F = sum(1..14, i -> basis(4, R, Variables=>toList(a_(i,1)..a_(i,5))));
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

             1       70
o8 : Matrix R  <--- R

i9 : time numericalImageDim(F, ideal 0_R)
     -- used 0.0892491 seconds

o9 = 69

i10 : 
