-- -*- M2-comint -*- hash: 1729059636

i1 : R = CC[x_(1,1)..x_(2,4)];

i2 : F = (minors(2, genericMatrix(R, 2, 4)))_*;

i3 : W = pseudoWitnessSet(F, ideal 0_R)
Sampling point in source ...
Tracking monodromy loops ...
Points found: 2
Points found: 2
Points found: 2
Points found: 2
Running trace test ...

o3 = a "pseudo-witness set", indicating
     the image has degree 2

o3 : PseudoWitnessSet

i4 : W.isCompletePseudoWitnessSet

o4 = true

i5 : W.degree

o5 = 2

i6 : setRandomSeed 10

o6 = 10

i7 : R = CC[s,t]

o7 = R

o7 : PolynomialRing

i8 : F = basis(3, R)
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o8 = | s3 s2t st2 t3 |

             1       4
o8 : Matrix R  <--- R

i9 : pseudoWitnessSet(F, ideal 0_R)
Sampling point in source ...
Tracking monodromy loops ...
Points found: 2
Points found: 2
Points found: 2
Points found: 2
Running trace test ...
Failed trace test! Trace: .0128189
Tracking monodromy loops ...
Points found: 2
Points found: 3
Points found: 3
Points found: 3
Points found: 3
Running trace test ...

o9 = a "pseudo-witness set", indicating
     the image has degree 3

o9 : PseudoWitnessSet

i10 : degree ker map(QQ[s,t], QQ[y_0..y_3], {s^3,s^2*t,s*t^2,t^3})

o10 = 3

i11 : 
