-- -*- M2-comint -*- hash: 245014558

i1 : G={{1,2},{2,3},{3,1}}

o1 = {{1, 2}, {2, 3}, {3, 1}}

o1 : List

i2 : d = disconnectors(G)

o2 = {{}, {1}, {2}, {3}}

o2 : List

i3 : d = disconnectors(G,EffectiveOnly=>true)

o3 = {{}, {3}, {2}, {1}}

o3 : List

i4 : 
