-- -*- M2-comint -*- hash: -1881429563

i1 : G = digraph  {{1,{}},{2,{1}},{3,{1}},{4,{2,3}}}

o1 = Digraph{1 => {}    }
             2 => {1}
             3 => {1}
             4 => {2, 3}

o1 : Digraph

i2 : R = markovRing (2,2,2,2) -- this ring corresponds to four binary random variables

o2 = R

o2 : PolynomialRing

i3 : S = globalMarkov G

o3 = {{{1}, {4}, {2, 3}}, {{2}, {3}, {4}}}

o3 : List

i4 : I = conditionalIndependenceIdeal (R,S);

o4 : Ideal of R

i5 : netList I_*

     +-------------------------------------------------------------------------------------------------------------------------------------------------------+
o5 = |- p       p        + p       p                                                                                                                         |
     |   1,1,1,2 2,1,1,1    1,1,1,1 2,1,1,2                                                                                                                  |
     +-------------------------------------------------------------------------------------------------------------------------------------------------------+
     |- p       p        + p       p                                                                                                                         |
     |   1,1,2,2 2,1,2,1    1,1,2,1 2,1,2,2                                                                                                                  |
     +-------------------------------------------------------------------------------------------------------------------------------------------------------+
     |- p       p        + p       p                                                                                                                         |
     |   1,2,1,2 2,2,1,1    1,2,1,1 2,2,1,2                                                                                                                  |
     +-------------------------------------------------------------------------------------------------------------------------------------------------------+
     |- p       p        + p       p                                                                                                                         |
     |   1,2,2,2 2,2,2,1    1,2,2,1 2,2,2,2                                                                                                                  |
     +-------------------------------------------------------------------------------------------------------------------------------------------------------+
     |- p       p        + p       p        + p       p        - p       p        - p       p        - p       p        + p       p        + p       p       |
     |   1,1,2,1 1,2,1,1    1,1,1,1 1,2,2,1    1,2,2,1 2,1,1,1    1,2,1,1 2,1,2,1    1,1,2,1 2,2,1,1    2,1,2,1 2,2,1,1    1,1,1,1 2,2,2,1    2,1,1,1 2,2,2,1|
     +-------------------------------------------------------------------------------------------------------------------------------------------------------+
     |- p       p        + p       p        + p       p        - p       p        - p       p        - p       p        + p       p        + p       p       |
     |   1,1,2,2 1,2,1,2    1,1,1,2 1,2,2,2    1,2,2,2 2,1,1,2    1,2,1,2 2,1,2,2    1,1,2,2 2,2,1,2    2,1,2,2 2,2,1,2    1,1,1,2 2,2,2,2    2,1,1,2 2,2,2,2|
     +-------------------------------------------------------------------------------------------------------------------------------------------------------+

i6 : F = marginMap (1,R)

o6 = map (R, R, {p        - p       , p        - p       , p        - p       , p        - p       , p        - p       , p        - p       , p        - p       , p        - p       , p       , p       , p       , p       , p       , p       , p       , p       })
                  1,1,1,1    2,1,1,1   1,1,1,2    2,1,1,2   1,1,2,1    2,1,2,1   1,1,2,2    2,1,2,2   1,2,1,1    2,2,1,1   1,2,1,2    2,2,1,2   1,2,2,1    2,2,2,1   1,2,2,2    2,2,2,2   2,1,1,1   2,1,1,2   2,1,2,1   2,1,2,2   2,2,1,1   2,2,1,2   2,2,2,1   2,2,2,2

o6 : RingMap R <--- R

i7 : J = F I;

o7 : Ideal of R

i8 : netList J_*

     +-------------------------------------+
o8 = |- p       p        + p       p       |
     |   1,1,1,2 2,1,1,1    1,1,1,1 2,1,1,2|
     +-------------------------------------+
     |- p       p        + p       p       |
     |   1,1,2,2 2,1,2,1    1,1,2,1 2,1,2,2|
     +-------------------------------------+
     |- p       p        + p       p       |
     |   1,2,1,2 2,2,1,1    1,2,1,1 2,2,1,2|
     +-------------------------------------+
     |- p       p        + p       p       |
     |   1,2,2,2 2,2,2,1    1,2,2,1 2,2,2,2|
     +-------------------------------------+
     |- p       p        + p       p       |
     |   1,1,2,1 1,2,1,1    1,1,1,1 1,2,2,1|
     +-------------------------------------+
     |- p       p        + p       p       |
     |   1,1,2,2 1,2,1,2    1,1,1,2 1,2,2,2|
     +-------------------------------------+

i9 : netList primaryDecomposition J

     +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
o9 = |ideal (p       , p       , p       , p       , p       p        - p       p       , p       p        - p       p       )                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
     |        1,2,2,2   1,2,2,1   1,2,1,2   1,2,1,1   1,1,2,2 2,1,2,1    1,1,2,1 2,1,2,2   1,1,1,2 2,1,1,1    1,1,1,1 2,1,1,2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
     +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
     |ideal (p       , p       , p       , p       , p       p        - p       p       , p       p        - p       p       )                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
     |        1,2,2,2   1,2,2,1   1,1,2,2   1,1,2,1   1,2,1,2 2,2,1,1    1,2,1,1 2,2,1,2   1,1,1,2 2,1,1,1    1,1,1,1 2,1,1,2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
     +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
     |ideal (p       , p       , p       , p       , p       p        - p       p       , p       p        - p       p       )                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
     |        1,2,1,2   1,2,1,1   1,1,1,2   1,1,1,1   1,2,2,2 2,2,2,1    1,2,2,1 2,2,2,2   1,1,2,2 2,1,2,1    1,1,2,1 2,1,2,2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
     +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
     |ideal (p       , p       , p       , p       , p       p        - p       p       , p       p        - p       p       )                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
     |        1,1,2,2   1,1,2,1   1,1,1,2   1,1,1,1   1,2,2,2 2,2,2,1    1,2,2,1 2,2,2,2   1,2,1,2 2,2,1,1    1,2,1,1 2,2,1,2                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          |
     +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
     |ideal (p       p        - p       p       , p       p        - p       p       , p       p        - p       p       , p       p        - p       p       , p       p        - p       p       , p       p        - p       p       , p       p       p       p        - p       p       p       p       , p       p       p       p        - p       p       p       p       , p       p       p       p        - p       p       p       p       , p       p       p       p        - p       p       p       p       , p       p       p       p        - p       p       p       p       , p       p       p       p        - p       p       p       p       , p       p       p       p        - p       p       p       p       , p       p       p       p        - p       p       p       p       , p       p       p       p        - p       p       p       p       )|
     |        1,2,2,2 2,2,2,1    1,2,2,1 2,2,2,2   1,2,1,2 2,2,1,1    1,2,1,1 2,2,1,2   1,1,2,2 2,1,2,1    1,1,2,1 2,1,2,2   1,1,1,2 2,1,1,1    1,1,1,1 2,1,1,2   1,1,2,2 1,2,1,2    1,1,1,2 1,2,2,2   1,1,2,1 1,2,1,1    1,1,1,1 1,2,2,1   2,1,1,1 2,1,2,2 2,2,1,2 2,2,2,1    2,1,1,2 2,1,2,1 2,2,1,1 2,2,2,2   1,1,1,1 2,1,2,2 2,2,1,2 2,2,2,1    1,1,1,2 2,1,2,1 2,2,1,1 2,2,2,2   1,1,2,2 2,1,1,1 2,2,1,2 2,2,2,1    1,1,2,1 2,1,1,2 2,2,1,1 2,2,2,2   1,1,1,1 1,1,2,2 2,2,1,2 2,2,2,1    1,1,1,2 1,1,2,1 2,2,1,1 2,2,2,2   1,2,1,2 2,1,1,1 2,1,2,2 2,2,2,1    1,2,1,1 2,1,1,2 2,1,2,1 2,2,2,2   1,1,1,1 1,2,1,2 2,1,2,2 2,2,2,1    1,1,1,2 1,2,1,1 2,1,2,1 2,2,2,2   1,2,2,2 2,1,1,2 2,1,2,1 2,2,1,1    1,2,2,1 2,1,1,1 2,1,2,2 2,2,1,2   1,1,2,1 1,2,2,2 2,1,1,2 2,2,1,1    1,1,2,2 1,2,2,1 2,1,1,1 2,2,1,2   1,2,1,1 1,2,2,2 2,1,1,2 2,1,2,1    1,2,1,2 1,2,2,1 2,1,1,1 2,1,2,2 |
     +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

i10 : G = mixedGraph (digraph {{b,{c,d}},{c,{d}}},bigraph {{a,d}})

o10 = MixedGraph{Bigraph => Bigraph{a => {d}}   }
                                    d => {a}
                 Digraph => Digraph{b => {c, d}}
                                    c => {d}
                                    d => {}
                 Graph => Graph{}

o10 : MixedGraph

i11 : R = gaussianRing G

o11 = R

o11 : PolynomialRing

i12 : J = trekIdeal (R,G);

o12 : Ideal of R

i13 : J / print;
s
 a,b
s
 a,c
- s   s    + s   s
   a,c b,b    a,b b,c
- s   s    + s   s
   a,c b,b    a,b b,c
- s   s    + s   s
   a,c b,c    a,b c,c
s   s    - s   s
 a,c b,d    a,b c,d

i14 : R=gaussianRing 5

o14 = R

o14 : PolynomialRing

i15 : S={{{1},{2},{3,4}}, {{2,3},{1},{5}}}

o15 = {{{1}, {2}, {3, 4}}, {{2, 3}, {1}, {5}}}

o15 : List

i16 : I=conditionalIndependenceIdeal (R,S);

o16 : Ideal of R

i17 : I / print;
                                                    2
- s   s   s    + s   s   s    + s   s   s    - s   s    - s   s   s    + s   s   s
   1,4 2,4 3,3    1,4 2,3 3,4    1,3 2,4 3,4    1,2 3,4    1,3 2,3 4,4    1,2 3,3 4,4
- s   s    + s   s
   1,3 2,5    1,2 3,5
- s   s    + s   s
   1,5 2,5    1,2 5,5
- s   s    + s   s
   1,5 3,5    1,3 5,5

i18 : 
