-- -*- M2-comint -*- hash: 1625327879

i1 : G = mixedGraph(digraph {{b,{c,d}},{c,{d}}},bigraph {{a,d}})

o1 = MixedGraph{Bigraph => Bigraph{a => {d}}   }
                                   d => {a}
                Digraph => Digraph{b => {c, d}}
                                   c => {d}
                                   d => {}
                Graph => Graph{}

o1 : MixedGraph

i2 : R = gaussianRing G

o2 = R

o2 : PolynomialRing

i3 : compactMatrixForm =false;

i4 : bidirectedEdgesMatrix R

o4 = |  p       0     0   p     |
     |   a,a               a,d  |
     |                          |
     |    0   p       0     0   |
     |         b,b              |
     |                          |
     |    0     0   p       0   |
     |               c,c        |
     |                          |
     |  p       0     0   p     |
     |   a,d               d,d  |

             4       4
o4 : Matrix R  <--- R

i5 : G = mixedGraph(digraph {{1,3},{2,4}},bigraph {{3,4}},graph {{1,2}});

i6 : R = gaussianRing G

o6 = R

o6 : PolynomialRing

i7 : bidirectedEdgesMatrix R

o7 = |  p     p     |
     |   3,3   3,4  |
     |              |
     |  p     p     |
     |   3,4   4,4  |

             2       2
o7 : Matrix R  <--- R

i8 : G = bigraph {{a,d},{b},{c}}

o8 = Bigraph{a => {d}}
             b => {}
             c => {}
             d => {a}

o8 : Bigraph

i9 : R = gaussianRing G

o9 = R

o9 : PolynomialRing

i10 : bidirectedEdgesMatrix R

o10 = |  p       0     0   p     |
      |   a,a               a,d  |
      |                          |
      |    0   p       0     0   |
      |         b,b              |
      |                          |
      |    0     0   p       0   |
      |               c,c        |
      |                          |
      |  p       0     0   p     |
      |   a,d               d,d  |

              4       4
o10 : Matrix R  <--- R

i11 : 
