-- -*- M2-comint -*- hash: -799456934

i1 : U = graph {{1,2},{2,3}}

o1 = Graph{1 => {2}   }
           2 => {1, 3}
           3 => {2}

o1 : Graph

i2 : B = bigraph{{4,5}}

o2 = Bigraph{4 => {5}}
             5 => {4}

o2 : Bigraph

i3 : D = digraph {{1,4}}

o3 = Digraph{1 => {4}}
             4 => {}

o3 : Digraph

i4 : R = gaussianRing mixedGraph(U,B,D)

o4 = R

o4 : PolynomialRing

i5 : R.gaussianRingData

o5 = HashTable{compU => {1, 2, 3}}
               compW => {4, 5}
               kVar => k
               lVar => l
               nn => 5
               pVar => p
               sVar => s

o5 : HashTable

i6 : U = graph {{1,2},{2,3}}

o6 = Graph{1 => {2}   }
           2 => {1, 3}
           3 => {2}

o6 : Graph

i7 : B = bigraph{{4,5}}

o7 = Bigraph{4 => {5}}
             5 => {4}

o7 : Bigraph

i8 : D = digraph {{1,4}}

o8 = Digraph{1 => {4}}
             4 => {}

o8 : Digraph

i9 : R1 = gaussianRing B

o9 = R1

o9 : PolynomialRing

i10 : R2 = gaussianRing D

o10 = R2

o10 : PolynomialRing

i11 : R1.gaussianRingData

o11 = HashTable{compU => {}    }
                compW => {4, 5}
                kVar => k
                lVar => l
                nn => 2
                pVar => p
                sVar => s

o11 : HashTable

i12 : R2.gaussianRingData

o12 = HashTable{compU => {}    }
                compW => {1, 4}
                kVar => k
                lVar => l
                nn => 2
                pVar => p
                sVar => s

o12 : HashTable

i13 : 
      
