-- -*- M2-comint -*- hash: -1359128048

i1 : G = digraph {{1,{}}, {2,{}}}

o1 = Digraph{1 => {}}
             2 => {}

o1 : Digraph

i2 : R = markovRing (2,2)

o2 = R

o2 : PolynomialRing

i3 : discreteVanishingIdeal (R,G)

o3 = ideal(p   p    - p   p   )
            1,2 2,1    1,1 2,2

o3 : Ideal of R

i4 : conditionalIndependenceIdeal(R, localMarkov G)

o4 = ideal(- p   p    + p   p   )
              1,2 2,1    1,1 2,2

o4 : Ideal of R

i5 : G = digraph {{a,{b,c}}, {b,{c,d}}, {c,{}}, {d,{}}}

o5 = Digraph{a => {c, b}}
             b => {c, d}
             c => {}
             d => {}

o5 : Digraph

i6 : R = markovRing (2,3,4,2)

o6 = R

o6 : PolynomialRing

i7 : I = discreteVanishingIdeal (R,G);

o7 : Ideal of R

i8 : betti I

            0  1
o8 = total: 1 84
         0: 1  .
         1: . 84

o8 : BettiTally

i9 : 
