-- -*- M2-comint -*- hash: -84486095

i1 : R = gaussianRing 5

o1 = R

o1 : PolynomialRing

i2 : gaussianRingData

o2 = gaussianRingData

o2 : Symbol

i3 : R=gaussianRing graph {{1,2},{2,3}}

o3 = R

o3 : PolynomialRing

i4 : R.gaussianRingData

o4 = HashTable{kVar => k}
               nn => 3
               sVar => s

o4 : HashTable

i5 : U = graph {{1,2},{2,3}}

o5 = Graph{1 => {2}   }
           2 => {1, 3}
           3 => {2}

o5 : Graph

i6 : B = bigraph{{4,5}}

o6 = Bigraph{4 => {5}}
             5 => {4}

o6 : Bigraph

i7 : D = digraph {{1,4}}

o7 = Digraph{1 => {4}}
             4 => {}

o7 : Digraph

i8 : R1 = gaussianRing B

o8 = R1

o8 : PolynomialRing

i9 : R2 = gaussianRing D

o9 = R2

o9 : PolynomialRing

i10 : R3 = gaussianRing mixedGraph(U,B,D)

o10 = R3

o10 : PolynomialRing

i11 : R1.gaussianRingData

o11 = HashTable{compU => {}    }
                compW => {4, 5}
                kVar => k
                lVar => l
                nn => 2
                pVar => p
                sVar => s

o11 : HashTable

i12 : R2.gaussianRingData

o12 = HashTable{compU => {}    }
                compW => {1, 4}
                kVar => k
                lVar => l
                nn => 2
                pVar => p
                sVar => s

o12 : HashTable

i13 : R3.gaussianRingData

o13 = HashTable{compU => {1, 2, 3}}
                compW => {4, 5}
                kVar => k
                lVar => l
                nn => 5
                pVar => p
                sVar => s

o13 : HashTable

i14 : 
