-- -*- M2-comint -*- hash: -1004079870

i1 : d=(2,3,4,5);

i2 : R = markovRing d;

i3 : numgens R

o3 = 120

i4 : R_0, R_1, R_119 --here are some of the variables in the ring

o4 = (p       , p       , p       )
       1,1,1,1   1,1,1,2   2,3,4,5

o4 : Sequence

i5 : coefficientRing R

o5 = QQ

o5 : Ring

i6 : R2 = markovRing (d,Coefficients=>CC);

i7 : coefficientRing R2

o7 = CC
       53

o7 : ComplexField

i8 : d=(1,2);

i9 : markovRing (d,VariableName => q);

i10 : gens oo

o10 = {q   , q   }
        1,1   1,2

o10 : List

i11 : 
