-- -*- M2-comint -*- hash: -480887240

i1 : S = {{{1},{3},{4}}}

o1 = {{{1}, {3}, {4}}}

o1 : List

i2 : R = markovRing (4:2)

o2 = R

o2 : PolynomialRing

i3 : compactMatrixForm =false;

i4 : netList markovMatrices (R,S)

     +----------------------------------------------+
o4 = ||  p        + p         p        + p         ||
     ||   1,1,1,1    1,2,1,1   1,1,2,1    1,2,2,1  ||
     ||                                            ||
     ||  p        + p         p        + p         ||
     ||   2,1,1,1    2,2,1,1   2,1,2,1    2,2,2,1  ||
     +----------------------------------------------+
     ||  p        + p         p        + p         ||
     ||   1,1,1,2    1,2,1,2   1,1,2,2    1,2,2,2  ||
     ||                                            ||
     ||  p        + p         p        + p         ||
     ||   2,1,1,2    2,2,1,2   2,1,2,2    2,2,2,2  ||
     +----------------------------------------------+

i5 : G = graph{{a,b},{b,c},{c,d},{a,d}}

o5 = Graph{a => {b, d}}
           b => {a, c}
           c => {b, d}
           d => {a, c}

o5 : Graph

i6 : S = localMarkov G

o6 = {{{a}, {c}, {d, b}}, {{b}, {d}, {c, a}}}

o6 : List

i7 : R = markovRing (4:2)

o7 = R

o7 : PolynomialRing

i8 : markovMatrices (R,S,vertices G)

o8 = {|  p         p         |, |  p         p         |, |  p       
      |   1,1,1,1   1,1,2,1  |  |   1,1,1,2   1,1,2,2  |  |   1,2,1,1
      |                      |  |                      |  |          
      |  p         p         |  |  p         p         |  |  p       
      |   2,1,1,1   2,1,2,1  |  |   2,1,1,2   2,1,2,2  |  |   2,2,1,1
     ------------------------------------------------------------------------
     p         |, |  p         p         |, |  p         p         |, |
      1,2,2,1  |  |   1,2,1,2   1,2,2,2  |  |   1,1,1,1   1,1,1,2  |  |
               |  |                      |  |                      |  |
     p         |  |  p         p         |  |  p         p         |  |
      2,2,2,1  |  |   2,2,1,2   2,2,2,2  |  |   1,2,1,1   1,2,1,2  |  |
     ------------------------------------------------------------------------
     p         p         |, |  p         p         |, |  p         p       
      1,1,2,1   1,1,2,2  |  |   2,1,1,1   2,1,1,2  |  |   2,1,2,1   2,1,2,2
                         |  |                      |  |                    
     p         p         |  |  p         p         |  |  p         p       
      1,2,2,1   1,2,2,2  |  |   2,2,1,1   2,2,1,2  |  |   2,2,2,1   2,2,2,2
     ------------------------------------------------------------------------
     |}
     |
     |
     |
     |

o8 : List

i9 : 
