-- -*- M2-comint -*- hash: -1647283760

i1 : d=(1,2);

i2 : markovRing (d,VariableName => q);

i3 : gens oo

o3 = {q   , q   }
       1,1   1,2

o3 : List

i4 : 
