-- -*- M2-comint -*- hash: 879110001

i1 : F = marginMap(1,markovRing(3,2));

o1 : RingMap QQ[p   ..p   ] <--- QQ[p   ..p   ]
                 1,1   3,2           1,1   3,2

i2 : compactMatrixForm =false;

i3 : transpose F.matrix

o3 = {-1}  |  p    - p    - p     |
           |   1,1    2,1    3,1  |
           |                      |
     {-1}  |  p    - p    - p     |
           |   1,2    2,2    3,2  |
           |                      |
     {-1}  |         p            |
           |          2,1         |
           |                      |
     {-1}  |         p            |
           |          2,2         |
           |                      |
     {-1}  |         p            |
           |          3,1         |
           |                      |
     {-1}  |         p            |
           |          3,2         |

                            6                      1
o3 : Matrix (QQ[p   ..p   ])  <--- (QQ[p   ..p   ])
                 1,1   3,2              1,1   3,2

i4 : G = digraph  {{1,{}},{2,{1}},{3,{1}},{4,{2,3}}}

o4 = Digraph{1 => {}    }
             2 => {1}
             3 => {1}
             4 => {2, 3}

o4 : Digraph

i5 : R = markovRing (2,2,2,2)

o5 = R

o5 : PolynomialRing

i6 : S = globalMarkov G

o6 = {{{1}, {4}, {2, 3}}, {{2}, {3}, {4}}}

o6 : List

i7 : I = conditionalIndependenceIdeal (R,S);

o7 : Ideal of R

i8 : I / print;
- p       p        + p       p
   1,1,1,2 2,1,1,1    1,1,1,1 2,1,1,2
- p       p        + p       p
   1,1,2,2 2,1,2,1    1,1,2,1 2,1,2,2
- p       p        + p       p
   1,2,1,2 2,2,1,1    1,2,1,1 2,2,1,2
- p       p        + p       p
   1,2,2,2 2,2,2,1    1,2,2,1 2,2,2,2
- p       p        + p       p        + p       p        - p       p        - p       p        - p       p        + p       p        + p       p
   1,1,2,1 1,2,1,1    1,1,1,1 1,2,2,1    1,2,2,1 2,1,1,1    1,2,1,1 2,1,2,1    1,1,2,1 2,2,1,1    2,1,2,1 2,2,1,1    1,1,1,1 2,2,2,1    2,1,1,1 2,2,2,1
- p       p        + p       p        + p       p        - p       p        - p       p        - p       p        + p       p        + p       p
   1,1,2,2 1,2,1,2    1,1,1,2 1,2,2,2    1,2,2,2 2,1,1,2    1,2,1,2 2,1,2,2    1,1,2,2 2,2,1,2    2,1,2,2 2,2,1,2    1,1,1,2 2,2,2,2    2,1,1,2 2,2,2,2

i9 : F = marginMap(1,R);

o9 : RingMap R <--- R

i10 : transpose F.matrix

o10 = {-1}  |  p        - p         |
            |   1,1,1,1    2,1,1,1  |
            |                       |
      {-1}  |  p        - p         |
            |   1,1,1,2    2,1,1,2  |
            |                       |
      {-1}  |  p        - p         |
            |   1,1,2,1    2,1,2,1  |
            |                       |
      {-1}  |  p        - p         |
            |   1,1,2,2    2,1,2,2  |
            |                       |
      {-1}  |  p        - p         |
            |   1,2,1,1    2,2,1,1  |
            |                       |
      {-1}  |  p        - p         |
            |   1,2,1,2    2,2,1,2  |
            |                       |
      {-1}  |  p        - p         |
            |   1,2,2,1    2,2,2,1  |
            |                       |
      {-1}  |  p        - p         |
            |   1,2,2,2    2,2,2,2  |
            |                       |
      {-1}  |        p              |
            |         2,1,1,1       |
            |                       |
      {-1}  |        p              |
            |         2,1,1,2       |
            |                       |
      {-1}  |        p              |
            |         2,1,2,1       |
            |                       |
      {-1}  |        p              |
            |         2,1,2,2       |
            |                       |
      {-1}  |        p              |
            |         2,2,1,1       |
            |                       |
      {-1}  |        p              |
            |         2,2,1,2       |
            |                       |
      {-1}  |        p              |
            |         2,2,2,1       |
            |                       |
      {-1}  |        p              |
            |         2,2,2,2       |

              16       1
o10 : Matrix R   <--- R

i11 : J = F I;

o11 : Ideal of R

i12 : J / print;
- p       p        + p       p
   1,1,1,2 2,1,1,1    1,1,1,1 2,1,1,2
- p       p        + p       p
   1,1,2,2 2,1,2,1    1,1,2,1 2,1,2,2
- p       p        + p       p
   1,2,1,2 2,2,1,1    1,2,1,1 2,2,1,2
- p       p        + p       p
   1,2,2,2 2,2,2,1    1,2,2,1 2,2,2,2
- p       p        + p       p
   1,1,2,1 1,2,1,1    1,1,1,1 1,2,2,1
- p       p        + p       p
   1,1,2,2 1,2,1,2    1,1,1,2 1,2,2,2

i13 : 
