-- -*- M2-comint -*- hash: -1987359370

i1 : R = gaussianRing 5

o1 = R

o1 : PolynomialRing

i2 : R.gaussianRingData

o2 = HashTable{nn => 5}

o2 : HashTable

i3 : U = graph {{1,2},{2,3}}

o3 = Graph{1 => {2}   }
           2 => {1, 3}
           3 => {2}

o3 : Graph

i4 : B = bigraph{{4,5}}

o4 = Bigraph{4 => {5}}
             5 => {4}

o4 : Bigraph

i5 : D = digraph {{1,4}}

o5 = Digraph{1 => {4}}
             4 => {}

o5 : Digraph

i6 : R1 = gaussianRing B

o6 = R1

o6 : PolynomialRing

i7 : R2 = gaussianRing D

o7 = R2

o7 : PolynomialRing

i8 : R3 = gaussianRing U

o8 = R3

o8 : PolynomialRing

i9 : R4 = gaussianRing mixedGraph(U,B,D)

o9 = R4

o9 : PolynomialRing

i10 : R1.gaussianRingData

o10 = HashTable{compU => {}    }
                compW => {4, 5}
                kVar => k
                lVar => l
                nn => 2
                pVar => p
                sVar => s

o10 : HashTable

i11 : R2.gaussianRingData

o11 = HashTable{compU => {}    }
                compW => {1, 4}
                kVar => k
                lVar => l
                nn => 2
                pVar => p
                sVar => s

o11 : HashTable

i12 : R3.gaussianRingData

o12 = HashTable{kVar => k}
                nn => 3
                sVar => s

o12 : HashTable

i13 : R4.gaussianRingData

o13 = HashTable{compU => {1, 2, 3}}
                compW => {4, 5}
                kVar => k
                lVar => l
                nn => 5
                pVar => p
                sVar => s

o13 : HashTable

i14 : 
