-- -*- M2-comint -*- hash: 278707660

i1 : U = graph {{1,2},{2,3}}

o1 = Graph{1 => {2}   }
           2 => {1, 3}
           3 => {2}

o1 : Graph

i2 : B = bigraph{{4,5}}

o2 = Bigraph{4 => {5}}
             5 => {4}

o2 : Bigraph

i3 : D = digraph {{1,4}}

o3 = Digraph{1 => {4}}
             4 => {}

o3 : Digraph

i4 : R1 = gaussianRing B

o4 = R1

o4 : PolynomialRing

i5 : R2 = gaussianRing D

o5 = R2

o5 : PolynomialRing

i6 : R3 = gaussianRing U

o6 = R3

o6 : PolynomialRing

i7 : R4 = gaussianRing mixedGraph(U,B,D)

o7 = R4

o7 : PolynomialRing

i8 : R1.gaussianRingData

o8 = HashTable{compU => {}    }
               compW => {4, 5}
               kVar => k
               lVar => l
               nn => 2
               pVar => p
               sVar => s

o8 : HashTable

i9 : R2.gaussianRingData

o9 = HashTable{compU => {}    }
               compW => {1, 4}
               kVar => k
               lVar => l
               nn => 2
               pVar => p
               sVar => s

o9 : HashTable

i10 : R3.gaussianRingData

o10 = HashTable{kVar => k}
                nn => 3
                sVar => s

o10 : HashTable

i11 : R4.gaussianRingData

o11 = HashTable{compU => {1, 2, 3}}
                compW => {4, 5}
                kVar => k
                lVar => l
                nn => 5
                pVar => p
                sVar => s

o11 : HashTable

i12 : 
