-- -*- M2-comint -*- hash: -321110323

i1 : I = intervalCCi(interval(.5,.8),interval(.6,.9));

i2 : J = intervalCCi(interval(.54,.78),interval(.65,.89));

i3 : K = intervalCCi(interval(.45,.6),interval(.3,.78));

i4 : L = intervalCCi(3,4);

i5 : M = matrixCCi {{I,J},{K,L}}

o5 = |  [.5,.8] + [.6,.9]*ii [.54,.78] + [.65,.89]*ii |
     |  [.45,.6] + [.3,.78]*ii [3,3] + [4,4]*ii |

o5 : CCiMatrix

i6 : N = matrixCCi {{J,K},{L,I}}

o6 = |  [.54,.78] + [.65,.89]*ii [.45,.6] + [.3,.78]*ii |
     |  [3,3] + [4,4]*ii [.5,.8] + [.6,.9]*ii |

o6 : CCiMatrix

i7 : O = matrixCCi {{J,K,L},{I,L+K,J*L}}

o7 = |  [.54,.78] + [.65,.89]*ii [.45,.6] + [.3,.78]*ii
     |  [.5,.8] + [.6,.9]*ii [3.45,3.6] + [4.3,4.78]*ii
     ------------------------------------------------------------------------
     [3,3] + [4,4]*ii |
     [-1.94,-.26] + [4.11,5.79]*ii |

o7 : CCiMatrix

i8 : M + N

o8 = |  [1.04,1.58] + [1.25,1.79]*ii [.99,1.38] + [.95,1.67]*ii |
     |  [3.45,3.6] + [4.3,4.78]*ii [3.5,3.8] + [4.6,4.9]*ii |

o8 : CCiMatrix

i9 : M - N

o9 = |  [-.28,.26] + [-.29,.25]*ii [-.06,.33] + [-.13,.59]*ii |
     |  [-2.55,-2.4] + [-3.7,-3.22]*ii [2.2,2.5] + [3.1,3.4]*ii |

o9 : CCiMatrix

i10 : M * N

o10 = |  [-2.471,-.026] + [4.759,7.204]*ii [-1.008,.534] + [1.069,2.578]*ii 
      |  [-7.4512,-6.727] + [24.4545,25.1424]*ii [-2.5059,.27] + [4.07,6.836
      -----------------------------------------------------------------------
      |
      ]*ii |

o10 : CCiMatrix

i11 : M ^ 2

o11 = |  [-1.0112,.553] + [1.0545,2.5824]*ii [-2.471,-.026] + [4.759,7.204]*
      |  [-2.247,.9] + [3.12,5.904]*ii [-7.4512,-6.727] + [24.4545,25.1424]*
      -----------------------------------------------------------------------
      ii |
      ii |

o11 : CCiMatrix

i12 : entries M

o12 = {{[.5,.8] + [.6,.9]*ii, [.54,.78] + [.65,.89]*ii}, {[.45,.6] +
      -----------------------------------------------------------------------
      [.3,.78]*ii, [3,3] + [4,4]*ii}}

o12 : List

i13 : transpose O

o13 = |  [.54,.78] + [.65,.89]*ii [.5,.8] + [.6,.9]*ii |
      |  [.45,.6] + [.3,.78]*ii [3.45,3.6] + [4.3,4.78]*ii |
      |  [3,3] + [4,4]*ii [-1.94,-.26] + [4.11,5.79]*ii |

o13 : CCiMatrix

i14 : numcols O

o14 = 3

i15 : numrows O

o15 = 2

i16 : norm O

o16 = 12.9840062011914

o16 : RR (of precision 53)

i17 : 
