-- -*- M2-comint -*- hash: -84239928

i1 : I = intervalCCi(interval(.5,.8),interval(.6,.9))

o1 = [.5,.8] + [.6,.9]*ii

o1 : CCi

i2 : J = intervalCCi(interval(.54,.78),interval(.65,.89))

o2 = [.54,.78] + [.65,.89]*ii

o2 : CCi

i3 : K = intervalCCi(interval(.45,.6),interval(.3,.78))

o3 = [.45,.6] + [.3,.78]*ii

o3 : CCi

i4 : L = intervalCCi(3,4)

o4 = [3,3] + [4,4]*ii

o4 : CCi

i5 : I + J

o5 = [1.04,1.58] + [1.25,1.79]*ii

o5 : CCi

i6 : I - J

o6 = [-.28,.26] + [-.29,.25]*ii

o6 : CCi

i7 : I * K

o7 = [-.477,.3] + [.42,1.164]*ii

o7 : CCi

i8 : I / K

o8 = [.418216,4.04103] + [-1.21026,1.33333]*ii

o8 : CCi

i9 : I ^ 3

o9 = [-1.744,-.136] + [-.204,1.404]*ii

o9 : CCi

i10 : 2 * I

o10 = [1,1.6] + [1.2,1.8]*ii

o10 : CCi

i11 : isSubset(I,J)  -- I is not a subset of J

o11 = false

i12 : isSubset(J,I)  -- J is a subset of I

o12 = true

i13 : intersect(I,K)

o13 = [.5,.6] + [.6,.78]*ii

o13 : CCi

i14 : (realPart I, imaginaryPart I)

o14 = ([.5,.8], [.6,.9])

o14 : Sequence

i15 : norm I

o15 = 1.20415945787923

o15 : RR (of precision 53)

i16 : midpointCCi I

o16 = .65+.75*ii

o16 : CC (of precision 53)

i17 : 
