-- -*- M2-comint -*- hash: 1710595371

i1 : R = CC[x,y,z];

i2 : f = polySystem {x^2+y+z-1,x+y^2+z-1,x+y+z^2-1};

i3 : p = point{{1e-7-1e-7*ii,1e-7+1e-7*ii,1+1e-7}};

i4 : certifySingularSolution(f,p)

o4 = true

i5 : R = CC[x,y]

o5 = R

o5 : PolynomialRing

i6 : f = polySystem {x+y^3,x^2*y-y^4};

i7 : p = point {{-3.38813e-21+1.35525e-20*ii, -3.38813e-21+2.03288e-20*ii}};

i8 : certifySingularSolution(f,p,2) -- false, two iterations are not enough

o8 = false

i9 : certifySingularSolution(f,p,3)

o9 = true

i10 : certifySingularSolution(f,p,3,Strategy => "intervalArithmetic")

o10 = true

i11 : 
