-- -*- M2-comint -*- hash: 448591100

i1 : M = matrix {{1., 1, 1}}

o1 = | 1 1 1 |

                1          3
o1 : Matrix RR    <--- RR
              53         53

i2 : numericalKernel(M, Tolerance=>0.01)

o2 = | -.57735  -.57735  |
     | .788675  -.211325 |
     | -.211325 .788675  |

                3          2
o2 : Matrix RR    <--- RR
              53         53

i3 : M = matrix {{1., 1}, {1.001, 1}}

o3 = | 1     1 |
     | 1.001 1 |

                2          2
o3 : Matrix RR    <--- RR
              53         53

i4 : numericalKernel(M, Tolerance=>0.01)

o4 = | .70693   |
     | -.707284 |

                2          1
o4 : Matrix RR    <--- RR
              53         53

i5 : 
