-- -*- M2-comint -*- hash: 729437392

i1 : M = matrix {{1., 0, 1}, {0, 1, 1}, {1, 0, 1}}

o1 = | 1 0 1 |
     | 0 1 1 |
     | 1 0 1 |

                3          3
o1 : Matrix RR    <--- RR
              53         53

i2 : numericalImage(M, 0.01)

o2 = | -.627963 -.325058 |
     | -.459701 .888074  |
     | -.627963 -.325058 |

                3          2
o2 : Matrix RR    <--- RR
              53         53

i3 : M = matrix {{0.999, 2}, {1, 2}}

o3 = | .999 2 |
     | 1    2 |

                2          2
o3 : Matrix RR    <--- RR
              53         53

i4 : numericalImage(M, 0.01)

o4 = | -.707036 |
     | -.707177 |

                2          1
o4 : Matrix RR    <--- RR
              53         53

i5 : 
