-- -*- M2-comint -*- hash: 820067301

i1 : L1= { {{{1,2},{3},{4},{5}},1}, {{{1,3},{2},{4},{5}},1} };

i2 : curveClassRepresentativeM0nbar(5,L1)

o2 = CurveClassRepresentativeM0nbar{CurveExpression => HashTable{{{1, 2}, {3}, {4}, {5}} => 1}}
                                                                 {{1, 3}, {2}, {4}, {5}} => 1
                                    NumberOfMarkedPoints => 5

o2 : CurveClassRepresentativeM0nbar

i3 : L2= { {{1,2},{3},{4},{5}}=>1, {{1,3},{2},{4},{5}}=>1 };

i4 : curveClassRepresentativeM0nbar(5,L2)

o4 = CurveClassRepresentativeM0nbar{CurveExpression => HashTable{{{1, 2}, {3}, {4}, {5}} => 1}}
                                                                 {{1, 3}, {2}, {4}, {5}} => 1
                                    NumberOfMarkedPoints => 5

o4 : CurveClassRepresentativeM0nbar

i5 : L3={ {{{1,2},{3},{4},{5}},1}, {{{1,3},{2},{4},{5}},1}, {{{3},{4},{2,1},{5}},1}};

i6 : curveClassRepresentativeM0nbar(5,L3)

o6 = CurveClassRepresentativeM0nbar{CurveExpression => HashTable{{{1, 2}, {3}, {4}, {5}} => 2}}
                                                                 {{1, 3}, {2}, {4}, {5}} => 1
                                    NumberOfMarkedPoints => 5

o6 : CurveClassRepresentativeM0nbar

i7 : L4={ {{{1,2},{3},{4},{5}},1}, {{{1,3},{2},{4},{5}},1}, {{{3},{4},{2,1},{5}},-1}};

i8 : curveClassRepresentativeM0nbar(5,L4)

o8 = CurveClassRepresentativeM0nbar{CurveExpression => HashTable{{{1, 3}, {2}, {4}, {5}} => 1}}
                                    NumberOfMarkedPoints => 5

o8 : CurveClassRepresentativeM0nbar

i9 : 
