-- -*- M2-comint -*- hash: 1515403871

i1 : L1= { {{1,3},1}, {{1,4},1} }

o1 = {{{1, 3}, 1}, {{1, 4}, 1}}

o1 : List

i2 : divisorClassRepresentativeM0nbar(6,L1)

o2 = DivisorClassRepresentativeM0nbar{DivisorExpression => HashTable{{1, 3} => 1}}
                                                                     {1, 4} => 1
                                      NumberOfMarkedPoints => 6

o2 : DivisorClassRepresentativeM0nbar

i3 : L2= { {1,3}=>1, {1,4}=>1 }

o3 = {{1, 3} => 1, {1, 4} => 1}

o3 : List

i4 : divisorClassRepresentativeM0nbar(6,L2)

o4 = DivisorClassRepresentativeM0nbar{DivisorExpression => HashTable{{1, 3} => 1}}
                                                                     {1, 4} => 1
                                      NumberOfMarkedPoints => 6

o4 : DivisorClassRepresentativeM0nbar

i5 : L3={ {{1,3},1}, {{1,4},1}, {{3,1},1} };

i6 : divisorClassRepresentativeM0nbar(6,L3)

o6 = DivisorClassRepresentativeM0nbar{DivisorExpression => HashTable{{1, 3} => 2}}
                                                                     {1, 4} => 1
                                      NumberOfMarkedPoints => 6

o6 : DivisorClassRepresentativeM0nbar

i7 : L4= { {{1,3},1}, {{1,4},1}, {{2,4,5,6},1} };

i8 : divisorClassRepresentativeM0nbar(6,L4)

o8 = DivisorClassRepresentativeM0nbar{DivisorExpression => HashTable{{1, 3} => 2}}
                                                                     {1, 4} => 1
                                      NumberOfMarkedPoints => 6

o8 : DivisorClassRepresentativeM0nbar

i9 : L5= { {{1,3},1}, {{1,4},1}, {{4,5,6},1} };

i10 : divisorClassRepresentativeM0nbar(6,L5)

o10 = DivisorClassRepresentativeM0nbar{DivisorExpression => HashTable{{1, 2, 3} => 1}}
                                                                      {1, 3} => 1
                                                                      {1, 4} => 1
                                       NumberOfMarkedPoints => 6

o10 : DivisorClassRepresentativeM0nbar

i11 : L6= { {{1,3},1}, {{1,4},1}, {{4,5,6},1},{{1,2,3},-1} };

i12 : divisorClassRepresentativeM0nbar(6,L6)

o12 = DivisorClassRepresentativeM0nbar{DivisorExpression => HashTable{{1, 3} => 1}}
                                                                      {1, 4} => 1
                                       NumberOfMarkedPoints => 6

o12 : DivisorClassRepresentativeM0nbar

i13 : 
