-- -*- M2-comint -*- hash: -1330157751

i1 : A=matrix{{0, 0, 0, 1, 1,5},{7,0, 1, 3, 0, -2},{1,1, 1, 1, 1, 1}}

o1 = | 0 0 0 1 1 5  |
     | 7 0 1 3 0 -2 |
     | 1 1 1 1 1 1  |

              3        6
o1 : Matrix ZZ  <--- ZZ

i2 : cmClass(A)


          5      4      3
o2 = - 12h  + 20h  + 35h

     ZZ[h]
o2 : -----
        6
       h

i3 : A=matrix{{3, 0, 0, 1, 1,2}, {3,5,0,2,1,3},{0, 1, 2, 0, 2,0},{1, 1, 1, 1, 1,1}}

o3 = | 3 0 0 1 1 2 |
     | 3 5 0 2 1 3 |
     | 0 1 2 0 2 0 |
     | 1 1 1 1 1 1 |

              4        6
o3 : Matrix ZZ  <--- ZZ

i4 : cmh=cmClass(A,Output=>HashTable);


i5 : cmh#"CM class"

        5      4      3      2
o5 = 20h  + 23h  + 31h  + 28h

     ZZ[h]
o5 : -----
        6
       h

i6 : cmh#"polar degrees"

o6 = {45, 98, 81, 28}

o6 : List

i7 : cmh#"dual degree"

o7 = 45

o7 : QQ

i8 : cmh#"dual codim"

o8 = 1

i9 : cmh#"ED"

o9 = 252

o9 : QQ

i10 : cmh#"degree"

o10 = 28

o10 : QQ

i11 : 
