-- -*- M2-comint -*- hash: -784631933

i1 : fn=temporaryFileName()|".m2"

o1 = /private/tmp/M2-6902-0/0.m2

i2 : fn<</// square = (x) -> (stderr<<"Running"<<endl; sleep(1); x^2); ///<<endl;

i3 : fn<</// justexit = () -> ( exit(27); ); ///<<endl;

i4 : fn<</// spin = (x) -> (stderr<<"Spinning!!"<<endl; startTime:=cpuTime(); while(cpuTime()-startTime<x) do for i to 10000000 do i; return(x);); ///<<endl;

i5 : fn<<flush;

i6 : h=runExternalM2(fn,"square",(4));
Running (true && (${prefix}/bin/M2-binary  --stop --no-debug --silent  -q  <"/private/tmp/M2-6902-0/1.m2" >"/private/tmp/M2-6902-0/1.out" 2>&1 ))
Finished running.

i7 : h

o7 = HashTable{answer file => null}
               exit code => 0
               output file => null
               return code => 0
               statistics => null
               time used => 3
               value => 16

o7 : HashTable

i8 : h#value===4^2

o8 = true

i9 : h#"exit code"===0

o9 = true

i10 : h=runExternalM2(fn,"justexit",());
Running (true && (${prefix}/bin/M2-binary  --stop --no-debug --silent  -q  <"/private/tmp/M2-6902-0/2.m2" >"/private/tmp/M2-6902-0/2.out" 2>&1 ))
Finished running.
RunExternalM2: expected answer file does not exist

i11 : h

o11 = HashTable{answer file => /private/tmp/M2-6902-0/2.ans}
                exit code => 27
                output file => /private/tmp/M2-6902-0/2.out
                return code => 6912
                statistics => null
                time used => 1
                value => null

o11 : HashTable

i12 : fileExists(h#"output file")

o12 = true

i13 : fileExists(h#"answer file")

o13 = false

i14 : h=runExternalM2(fn,"spin",10,PreRunScript=>"ulimit -t 2");
Running (ulimit -t 2 && (${prefix}/bin/M2-binary  --stop --no-debug --silent  -q  <"/private/tmp/M2-6902-0/3.m2" >"/private/tmp/M2-6902-0/3.out" 2>&1 ))
sh: line 1:  7308 Cputime limit exceeded: 24  ( ${prefix}/bin/M2-binary --stop --no-debug --silent -q < "/private/tmp/M2-6902-0/3.m2" > "/private/tmp/M2-6902-0/3.out" 2>&1 )
Finished running.
RunExternalM2: expected answer file does not exist

i15 : h

o15 = HashTable{answer file => /private/tmp/M2-6902-0/3.ans}
                exit code => 0
                output file => /private/tmp/M2-6902-0/3.out
                return code => 24
                statistics => null
                time used => 4
                value => null

o15 : HashTable

i16 : if h#"output file" =!= null and fileExists(h#"output file") then get(h#"output file")

o16 = 
      i1 : -- Script /private/tmp/M2-6902-0/3.m2 automatically generated by RunExternalM2
           needsPackage("RunExternalM2",Configuration=>{"isChild"=>true});

      i2 : load "/private/tmp/M2-6902-0/0.m2";

      i3 : runExternalM2ReturnAnswer("/private/tmp/M2-6902-0/3.ans",spin (10));
      Spinning!!


i17 : if h#"answer file" =!= null and fileExists(h#"answer file") then get(h#"answer file")

i18 : h=runExternalM2(fn,"spin",3,KeepStatistics=>true);
Running (true && ( (/usr/bin/time sh -c '${prefix}/bin/M2-binary  --stop --no-debug --silent  -q  <"/private/tmp/M2-6902-0/4.m2" >"/private/tmp/M2-6902-0/4.out" 2>&1') >"/private/tmp/M2-6902-0/4.stat" 2>&1 ))
Finished running.

i19 : h#"statistics"

o19 =         8.23 real         4.30 user         0.19 sys


i20 : v=/// A complicated string^%&C@#CERQVASDFQ#BQBSDH"' ewrjwklsf///;

i21 : (runExternalM2(fn,identity,v))#value===v
Running (true && (${prefix}/bin/M2-binary  --stop --no-debug --silent  -q  <"/private/tmp/M2-6902-0/6.m2" >"/private/tmp/M2-6902-0/6.out" 2>&1 ))
Finished running.

o21 = true

i22 : R=QQ[x,y];

i23 : v=coker random(R^2,R^{3:-1})

o23 = cokernel | 9/2x+1/2y x+3/4y    7/4x+7/9y  |
               | 9/4x+1/2y 3/2x+3/4y 7/10x+1/2y |

                             2
o23 : R-module, quotient of R

i24 : h=runExternalM2(fn,identity,v)
Running (true && (${prefix}/bin/M2-binary  --stop --no-debug --silent  -q  <"/private/tmp/M2-6902-0/7.m2" >"/private/tmp/M2-6902-0/7.out" 2>&1 ))
Finished running.
RunExternalM2: expected answer file does not exist

o24 = HashTable{answer file => /private/tmp/M2-6902-0/7.ans}
                exit code => 1
                output file => /private/tmp/M2-6902-0/7.out
                return code => 256
                statistics => null
                time used => 2
                value => null

o24 : HashTable

i25 : get(h#"output file")

o25 = 
      i1 : -- Script /private/tmp/M2-6902-0/7.m2 automatically generated by RunExternalM2
           needsPackage("RunExternalM2",Configuration=>{"isChild"=>true});

      i2 : load "/private/tmp/M2-6902-0/0.m2";

      i3 : runExternalM2ReturnAnswer("/private/tmp/M2-6902-0/7.ans",identity (cokernel(map(R^2,R^{{-1}, {-1}, {-1}},{{(9/2)*x+(1/2)*y, x+(3/4)*y, (7/4)*x+(7/9)*y}, {(9/4)*x+(1/2)*y, (3/2)*x+(3/4)*y, (7/10)*x+(1/2)*y}}))));
      stdio:4:82:(3):[1]: error: no method for binary operator ^ applied to objects:
      --            R (of class Symbol)
      --      ^     2 (of class ZZ)


i26 : fn<<///R=QQ[x,y];///<<endl<<flush;

i27 : (runExternalM2(fn,identity,v))#value===v
Running (true && (${prefix}/bin/M2-binary  --stop --no-debug --silent  -q  <"/private/tmp/M2-6902-0/8.m2" >"/private/tmp/M2-6902-0/8.out" 2>&1 ))
Finished running.

o27 = true

i28 : v=R;

i29 : h=runExternalM2(fn,identity,v);
Running (true && (${prefix}/bin/M2-binary  --stop --no-debug --silent  -q  <"/private/tmp/M2-6902-0/9.m2" >"/private/tmp/M2-6902-0/9.out" 2>&1 ))
Finished running.

i30 : h#value

o30 = QQ[x..y]

o30 : PolynomialRing

i31 : v===h#value

o31 = false

i32 : R===value(toExternalString(R))

o32 = false

i33 : 
