-- -*- M2-comint -*- hash: -1120698331

i1 : R = QQ[x,y,z];

i2 : canonicalDivisor(R)

o2 = 0, the zero divisor

o2 : WeilDivisor on R

i3 : canonicalDivisor(R, IsGraded=>true)

o3 = -3*Div(x)

o3 : WeilDivisor on R

i4 : R = QQ[a,b,c,d]/ideal(c^2-b*d, b*c-a*d, b^2-a*c);

i5 : canonicalDivisor(R)

o5 = -2*Div(d, c, b)

o5 : WeilDivisor on R

i6 : 
