-- -*- M2-comint -*- hash: -1994860119

i1 : R = QQ[x,y]

o1 = R

o1 : PolynomialRing

i2 : M = (ideal(x^2,x*y))*R^1

o2 = image | x2 xy |

                             1
o2 : R-module, submodule of R

i3 : embedAsIdeal(M)

o3 = ideal (y, x)

o3 : Ideal of R

i4 : R = QQ[x,y]/ideal(x*y);

i5 : M = (ideal(x^3, y^5))*R^1;

i6 : embedAsIdeal(M)

o6 = ideal (y, x)

o6 : Ideal of R

i7 : N = (ideal(x,y))*R^1;

i8 : embedAsIdeal(N)

o8 = ideal (y, x)

o8 : Ideal of R

i9 : R = QQ[x,y];

i10 : M = R^{-3};

i11 : embedAsIdeal(M, IsGraded=>true)

o11 = {ideal 1, {-3}}

o11 : List

i12 : R = QQ[x,y];

i13 : M = ideal(x^2, x*y)*R^1;

i14 : L = embedAsIdeal(M, ReturnMap=>true)

o14 = {ideal (y, x), | x y |}

o14 : List

i15 : target L#1

       1
o15 = R

o15 : R-module, free

i16 : source L#1

o16 = image | x2 xy |

                              1
o16 : R-module, submodule of R

i17 : R = QQ[x,y];

i18 : M = (ideal(x^2,x*y))*R^1;

i19 : mat = map(M, R^1, {{1}, {1}});

o19 : Matrix

i20 : embedAsIdeal(mat)

o20 = {x + y, ideal (y, x)}

o20 : List

i21 : embedAsIdeal(M, Section=>mat)

o21 = {x + y, ideal (y, x)}

o21 : List

i22 : 
