-- -*- M2-comint -*- hash: 392729588

i1 : R = ZZ/7[x,y,Degrees=>{3, 5}];

i2 : output = findElementOfDegree(1, R)

       2
o2 = {x , y}

o2 : List

i3 : output#0/output#1

      2
     x
o3 = --
      y

o3 : frac R

i4 : findElementOfDegree(-2, R)

       2   4
o4 = {y , x }

o4 : List

i5 : R = QQ[x,y,Degrees=>{{1,2}, {3, 5}}];

i6 : output = findElementOfDegree({1, 3}, R)

       4
o6 = {x , y}

o6 : List

i7 : output#0/output#1

      4
     x
o7 = --
      y

o7 : frac R

i8 : 
