-- -*- M2-comint -*- hash: -634070971

i1 : R = ZZ/7[x,y,u,v]/ideal(x*y-u*v);

i2 : D = divisor(x)

o2 = Div(v, x) + Div(u, x)

o2 : WeilDivisor on R

i3 : gbs(D)

o3 = {{v, x}, {u, x}}

o3 : List

i4 : R = ZZ/2[x,y,z]/ideal(z^2+x*y*z+x^2*y+x*y^2);

i5 : J = ideal(x+y, x^2+z);

o5 : Ideal of R

i6 : D = divisor({2}, {J})

o6 = 2*Div(x+y, x^2+z)

o6 : WeilDivisor on R

i7 : gbs(D)

               2
o7 = {{x + y, y  + z}}

o7 : List

i8 : primes(D)

                     2
o8 = {ideal (x + y, x  + z)}

o8 : List

i9 : 
