-- -*- M2-comint -*- hash: -1253458206

i1 : R = QQ[x,y,u,v]/ideal(x*y-u*v);

i2 : D = divisor(x)

o2 = Div(v, x) + Div(u, x)

o2 : WeilDivisor on R

i3 : getPrimeCount(D)

o3 = 2

i4 : E = divisor(x*u)

o4 = Div(v, x) + Div(u, y) + 2*Div(u, x)

o4 : WeilDivisor on R

i5 : getPrimeCount(E)

o5 = 3

i6 : F = divisor({0}, {ideal(x,u)})

o6 = 0*Div(x, u)

o6 : WeilDivisor on R

i7 : getPrimeCount(F)

o7 = 1

i8 : getPrimeCount(cleanSupport F)

o8 = 0

i9 : getPrimeCount(1*F)

o9 = 0

i10 : 
