-- -*- M2-comint -*- hash: 1008317510

i1 : R = QQ[x, y, z];

i2 : D = divisor({-8, 2, 0}, {ideal(x), ideal(y), ideal(x^2+z)})

o2 = -8*Div(x) + 2*Div(y) + 0*Div(x^2+z)

o2 : WeilDivisor on R

i3 : getPrimeDivisors( D )

o3 = {Div(x), Div(y), Div(x^2+z)}

o3 : List

i4 : getPrimeDivisors( cleanSupport D )

o4 = {Div(x), Div(y)}

o4 : List

i5 : 
