-- -*- M2-comint -*- hash: -859189131

i1 : R = QQ[x, y, z];

i2 : D = divisor({1, 2, -3, 4}, {ideal(x), ideal(y), ideal(z), ideal(y)});

o2 : WeilDivisor on R

i3 : isZeroDivisor( D )

o3 = false

i4 : R = QQ[x, y, z];

i5 : E = divisor({1, 2, -3, 4, 5, -9, 13, 2, -15}, {ideal(x), ideal(x), ideal(x), ideal(y), ideal(y), ideal(y), ideal(z), ideal(z), ideal(z)});

o5 : WeilDivisor on R

i6 : isZeroDivisor( E )

o6 = true

i7 : 
