-- -*- M2-comint -*- hash: -67159616

i1 : R = QQ[x, y, z] / ideal(x * y - z^2 );

i2 : D1 = divisor({1, 2}, {ideal(x, z), ideal(y, z)})

o2 = Div(x, z) + 2*Div(y, z)

o2 : WeilDivisor on R

i3 : D2 = divisor({1/2, 3/4}, {ideal(y, z), ideal(x, z)}, CoefficientType => QQ)

o3 = 3/4*Div(x, z) + 1/2*Div(y, z)

o3 : QWeilDivisor on R

i4 : isQCartier(10, D1)

o4 = 2

i5 : isQCartier(10, D2)

o5 = 8

i6 : R = QQ[x, y, u, v] / ideal(x * y - u * v);

i7 : D1 = divisor({1, 2}, {ideal(x, u), ideal(y, v)})

o7 = Div(x, u) + 2*Div(y, v)

o7 : WeilDivisor on R

i8 : D2 = divisor({1/2, -3/4}, {ideal(y, u), ideal(x, v)}, CoefficientType => QQ)

o8 = 1/2*Div(y, u) + -3/4*Div(x, v)

o8 : QWeilDivisor on R

i9 : isQCartier(10, D1)

o9 = 0

i10 : isQCartier(10, D2)

o10 = 0

i11 : R = QQ[x, y, z] / ideal(x * y - z^2 );

i12 : D1 = divisor({1, 2}, {ideal(x, z), ideal(y, z)})

o12 = Div(x, z) + 2*Div(y, z)

o12 : WeilDivisor on R

i13 : D2 = divisor({1/2, 3/4}, {ideal(y, z), ideal(x, z)}, CoefficientType => QQ)

o13 = 3/4*Div(x, z) + 1/2*Div(y, z)

o13 : QWeilDivisor on R

i14 : isQCartier(10, D1, IsGraded => true)

o14 = 1

i15 : isQCartier(10, D2, IsGraded => true)

o15 = 4

i16 : 
