-- -*- M2-comint -*- hash: -1663218544

i1 : R = QQ[x, y, z] / ideal(x * y - z^2);

i2 : D = divisor({1/2, 3/4}, {ideal(x, z), ideal(y, z)}, CoefficientType => QQ)

o2 = 1/2*Div(x, z) + 3/4*Div(y, z)

o2 : QWeilDivisor on R

i3 : E = divisor({3/4, 5/2}, {ideal(y, z), ideal(x, z)}, CoefficientType => QQ)

o3 = 5/2*Div(x, z) + 3/4*Div(y, z)

o3 : QWeilDivisor on R

i4 : isQLinearEquivalent(10, D, E)

o4 = true

i5 : R = QQ[x,y,z] / ideal(x * y - z^2);

i6 : D = divisor(x);

o6 : WeilDivisor on R

i7 : E = divisor(ideal(x,z));

o7 : WeilDivisor on R

i8 : isQLinearEquivalent(1, D, E)

o8 = false

i9 : isQLinearEquivalent(3, D, E)

o9 = true

i10 : R = QQ[x, y, z] / ideal(x * y - z^2);

i11 : D = divisor({1/2, 3/4}, {ideal(x, z), ideal(y, z)}, CoefficientType => QQ)

o11 = 3/4*Div(y, z) + 1/2*Div(x, z)

o11 : QWeilDivisor on R

i12 : E = divisor({3/2, -1/4}, {ideal(y, z), ideal(x, z)}, CoefficientType => QQ)

o12 = 3/2*Div(y, z) + -1/4*Div(x, z)

o12 : QWeilDivisor on R

i13 : isQLinearEquivalent(10, D, E, IsGraded => true)

o13 = true

i14 : isQLinearEquivalent(10, 3*D, E, IsGraded => true)

o14 = false

i15 : 
