-- -*- M2-comint -*- hash: -1437187365

i1 : R = QQ[x, y, z];

i2 : D = divisor(x);

o2 : WeilDivisor on R

i3 : isPrincipal(D, IsGraded => true)

o3 = false

i4 : R = QQ[x, y, z]/ideal(x^2 - y*z);

i5 : D = divisor(x);

o5 : WeilDivisor on R

i6 : E = divisor(ideal(x,z));

o6 : WeilDivisor on R

i7 : isPrincipal( D )

o7 = true

i8 : isPrincipal( E )

o8 = false

i9 : 
