-- -*- M2-comint -*- hash: -1114089587

i1 : debugLevel = 1;

i2 : R = QQ[x,y];

i3 : isWellDefined(divisor({1}, {ideal(x)} ))
 -- 1 : (ContainmentHooks) with Strategy => Inhomogeneous from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/modules2.m2:115:61-115:99]*-
 -- (minimalPrimes,Ideal) with Strategy => Monomial from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/MinimalPrimes.m2:303:27-312:61]*-
 -- (trim,Module) with Strategy => Complement from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/matrix2.m2:248:62-248:113]*-
 -- (codim,Module) with Strategy => Default from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/monideal.m2:37:57-49:52]*-
 -- (codim,Module) with Strategy => Default from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/monideal.m2:37:57-49:52]*-

o3 = true

i4 : isWellDefined(divisor({1/2}, {ideal(x)} ))
(isWellDefined, BasicDivisor): Not all coefficients are integers

o4 = false

i5 : isWellDefined(divisor({1/2}, {ideal(x)}, CoefficientType=>QQ))
 -- 1 : (ContainmentHooks) with Strategy => Inhomogeneous from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/modules2.m2:115:61-115:99]*-
 -- (minimalPrimes,Ideal) with Strategy => Monomial from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/MinimalPrimes.m2:303:27-312:61]*-
 -- (trim,Module) with Strategy => Complement from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/matrix2.m2:248:62-248:113]*-
 -- (codim,Module) with Strategy => Default from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/monideal.m2:37:57-49:52]*-
 -- (codim,Module) with Strategy => Default from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/monideal.m2:37:57-49:52]*-

o5 = true

i6 : isWellDefined(divisor({1}, {ideal(x,y)}))
 -- 1 : (ContainmentHooks) with Strategy => Inhomogeneous from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/modules2.m2:115:61-115:99]*-
 -- (minimalPrimes,Ideal) with Strategy => Monomial from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/MinimalPrimes.m2:303:27-312:61]*-
 -- (trim,Module) with Strategy => Complement from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/matrix2.m2:248:62-248:113]*-
 -- (codim,Module) with Strategy => Default from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/monideal.m2:37:57-49:52]*-
 -- 1 : (ContainmentHooks) with Strategy => Inhomogeneous from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/modules2.m2:115:61-115:99]*-
 -- 1 : (ContainmentHooks) with Strategy => Inhomogeneous from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/modules2.m2:115:61-115:99]*-
 -- (codim,Module) with Strategy => Default from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/monideal.m2:37:57-49:52]*-
(isWellDefined, BasicDivisor): Not all ideals are height one

o6 = false

i7 : isWellDefined(divisor({1}, {ideal(x^2)}))
 -- 1 : (ContainmentHooks) with Strategy => Inhomogeneous from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/modules2.m2:115:61-115:99]*-
 -- (minimalPrimes,Ideal) with Strategy => Monomial from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/MinimalPrimes.m2:303:27-312:61]*-
 -- (trim,Module) with Strategy => Complement from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/matrix2.m2:248:62-248:113]*-
 -- (codim,Module) with Strategy => Default from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/monideal.m2:37:57-49:52]*-
 -- 1 : (ContainmentHooks) with Strategy => Inhomogeneous from -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/modules2.m2:115:61-115:99]*-
(isWellDefined, BasicDivisor): Not all ideals are prime

o7 = false

i8 : S = QQ[a,b];

i9 : isWellDefined(divisor({1,2}, {ideal(x), ideal(a)}))
(isWellDefined, BasicDivisor): Not all ideals have the same ambient ring

o9 = false

i10 : 
