-- -*- M2-comint -*- hash: -812820476

i1 : R = QQ[x, y, z]/ ideal(x * y - z^2);

i2 : D1 = divisor({3, 8}, {ideal(x, z), ideal(y, z)})

o2 = 3*Div(x, z) + 8*Div(y, z)

o2 : WeilDivisor on R

i3 : D2 = divisor({8, 1}, {ideal(y, z), ideal(x, z)})

o3 = Div(x, z) + 8*Div(y, z)

o3 : WeilDivisor on R

i4 : isLinearEquivalent(D1, D2)

o4 = true

i5 : R = QQ[x, y, z]/ ideal(x * y - z^2);

i6 : D1 = divisor({3, 8}, {ideal(x, z), ideal(y, z)})

o6 = 3*Div(x, z) + 8*Div(y, z)

o6 : WeilDivisor on R

i7 : D2 = divisor({8, 1}, {ideal(y, z), ideal(x, z)})

o7 = Div(x, z) + 8*Div(y, z)

o7 : WeilDivisor on R

i8 : isLinearEquivalent(D1, D2, IsGraded => true)

o8 = false

i9 : 
