-- -*- M2-comint -*- hash: -760519672

i1 : R = QQ[x,y,u,v]/ideal(x*y-u*v);

i2 : D = divisor(x)

o2 = Div(v, x) + Div(u, x)

o2 : WeilDivisor on R

i3 : primes(D)

o3 = {ideal (v, x), ideal (u, x)}

o3 : List

i4 : E = divisor(x*u)

o4 = Div(v, x) + Div(u, y) + 2*Div(u, x)

o4 : WeilDivisor on R

i5 : primes(E)

o5 = {ideal (v, x), ideal (u, y), ideal (u, x)}

o5 : List

i6 : F = divisor({0}, {ideal(x,u)})

o6 = 0*Div(x, u)

o6 : WeilDivisor on R

i7 : primes(F)

o7 = {ideal (x, u)}

o7 : List

i8 : primes(cleanSupport F)

o8 = {}

o8 : List

i9 : primes(1*F)

o9 = {}

o9 : List

i10 : 
