-- -*- M2-comint -*- hash: 814893193

i1 : R = QQ[x];

i2 : S = QQ[y];

i3 : f = map(S, R, {y^3});

o3 : RingMap S <--- R

i4 : ramificationDivisor(f)

o4 = 2*Div(y)

o4 : WeilDivisor on S

i5 : R = QQ[x,y];

i6 : T = QQ[a,b,c,d];

i7 : h = map(R, T, {x^3, x^2*y, x*y^2, y^3});

o7 : RingMap R <--- T

i8 : S = T/ker h;

i9 : f = map(R, S, {x^3, x^2*y, x*y^2, y^3});

o9 : RingMap R <--- S

i10 : ramificationDivisor(f)

o10 = 0, the zero divisor

o10 : WeilDivisor on R

i11 : R = ZZ/2[t];

i12 : S = ZZ/2[x];

i13 : f = map(S, R, {x^2*(1+x)});

o13 : RingMap S <--- R

i14 : ramificationDivisor(f)

o14 = 2*Div(x)

o14 : WeilDivisor on S

i15 : R = QQ[x,y];

i16 : S = reesAlgebra(ideal(x,y^2));

i17 : f = map(S, R);

o17 : RingMap S <--- R

i18 : ramificationDivisor(f,IsGraded=>true)

o18 = 2*Div(y, x)

o18 : WeilDivisor on S

i19 : 
