-- -*- M2-comint -*- hash: -1927226459

i1 : R = QQ[x,y,z]/ideal(x^2-y*z);

i2 : m = ideal(x,y,z);

o2 : Ideal of R

i3 : reflexify(m)

o3 = ideal 1

o3 : Ideal of R

i4 : I = ideal(x,y);

o4 : Ideal of R

i5 : reflexify(I)

o5 = ideal (y, x)

o5 : Ideal of R

i6 : reflexify(I^2)

o6 = ideal y

o6 : Ideal of R

i7 : reflexify(I^3)

             2
o7 = ideal (y , x*y)

o7 : Ideal of R

i8 : R = QQ[x,y,z]/ideal(x^2-y*z);

i9 : m = ideal(x,y,z);

o9 : Ideal of R

i10 : prune reflexify(m*R^2)

       2
o10 = R

o10 : R-module, free

i11 : I = ideal(x,y);

o11 : Ideal of R

i12 : prune reflexify(I*R^1)

o12 = cokernel {1} | x  -y |
               {1} | -z x  |

                             2
o12 : R-module, quotient of R

i13 : prune reflexify(I^2*R^1)

       1
o13 = R

o13 : R-module, free, degrees {1}

i14 : R = QQ[x,y];

i15 : m = ideal(x,y);

o15 : Ideal of R

i16 : M = m*R^1;

i17 : f = reflexify( M, ReturnMap => true )

o17 = | x y |

o17 : Matrix

i18 : source f

o18 = image | x y |

                              1
o18 : R-module, submodule of R

i19 : target f

       1
o19 = R

o19 : R-module, free

i20 : R = QQ[x,y,z]/ideal(-y^2*z +x^3 + x^2*z + x*z^2+z^3);

i21 : I = ideal(x-z,y-2*z);

o21 : Ideal of R

i22 : J = I^21;

o22 : Ideal of R

i23 : time reflexify(J);
     -- used 0.49917 seconds

o23 : Ideal of R

i24 : time reflexify(J*R^1);
     -- used 0.82596 seconds

i25 : R = ZZ/13[x,y,z]/ideal(x^3 + y^3-z^11*x*y);

i26 : I = ideal(x-4*y, z);

o26 : Ideal of R

i27 : J = I^20;

o27 : Ideal of R

i28 : M = J*R^1;

i29 : J1 = time reflexify( J, Strategy=>IdealStrategy )
     -- used 0.113819 seconds

              2            2     9       9   11
o29 = ideal (x  + 5x*y + 3y , x*z  - 4y*z , z   + x - 4y)

o29 : Ideal of R

i30 : J2 = time reflexify( J, Strategy=>ModuleStrategy )
     -- used 8.65829 seconds

              2            2     9       9   11
o30 = ideal (x  + 5x*y + 3y , x*z  - 4y*z , z   + x - 4y)

o30 : Ideal of R

i31 : J1 == J2

o31 = true

i32 : time reflexify( M, Strategy=>IdealStrategy );
     -- used 10.9236 seconds

i33 : time reflexify( M, Strategy=>ModuleStrategy );
     -- used 0.492958 seconds

i34 : R = QQ[x,y,u,v]/ideal(x*y-u*v);

i35 : I = ideal(x,u);

o35 : Ideal of R

i36 : J = I^20;

o36 : Ideal of R

i37 : M = I^20*R^1;

i38 : time reflexify( J, Strategy=>IdealStrategy )
     -- used 0.389851 seconds

              20     19   2 18   3 17   4 16   5 15   6 14   7 13   8 12 
o38 = ideal (u  , x*u  , x u  , x u  , x u  , x u  , x u  , x u  , x u  ,
      -----------------------------------------------------------------------
       9 11   10 10   11 9   12 8   13 7   14 6   15 5   16 4   17 3   18 2 
      x u  , x  u  , x  u , x  u , x  u , x  u , x  u , x  u , x  u , x  u ,
      -----------------------------------------------------------------------
       19    20
      x  u, x  )

o38 : Ideal of R

i39 : time reflexify( J, Strategy=>ModuleStrategy )
     -- used 0.0241205 seconds

              20     19   2 18   3 17   4 16   5 15   6 14   7 13   8 12 
o39 = ideal (u  , x*u  , x u  , x u  , x u  , x u  , x u  , x u  , x u  ,
      -----------------------------------------------------------------------
       9 11   10 10   11 9   12 8   13 7   14 6   15 5   16 4   17 3   18 2 
      x u  , x  u  , x  u , x  u , x  u , x  u , x  u , x  u , x  u , x  u ,
      -----------------------------------------------------------------------
       19    20
      x  u, x  )

o39 : Ideal of R

i40 : time reflexify( M, Strategy=>IdealStrategy );
     -- used 0.101753 seconds

i41 : time reflexify( M, Strategy=>ModuleStrategy );
     -- used 0.00914775 seconds

i42 : R = QQ[x,y]/ideal(x*y);

i43 : I = ideal(x,y);

o43 : Ideal of R

i44 : reflexify(I, KnownDomain=>false)

o44 = ideal (y, x)

o44 : Ideal of R

i45 : reflexify(I, KnownDomain=>true)

o45 = ideal 1

o45 : Ideal of R

i46 : J = ideal(x-y, x+y);

o46 : Ideal of R

i47 : reflexify(J, KnownDomain=>false)

o47 = ideal (y, x)

o47 : Ideal of R

i48 : reflexify(I, KnownDomain=>true)

o48 = ideal 1

o48 : Ideal of R

i49 : 
