-- -*- M2-comint -*- hash: 1489302682

i1 : R=QQ[x];

i2 : D=divisor({3/2}, {ideal(x)}, CoefficientType=>QQ)

o2 = 3/2*Div(x)

o2 : QWeilDivisor on R

i3 : E=divisor({1.5}, {ideal(x)}, CoefficientType=>RR)

o3 = 1.5*Div(x)

o3 : RWeilDivisor on R

i4 : toWeilDivisor(2*D)

o4 = 3*Div(x)

o4 : WeilDivisor on R

i5 : toWeilDivisor(2*E)

o5 = 3*Div(x)

o5 : WeilDivisor on R

i6 : isWeilDivisor(D)

o6 = false

i7 : try toWeilDivisor(D) then print "converted to a WeilDivisor" else print "can't be converted to a WeilDivisor"
can't be converted to a WeilDivisor

i8 : 
