-- -*- M2-comint -*- hash: -458463898

i1 : R = ZZ/5[x, y];

i2 : D = divisor(x);

o2 : WeilDivisor on R

i3 : E = toQWeilDivisor(D)

o3 = Div(x)

o3 : QWeilDivisor on R

i4 : toQWeilDivisor(E)

o4 = Div(x)

o4 : QWeilDivisor on R

i5 : F = divisor({3, 0, -2}, {ideal(x), ideal(y), ideal(x+y)})

o5 = -2*Div(x+y) + 3*Div(x) + 0*Div(y)

o5 : WeilDivisor on R

i6 : 
