-- -*- M2-comint -*- hash: -780750115

i1 : R = QQ[x, y]

o1 = R

o1 : PolynomialRing

i2 : I = ideal((x^2+1)^2*y, y+1)

             4      2
o2 = ideal (x y + 2x y + y, y + 1)

o2 : Ideal of R

i3 : radical I

                    2
o3 = ideal (y + 1, x  + 1)

o3 : Ideal of R

i4 : R = ZZ/101[a..d]

o4 = R

o4 : PolynomialRing

i5 : I = intersect(ideal(a^2,b^2,c), ideal(a,b^3,c^2))

             2        2   3     2
o5 = ideal (c , a*c, a , b , a*b )

o5 : Ideal of R

i6 : elapsedTime radical(ideal I_*, Strategy => Monomial)
 -- 0.000600819 seconds elapsed

o6 = ideal (a, b, c)

o6 : Ideal of R

i7 : elapsedTime radical(ideal I_*, Unmixed => true)
 -- 0.0461657 seconds elapsed

o7 = ideal (c, b, a)

o7 : Ideal of R

i8 : 
