-- -*- M2-comint -*- hash: 2079497219

i1 : R = QQ[x_1..x_4];

i2 : I = ideal(x_2^2+x_1*x_2+1, x_1*x_2*x_3*x_4+1);

o2 : Ideal of R

i3 : (f,J,X) = noetherNormalization I

                  9     9             1     1                      13 2  
o3 = (map (R, R, {-x  + -x  + x , x , -x  + -x  + x , x }), ideal (--x  +
                  4 1   2 2    4   1  2 1   2 2    3   2            4 1  
     ------------------------------------------------------------------------
     9                 9 3     27 2 2   9   3   9 2       9   2     1 2      
     -x x  + x x  + 1, -x x  + --x x  + -x x  + -x x x  + -x x x  + -x x x  +
     2 1 2    1 4      8 1 2    8 1 2   4 1 2   4 1 2 3   2 1 2 3   2 1 2 4  
     ------------------------------------------------------------------------
     1   2
     -x x x  + x x x x  + 1), {x , x })
     2 1 2 4    1 2 3 4         4   3

o3 : Sequence

i4 : R = QQ[x_1..x_5, MonomialOrder => Lex];

i5 : I = ideal(x_2*x_1-x_5^3, x_5*x_1^3);

o5 : Ideal of R

i6 : (f,J,X) = noetherNormalization I

                  3                  7     3         7     3              
o6 = (map (R, R, {-x  + x  + x , x , -x  + -x  + x , -x  + -x  + x , x }),
                  4 1    2    5   1  4 1   4 2    4  9 1   2 2    3   2   
     ------------------------------------------------------------------------
            3 2                  3  27 3     27 2 2   27 2       9   3  
     ideal (-x  + x x  + x x  - x , --x x  + --x x  + --x x x  + -x x  +
            4 1    1 2    1 5    2  64 1 2   16 1 2   16 1 2 5   4 1 2  
     ------------------------------------------------------------------------
     9   2     9     2    4     3       2 2      3
     -x x x  + -x x x  + x  + 3x x  + 3x x  + x x ), {x , x , x })
     2 1 2 5   4 1 2 5    2     2 5     2 5    2 5     5   4   3

o6 : Sequence

i7 : transpose gens gb J

o7 = {-10} | x_2^10                                                          
     {-10} | 12x_1x_2x_5^6-54x_2^9x_5-12x_2^9+27x_2^8x_5^2+12x_2^8x_5-9x_2^7x
     {-9}  | 48x_1x_2^2x_5^3-108x_1x_2x_5^5+48x_1x_2x_5^4+486x_2^9-243x_2^8x_
     {-9}  | 384x_1x_2^3+864x_1x_2^2x_5^2+768x_1x_2^2x_5+2916x_1x_2x_5^5-648x
     {-3}  | 3x_1^2+4x_1x_2+4x_1x_5-4x_2^3                                   
     ------------------------------------------------------------------------
                                                                   
     _5^3-12x_2^7x_5^2+12x_2^6x_5^3-12x_2^5x_5^4+12x_2^4x_5^5+16x_2
     5-36x_2^8+81x_2^7x_5^2+72x_2^7x_5-108x_2^6x_5^2+108x_2^5x_5^3-
     _1x_2x_5^4+576x_1x_2x_5^3+384x_1x_2x_5^2-13122x_2^9+6561x_2^8x
                                                                   
     ------------------------------------------------------------------------
                                                                             
     ^2x_5^6+16x_2x_5^7                                                      
     108x_2^4x_5^4+48x_2^4x_5^3+64x_2^3x_5^3-144x_2^2x_5^5+128x_2^2x_5^4-144x
     _5+1458x_2^8-2187x_2^7x_5^2-2430x_2^7x_5+216x_2^7+2916x_2^6x_5^2-648x_2^
                                                                             
     ------------------------------------------------------------------------
                                                                             
                                                                             
     _2x_5^6+64x_2x_5^5                                                      
     6x_5-288x_2^6-2916x_2^5x_5^3+648x_2^5x_5^2+288x_2^5x_5+384x_2^5+2916x_2^
                                                                             
     ------------------------------------------------------------------------
                                                                            
                                                                            
                                                                            
     4x_5^4-648x_2^4x_5^3+576x_2^4x_5^2+384x_2^4x_5+512x_2^4+1152x_2^3x_5^2+
                                                                            
     ------------------------------------------------------------------------
                                                                             
                                                                             
                                                                             
     1536x_2^3x_5+3888x_2^2x_5^5-864x_2^2x_5^4+1920x_2^2x_5^3+1536x_2^2x_5^2+
                                                                             
     ------------------------------------------------------------------------
                                                      |
                                                      |
                                                      |
     3888x_2x_5^6-864x_2x_5^5+768x_2x_5^4+512x_2x_5^3 |
                                                      |

             5       1
o7 : Matrix R  <--- R

i8 : R = ZZ/2[a,b];

i9 : I = ideal(a^2*b+a*b^2+1);

o9 : Ideal of R

i10 : (f,J,X) = noetherNormalization I
--warning: no good linear transformation found by noetherNormalization

                                  2       2
o10 = (map (R, R, {b, a}), ideal(a b + a*b  + 1), {b})

o10 : Sequence

i11 : R = QQ[x_1..x_4];

i12 : I = ideal(x_2^2+x_1*x_2+1, x_1*x_2*x_3*x_4+1);

o12 : Ideal of R

i13 : (f,J,X) = noetherNormalization(I,Verbose => true)
--trying random transformation: 1
--trying with basis element limit: 5
--trying with basis element limit: 20

                          7             3     7                        2  
o13 = (map (R, R, {7x  + --x  + x , x , -x  + -x  + x , x }), ideal (8x  +
                     1   10 2    4   1  7 1   3 2    3   2             1  
      -----------------------------------------------------------------------
       7                   3     499 2 2   49   3     2        7   2    
      --x x  + x x  + 1, 3x x  + ---x x  + --x x  + 7x x x  + --x x x  +
      10 1 2    1 4        1 2    30 1 2   30 1 2     1 2 3   10 1 2 3  
      -----------------------------------------------------------------------
      3 2       7   2
      -x x x  + -x x x  + x x x x  + 1), {x , x })
      7 1 2 4   3 1 2 4    1 2 3 4         4   3

o13 : Sequence

i14 : R = QQ[x_1..x_4]; 

i15 : I = ideal(x_2^2+x_1*x_2+1, x_1*x_2*x_3*x_4+1);

o15 : Ideal of R

i16 : (f,J,X) = noetherNormalization(I,Verbose => true,LimitList => {5,10})
--trying random transformation: 1
--trying with basis element limit: 5
--trying with basis element limit: 10

                   2     5                  6                      5 2  
o16 = (map (R, R, {-x  + -x  + x , x , x  + -x  + x , x }), ideal (-x  +
                   3 1   2 2    4   1   1   7 2    3   2           3 1  
      -----------------------------------------------------------------------
      5                 2 3     43 2 2   15   3   2 2       5   2      2    
      -x x  + x x  + 1, -x x  + --x x  + --x x  + -x x x  + -x x x  + x x x 
      2 1 2    1 4      3 1 2   14 1 2    7 1 2   3 1 2 3   2 1 2 3    1 2 4
      -----------------------------------------------------------------------
        6   2
      + -x x x  + x x x x  + 1), {x , x })
        7 1 2 4    1 2 3 4         4   3

o16 : Sequence

i17 : R = QQ[x_1..x_4];

i18 : I = ideal(x_2^2+x_1*x_2+1, x_1*x_2*x_3*x_4+1);

o18 : Ideal of R

i19 : (f,J,X) = noetherNormalization(I,Verbose => true,RandomRange => 2)
--trying random transformation: 1
--trying with basis element limit: 5
--trying with basis element limit: 20

                                                              2              
o19 = (map (R, R, {2x  - x  + x , x , x  + x , x }), ideal (3x  - x x  + x x 
                     1    2    4   1   2    3   2             1    1 2    1 4
      -----------------------------------------------------------------------
             2 2      3     2          2        2
      + 1, 2x x  - x x  + 2x x x  - x x x  + x x x  + x x x x  + 1), {x ,
             1 2    1 2     1 2 3    1 2 3    1 2 4    1 2 3 4         4 
      -----------------------------------------------------------------------
      x })
       3

o19 : Sequence

i20 : 
