-- -*- M2-comint -*- hash: 233295167

i1 : R=rootSystemC(4)

o1 = RootSystem{...8...}

o1 : RootSystem

i2 : w=reduce(R,{1})

o2 = WeylGroupElement{RootSystem{...8...}, | -1 |}
                                           |  2 |
                                           |  1 |
                                           |  1 |

o2 : WeylGroupElement

i3 : r=simpleRoot(R,2)

o3 = | -1 |
     |  2 |
     | -1 |
     |  0 |

o3 : Root

i4 : w*r

o4 = |  1 |
     |  1 |
     | -1 |
     |  0 |

o4 : Root

i5 : 
