-- -*- M2-comint -*- hash: 340072731

i1 : R=rootSystemA(2)

o1 = RootSystem{...8...}

o1 : RootSystem

i2 : eval(R,1,1)

o2 = 2

i3 : eval(R,1,2)

o3 = -1

i4 : 
