-- -*- M2-comint -*- hash: -236542327

i1 : R=rootSystemA(3)

o1 = RootSystem{...8...}

o1 : RootSystem

i2 : P=parabolic(R,set {3})

o2 = set {3}

o2 : Parabolic

i3 : w1 = reduce(R,{2})

o3 = WeylGroupElement{RootSystem{...8...}, |  2 |}
                                           | -1 |
                                           |  2 |

o3 : WeylGroupElement

i4 : w2 = reduce(R,{1,2,1,3,2})

o4 = WeylGroupElement{RootSystem{...8...}, | -1 |}
                                           | -2 |
                                           |  1 |

o4 : WeylGroupElement

i5 : myInterval=intervalBruhat(w1 % P,w2 % P)

o5 = HasseDiagram{{{WeylGroupElement{RootSystem{...8...}, |  1 |}, {{0, | 1 |}, {1, | -1 |}}}}, {{WeylGroupElement{RootSystem{...8...}, | -2 |}, {{0, | -1 |}, {2, |  1 |}}}, {WeylGroupElement{RootSystem{...8...}, | -1 |}, {{0, |  2 |}, {1, | -1 |}}}}, {{WeylGroupElement{RootSystem{...8...}, | -2 |}, {{0, |  1 |}}}, {WeylGroupElement{RootSystem{...8...}, |  1 |}, {{0, |  2 |}}}, {WeylGroupElement{RootSystem{...8...}, |  2 |}, {{0, | -1 |}}}}, {{WeylGroupElement{RootSystem{...8...}, |  2 |}, {}}}}
                                                          | -3 |        | 0 |       |  1 |                                              |  3 |        |  1 |       |  1 |                                            | -1 |        | -1 |       |  2 |                                              |  1 |        |  1 |                                            | -2 |        | -1 |                                            |  1 |        |  1 |                                              | -1 |
                                                          |  1 |        | 1 |       |  1 |                                              | -2 |        |  1 |       | -1 |                                            |  3 |        |  0 |       | -1 |                                              |  2 |        | -1 |                                            |  3 |        |  0 |                                            | -2 |        |  1 |                                              |  2 |

o5 : HasseDiagram

i6 : myInterval#1

o6 = {{WeylGroupElement{RootSystem{...8...}, | -2 |}, {{0, | -1 |}, {2, |  1
                                             |  3 |        |  1 |       |  1
                                             | -2 |        |  1 |       | -1
     ------------------------------------------------------------------------
     |}}}, {WeylGroupElement{RootSystem{...8...}, | -1 |}, {{0, |  2 |}, {1,
     |                                            | -1 |        | -1 |      
     |                                            |  3 |        |  0 |      
     ------------------------------------------------------------------------
     | -1 |}}}}
     |  2 |
     | -1 |

o6 : List

i7 : 
