-- -*- M2-comint -*- hash: -1625392142

i1 : R=rootSystemA(3)

o1 = RootSystem{...8...}

o1 : RootSystem

i2 : w=reduce(R,{1,2,1})

o2 = WeylGroupElement{RootSystem{...8...}, | -1 |}
                                           | -1 |
                                           |  3 |

o2 : WeylGroupElement

i3 : isReduced({2,3},w)

o3 = true

i4 : isReduced({1},w)

o4 = false

i5 : 
