-- -*- M2-comint -*- hash: 1824812920

i1 : R = QQ[X,Y,Z,x,y,z]

o1 = R

o1 : PolynomialRing

i2 : F = matrix{{x*y^2,y^3,x*z^2,y^3+z^3}}

o2 = | xy2 y3 xz2 y3+z3 |

             1       4
o2 : Matrix R  <--- R

i3 : G = matrix{{y^2,z^2}}

o3 = | y2 z2 |

             1       2
o3 : Matrix R  <--- R

i4 : M = matrix{{1,0,0},{0,1,0},{0,0,1},{-X,-Y,-Z}}

o4 = | 1  0  0  |
     | 0  1  0  |
     | 0  0  1  |
     | -X -Y -Z |

             4       3
o4 : Matrix R  <--- R

i5 : H = (F//G)*M

o5 = {2} | -Xy+x -Yy+y -Zy   |
     {2} | -Xz   -Yz   -Zz+x |

             2       3
o5 : Matrix R  <--- R

i6 : l = {x,y,z}

o6 = {x, y, z}

o6 : List

i7 : L=eliminationMatrix (l,G,H, Strategy => CM2Residual)

o7 = {3} | 0  0   0  0  0  0  1  0  0  0    0    0    |
     {3} | 0  0   0  0  0  0  -X 1  0  -Y+1 0    0    |
     {3} | 0  0   -Y 0  0  0  -Z 0  1  0    0    0    |
     {3} | -1 0   0  0  0  0  0  -X 0  0    -Y+1 0    |
     {3} | 0  0   X  -Y 0  0  0  -Z -X -Z   0    -Y+1 |
     {3} | 0  0   0  0  -Y -1 0  0  -Z 0    0    0    |
     {3} | X  Y-1 0  0  0  Z  0  0  0  0    0    0    |
     {3} | 0  0   0  X  0  0  0  0  0  0    -Z   0    |
     {3} | 0  0   0  0  X  0  0  0  0  0    0    -Z   |
     {3} | X  Y   0  0  0  Z  0  0  0  0    0    0    |

             10       12
o7 : Matrix R   <--- R

i8 : maxCol L

o8 = {{3} | 0  0   0  0  0  0  1  0  0  0    |, {0, 1, 2, 3, 4, 5, 6, 7, 8,
      {3} | 0  0   0  0  0  0  -X 1  0  -Y+1 |
      {3} | 0  0   -Y 0  0  0  -Z 0  1  0    |
      {3} | -1 0   0  0  0  0  0  -X 0  0    |
      {3} | 0  0   X  -Y 0  0  0  -Z -X -Z   |
      {3} | 0  0   0  0  -Y -1 0  0  -Z 0    |
      {3} | X  Y-1 0  0  0  Z  0  0  0  0    |
      {3} | 0  0   0  X  0  0  0  0  0  0    |
      {3} | 0  0   0  0  X  0  0  0  0  0    |
      {3} | X  Y   0  0  0  Z  0  0  0  0    |
     ------------------------------------------------------------------------
     9}}

o8 : List

i9 : R=QQ[a_0,a_1,a_2,a_3,a_4,b_0,b_1,b_2,b_3,b_4,c_0,c_1,c_2,c_3,c_4,x,y,z]

o9 = R

o9 : PolynomialRing

i10 : G=matrix{{z,x^2+y^2}}

o10 = | z x2+y2 |

              1       2
o10 : Matrix R  <--- R

i11 : H=matrix{{a_0*z+a_1*x+a_2*y,b_0*z+b_1*x+b_2*y,c_0*z+c_1*x+c_2*y},{a_3,b_3,c_3}}

o11 = | a_1x+a_2y+a_0z b_1x+b_2y+b_0z c_1x+c_2y+c_0z |
      | a_3            b_3            c_3            |

              2       3
o11 : Matrix R  <--- R

i12 : L=eliminationMatrix ({x,y,z},G,H, Strategy => ciResidual)

o12 = {2} | a_3 b_3 c_3 -a_3b_1+a_1b_3 0              0             
      {2} | 0   0   0   -a_3b_2+a_2b_3 -a_3b_1+a_1b_3 0             
      {2} | a_1 b_1 c_1 -a_3b_0+a_0b_3 0              -a_3b_1+a_1b_3
      {2} | a_3 b_3 c_3 0              -a_3b_2+a_2b_3 0             
      {2} | a_2 b_2 c_2 0              -a_3b_0+a_0b_3 -a_3b_2+a_2b_3
      {2} | a_0 b_0 c_0 0              0              -a_3b_0+a_0b_3
      -----------------------------------------------------------------------
      -a_3c_1+a_1c_3 0              0              -b_3c_1+b_1c_3
      -a_3c_2+a_2c_3 -a_3c_1+a_1c_3 0              -b_3c_2+b_2c_3
      -a_3c_0+a_0c_3 0              -a_3c_1+a_1c_3 -b_3c_0+b_0c_3
      0              -a_3c_2+a_2c_3 0              0             
      0              -a_3c_0+a_0c_3 -a_3c_2+a_2c_3 0             
      0              0              -a_3c_0+a_0c_3 0             
      -----------------------------------------------------------------------
      0              0              |
      -b_3c_1+b_1c_3 0              |
      0              -b_3c_1+b_1c_3 |
      -b_3c_2+b_2c_3 0              |
      -b_3c_0+b_0c_3 -b_3c_2+b_2c_3 |
      0              -b_3c_0+b_0c_3 |

              6       12
o12 : Matrix R  <--- R

i13 : R=QQ[a_0,a_1,a_2,a_3,a_4,b_0,b_1,b_2,b_3,b_4,c_0,c_1,c_2,c_3,c_4,x,y,z]

o13 = R

o13 : PolynomialRing

i14 : G=matrix{{z,x^2+y^2}}

o14 = | z x2+y2 |

              1       2
o14 : Matrix R  <--- R

i15 : H=matrix{{a_0*z+a_1*x+a_2*y,b_0*z+b_1*x+b_2*y,c_0*z+c_1*x+c_2*y},{a_3,b_3,c_3}}

o15 = | a_1x+a_2y+a_0z b_1x+b_2y+b_0z c_1x+c_2y+c_0z |
      | a_3            b_3            c_3            |

              2       3
o15 : Matrix R  <--- R

i16 : L=eliminationMatrix ({x,y,z},G,H, Strategy => byResolution)

o16 = {2} | a_3b_1-a_1b_3 0             0             a_3c_1-a_1c_3
      {2} | a_3b_2-a_2b_3 a_3b_1-a_1b_3 0             a_3c_2-a_2c_3
      {2} | a_3b_0-a_0b_3 0             a_3b_1-a_1b_3 a_3c_0-a_0c_3
      {2} | 0             a_3b_2-a_2b_3 0             0            
      {2} | 0             a_3b_0-a_0b_3 a_3b_2-a_2b_3 0            
      {2} | 0             0             a_3b_0-a_0b_3 0            
      -----------------------------------------------------------------------
      0             0             b_3c_1-b_1c_3 0             0            
      a_3c_1-a_1c_3 0             b_3c_2-b_2c_3 b_3c_1-b_1c_3 0            
      0             a_3c_1-a_1c_3 b_3c_0-b_0c_3 0             b_3c_1-b_1c_3
      a_3c_2-a_2c_3 0             0             b_3c_2-b_2c_3 0            
      a_3c_0-a_0c_3 a_3c_2-a_2c_3 0             b_3c_0-b_0c_3 b_3c_2-b_2c_3
      0             a_3c_0-a_0c_3 0             0             b_3c_0-b_0c_3
      -----------------------------------------------------------------------
      a_3 b_3 c_3 |
      0   0   0   |
      a_1 b_1 c_1 |
      a_3 b_3 c_3 |
      a_2 b_2 c_2 |
      a_0 b_0 c_0 |

              6       12
o16 : Matrix R  <--- R

i17 : 
