-- -*- M2-comint -*- hash: 1209938661

i1 : R=QQ[a,b,c,x,y] 

o1 = R

o1 : PolynomialRing

i2 : f1 = a*x^2+b*x*y+c*y^2 

        2              2
o2 = a*x  + b*x*y + c*y

o2 : R

i3 : f2 = 2*a*x+b*y 

o3 = 2a*x + b*y

o3 : R

i4 : M = matrix{{f1,f2}} 

o4 = | ax2+bxy+cy2 2ax+by |

             1       2
o4 : Matrix R  <--- R

i5 : l = {x,y} 

o5 = {x, y}

o5 : List

i6 : dHPM = listDetComplex (2,l,koszul M)

           2     2
o6 = {- a*b  + 4a c, 1}

o6 : List

i7 : dHPM = listDetComplex (3,l,koszul M)

           2      2 2
o7 = {- a*b c + 4a c , c}

o7 : List

i8 : R=QQ[a,b,c,d,e,f,g,h,i,x,y,z] 

o8 = R

o8 : PolynomialRing

i9 : f1 = a*x+b*y+c*z 

o9 = a*x + b*y + c*z

o9 : R

i10 : f2 = d*x+e*y+f*z 

o10 = d*x + e*y + f*z

o10 : R

i11 : f3 = g*x+h*y+i*z 

o11 = g*x + h*y + i*z

o11 : R

i12 : M = matrix{{f1,f2,f3}} 

o12 = | ax+by+cz dx+ey+fz gx+hy+iz |

              1       3
o12 : Matrix R  <--- R

i13 : l = {x,y,z} 

o13 = {x, y, z}

o13 : List

i14 : dHPM = listDetComplex (1,l,koszul M, Strategy => Exact)

o14 = {- c*e*g + b*f*g + c*d*h - a*f*h - b*d*i + a*e*i, 1, 1}

o14 : List

i15 : setRandomSeed 0

o15 = 0

i16 : dHPM = listDetComplex (2,l,koszul M, Strategy => Numeric)

        3 2        2         2   2     3           2           2       
o16 = {c e g - 2b*c e*f*g + b c*f g - c d*e*h + b*c d*f*h + a*c e*f*h -
      -----------------------------------------------------------------------
             2       2           2 2     2                          2
      a*b*c*f h + b*c d*e*i - a*c e i - b c*d*f*i + a*b*c*e*f*i, - c e +
      -----------------------------------------------------------------------
      b*c*f, 1}

o16 : List

i17 : 
