-- -*- M2-comint -*- hash: 2127773816

i1 : A = matrix{{1,0},{0,1}}

o1 = | 1 0 |
     | 0 1 |

              2        2
o1 : Matrix ZZ  <--- ZZ

i2 : R = QQ[x,y, Degrees => entries transpose A]

o2 = R

o2 : PolynomialRing

i3 : I = ideal(x^2,y^2)

             2   2
o3 = ideal (x , y )

o3 : Ideal of R

i4 : M = R^1/I

o4 = cokernel | x2 y2 |

                            1
o4 : R-module, quotient of R

i5 : quasidegrees M

o5 = {{| 0 |, {}}, {| 1 |, {}}, {| 1 |, {}}, {0, {}}}
       | 1 |        | 0 |        | 1 |

o5 : List

i6 : R = R^{{-3,-2}}

               1
o6 = (QQ[x..y])

o6 : QQ[x..y]-module, free, degrees {{3, 2}}

i7 : M = R^1/I

o7 = cokernel {3, 2} | x2 y2 |

                                            1
o7 : QQ[x..y]-module, quotient of (QQ[x..y])

i8 : quasidegrees M

o8 = {{| 3 |, {}}, {| 3 |, {}}, {| 4 |, {}}, {| 4 |, {}}}
       | 3 |        | 2 |        | 2 |        | 3 |

o8 : List

i9 : A = matrix{{1,0},{0,1}}

o9 = | 1 0 |
     | 0 1 |

              2        2
o9 : Matrix ZZ  <--- ZZ

i10 : R = QQ[x,y]

o10 = R

o10 : PolynomialRing

i11 : R = toGradedRing(A,R)

o11 = R

o11 : PolynomialRing

i12 : I = ideal(x^2*y,y^2)

              2    2
o12 = ideal (x y, y )

o12 : Ideal of R

i13 : M=R^1/I

o13 = cokernel | x2y y2 |

                             1
o13 : R-module, quotient of R

i14 : quasidegrees M

o14 = {{| 1 |, {}}, {| 0 |, {}}, {0, {| 1 |}}}
        | 1 |        | 1 |            | 0 |

o14 : List

i15 : 
