-- -*- M2-comint -*- hash: -1667235660

i1 : R = QQ[x,y,Degrees=>{{1,0},{0,1}}]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x^2*y,x*y^2,y^3)

             2      2   3
o2 = ideal (x y, x*y , y )

o2 : Ideal of R

i3 : M = R^1/I

o3 = cokernel | x2y xy2 y3 |

                            1
o3 : R-module, quotient of R

i4 : quasidegreesAsVariables M

                                      2
o4 = {{1, {x}}, {y, {}}, {x*y, {}}, {y , {}}}

o4 : List

i5 : R=QQ[x,y,z,Degrees=>{{1,0,0},{0,1,0},{0,0,1}}]

o5 = R

o5 : PolynomialRing

i6 : I=ideal(y)

o6 = ideal y

o6 : Ideal of R

i7 : M=R^1/I

o7 = cokernel | y |

                            1
o7 : R-module, quotient of R

i8 : quasidegreesAsVariables M

o8 = {{1, {x, z}}}

o8 : List

i9 : 
