-- -*- M2-comint -*- hash: 1604572376

i1 : A = matrix{{1,1,1,1},{0,1,5,11}}

o1 = | 1 1 1 1  |
     | 0 1 5 11 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : R = QQ[a..d]

o2 = R

o2 : PolynomialRing

i3 : R = toGradedRing(A,R)

o3 = R

o3 : PolynomialRing

i4 : I = toricIdeal(A,R)

               2    2    5    3 2   2 3    4    5    4
o4 = ideal (b*c  - a d, c  - b d , a c  - b d, b  - a c)

o4 : Ideal of R

i5 : M = R^1/I

o5 = cokernel | bc2-a2d c5-b3d2 a2c3-b4d b5-a4c |

                            1
o5 : R-module, quotient of R

i6 : quasidegreesLocalCohomology M

o6 = {{| 2 |, {}}, {| 3 |, {}}, {| 3 |, {}}, {| 4 |, {}}}
       | 4 |        | 4 |        | 9 |        | 9 |

o6 : List

i7 : quasidegreesLocalCohomology(1,M)

o7 = {{| 2 |, {}}, {| 3 |, {}}, {| 3 |, {}}, {| 4 |, {}}}
       | 4 |        | 4 |        | 9 |        | 9 |

o7 : List

i8 : A = matrix{{1,1,1,1,1},{0,0,1,1,0},{0,1,1,0,-2}}

o8 = | 1 1 1 1 1  |
     | 0 0 1 1 0  |
     | 0 1 1 0 -2 |

              3        5
o8 : Matrix ZZ  <--- ZZ

i9 : R = QQ[a..e]

o9 = R

o9 : PolynomialRing

i10 : R = toGradedRing(A,R)

o10 = R

o10 : PolynomialRing

i11 : I = toricIdeal(A,R)

                           2    2    2            3    2
o11 = ideal (a*c - b*d, a*d  - c e, a d - b*c*e, a  - b e)

o11 : Ideal of R

i12 : M = R^1/I

o12 = cokernel | ac-bd ad2-c2e a2d-bce a3-b2e |

                             1
o12 : R-module, quotient of R

i13 : quasidegreesLocalCohomology(2,M)

o13 = {{| 0 |, {|  1 |}}}
        | 0 |   |  0 |
        | 1 |   | -2 |

o13 : List

i14 : 
