-- -*- M2-comint -*- hash: -217501696

i1 : A=matrix{{1,1,1,1,1},{0,0,1,1,0},{0,1,1,0,-2}}

o1 = | 1 1 1 1 1  |
     | 0 0 1 1 0  |
     | 0 1 1 0 -2 |

              3        5
o1 : Matrix ZZ  <--- ZZ

i2 : R=QQ[a..e]

o2 = R

o2 : PolynomialRing

i3 : S=toGradedRing(A,R)

o3 = S

o3 : PolynomialRing

i4 : describe S

o4 = QQ[a..e, Degrees => {{1}, {1}, {1}, {1}, {1 }}, Heft => {1, 2:0}]
                          {0}  {0}  {1}  {1}  {0 }
                          {0}  {1}  {1}  {0}  {-2}

i5 : 
