-- -*- M2-comint -*- hash: 975094671

i1 : R = QQ[x,y]

o1 = R

o1 : PolynomialRing

i2 : S = diffOpRing R

o2 = S

o2 : PolynomialRing

i3 : D = diffOp((x+y)*dx + (3+x) * dx*dy^2)

o3 = | (x+3)dxdy^2+(x+y)dx |

                1
o3 : DiffOp in S

i4 : (x^2+3) * D

o4 = | (x3+3x2+3x+9)dxdy^2+(x3+x2y+3x+3y)dx |

                1
o4 : DiffOp in S

i5 : D + D

o5 = | (2x+6)dxdy^2+(2x+2y)dx |

                1
o5 : DiffOp in S

i6 : D(x^5*y^2)

       5 2     4 3      5      4
o6 = 5x y  + 5x y  + 10x  + 30x

o6 : R

i7 : D = diffOp(matrix{{x*dx}, {y*dy}})

o7 = | xdx |
     | ydy |

                2
o7 : DiffOp in S

i8 : f = matrix{{x^2}, {y^2}}

o8 = | x2 |
     | y2 |

             2       1
o8 : Matrix R  <--- R

i9 : D f

       2     2
o9 = 2x  + 2y

o9 : R

i10 : 
