-- -*- M2-comint -*- hash: 1855236368

i1 : R = QQ[x,y,z];

i2 : I = (ideal(x,y,z))^3;

o2 : Ideal of R

i3 : noetherianOperators(I, Strategy => "MacaulayMatrix")

o3 = {| 1 |, | dz |, | dy |, | dx |, | dz^2 |, | dydz |, | dxdz |, | dy^2 |,
     ------------------------------------------------------------------------
     | dxdy |, | dx^2 |}

o3 : List

i4 : noetherianOperators(I, Strategy => "MacaulayMatrix", DegreeLimit => 1)

o4 = {| 1 |, | dz |, | dy |, | dx |}

o4 : List

i5 : 
