-- -*- M2-comint -*- hash: 1081571352

i1 : R = QQ[x,y,t]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x^2, y^2 - x*t)

             2   2
o2 = ideal (x , y  - x*t)

o2 : Ideal of R

i3 : P = radical I

o3 = ideal (y, x)

o3 : Ideal of R

i4 : N = noetherianOperators I

o4 = {| 1 |, | dy |, | tdy^2+2dx |, | tdy^3+6dxdy |}

o4 : List

i5 : phi = map(R, R, diagonalMatrix apply(numgens R, i -> random QQ))

                 9   1   9
o5 = map (R, R, {-x, -y, -t})
                 2   2   4

o5 : RingMap R <--- R

i6 : N' = coordinateChangeOps_phi N

o6 = {| 1 |, | 2dy |, | 4tdy^2+4/9dx |, | 8tdy^3+8/3dxdy |}

o6 : List

i7 : I' = phi I

            81 2  1 2   81
o7 = ideal (--x , -y  - --x*t)
             4    4      8

o7 : Ideal of R

i8 : P' = phi P

            1   9
o8 = ideal (-y, -x)
            2   2

o8 : Ideal of R

i9 : I' == getIdealFromNoetherianOperators(N', P')

o9 = false

i10 : 
