-- -*- M2-comint -*- hash: -675834709

i1 : R = CC[x,y];

i2 : I = ideal{x^2-y^2}

            2    2
o2 = ideal(x  - y )

o2 : Ideal of R

i3 : p = point matrix{{1,1}};

i4 : gCorners(p, I)
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o4 = | y |

             1       1
o4 : Matrix R  <--- R

i5 : S = gCorners(p, I, StandardBasis=>true)

o5 = | -.5x2+.5y2-1x+y |

             1       1
o5 : Matrix R  <--- R

i6 : R = CC[x,y,z];

i7 : J = ideal{z*(x*y-4), x-y}

o7 = ideal (x*y*z - 4z, x - y)

o7 : Ideal of R

i8 : q = point matrix{{1.4142136, 1.4142136, 0}};

i9 : gCorners(q, J, Tolerance=>1e-5)

o9 = | y z |

             1       2
o9 : Matrix R  <--- R

i10 : gCorners(q, J, StandardBasis=>true)

o10 = | -1x+y -.5x2z-1.41421xz+z |

              1       2
o10 : Matrix R  <--- R

i11 : 
