-- -*- M2-comint -*- hash: 900702544

i1 : R = QQ[x,y,t];

i2 : Q1 = ideal(x^2, y^2 + x*t);

o2 : Ideal of R

i3 : Q2 = ideal((x+t)^2);

o3 : Ideal of R

i4 : I = intersect(Q1, Q2);

o4 : Ideal of R

i5 : P = radical Q1;

o5 : Ideal of R

i6 : pt = point{{0,0,2}};

i7 : A = specializedNoetherianOperators(I, pt, DependentSet => {x,y}) / normalize

o7 = {| 1 |, | dy |, | dy^2-dx |, | dy^3-3dxdy |}

o7 : List

i8 : B = noetherianOperators(I, P) /
         (D -> evaluate(D,pt)) /
         normalize

o8 = {| 1 |, | dy |, | dy^2-dx |, | dy^3-3dxdy |}

o8 : List

i9 : A == B

o9 = true

i10 : S = CC[x,y,t]

o10 = S

o10 : PolynomialRing

i11 : pt = point{{0,0,2.1}}

o11 = pt

o11 : Point

i12 : specializedNoetherianOperators(sub(I, S), pt, DependentSet => {x,y})

o12 = {| 1 |, | dy |, | .5dy^2-.47619dx |, | .166667dy^3-.47619dxdy |}

o12 : List

i13 : 
