-- -*- M2-comint -*- hash: -154644539

i1 : R = CC[x,y];

i2 : I = ideal{x^2, y*x}

             2
o2 = ideal (x , x*y)

o2 : Ideal of R

i3 : truncatedDual(origin(R),I,3)

o3 = | 1 y x .5y2 .166667y3 |

o3 : DualSpace

i4 : p = point matrix{{0_CC, 1_CC}}

o4 = p

o4 : Point

i5 : truncatedDual(p,I,3)

o5 = | 1 y .5y2 .166667y3 |

o5 : DualSpace

i6 : q = point matrix{{0_CC + 1e-10, 1_CC}}

o6 = q

o6 : Point

i7 : tol = 1e-6;

i8 : S = truncatedDual(q,I,3, Tolerance => tol)

o8 = | 1 y .5y2 .166667y3 |

o8 : DualSpace

i9 : (m,c) = coefficients gens S;

i10 : m*clean(tol, c)

o10 = | 1 y .5y2 .166667y3 |

              1       4
o10 : Matrix R  <--- R

i11 : 
