-- -*- M2-comint -*- hash: 1665351181

i1 : R = QQ[a,b];

i2 : I = ideal{a^3,b^3}

             3   3
o2 = ideal (a , b )

o2 : Ideal of R

i3 : D = zeroDimensionalDual(origin(R), I)

o3 = | 1 b a 1/2b2 ab 1/2a2 1/2ab2 1/2a2b 1/4a2b2 |

o3 : DualSpace

i4 : dim D

o4 = 9

i5 : S = CC[x,y];

i6 : J = ideal{(y-2)^2,y-x^2}

             2              2
o6 = ideal (y  - 4y + 4, - x  + y)

o6 : Ideal of S

i7 : p = point matrix{{1.4142136_CC,2_CC}};

i8 : D = zeroDimensionalDual(p, J)

o8 = | 1 .353553x+y |

o8 : DualSpace

i9 : dim D

o9 = 2

i10 : 
