-- -*- M2-comint -*- hash: -1222947038

i1 : S=ZZ/101[x,y,z];

i2 : A=labeledModule(S^2);

o2 : free S-module with labeled basis

i3 : B=labeledModule(S^{3:-2});

o3 : free S-module with labeled basis

i4 : M=matrix{{x^2,x*y,y^2},{y^2,y*z,z^2}}

o4 = | x2 xy y2 |
     | y2 yz z2 |

             2       3
o4 : Matrix S  <--- S

i5 : f=map(A,B,M);

             2       3
o5 : Matrix S  <--- S

i6 : E=(exteriorPower(2,B))**(exteriorPower(2,A))

      3
o6 = S

o6 : free S-module with labeled basis

i7 : minorsMap(f,E)

o7 = | -xy3+x2yz -y4+x2z2 -y3z+xyz2 |

             1       3
o7 : Matrix S  <--- S

i8 : minorsMap(M,E)

o8 = | -xy3+x2yz -y4+x2z2 -y3z+xyz2 |

             1       3
o8 : Matrix S  <--- S

i9 : 
