-- -*- M2-comint -*- hash: 156178597

i1 : d={0,2,4,5};

i2 : p=pureResES1(d,ZZ/32003)

o2 = | x_0^2 x_0x_1 x_1^2-x_0x_2 x_0x_2 x_1x_2 x_2^2        0      0      0      0     |
     | 0     x_0^2  x_0x_1       x_0x_1 x_1^2  x_1x_2       x_0x_2 x_1x_2 x_2^2  0     |
     | 0     0      x_0^2        0      x_0x_1 x_1^2-x_0x_2 0      x_0x_2 x_1x_2 x_2^2 |

               ZZ          3         ZZ          10
o2 : Matrix (-----[x ..x ])  <--- (-----[x ..x ])
             32003  0   2          32003  0   2

i3 : betti res coker p

            0  1  2 3
o3 = total: 3 10 15 8
         0: 3  .  . .
         1: . 10  . .
         2: .  . 15 8

o3 : BettiTally

i4 : dim coker p

o4 = 0

i5 : 
