-- -*- M2-comint -*- hash: 1001304895

i1 : S=ZZ/101[x_{0,0,0}..x_{2,1,1}];

i2 : C=symmetricPower(2,labeledModule(S^3))

      6
o2 = S

o2 : free S-module with labeled basis

i3 : basisList C

o3 = {{0, 0}, {0, 1}, {1, 1}, {0, 2}, {1, 2}, {2, 2}}

o3 : List

i4 : toOrdinal({0,0},C)

o4 = 0

i5 : toOrdinal({1,2},C)

o5 = 4

i6 : 
