-- -*- M2-comint -*- hash: 1688437809

i1 : S=ZZ/101[x,y,z];

i2 : A=labeledModule(S^2);

o2 : free S-module with labeled basis

i3 : B=labeledModule(S^5);

o3 : free S-module with labeled basis

i4 : F=A**B

      10
o4 = S

o4 : free S-module with labeled basis

i5 : underlyingModules(F)

       2   5
o5 = {S , S }

o5 : List

i6 : G=exteriorPower(2,A)

      1
o6 = S

o6 : free S-module with labeled basis

i7 : underlyingModules(G)

       2
o7 = {S }

o7 : List

i8 : 
