-- -*- M2-comint -*- hash: 1214689118

i1 : R = QQ[x,y,z,w];

i2 : I = ideal(x*y*w^3,x^2*y*w^2,x*y^3*w,x*y*z^3);

o2 : Ideal of R

i3 : m = ideal vars R;

o3 : Ideal of R

i4 : mixedMultiplicity ((m,I,I,I),(0,1,1,1))

o4 = 6

i5 : R = QQ[x,y,z];

i6 : m = ideal vars R;

o6 : Ideal of R

i7 : f = z^5 + x*y^7 + x^15;

i8 : I = ideal(apply(0..2, i -> diff(R_i,f)))

               14    7      6    4
o8 = ideal (15x   + y , 7x*y , 5z )

o8 : Ideal of R

i9 : mixedMultiplicity ((m,I),(2,0))

o9 = 1

i10 : mixedMultiplicity ((m,I),(1,1))

o10 = 4

i11 : S = QQ[x,y,z,w]/ideal(x*z, y*z);

i12 : I = ideal(x,y);

o12 : Ideal of S

i13 : m = ideal vars S;

o13 : Ideal of S

i14 : K = saturate(sub(ideal(),S), I^2);

o14 : Ideal of S

i15 : T = S/K;

i16 : J = sub(I, T);

o16 : Ideal of T

i17 : n = sub(m, T);

o17 : Ideal of T

i18 : mixedMultiplicity ((n,J,J),(2,0,0))

o18 = 1

i19 : 
