-- -*- M2-comint -*- hash: -1237861159

i1 : S = QQ[x_0..x_3];

i2 : C = trim monomialCurveIdeal(S,{2,3,5});

o2 : Ideal of S

i3 : multiReesIdeal (C, VariableBaseName => "w")

             2                   2
o3 = ideal (x w  - x w  - x w , x w  - x w  - x w )
             2 0    1 1    3 2   1 0    0 1    2 2

o3 : Ideal of S[w ..w ]
                 0   2

i4 : homIdealPolytope ({(0,1),(1,0),(2,1),(1,2)}, VariableBaseName => "T")

             2       2     2     2
o4 = ideal (T T , T T , T T , T T )
             1 2   1 2   1 3   2 3

o4 : Ideal of QQ[T ..T ]
                  1   3

i5 : 
