-- -*- M2-comint -*- hash: -1972301537

i1 : gndR = QQ[(t_1..t_3)|(w_1..w_3)|(v_1..v_3), MonomialOrder => Lex];

i2 : translation := matrix {{w_1}, {w_2}, {w_3}, {t_1*w_2+t_2*w_3+v_1}, {-t_1*w_1+t_3*w_3+v_2}, {-t_2*w_1-t_3*w_2+v_3}};

                6          1
o2 : Matrix gndR  <--- gndR

i3 : sag := sagbi transpose translation;

i4 : netList first entries gens sag

     +------------------+
o4 = |w                 |
     | 3                |
     +------------------+
     |w                 |
     | 2                |
     +------------------+
     |w                 |
     | 1                |
     +------------------+
     |t w  + t w  - v   |
     | 2 1    3 2    3  |
     +------------------+
     |t w  + t w  + v   |
     | 1 2    2 3    1  |
     +------------------+
     |t w  - t w  - v   |
     | 1 1    3 3    2  |
     +------------------+
     |w v  + w v  + w v |
     | 1 1    2 2    3 3|
     +------------------+

i5 : R = QQ[x_1..x_9, MonomialOrder => Lex];

i6 : eqns := {x_1^2+x_2^2+x_3^2-1, x_1*x_4+x_2*x_5+x_3*x_6, x_1*x_7+x_2*x_8+x_3*x_9, x_1*x_4+x_2*x_5+x_3*x_6,
              x_4^2+x_5^2+x_6^2-1, x_4*x_7+x_5*x_8+x_6*x_9, x_1*x_7+x_2*x_8+x_3*x_9, x_4*x_7+x_5*x_8+x_6*x_9,
              x_7^2+x_8^2+x_9^2-1, x_1*x_5*x_9-x_1*x_6*x_8-x_2*x_4*x_9+x_2*x_6*x_7+x_3*x_4*x_8-x_3*x_5*x_7-1};

i7 : sag1 = subring sagbi eqns;

i8 : SB = sagbi(sag1, Limit => 100);

i9 : isSAGBI SB

o9 = true

i10 : netList first entries gens SB

      +---------------------------------------------------------------------------------------------------------------------+
      | 2    2    2                                                                                                         |
o10 = |x  + x  + x                                                                                                          |
      | 7    8    9                                                                                                         |
      +---------------------------------------------------------------------------------------------------------------------+
      |x x  + x x  + x x                                                                                                    |
      | 4 7    5 8    6 9                                                                                                   |
      +---------------------------------------------------------------------------------------------------------------------+
      | 2    2    2                                                                                                         |
      |x  + x  + x                                                                                                          |
      | 4    5    6                                                                                                         |
      +---------------------------------------------------------------------------------------------------------------------+
      |x x  + x x  + x x                                                                                                    |
      | 1 7    2 8    3 9                                                                                                   |
      +---------------------------------------------------------------------------------------------------------------------+
      |x x  + x x  + x x                                                                                                    |
      | 1 4    2 5    3 6                                                                                                   |
      +---------------------------------------------------------------------------------------------------------------------+
      | 2    2    2                                                                                                         |
      |x  + x  + x                                                                                                          |
      | 1    2    3                                                                                                         |
      +---------------------------------------------------------------------------------------------------------------------+
      |x x x  - x x x  - x x x  + x x x  + x x x  - x x x                                                                   |
      | 1 5 9    1 6 8    2 4 9    2 6 7    3 4 8    3 5 7                                                                  |
      +---------------------------------------------------------------------------------------------------------------------+
      | 2 2    2 2                            2 2    2 2                2 2    2 2                                          |
      |x x  + x x  - 2x x x x  - 2x x x x  + x x  + x x  - 2x x x x  + x x  + x x                                           |
      | 4 8    4 9     4 5 7 8     4 6 7 9    5 7    5 9     5 6 8 9    6 7    6 8                                          |
      +---------------------------------------------------------------------------------------------------------------------+
      |     2        2                                         2        2                                         2        2|
      |x x x  + x x x  - x x x x  - x x x x  - x x x x  + x x x  + x x x  - x x x x  - x x x x  - x x x x  + x x x  + x x x |
      | 1 4 8    1 4 9    1 5 7 8    1 6 7 9    2 4 7 8    2 5 7    2 5 9    2 6 8 9    3 4 7 9    3 5 8 9    3 6 7    3 6 8|
      +---------------------------------------------------------------------------------------------------------------------+
      |                         2        2        2                              2        2                   2             |
      |x x x x  + x x x x  - x x x  - x x x  - x x x  + x x x x  + x x x x  - x x x  - x x x  + x x x x  - x x x  + x x x x |
      | 1 4 5 8    1 4 6 9    1 5 7    1 6 7    2 4 8    2 4 5 7    2 5 6 9    2 6 8    3 4 9    3 4 6 7    3 5 9    3 5 6 8|
      +---------------------------------------------------------------------------------------------------------------------+
      | 2 2    2 2                            2 2    2 2                2 2    2 2                                          |
      |x x  + x x  - 2x x x x  - 2x x x x  + x x  + x x  - 2x x x x  + x x  + x x                                           |
      | 1 8    1 9     1 2 7 8     1 3 7 9    2 7    2 9     2 3 8 9    3 7    3 8                                          |
      +---------------------------------------------------------------------------------------------------------------------+
      | 2        2                                                    2        2                              2        2    |
      |x x x  + x x x  - x x x x  - x x x x  - x x x x  - x x x x  + x x x  + x x x  - x x x x  - x x x x  + x x x  + x x x |
      | 1 5 8    1 6 9    1 2 4 8    1 2 5 7    1 3 4 9    1 3 6 7    2 4 7    2 6 9    2 3 5 9    2 3 6 8    3 4 7    3 5 8|
      +---------------------------------------------------------------------------------------------------------------------+
      | 2 2    2 2                            2 2    2 2                2 2    2 2                                          |
      |x x  + x x  - 2x x x x  - 2x x x x  + x x  + x x  - 2x x x x  + x x  + x x                                           |
      | 1 5    1 6     1 2 4 5     1 3 4 6    2 4    2 6     2 3 5 6    3 4    3 5                                          |
      +---------------------------------------------------------------------------------------------------------------------+

i11 : 
