-- -*- M2-comint -*- hash: 796562735

i1 : R = QQ[x,y,z];

i2 : S = sagbi {x^2, y^2, z^2}

o2 = SAGBIBasis Computation Object with 3 generators, Limit = 100.

o2 : SAGBIBasis

i3 : ambient S

o3 = R

o3 : PolynomialRing

i4 : Q = R / ideal(x^3 - y);

i5 : S' = sagbi {x^3, y^2}

o5 = SAGBIBasis Computation Object with 1 generators, Limit = 100.

o5 : SAGBIBasis

i6 : ambient S'

o6 = Q

o6 : QuotientRing

i7 : 
