-- -*- M2-comint -*- hash: -454327453

i1 : R = QQ[x,y,z];

i2 : S = subring {x+y+z,x*y+x*z+y*z, x*y*z, (x-y)*(x-z)*(y-z)};

i3 : isSAGBI S

o3 = false

i4 : sagbi(S, Limit => 5)

o4 = Partial SAGBIBasis Computation Object with 6 generators, Limit = 5.

o4 : SAGBIBasis

i5 : isSAGBI S
 -- 0.00022479 seconds elapsed
 -- 0.00022992 seconds elapsed
 -- 0.000233003 seconds elapsed
 -- 0.000118756 seconds elapsed
 -- 0.000243043 seconds elapsed
 -- 0.000207903 seconds elapsed
 -- 0.000324831 seconds elapsed
 -- 0.000267165 seconds elapsed
 -- 0.000247644 seconds elapsed
 -- 0.0001219 seconds elapsed
 -- 0.000224954 seconds elapsed
 -- 0.00023416 seconds elapsed
 -- 0.0184481 seconds elapsed
 -- 0.000556143 seconds elapsed
 -- 0.00437751 seconds elapsed
 -- 0.000124583 seconds elapsed
 -- 0.000472241 seconds elapsed
 -- 0.000256369 seconds elapsed
 -- 0.000138194 seconds elapsed
 -- 0.000424716 seconds elapsed
 -- 0.000258358 seconds elapsed
 -- 0.000116564 seconds elapsed
 -- 0.000556634 seconds elapsed
 -- 0.000257156 seconds elapsed
 -- 0.000132689 seconds elapsed
 -- 0.000370058 seconds elapsed
 -- 0.0105144 seconds elapsed
 -- 0.000120052 seconds elapsed
 -- 0.000383615 seconds elapsed
 -- 0.00025394 seconds elapsed
 -- 0.000154548 seconds elapsed
 -- 0.000526159 seconds elapsed
 -- 0.000385994 seconds elapsed
 -- 0.000120511 seconds elapsed
 -- 0.000247599 seconds elapsed
 -- 0.000324158 seconds elapsed
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction

o5 = false

i6 : S' = subring {x+y+z,x*y+x*z+y*z, x*y*z};

i7 : isSAGBI S'

o7 = true

i8 : sagbi(S', Limit => 5)

o8 = SAGBIBasis Computation Object with 3 generators, Limit = 5.

o8 : SAGBIBasis

i9 : isSAGBI S'
 -- 0.000228872 seconds elapsed
 -- 0.000189745 seconds elapsed
 -- 0.000297405 seconds elapsed
 -- 0.000118273 seconds elapsed
 -- 0.000252627 seconds elapsed
 -- 0.00019839 seconds elapsed
 -- 0.000115806 seconds elapsed
 -- 0.00021178 seconds elapsed
 -- 0.000195539 seconds elapsed
 -- 0.000257508 seconds elapsed
 -- 0.000198404 seconds elapsed
 -- 0.000195166 seconds elapsed
 -- 0.000112511 seconds elapsed
 -- 0.000216696 seconds elapsed
 -- 0.000189655 seconds elapsed
 -- 0.000125089 seconds elapsed
 -- 0.000270481 seconds elapsed
 -- 0.000214014 seconds elapsed
 -- 0.000108797 seconds elapsed
 -- 0.000234624 seconds elapsed
 -- 0.000269272 seconds elapsed
 -- 0.000126563 seconds elapsed
 -- 0.000229272 seconds elapsed
 -- 0.000388401 seconds elapsed
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction

o9 = true

i10 : 
