-- -*- M2-comint -*- hash: 8715591

i1 : R = QQ[t_(1,1)..t_(3,3),MonomialOrder=>Lex];

i2 : M = genericMatrix(R,3,3);

             3       3
o2 : Matrix R  <--- R

i3 : A = subring gens minors(2, M);

i4 : isSAGBI A

o4 = false

i5 : S = sagbi A;

i6 : gS = gens S

o6 = | t_(2,2)t_(3,3)-t_(2,3)t_(3,2) t_(2,1)t_(3,3)-t_(2,3)t_(3,1)
     ------------------------------------------------------------------------
     t_(2,1)t_(3,2)-t_(2,2)t_(3,1) t_(1,2)t_(3,3)-t_(1,3)t_(3,2)
     ------------------------------------------------------------------------
     t_(1,2)t_(2,3)-t_(1,3)t_(2,2) t_(1,1)t_(3,3)-t_(1,3)t_(3,1)
     ------------------------------------------------------------------------
     t_(1,1)t_(3,2)-t_(1,2)t_(3,1) t_(1,1)t_(2,3)-t_(1,3)t_(2,1)
     ------------------------------------------------------------------------
     t_(1,1)t_(2,2)-t_(1,2)t_(2,1)
     ------------------------------------------------------------------------
     t_(1,1)t_(2,2)t_(3,1)t_(3,3)-t_(1,1)t_(2,3)t_(3,1)t_(3,2)-t_(1,2)t_(2,1)
     ------------------------------------------------------------------------
     t_(3,1)t_(3,3)+t_(1,2)t_(2,3)t_(3,1)^2+t_(1,3)t_(2,1)t_(3,1)t_(3,2)-t_(1
     ------------------------------------------------------------------------
     ,3)t_(2,2)t_(3,1)^2 t_(1,1)t_(1,3)t_(2,2)t_(3,3)-t_(1,1)t_(1,3)t_(2,3)t
     ------------------------------------------------------------------------
     _(3,2)-t_(1,2)t_(1,3)t_(2,1)t_(3,3)+t_(1,2)t_(1,3)t_(2,3)t_(3,1)+t_(1,3
     ------------------------------------------------------------------------
     )^2t_(2,1)t_(3,2)-t_(1,3)^2t_(2,2)t_(3,1) |

             1       11
o6 : Matrix R  <--- R

i7 : isSAGBI gS

o7 = true

i8 : R=QQ[x,y];

i9 : A = subring matrix{{x+y,x*y,x*y^2}};

i10 : gens sagbi(A,Limit=>3)

o10 = | x+y xy xy2 |

              1       3
o10 : Matrix R  <--- R

i11 : gens sagbi(A,Limit=>10)

o11 = | x+y xy xy2 xy3 xy4 xy5 xy6 xy7 xy8 xy9 |

              1       10
o11 : Matrix R  <--- R

i12 : 
