-- -*- M2-comint -*- hash: 891979749

i1 : R = QQ[x,y];

i2 : I = ideal(x^3 + x*y^2 + y^3);

o2 : Ideal of R

i3 : Q = R/I;

i4 : S1 = subring {x^2, x*y};

i5 : S2 = subring {x, y^2};

i6 : S = subringIntersection(S1, S2);
 -- 0.000103748 seconds elapsed
 -- 0.000848808 seconds elapsed
 -- 0.000274054 seconds elapsed
 -- 0.000108914 seconds elapsed
 -- 0.00077746 seconds elapsed
 -- 0.000243818 seconds elapsed
 -- 0.000081568 seconds elapsed
 -- 0.000083699 seconds elapsed
 -- 0.000243902 seconds elapsed
 -- 0.000109862 seconds elapsed
 -- 0.000806564 seconds elapsed
 -- 0.000266545 seconds elapsed
 -- 0.000086349 seconds elapsed
 -- 0.00410406 seconds elapsed
 -- 0.00027144 seconds elapsed
 -- 0.000095095 seconds elapsed
 -- 0.000671852 seconds elapsed
 -- 0.000236963 seconds elapsed
 -- 0.000106589 seconds elapsed
 -- 0.000730168 seconds elapsed
 -- 0.000231871 seconds elapsed
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction

i7 : gens S

o7 = | x2 x2y2+xy3 y4 xy3 y6 xy5 |

             1       6
o7 : Matrix Q  <--- Q

i8 : isSAGBI S
 -- 0.000114381 seconds elapsed
 -- 0.000843386 seconds elapsed
 -- 0.00025428 seconds elapsed
 -- 0.000110673 seconds elapsed
 -- 0.000768833 seconds elapsed
 -- 0.000267098 seconds elapsed
 -- 0.00009831 seconds elapsed
 -- 0.000689692 seconds elapsed
 -- 0.000248125 seconds elapsed
 -- 0.000105179 seconds elapsed
 -- 0.000709799 seconds elapsed
 -- 0.00024118 seconds elapsed
 -- 0.000112199 seconds elapsed
 -- 0.00067835 seconds elapsed
 -- 0.000244697 seconds elapsed
 -- 0.000122816 seconds elapsed
 -- 0.000732716 seconds elapsed
 -- 0.000252591 seconds elapsed
 -- 0.00010567 seconds elapsed
 -- 0.000803318 seconds elapsed
 -- 0.000225518 seconds elapsed
 -- 0.00009929 seconds elapsed
 -- 0.000742769 seconds elapsed
 -- 0.000235308 seconds elapsed
 -- 0.000089866 seconds elapsed
 -- 0.0107502 seconds elapsed
 -- 0.00030931 seconds elapsed
 -- 0.0000857 seconds elapsed
 -- 0.000687561 seconds elapsed
 -- 0.000218628 seconds elapsed
 -- 0.000111043 seconds elapsed
 -- 0.000666867 seconds elapsed
 -- 0.00022916 seconds elapsed
 -- 0.000111774 seconds elapsed
 -- 0.00075293 seconds elapsed
 -- 0.000287289 seconds elapsed
 -- 0.000114225 seconds elapsed
 -- 0.00109446 seconds elapsed
 -- 0.00043654 seconds elapsed
 -- 0.000100631 seconds elapsed
 -- 0.00381293 seconds elapsed
 -- 0.000517281 seconds elapsed
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction
timing raw subduction

o8 = true

i9 : 
