-- -*- M2-comint -*- hash: 1214712323

i1 : R = ZZ/2[x,y];

i2 : Q = R / ideal(x + y^5);

i3 : S = subring {x+y, x*y, x*y^2};

i4 : f = x^2*y^3 + x^4 + y^4;

i5 : f % S

o5 = 0

o5 : Q

i6 : g = f // S

      4
o6 = p  + p p
      0    1 2

     ZZ
o6 : --[p ..p ]
      2  0   2

i7 : M = map(Q, subductionQuotientRing S, gens S);

                    ZZ
o7 : RingMap Q <--- --[p ..p ]
                     2  0   2

i8 : M g == f

o8 = true

i9 : 
