-- -*- M2-comint -*- hash: -596941221

i1 : QQ[x,y,z];

i2 : isGenSegment(ideal(x^2,x*y,y^4))

o2 = (true, {6, 3, 1})

o2 : Sequence

i3 : isGenSegment(ideal(x^2,x*y^3,y^4))

o3 = (true, {4, 3, 1})

o3 : Sequence

i4 : 
