-- -*- M2-comint -*- hash: -1784452729

i1 : QQ[x,y,z];

i2 : J = ideal(x^2,x*y^3,y^4)

             2     3   4
o2 = ideal (x , x*y , y )

o2 : Ideal of QQ[x..z]

i3 : isRegSegment J

o3 = (false, )

o3 : Sequence

i4 : isGenSegment(truncate(regularity J,J))

o4 = (false, )

o4 : Sequence

i5 : isGenSegment J

o5 = (true, {4, 3, 1})

o5 : Sequence

i6 : 
