-- -*- M2-comint -*- hash: -712477053

i1 : QQ[t];

i2 : S = QQ[x,y,z,w];

i3 : lexIdeal(4*t, S)

                5   4 2
o3 = ideal (x, y , y z )

o3 : Ideal of S

i4 : lexIdeal(4*t, 5)

                     5   4 2
o4 = ideal (x , x , x , x x )
             1   0   2   2 3

o4 : Ideal of QQ[x ..x ]
                  0   4

i5 : hp = hilbertPolynomial oo

o5 = - 4*P  + 4*P
          0      1

o5 : ProjectiveHilbertPolynomial

i6 : lexIdeal(hp, S)

                5   4 2
o6 = ideal (x, y , y z )

o6 : Ideal of S

i7 : lexIdeal(hp, 3)

             5   4 2
o7 = ideal (x , x x )
             0   0 1

o7 : Ideal of QQ[x ..x ]
                  0   2

i8 : lexIdeal(5, S)

                   5
o8 = ideal (y, x, z )

o8 : Ideal of S

i9 : lexIdeal(5, 3)

                 5
o9 = ideal (x , x )
             0   1

o9 : Ideal of QQ[x ..x ]
                  0   2

i10 : 
