-- -*- M2-comint -*- hash: -200747041

i1 : QQ[t];

i2 : stronglyStableIdeals(3, 3, CoefficientRing=>ZZ/101)

                  3           2         2
o2 = {ideal (x , x ), ideal (x , x x , x )}
              0   1           1   0 1   0

o2 : List

i3 : oo#0

                 3
o3 = ideal (x , x )
             0   1

               ZZ
o3 : Ideal of ---[x ..x ]
              101  0   2

i4 : 
