-- -*- M2-comint -*- hash: -591487466

i1 : QQ[t];

i2 : S = QQ[x,y,z,w];

i3 : stronglyStableIdeals(4*t, S)

                 5   4 2                     2   4    5                2 
o3 = {ideal (x, y , y z ), ideal (x*z, x*y, x , y z, y ), ideal (x*y, x ,
     ------------------------------------------------------------------------
        2   4                2   3
     x*z , y ), ideal (x*y, x , y )}

o3 : List

i4 : stronglyStableIdeals(4*t, 4)

                  5   4 2                       2   4     5               
o4 = {ideal (x , x , x x ), ideal (x x , x x , x , x x , x ), ideal (x x ,
              0   1   1 2           0 2   0 1   0   1 2   1           0 1 
     ------------------------------------------------------------------------
      2     2   4                 2   3
     x , x x , x ), ideal (x x , x , x )}
      0   0 2   1           0 1   0   1

o4 : List

i5 : hp = hilbertPolynomial(oo#0)

o5 = - 4*P  + 4*P
          0      1

o5 : ProjectiveHilbertPolynomial

i6 : stronglyStableIdeals(hp, S)

                 5   4 2                     2   4    5                2 
o6 = {ideal (x, y , y z ), ideal (x*z, x*y, x , y z, y ), ideal (x*y, x ,
     ------------------------------------------------------------------------
        2   4                2   3
     x*z , y ), ideal (x*y, x , y )}

o6 : List

i7 : stronglyStableIdeals(hp, 4)

                  5   4 2                       2   4     5               
o7 = {ideal (x , x , x x ), ideal (x x , x x , x , x x , x ), ideal (x x ,
              0   1   1 2           0 2   0 1   0   1 2   1           0 1 
     ------------------------------------------------------------------------
      2     2   4                 2   3
     x , x x , x ), ideal (x x , x , x )}
      0   0 2   1           0 1   0   1

o7 : List

i8 : stronglyStableIdeals(5, S)

                    5                   2   4              2   3     2  
o8 = {ideal (y, x, z ), ideal (x, y*z, y , z ), ideal (x, y , z , y*z ),
     ------------------------------------------------------------------------
                       2        2   3
     ideal (y*z, x*z, y , x*y, x , z )}

o8 : List

i9 : stronglyStableIdeals(5, 4)

                      5                     2   4               2   3     2  
o9 = {ideal (x , x , x ), ideal (x , x x , x , x ), ideal (x , x , x , x x ),
              1   0   2           0   1 2   1   2           0   1   2   1 2  
     ------------------------------------------------------------------------
                         2         2   3
     ideal (x x , x x , x , x x , x , x )}
             1 2   0 2   1   0 1   0   2

o9 : List

i10 : 
