-- -*- M2-comint -*- hash: -491925367

i1 : ZZ/2[x,y,z]; rationalPoints(ideal(y^2*z+y*z^2-x^3-x*z^2), Projective=>true)

o2 = {(1 : 0 : 1), (1 : 1 : 1), (0 : 1 : 0), (0 : 1 : 1), (0 : 0 : 1)}

o2 : List

i3 : QQ[x,y]; rationalPoints(ideal(x^2+y^2-1), Bound=>5)

                                         3    4      3    4    4    3      4 
o4 = {{0, -1}, {1, 0}, {-1, 0}, {0, 1}, {-, - -}, {- -, - -}, {-, - -}, {- -,
                                         5    5      5    5    5    5      5 
     ------------------------------------------------------------------------
       3    4  3      4  3    3  4      3  4
     - -}, {-, -}, {- -, -}, {-, -}, {- -, -}}
       5    5  5      5  5    5  5      5  5

o4 : List

i5 : QQ[x,y]; I = ideal(x^2+1,y^2-2);

o6 : Ideal of QQ[x..y]

i7 : rationalPoints(I, Verbose=>true)
-- the following polynomials do not split
   -- x^2-2

o7 = {}

o7 : List

i8 : rationalPoints(I, Split=>true, Verbose=>true)
-- base change to the field QQ[a]/(a^2-2)
-- base change to the field QQ[a]/(a^4-2*a^2+9)

       1 3   1   1 3   5       1 3   1   1 3   5     1 3   1     1 3   5   
o8 = {{-a  + -a, -a  - -a}, {- -a  - -a, -a  - -a}, {-a  + -a, - -a  + -a},
       6     6   6     6       6     6   6     6     6     6     6     6   
     ------------------------------------------------------------------------
        1 3   1     1 3   5
     {- -a  - -a, - -a  + -a}}
        6     6     6     6

o8 : List

i9 : 
