-- -*- M2-comint -*- hash: 1751733472

i1 : QQ[x]; F = extField(4*x^2+1, Variable=>i); x

     1
o3 = -i
     2

o3 : F

i4 : baseRing F

      QQ[i]
o4 = ------
      2
     i  + 1

o4 : QuotientRing

i5 : i^2 + 1 == 0

o5 = true

i6 : QQ[q]; F' = extField(F, q^2-2); q

     1 3   5
o8 = -a  - -a
     6     6

o8 : F'

i9 : q^2 == 2

o9 = true

i10 : baseRing F'

          QQ[a]
o10 = ------------
       4     2
      a  - 2a  + 9

o10 : QuotientRing

i11 : j = baseChange_F' i

      1 3   1
o11 = -a  + -a
      6     6

o11 : F'

i12 : j^2 + 1 == 0

o12 = true

i13 : QQ[symbol x]; F' = extField {4*x^2+1, x^2-2}; baseRing F'

          QQ[a]
o15 = ------------
       4     2
      a  - 2a  + 9

o15 : QuotientRing

i16 : extField {4*x^2+1}; x

o17 = x

o17 : QQ[x]

i18 : QQ[x]; p = x^3-2; F = extField {p}; #zeros_F p

o21 = 1

i22 : F' = extField {p, p}; #zeros_F' p

o23 = 3

i24 : F' = splittingField p; #zeros_F' p

o25 = 3

i26 : ZZ/11[x]; F = extField(x^4+1); describe F

o28 = GF 121

i29 : x

o29 = 5a + 5

o29 : F

i30 : x^4 + 1 == 0

o30 = true

i31 : 
