-- -*- M2-comint -*- hash: 557546433

i1 : R = ZZ/5[x,y,z]; I = ideal(x^3-y*z, x+y);

o2 : Ideal of R

i3 : rationalPoints I

o3 = {{0, 0, 0}, {0, 0, 1}, {-2, 2, 1}, {2, -2, 1}, {0, 0, 2}, {0, 0, -2},
     ------------------------------------------------------------------------
     {0, 0, -1}, {-1, 1, -1}, {1, -1, -1}}

o3 : List

i4 : #rationalPoints Spec(R/I)

o4 = 9

i5 : #rationalPoints_(GF 25) I

o5 = 49

i6 : ZZ/5[x,y,z,w]; I = ideal "xz-y2,xw-yz,yw-z2";

              ZZ
o7 : Ideal of --[x..z, w]
               5

i8 : rationalPoints(I, Projective => true)

o8 = {(1 : 0 : 0 : 0), (1 : 1 : 1 : 1), (1 : -2 : -1 : 2), (1 : 2 : -1 : -2),
     ------------------------------------------------------------------------
     (1 : -1 : 1 : -1), (0 : 0 : 0 : 1)}

o8 : List

i9 : #rationalPoints variety I

o9 = 6

i10 : #rationalPoints_(GF 25) variety I

o10 = 26

i11 : ZZ/101[u_0..u_10]; f = sum toList(u_0..u_10); I = ideal f

o13 = ideal(u  + u  + u  + u  + u  + u  + u  + u  + u  + u  + u  )
             0    1    2    3    4    5    6    7    8    9    10

                ZZ
o13 : Ideal of ---[u ..u  ]
               101  0   10

i14 : time rationalPoints(I, Amount => true)
     -- used 0.00443017 seconds

o14 = 110462212541120451001

i15 : QQ[x,y,z]; I = homogenize(ideal(y^2-x*(x-1)*(x-2)*(x-5)*(x-6)), z);

o16 : Ideal of QQ[x..z]

i17 : rationalPoints(variety I, Bound=>12)

                             1            1             1            1       
o17 = {(1 : 0 : 1), (1 : 0 : -), (1 : 2 : -), (1 : -2 : -), (1 : 0 : -), (1 :
                             2            3             3            5       
      -----------------------------------------------------------------------
          1
      0 : -), (0 : 1 : 0), (0 : 0 : 1)}
          6

o17 : List

i18 : globalHeight \ oo

o18 = {1, 2, 6, 6, 5, 6, 1, 1}

o18 : List

i19 : rationalPoints(variety I, Bound=>12, KeepAll=>true)

                             1            1             1            1       
o19 = {(1 : 0 : 1), (1 : 0 : -), (1 : 2 : -), (1 : -2 : -), (1 : 0 : -), (1 :
                             2            3             3            5       
      -----------------------------------------------------------------------
          1              1               1
      0 : -), (1 : 12 : --), (1 : -12 : --), (0 : 1 : 0), (0 : 0 : 1)}
          6             10              10

o19 : List

i20 : globalHeight \ oo

o20 = {1, 2, 6, 6, 5, 6, 120, 120, 1, 1}

o20 : List

i21 : QQ[x,y]; rationalPoints(ideal(x-2), Bound=>2)

                                                       1       1
o22 = {{2, -2}, {2, -1}, {2, 0}, {2, 1}, {2, 2}, {2, - -}, {2, -}}
                                                       2       2

o22 : List

i23 : R = QQ[x,y]; I = ideal(x^2+y^2-1,x^3+y^3-1);

o24 : Ideal of R

i25 : rationalPoints(I, Verbose => true)
-- the following polynomials do not split
   -- 2*x^2+4*x+3

o25 = {{1, 0}, {0, 1}}

o25 : List

i26 : rationalPoints(I, Verbose => true, Split => true)
-- base change to the field QQ[a]/(a^2+4*a+6)

                          1       1     1     1
o26 = {{1, 0}, {0, 1}, {- -a - 2, -a}, {-a, - -a - 2}}
                          2       2     2     2

o26 : List

i27 : ring \ first oo

          QQ[a]          QQ[a]
o27 = {-----------[], -----------[]}
        2              2
       a  + 4a + 6    a  + 4a + 6

o27 : List

i28 : F = toField(QQ[q]/(q^4-10*q^2+20)); R = F[x,y,z,w];

i30 : I = ideal "64(x-w)(x4-4x3w-10x2y2-4x2w2+16xw3-20xy2w+5y4+16w4-20y2w2)-5q(2z-qw)(4(x2+y2-z2)+(1+3(5-q2))w2)2";

o30 : Ideal of R

i31 : nodes = I + ideal jacobian I;

o31 : Ideal of R

i32 : time rationalPoints(variety nodes, Split=>true, Verbose=>true);
-- base change to the field QQ[a]/(a^8-40*a^6+230*a^4-200*a^2+25)
     -- used 1.90398 seconds

i33 : #oo

o33 = 31

i34 : nodes' = baseChange_32003 nodes;

o34 : Ideal of GF 1048969271299456081[x..z, w]

i35 : time #rationalPoints(variety nodes', Split=>true, Verbose=>true)
     -- used 0.3031 seconds

o35 = 31

i36 : 
