-- -*- M2-comint -*- hash: -710362241

i1 : R=QQ[a..h]

o1 = R

o1 : PolynomialRing

i2 : M=matrix{{a,b,c,d},{e,f,g,h}}

o2 = | a b c d |
     | e f g h |

             2       4
o2 : Matrix R  <--- R

i3 : analyticSpread minors(2,M)

o3 = 5

i4 : specialFiberIdeal minors(2,M)

o4 = ideal(Z Z  - Z Z  + Z Z )
            2 3    1 4    0 5

o4 : Ideal of QQ[Z ..Z ]
                  0   5

i5 : R=QQ[a,b,c,d]

o5 = R

o5 : PolynomialRing

i6 : M=matrix{{a,b,c,d},{b,c,d,a}}

o6 = | a b c d |
     | b c d a |

             2       4
o6 : Matrix R  <--- R

i7 : analyticSpread minors(2,M)

o7 = 4

i8 : specialFiberIdeal minors(2,M)

                                 2                  2
o8 = ideal (Z Z  - Z Z  + Z Z , Z  - Z Z  - Z Z  - Z  + Z Z  + Z Z )
             2 3    1 4    0 5   1    0 2    0 3    4    2 5    3 5

o8 : Ideal of QQ[Z ..Z ]
                  0   5

i9 : 
