-- -*- M2-comint -*- hash: -1567200065

i1 : R = ZZ/101[a,b]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(a^2, a*b)

             2
o2 = ideal (a , a*b)

o2 : Ideal of R

i3 : ass I

o3 = {ideal a, ideal (b, a)}

o3 : List

i4 : distinguished I

o4 = {{2, ideal (b, a)}, {1, ideal a}}

o4 : List

i5 : intersectInP(I,I)

o5 = {{1, ideal a}}

o5 : List

i6 : 
