-- -*- M2-comint -*- hash: 1326209556

i1 : S = ZZ/5[x,y]

o1 = S

o1 : PolynomialRing

i2 : I = ideal(x^3,x*y,y^4)

             3        4
o2 = ideal (x , x*y, y )

o2 : Ideal of S

i3 : J = ideal(x*y, x^3+y^4)

                  4    3
o3 = ideal (x*y, y  + x )

o3 : Ideal of S

i4 : isReduction(I,J)

o4 = true

i5 : isReduction(J,I)

o5 = false

i6 : isReduction(I,I)

o6 = true

i7 : g = I_0

      3
o7 = x

o7 : S

i8 : isReduction(I,J,g)

o8 = true

i9 : isReduction(J,I,g)

o9 = false

i10 : isReduction(I,I,g)

o10 = true

i11 : 
