-- -*- M2-comint -*- hash: 786633128

i1 : setRandomSeed 0

o1 = 0

i2 : n=3;

i3 : kk = ZZ/101;

i4 : S = kk[a_0..a_(n-2)];

i5 : phi' = map(S^(n),S^(n-1), (i,j) -> if i == 0 then a_j else random(2,S));

             3       2
o5 : Matrix S  <--- S

i6 : I = minors(n-1,phi');

o6 : Ideal of S

i7 : betti (F = res I)

            0 1 2
o7 = total: 1 3 2
         0: 1 . .
         1: . . .
         2: . 2 .
         3: . 1 2

o7 : BettiTally

i8 : phi = F.dd_2;

             3       2
o8 : Matrix S  <--- S

i9 : jphi = jacobianDual phi

o9 = {0, 1} | (11a_0-37a_1)w_1                
     {0, 1} | (-11a_0-34a_1)w_0-46a_1w_1+14w_2
     ------------------------------------------------------------------------
     w_2                              |
     11a_1w_0+(-11a_0-30a_1)w_1+18w_2 |

                       2                 2
o9 : Matrix (S[w ..w ])  <--- (S[w ..w ])
                0   2             0   2

i10 : ell = analyticSpread I

o10 = 2

i11 : r = reductionNumber(I, minimalReduction I)

o11 = 1

i12 : whichGm I >= ell

o12 = true

i13 : apply(toList(1..ell-1), p-> {p+1, codim minors(n-p, phi)})

o13 = {{2, 2}}

o13 : List

i14 : reesI = reesIdeal I;

o14 : Ideal of S[w ..w ]
                  0   2

i15 : codim reesI

o15 = 2

i16 : betti res reesI

             0 1 2
o16 = total: 1 3 2
          0: 1 . .
          1: . . .
          2: . 2 .
          3: . 1 2

o16 : BettiTally

i17 : psi = jacobianDual phi

o17 = {0, 1} | (11a_0-37a_1)w_1                
      {0, 1} | (-11a_0-34a_1)w_0-46a_1w_1+14w_2
      -----------------------------------------------------------------------
      w_2                              |
      11a_1w_0+(-11a_0-30a_1)w_1+18w_2 |

                        2                 2
o17 : Matrix (S[w ..w ])  <--- (S[w ..w ])
                 0   2             0   2

i18 : ST = ring psi

o18 = ST

o18 : PolynomialRing

i19 : T = vars ST

o19 = | w_0 w_1 w_2 |

               1        3
o19 : Matrix ST  <--- ST

i20 : J = ideal(T*promote(phi, ST))

                            2          2               2                 2  
o20 = ideal ((- 11a a  - 34a )w  + (11a  - 37a a  - 46a )w  + 14a w , 11a w 
                   0 1      1  0       0      0 1      1  1      1 2     1 0
      -----------------------------------------------------------------------
                       2
      + (- 11a a  - 30a )w  + (a  + 18a )w )
              0 1      1  1     0      1  2

o20 : Ideal of ST

i21 : betti res J

             0 1 2
o21 = total: 1 2 1
          0: 1 . .
          1: . . .
          2: . 2 .
          3: . . .
          4: . . 1

o21 : BettiTally

i22 : J1 = minors(ell, psi)

                        2              2             2  2                    
o22 = ideal((20a a  - 3a )w w  + (- 20a  - 24a a  - a )w  + (11a  + 34a )w w 
                0 1     1  0 1         0      0 1    1  1       0      1  0 2
      -----------------------------------------------------------------------
                                2
      + (- 4a  - 14a )w w  - 14w )
             0      1  1 2      2

o22 : Ideal of ST

i23 : betti (G = res trim (J+J1))

             0 1 2
o23 = total: 1 3 2
          0: 1 . .
          1: . . .
          2: . 2 .
          3: . 1 2

o23 : BettiTally

i24 : betti res reesIdeal I

             0 1 2
o24 = total: 1 3 2
          0: 1 . .
          1: . . .
          2: . 2 .
          3: . 1 2

o24 : BettiTally

i25 : 
