-- -*- M2-comint -*- hash: 69026975

i1 : kk = ZZ/101;

i2 : S = kk[a..c];

i3 : m = ideal vars S;

o3 : Ideal of S

i4 : i = (ideal"a,b")*m+ideal"c3"

             2                  2        3
o4 = ideal (a , a*b, a*c, a*b, b , b*c, c )

o4 : Ideal of S

i5 : analyticSpread i

o5 = 3

i6 : minimalReduction i

                 3      2              2                       3      2  
o6 = ideal (- 10c  + 24a  + 36a*b + 19b  - 30a*c + 19b*c, - 16c  - 29a  -
     ------------------------------------------------------------------------
                2                       3      2              2
     37a*b - 24b  - 22a*c - 38b*c, - 18c  + 39a  + 40a*b - 47b  + 34a*c -
     ------------------------------------------------------------------------
     39b*c)

o6 : Ideal of S

i7 : f = gens i

o7 = | a2 ab ac ab b2 bc c3 |

             1       7
o7 : Matrix S  <--- S

i8 : for a from 0 to 3 do(jhom:=ideal (f*random(source f, S^{3-a:-2,a:-3})); print(i^6 == (i^5)*jhom))
false
false
false
false

i9 : 
