-- -*- M2-comint -*- hash: 1545454869

i1 : setRandomSeed()

i2 : kk = ZZ/32003;

i3 : S = kk[a..c];

i4 : m = ideal vars S;

o4 : Ideal of S

i5 : i = (ideal"a,b")*m+ideal"c3"

             2                  2        3
o5 = ideal (a , a*b, a*c, a*b, b , b*c, c )

o5 : Ideal of S

i6 : analyticSpread i

o6 = 3

i7 : j=minimalReduction i

                 3         2                   2                       
o7 = ideal (1851c  + 10356a  - 4344a*b + 15816b  + 11567a*c - 15394b*c,
     ------------------------------------------------------------------------
           3         2                  2                            3  
     11958c  - 11142a  + 6959a*b - 2765b  - 15224a*c - 2094b*c, 8725c  +
     ------------------------------------------------------------------------
          2                   2
     1278a  + 4039a*b - 10543b  - 7124a*c - 12085b*c)

o7 : Ideal of S

i8 : reductionNumber (i,j)

o8 = 1

i9 : 
