-- -*- M2-comint -*- hash: 286936633

i1 : S = QQ[x_0..x_3]

o1 = S

o1 : PolynomialRing

i2 : i = monomialCurveIdeal(S,{3,7,8})

               2    2       3      3   3      2 2   5      4   5    3
o2 = ideal (x x  - x x , x x  - x x , x x  - x x , x  - x x , x  - x x x )
             0 2    1 3   1 2    0 3   1 2    0 3   2    1 3   1    0 2 3

o2 : Ideal of S

i3 : I = reesIdeal i;

o3 : Ideal of S[w ..w ]
                 0   4

i4 : reesIdeal(i, Variable=>v)

                                   3      2              2      2      2   
o4 = ideal (x x v  - x v  + x v , x v  + x v  - x v , x x v  - x v  + x v ,
             1 2 0    0 1    3 2   3 0    2 1    1 3   0 3 0    1 1    2 2 
     ------------------------------------------------------------------------
      2        2            3                     3                       2 2
     x x v  - x v  + x v , x v  + x x v  - x v , x v  - x x v  + x v , x x v 
      0 3 0    1 2    2 4   2 0    1 3 1    0 3   1 0    0 2 2    3 4   2 3 0
     ------------------------------------------------------------------------
          2                2      2             2      2 2  2
     - x v  + v v , x x x v  - x v  + v v , (x x x  + x x )v  - x x v v  +
        1 1    2 3   0 1 3 0    2 2    1 4    0 2 3    1 3  0    1 2 1 2  
     ------------------------------------------------------------------------
     v v )
      3 4

o4 : Ideal of S[v ..v ]
                 0   4

i5 : I=reesIdeal(i,i_0);

o5 : Ideal of S[w ..w ]
                 0   4

i6 : (J=symmetricKernel gens i);

o6 : Ideal of S[w ..w ]
                 0   4

i7 : isLinearType(i,i_0)

o7 = false

i8 : isLinearType i

o8 = false

i9 : reesAlgebra (i,i_0)

                                                                                                           S[w ..w ]
                                                                                                              0   4
o9 = ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                             3      2              2      2      2     2        2            3                     3                       2 2      2                2      2             2      2 2  2
     (x x w  - x w  + x w , x w  + x w  - x w , x x w  - x w  + x w , x x w  - x w  + x w , x w  + x x w  - x w , x w  - x x w  + x w , x x w  - x w  + w w , x x x w  - x w  + w w , (x x x  + x x )w  - x x w w  + w w )
       1 2 0    0 1    3 2   3 0    2 1    1 3   0 3 0    1 1    2 2   0 3 0    1 2    2 4   2 0    1 3 1    0 3   1 0    0 2 2    3 4   2 3 0    1 1    2 3   0 1 3 0    2 2    1 4    0 2 3    1 3  0    1 2 1 2    3 4

o9 : QuotientRing

i10 : trim ideal normalCone (i, i_0)

                2    2       3      3   3      2 2   5      4   5    3
o10 = ideal (x x  - x x , x x  - x x , x x  - x x , x  - x x , x  - x x x )
              0 2    1 3   1 2    0 3   1 2    0 3   2    1 3   1    0 2 3

                                                                                                                     S[w ..w ]
                                                                                                                        0   4
o10 : Ideal of ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                       3      2              2      2      2     2        2            3                     3                       2 2      2                2      2             2      2 2  2
               (x x w  - x w  + x w , x w  + x w  - x w , x x w  - x w  + x w , x x w  - x w  + x w , x w  + x x w  - x w , x w  - x x w  + x w , x x w  - x w  + w w , x x x w  - x w  + w w , (x x x  + x x )w  - x x w w  + w w )
                 1 2 0    0 1    3 2   3 0    2 1    1 3   0 3 0    1 1    2 2   0 3 0    1 2    2 4   2 0    1 3 1    0 3   1 0    0 2 2    3 4   2 3 0    1 1    2 3   0 1 3 0    2 2    1 4    0 2 3    1 3  0    1 2 1 2    3 4

i11 : trim ideal associatedGradedRing (i,i_0)

                2    2       3      3   3      2 2   5      4   5    3
o11 = ideal (x x  - x x , x x  - x x , x x  - x x , x  - x x , x  - x x x )
              0 2    1 3   1 2    0 3   1 2    0 3   2    1 3   1    0 2 3

                                                                                                                     S[w ..w ]
                                                                                                                        0   4
o11 : Ideal of ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                       3      2              2      2      2     2        2            3                     3                       2 2      2                2      2             2      2 2  2
               (x x w  - x w  + x w , x w  + x w  - x w , x x w  - x w  + x w , x x w  - x w  + x w , x w  + x x w  - x w , x w  - x x w  + x w , x x w  - x w  + w w , x x x w  - x w  + w w , (x x x  + x x )w  - x x w w  + w w )
                 1 2 0    0 1    3 2   3 0    2 1    1 3   0 3 0    1 1    2 2   0 3 0    1 2    2 4   2 0    1 3 1    0 3   1 0    0 2 2    3 4   2 3 0    1 1    2 3   0 1 3 0    2 2    1 4    0 2 3    1 3  0    1 2 1 2    3 4

i12 : trim specialFiberIdeal (i,i_0)

o12 = ideal (w w , w w , w w )
              3 4   1 4   2 3

o12 : Ideal of QQ[w ..w ]
                   0   4

i13 : 
