-- -*- M2-comint -*- hash: -2113238255

i1 : R=QQ[a..h]

o1 = R

o1 : PolynomialRing

i2 : M=matrix{{a,b,c,d},{e,f,g,h}}

o2 = | a b c d |
     | e f g h |

             2       4
o2 : Matrix R  <--- R

i3 : analyticSpread minors(2,M)

o3 = 5

i4 : specialFiberIdeal minors(2,M)

o4 = ideal(Z Z  - Z Z  + Z Z )
            2 3    1 4    0 5

o4 : Ideal of QQ[Z ..Z ]
                  0   5

i5 : n = 2

o5 = 2

i6 : x = symbol x

o6 = x

o6 : Symbol

i7 : S = ZZ/32003[x_1..x_n]

o7 = S

o7 : PolynomialRing

i8 : M = matrix{{x_1,x_2,0},{0,x_1,x_2}}

o8 = | x_1 x_2 0   |
     | 0   x_1 x_2 |

             2       3
o8 : Matrix S  <--- S

i9 : I = minors(n,M)

             2         2
o9 = ideal (x , x x , x )
             1   1 2   2

o9 : Ideal of S

i10 : specialFiber(I,I_0)

        ZZ
      -----[w ..w ]
      32003  0   2
o10 = -------------
         2
        w  - w w
         1    0 2

o10 : QuotientRing

i11 : 
