-- -*- M2-comint -*- hash: -534209985

i1 : R = QQ[a..e]

o1 = R

o1 : PolynomialRing

i2 : J = monomialCurveIdeal(R, {1,2,3})

             2                    2
o2 = ideal (c  - b*d, b*c - a*d, b  - a*c)

o2 : Ideal of R

i3 : symmetricKernel (gens J)

o3 = ideal (b*w  - c*w  + d*w , a*w  - b*w  + c*w )
               0      1      2     0      1      2

o3 : Ideal of R[w ..w ]
                 0   2

i4 : S = ring oo;

i5 : (monoid S).Options.Degrees

o5 = {{1, 2}, {1, 2}, {1, 2}}

o5 : List

i6 : R = QQ[x,y,z]/ideal(x*y^2-z^9)

o6 = R

o6 : QuotientRing

i7 : J = ideal(x,y,z)

o7 = ideal (x, y, z)

o7 : Ideal of R

i8 : symmetricKernel(gens J)

                                                             8       2  
o8 = ideal (z*w  - y*w , z*w  - x*w , y*w  - x*w , x*y*w  - z w , x*w  -
               1      2     0      2     0      1       1      2     1  
     ------------------------------------------------------------------------
      7 2     2    6 3
     z w , w w  - z w )
        2   0 1      2

o8 : Ideal of R[w ..w ]
                 0   2

i9 : 
