-- -*- M2-comint -*- hash: -1048791076

i1 : kk=ZZ/101;

i2 : S=kk[a..c];

i3 : m=ideal vars S

o3 = ideal (a, b, c)

o3 : Ideal of S

i4 : i=(ideal"a,b")*m+ideal"c3"

             2                  2        3
o4 = ideal (a , a*b, a*c, a*b, b , b*c, c )

o4 : Ideal of S

i5 : whichGm i

o5 = 3

i6 : 
