-- -*- M2-comint -*- hash: -833826016

i1 : QQ[x,y,z];

i2 : gfan(ideal(x^2*y -z, y^2*z - x, z^2*x - y), "symmetry" => {{0,1,2}, {1,2,0}})

         2            2           2     3    2      3    2          3   
o2 = {{(y z) - x, (x*z ) - y, (x*y ) - z , (x z) - y , (x y) - z, (x ) -
     ------------------------------------------------------------------------
        2    4     2    4     2      3       2    4     2      2         2  
     y*z , (z ) - x , (y ) - z }, {(x ) - y*z , (z ) - x , (x*z ) - y, (x y)
     ------------------------------------------------------------------------
              2     3    2          3     2       6             4      
     - z, (x*y ) - z , (y z) - x, (y ) - x z}, {(z ) - x*y, (y*z ) - z,
     ------------------------------------------------------------------------
         2         2          3     5      2     3    2     4      4     2 
     (x*z ) - y, (y z) - x, (y ) - z , (x*y ) - z , (x ) - z }, {(y ) - z ,
     ------------------------------------------------------------------------
         2     3    2          2     4      2           4         5     3  
     (x*y ) - z , (y z) - x, (x ) - z , (x*z ) - y, (y*z ) - z, (z ) - y },
     ------------------------------------------------------------------------
        4     2    2 3           4         5     3         2       9      
     {(y ) - z , (y z ) - y, (y*z ) - z, (z ) - y , (x) - y z}, {(y ) - z,
     ------------------------------------------------------------------------
       6               2     2     4      2     8           6    2     4 
     (y z) - y, (x) - y z, (z ) - y }, {(x ) - y , (x*z) - y , (z ) - y ,
     ------------------------------------------------------------------------
       2            4         9           3     5           6    2     4 
     (y z) - x, (x*y ) - y, (y ) - z}, {(x ) - y , (x*z) - y , (z ) - y ,
     ------------------------------------------------------------------------
       2          2            4         8     2      8     2    2 3      
     (x y) - z, (y z) - x, (x*y ) - y, (y ) - x }, {(y ) - x , (x y ) - x,
     ------------------------------------------------------------------------
         4         3     5         2       11           4              9 
     (x*y ) - y, (x ) - y , (z) - x y}, {(y  ) - x, (x*y ) - y, (z) - y ,
     ------------------------------------------------------------------------
       2     8      15              9         11
     (x ) - y }, {(y  ) - y, (z) - y , (x) - y  }}

o2 : List

i3 : QQ[x,y,z];

i4 : gfanBuchberger(ideal(x,y+z))

o4 = {(y) + z, (x)}

o4 : MarkedPolynomialList

i5 : QQ[x,y,z];

i6 : gfanBuchberger(ideal(x,y+z), "w" => {1,2,3})

o6 = {(x), (z) + y}

o6 : MarkedPolynomialList

i7 : 
