-- -*- M2-comint -*- hash: 1912589330

i1 : QQ[x,y,z];

i2 : f = x + y + z;

i3 : g = x + y;

i4 : h = y + z;

i5 : L = markedPolynomialList {{z, y}, {f,g}}

o5 = {(z) + x + y, (y) + x}

o5 : MarkedPolynomialList

i6 : M = markedPolynomialList {{x, y} , {f,h}}

o6 = {(x) + y + z, (y) + z}

o6 : MarkedPolynomialList

i7 : gfanPolynomialSetUnion(L,M)

o7 = {(z) + x + y, (y) + x, (y) + z}

o7 : MarkedPolynomialList

i8 : gfanPolynomialSetUnion({f,g},{f,h})

o8 = {(x) + y + z, (x) + y, (y) + z}

o8 : MarkedPolynomialList

i9 : 
