-- -*- M2-comint -*- hash: 625714125

i1 : R = QQ[x,y,z];

i2 : gfan(ideal(x^2*y -y^2, y^2*x - x^2))

         5     2      2     4    2     4      3     3    2      2      2   
o2 = {{(y ) - y , (x*y ) - y , (x ) - y }, {(x ) - y , (x y) - y , (x*y ) -
     ------------------------------------------------------------------------
      2    4     2      4     2    2      2      2     2    3     3      5   
     x , (y ) - x }, {(x ) - y , (x y) - y , (x*y ) - x , (y ) - x }, {(x ) -
     ------------------------------------------------------------------------
      2    2      4    2     4
     x , (x y) - x , (y ) - x }}

o2 : List

i3 : gfan({x^2*y -y^2, y^2*x - x^2}, "symmetry" => {{0,1,2}, {1,0,2}})

           2     2    2      2    3     3    4     2      5     2      2   
o3 = {{(x*y ) - x , (x y) - y , (x ) - y , (y ) - x }, {(y ) - y , (x*y ) -
     ------------------------------------------------------------------------
      4    2     4
     y , (x ) - y }}

o3 : List

i4 : gfan(markedPolynomialList {{y^5, x*y^2, x^2},{y^5-y^2,x*y^2 - y^4, x^2 -y^4}}, "g" => true)

         5     2      2     4    2     4      3     3    2      2      2   
o4 = {{(y ) - y , (x*y ) - y , (x ) - y }, {(x ) - y , (x y) - y , (x*y ) -
     ------------------------------------------------------------------------
      2    4     2      4     2    2      2      2     2    3     3      5   
     x , (y ) - x }, {(x ) - y , (x y) - y , (x*y ) - x , (y ) - x }, {(x ) -
     ------------------------------------------------------------------------
      2    2      4    2     4
     x , (x y) - x , (y ) - x }}

o4 : List

i5 : 
