-- -*- M2-comint -*- hash: -1740538260

i1 : QQ[x,y,z];

i2 : I = ideal(x*y + z, x*z + y);

o2 : Ideal of QQ[x..z]

i3 : gfanBuchberger(I)

        2     2
o3 = {(y ) - z , (x*z) + y, (x*y) + z}

o3 : MarkedPolynomialList

i4 : gfanBuchberger(I, "w" => {1,2,3})

                              2     2
o4 = {(x*y) + z, (x*z) + y, (z ) - y }

o4 : MarkedPolynomialList

i5 : gfanBuchberger({x*y + z, x*z +y}, "w" => {1,2,3})

                              2     2
o5 = {(x*y) + z, (x*z) + y, (z ) - y }

o5 : MarkedPolynomialList

i6 : QQ[x,y,z, MonomialOrder => { Weights => {1,2,3}, Lex } ];

i7 : G = gens gb ideal(x*y + z,  x*z + y )

o7 = | xy+z xz+y z2-y2 |

                      1                3
o7 : Matrix (QQ[x..z])  <--- (QQ[x..z])

i8 : markedPolynomialList transpose  apply(flatten entries G, g-> {leadTerm g, g})

                              2     2
o8 = {(x*y) + z, (x*z) + y, (z ) - y }

o8 : MarkedPolynomialList

i9 : 
