-- -*- M2-comint -*- hash: -324340244

i1 : QQ[x,y];

i2 : L = {x+y, x^2*y + x};

i3 : gfanHomogenize(L, symbol z, "w" => {2,3})

                  5    2
o3 = {x*z + y, x*z  + x y}

o3 : List

i4 : QQ[x,y,z];

i5 : L = {x+y, x^2*y + x};

i6 : homogenize(matrix{L}, z, {2,3,1})

o6 = | xz+y xz5+x2y |

                      1                2
o6 : Matrix (QQ[x..z])  <--- (QQ[x..z])

i7 : QQ[x,y];

i8 : L = markedPolynomialList {{y}, {x+y}};

i9 : gfanHomogenize(L, symbol z,  "w" => {2,3})

o9 = {(y) + x*z}

o9 : MarkedPolynomialList

i10 : 
