-- -*- M2-comint -*- hash: 1130370976

i1 : R=ZZ[x,y]

o1 = R

o1 : PolynomialRing

i2 : I=ideal(x^2-y^2,2*x)

             2    2
o2 = ideal (x  - y , 2x)

o2 : Ideal of R

i3 : F=gfanOverIntegers(I,"groebnerFan"=>true)

o3 = F

o3 : Fan

i4 : rays F

o4 = | 1  -1 |
     | -1 1  |

              2        2
o4 : Matrix ZZ  <--- ZZ

i5 : linealitySpace F

o5 = | 1 |
     | 1 |

              2        1
o5 : Matrix ZZ  <--- ZZ

i6 : maxCones F

o6 = {{1}, {0}}

o6 : List

i7 : G=gfanOverIntegers(I,{1,0},"groebnerBasis"=>true)

        2     2           2
o7 = {(x ) + y , (2x), (2y )}

o7 : MarkedPolynomialList

i8 : H=gfanOverIntegers(I,{1,0},"initialIdeal"=>true)

       2        2
o8 = {x , 2x, 2y }

o8 : List

i9 : 
