-- -*- M2-comint -*- hash: -1377945760

i1 : S=ZZ[x_0,x_1];

i2 : R=ZZ[a_1..a_4];

i3 : Q1=matrix{{a_1,a_2,a_3,a_4}}

o3 = | a_1 a_2 a_3 a_4 |

             1       4
o3 : Matrix R  <--- R

i4 : gotzmannTest(S^2,1,{0})

o4 = true

i5 : Q1=affinePart(Q1,{0})

o5 = | 1 a_2 a_3 a_4 |

             1       4
o5 : Matrix R  <--- R

i6 : N1=gens ker Q1

o6 = {0} | a_2 a_3 a_4 |
     {1} | -1  0   0   |
     {1} | 0   -1  0   |
     {1} | 0   0   -1  |

             4       3
o6 : Matrix R  <--- R

i7 : N2=nextDegree(N1,1,S)

o7 = {-1} | a_2 0   a_3 0   a_4 0   |
     {-1} | -1  a_2 0   a_3 0   a_4 |
     {0}  | 0   -1  0   0   0   0   |
     {0}  | 0   0   -1  0   0   0   |
     {0}  | 0   0   0   -1  -1  0   |
     {0}  | 0   0   0   0   0   -1  |

             6       6
o7 : Matrix R  <--- R

i8 : co1Fitting(N2)

o8 = ideal(a a  - a )
            2 3    4

o8 : Ideal of R

i9 : quotScheme(S^2,1,{0})

o9 = ideal(a a  - a )
            2 3    4

o9 : Ideal of ZZ[a ..a ]
                  1   4

i10 : S=ZZ[x,y];

i11 : R=ZZ[a_1..a_12];

i12 : Q2=matrix{toList(a_1..a_6),toList(a_7..a_12)}

o12 = | a_1 a_2 a_3 a_4  a_5  a_6  |
      | a_7 a_8 a_9 a_10 a_11 a_12 |

              2       6
o12 : Matrix R  <--- R

i13 : Q2=affinePart(Q2,{0,1})

o13 = | 1 0 a_3 a_4  a_5  a_6  |
      | 0 1 a_9 a_10 a_11 a_12 |

              2       6
o13 : Matrix R  <--- R

i14 : K3=nextDegree(gens ker Q2,2,S);

              8       8
o14 : Matrix R  <--- R

i15 : time I=co1Fitting(K3)
     -- used 0.00277986 seconds

o15 = ideal (a a   + a  - a  , a a   - a , a a   + a  - a  , a a   - a )
              9 11    5    12   3 11    6   9 10    4    11   3 10    5

o15 : Ideal of R

i16 : time J=fittingIdeal(2-1,coker K3);
     -- used 0.00860912 seconds

o16 : Ideal of R

i17 : I==J

o17 = true

i18 : 
