-- -*- M2-comint -*- hash: -322577386

i1 : S=ZZ[x,y];

i2 : R=S[a_1..a_4];

i3 : M=matrix{{1,a_2,a_3,a_4}};

             1       4
o3 : Matrix R  <--- R

i4 : K=nextDegree(ker M,1,S)

o4 = {-1, 0} | a_2 0   a_3 0   a_4 0   |
     {-1, 0} | -1  a_2 0   a_3 0   a_4 |
     {0, 0}  | 0   -1  0   0   0   0   |
     {0, 0}  | 0   0   -1  0   0   0   |
     {0, 0}  | 0   0   0   -1  -1  0   |
     {0, 0}  | 0   0   0   0   0   -1  |

             6       6
o4 : Matrix R  <--- R

i5 : gaussCol(K)

o5 = | a_2 a_2^2 a_3 a_2a_3 -a_2a_3+a_4 a_2a_4 |
     | -1  0     0   0      0           0      |
     | 0   -1    0   0      0           0      |
     | 0   0     -1  0      0           0      |
     | 0   0     0   -1     0           0      |
     | 0   0     0   0      0           -1     |

             6       6
o5 : Matrix R  <--- R

i6 : 
