-- -*- M2-comint -*- hash: -1182588462

i1 : genericMultidimensionalMatrix(2,4,3)

o1 = {{{a     , a     , a     }, {a     , a     , a     }, {a     , a     ,
         0,0,0   0,0,1   0,0,2     0,1,0   0,1,1   0,1,2     0,2,0   0,2,1 
     ------------------------------------------------------------------------
     a     }, {a     , a     , a     }}, {{a     , a     , a     }, {a     ,
      0,2,2     0,3,0   0,3,1   0,3,2       1,0,0   1,0,1   1,0,2     1,1,0 
     ------------------------------------------------------------------------
     a     , a     }, {a     , a     , a     }, {a     , a     , a     }}}
      1,1,1   1,1,2     1,2,0   1,2,1   1,2,2     1,3,0   1,3,1   1,3,2

o1 : 3-dimensional matrix of shape 2 x 4 x 3 over ZZ[a     ..a     ]
                                                      0,0,0   1,3,2

i2 : genericMultidimensionalMatrix((2,2,3),CoefficientRing=>ZZ/101)

o2 = {{{a     , a     , a     }, {a     , a     , a     }}, {{a     , a     ,
         0,0,0   0,0,1   0,0,2     0,1,0   0,1,1   0,1,2       1,0,0   1,0,1 
     ------------------------------------------------------------------------
     a     }, {a     , a     , a     }}}
      1,0,2     1,1,0   1,1,1   1,1,2

                                                   ZZ
o2 : 3-dimensional matrix of shape 2 x 2 x 3 over ---[a     ..a     ]
                                                  101  0,0,0   1,1,2

i3 : genericMultidimensionalMatrix((2,1,3),CoefficientRing=>ZZ/101,Variable=>"b")

o3 = {{{b     , b     , b     }}, {{b     , b     , b     }}}
         0,0,0   0,0,1   0,0,2       1,0,0   1,0,1   1,0,2

                                                   ZZ
o3 : 3-dimensional matrix of shape 2 x 1 x 3 over ---[b     ..b     ]
                                                  101  0,0,0   1,0,2

i4 : 
