-- -*- M2-comint -*- hash: 1772013090

i1 : genericSymmetricMultidimensionalMatrix(3,2)

o1 = {{{a , a }, {a , a }}, {{a , a }, {a , a }}}
         0   1     1   2       1   2     2   3

o1 : 3-dimensional matrix of shape 2 x 2 x 2 over QQ[a ..a ]
                                                      0   3

i2 : genericSymmetricMultidimensionalMatrix(3,2,CoefficientRing=>ZZ/101)

o2 = {{{a , a }, {a , a }}, {{a , a }, {a , a }}}
         0   1     1   2       1   2     2   3

                                                   ZZ
o2 : 3-dimensional matrix of shape 2 x 2 x 2 over ---[a ..a ]
                                                  101  0   3

i3 : genericSymmetricMultidimensionalMatrix(3,2,CoefficientRing=>ZZ/101,Variable=>"b")

o3 = {{{b , b }, {b , b }}, {{b , b }, {b , b }}}
         0   1     1   2       1   2     2   3

                                                   ZZ
o3 : 3-dimensional matrix of shape 2 x 2 x 2 over ---[b ..b ]
                                                  101  0   3

i4 : 
