-- -*- M2-comint -*- hash: 1024556833

i1 : genericSkewMultidimensionalMatrix(3,4)

o1 = {{{0, 0, 0, 0}, {0, 0, -a , -a }, {0, a , 0, -a }, {0, a , a , 0}}, {{0,
                              1    0        1       2        0   2           
     ------------------------------------------------------------------------
     0, a , a }, {0, 0, 0, 0}, {-a , 0, 0, -a }, {-a , 0, a , 0}}, {{0, -a ,
         1   0                    1          3      0      3              1 
     ------------------------------------------------------------------------
     0, a }, {a , 0, 0, a }, {0, 0, 0, 0}, {-a , -a , 0, 0}}, {{0, -a , -a ,
         2     1         3                    2    3                 0    2 
     ------------------------------------------------------------------------
     0}, {a , 0, -a , 0}, {a , a , 0, 0}, {0, 0, 0, 0}}}
           0       3        2   3

o1 : 3-dimensional matrix of shape 4 x 4 x 4 over QQ[a ..a ]
                                                      0   3

i2 : genericSkewMultidimensionalMatrix(3,4,CoefficientRing=>ZZ/101)

o2 = {{{0, 0, 0, 0}, {0, 0, -a , -a }, {0, a , 0, -a }, {0, a , a , 0}}, {{0,
                              1    0        1       2        0   2           
     ------------------------------------------------------------------------
     0, a , a }, {0, 0, 0, 0}, {-a , 0, 0, -a }, {-a , 0, a , 0}}, {{0, -a ,
         1   0                    1          3      0      3              1 
     ------------------------------------------------------------------------
     0, a }, {a , 0, 0, a }, {0, 0, 0, 0}, {-a , -a , 0, 0}}, {{0, -a , -a ,
         2     1         3                    2    3                 0    2 
     ------------------------------------------------------------------------
     0}, {a , 0, -a , 0}, {a , a , 0, 0}, {0, 0, 0, 0}}}
           0       3        2   3

                                                   ZZ
o2 : 3-dimensional matrix of shape 4 x 4 x 4 over ---[a ..a ]
                                                  101  0   3

i3 : genericSkewMultidimensionalMatrix(3,4,CoefficientRing=>ZZ/101,Variable=>"b")

o3 = {{{0, 0, 0, 0}, {0, 0, -b , -b }, {0, b , 0, -b }, {0, b , b , 0}}, {{0,
                              1    0        1       2        0   2           
     ------------------------------------------------------------------------
     0, b , b }, {0, 0, 0, 0}, {-b , 0, 0, -b }, {-b , 0, b , 0}}, {{0, -b ,
         1   0                    1          3      0      3              1 
     ------------------------------------------------------------------------
     0, b }, {b , 0, 0, b }, {0, 0, 0, 0}, {-b , -b , 0, 0}}, {{0, -b , -b ,
         2     1         3                    2    3                 0    2 
     ------------------------------------------------------------------------
     0}, {b , 0, -b , 0}, {b , b , 0, 0}, {0, 0, 0, 0}}}
           0       3        2   3

                                                   ZZ
o3 : 3-dimensional matrix of shape 4 x 4 x 4 over ---[b ..b ]
                                                  101  0   3

i4 : 
