-- -*- M2-comint -*- hash: 1117883242

i1 : (a,b) = (0_(ZZ/2),1_(ZZ/2))

o1 = (0, 1)

o1 : Sequence

i2 : G = {{a,a}, {a,b}, {b,a}, {b,b}}

o2 = {{0, 0}, {0, 1}, {1, 0}, {1, 1}}

o2 : List

i3 : B = {{G#0}, {G#1}, {G#2,G#3}}

o3 = {{{0, 0}}, {{0, 1}}, {{1, 0}, {1, 1}}}

o3 : List

i4 : aut = {({2,3}, {0,1,3,2}),
            ({3,2}, {0,1,3,2})}

o4 = {({2, 3}, {0, 1, 3, 2}), ({3, 2}, {0, 1, 3, 2})}

o4 : List

i5 : model(G,B,aut)

o5 = Model{AList => HashTable{{0, 0} => {1, 0, 0}}                          }
                              {0, 1} => {0, 1, 0}
                              {1, 0} => {0, 0, 1}
                              {1, 1} => {0, 0, 1}
           Automorphisms => HashTable{{2, 3} => HashTable{{0, 0} => {0, 0}}}
                                                          {0, 1} => {0, 1}
                                                          {1, 0} => {1, 1}
                                                          {1, 1} => {1, 0}
                                      {3, 2} => HashTable{{0, 0} => {0, 0}}
                                                          {0, 1} => {0, 1}
                                                          {1, 0} => {1, 1}
                                                          {1, 1} => {1, 0}
           Buckets => {{{0, 0}}, {{0, 1}}, {{1, 0}, {1, 1}}}
           Group => {{0, 0}, {0, 1}, {1, 0}, {1, 1}}

o5 : Model

i6 : 
