-- -*- M2-comint -*- hash: 689447153

i1 : (S,E) = productOfProjectiveSpaces{1,2}

o1 = (S, E)

o1 : Sequence

i2 : P = prune truncate({1,2},E^1)**E^{{1,2}};

i3 : LP = bgg P

      1      5      6
o3 = S  <-- S  <-- S
                    
     -2     -1     0

o3 : ChainComplex

i4 : netList apply(toList(min LP..max LP), i-> decompose ann HH_i LP)

     +------------------------------------+------------------------+
o4 = |ideal (x   , x   , x   , x   , x   )|                        |
     |        1,2   1,1   1,0   0,1   0,0 |                        |
     +------------------------------------+------------------------+
     |ideal (x   , x   )                  |ideal (x   , x   , x   )|
     |        0,1   0,0                   |        1,2   1,1   1,0 |
     +------------------------------------+------------------------+
     |ideal ()                            |                        |
     +------------------------------------+------------------------+

i5 : M = prune HH_0 LP

o5 = cokernel {1, 1} | -x_(1,2) |
              {1, 1} | x_(1,0)  |
              {1, 1} | -x_(1,1) |

                            3
o5 : S-module, quotient of S

i6 : betti res M

            0 1
o6 = total: 3 1
         2: 3 1

o6 : BettiTally

i7 : high = {3,3}

o7 = {3, 3}

o7 : List

i8 : cohomologyMatrix(M, -high, high)

o8 = | 45h 30h 15h 0 15  30  45  |
     | 24h 16h 8h  0 8   16  24  |
     | 9h  6h  3h  0 3   6   9   |
     | 0   0   0   0 0   0   0   |
     | 3h2 2h2 h2  0 h   2h  3h  |
     | 0   0   0   0 0   0   0   |
     | 9h3 6h3 3h3 0 3h2 6h2 9h2 |

                      7                7
o8 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i9 : M=module ideal vars S

o9 = image | x_(0,0) x_(0,1) x_(1,0) x_(1,1) x_(1,2) |

                             1
o9 : S-module, submodule of S

i10 : RM = bgg(M,LengthLimit=>3)

       70      35      15      5
o10 = E   <-- E   <-- E   <-- E
                               
      -4      -3      -2      -1

o10 : ChainComplex

i11 : betti RM

             -4 -3 -2 -1
o11 = total: 70 35 15  5
          0: 70 35 15  5

o11 : BettiTally

i12 : tallyDegrees RM

o12 = (Tally{{-1, -3} => 20}, Tally{{-1, -2} => 12}, Tally{{-1, -1} => 6},
             {-2, -2} => 18         {-2, -1} => 9          {-2, 0} => 3   
             {-3, -1} => 12         {-3, 0} => 4           {0, -2} => 6
             {-4, 0} => 5           {0, -3} => 10
             {0, -4} => 15
      -----------------------------------------------------------------------
      Tally{{-1, 0} => 2})
            {0, -1} => 3

o12 : Sequence

i13 : 
