-- -*- M2-comint -*- hash: -1612190955

i1 : (S,E) = productOfProjectiveSpaces {1,1};

i2 : T1= (dual res( trim (ideal vars E)^2,LengthLimit=>8))[1];

i3 : T=trivialHomologicalTruncation(T2=res(coker upperCorner(T1,{4,3}),LengthLimit=>13)[7],-5,6);

i4 : betti T

            -5 -4 -3 -2 -1  0   1   2   3   4   5   6
o4 = total: 22 27 26 36 63 98 136 181 236 304 388 491
         0: 22 27 18  6  .  .   .   .   .   .   .   .
         1:  .  .  8 30 63 98 132 166 200 234 268 302
         2:  .  .  .  .  .  .   4  15  36  70 120 189

o4 : BettiTally

i5 : cohomologyMatrix(T,-{4,4},{3,2})

o5 = | 27h  20h  13h  6h  1  8   15  22  |
     | 16h  12h  8h   4h  0  4   8   12  |
     | 5h   4h   3h   2h  h  0   1   2   |
     | 6h2  4h2  2h2  0   2h 4h  6h  8h  |
     | 17h2 12h2 7h2  2h2 3h 8h  13h 18h |
     | 28h2 20h2 12h2 4h2 4h 12h 20h 28h |
     | 39h2 28h2 17h2 6h2 5h 16h 27h 38h |

                      7                8
o5 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i6 : fqT=firstQuadrantComplex(T,-{2,1});

i7 : betti fqT

            -5 -4 -3 -2 -1  0 1
o7 = total: 22 27 26 18 22 12 5
         0: 22 27 18  6  .  . .
         1:  .  .  8 12 22 12 3
         2:  .  .  .  .  .  . 2

o7 : BettiTally

i8 : cohomologyMatrix(fqT,-{4,4},{3,2})

o8 = | 0 0 13h 6h 1  8  15 22 |
     | 0 0 8h  4h 0  4  8  12 |
     | 0 0 3h  2h h  0  1  2  |
     | 0 0 2h2 0  2h 4h 6h 8h |
     | 0 0 0   0  0  0  0  0  |
     | 0 0 0   0  0  0  0  0  |
     | 0 0 0   0  0  0  0  0  |

                      7                8
o8 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i9 : cohomologyMatrix(fqT,-{2,1},-{1,0})

o9 = | 3h  2h |
     | 2h2 0  |

                      2                2
o9 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i10 : lqT=lastQuadrantComplex(T,-{2,1});

i11 : betti lqT

              3  4  5   6
o11 = total: 12 37 78 138
          2: 12 37 78 138

o11 : BettiTally

i12 : cohomologyMatrix(lqT,-{4,4},{3,2})

o12 = | 0    0    0 0 0 0 0 0 |
      | 0    0    0 0 0 0 0 0 |
      | 0    0    0 0 0 0 0 0 |
      | 0    0    0 0 0 0 0 0 |
      | 17h2 12h2 0 0 0 0 0 0 |
      | 28h2 20h2 0 0 0 0 0 0 |
      | 39h2 28h2 0 0 0 0 0 0 |

                       7                8
o12 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i13 : cohomologyMatrix(lqT,-{3,2},-{2,1})

o13 = | 0    0 |
      | 12h2 0 |

                       2                2
o13 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i14 : cT=cornerComplex(T,-{2,1});

i15 : betti cT

             -5 -4 -3 -2 -1  0 1  2  3  4   5
o15 = total: 22 27 26 18 22 12 5 12 37 78 138
          0: 22 27 18  6  .  . .  .  .  .   .
          1:  .  .  8 12 22 12 3  .  .  .   .
          2:  .  .  .  .  .  . 2  .  .  .   .
          3:  .  .  .  .  .  . . 12 37 78 138

o15 : BettiTally

i16 : cohomologyMatrix(cT,-{4,4},{3,2})

o16 = | 0    0    13h 6h 1  8  15 22 |
      | 0    0    8h  4h 0  4  8  12 |
      | 0    0    3h  2h h  0  1  2  |
      | 0    0    2h2 0  2h 4h 6h 8h |
      | 17h3 12h3 0   0  0  0  0  0  |
      | 28h3 20h3 0   0  0  0  0  0  |
      | 39h3 28h3 0   0  0  0  0  0  |

                       7                8
o16 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i17 : 
