-- -*- M2-comint -*- hash: 1092873435

i1 : n={1,1};

i2 : (S,E) = productOfProjectiveSpaces n;

i3 : T1 = (dual res trim (ideal vars E)^2)[1];

i4 : a=-{2,2};T2=T1**E^{a}[sum a];

i6 : W=beilinsonWindow T2,cohomologyMatrix(W,-2*n,2*n)

       15      16      4
o6 = (E   <-- E   <-- E , | 0 0 0  0 0 |)
                          | 0 0 0  0 0 |
      0       1       2   | 0 8 15 0 0 |
                          | 0 4 8  0 0 |
                          | 0 0 0  0 0 |

o6 : Sequence

i7 : T=tateExtension W;

i8 : cohomologyMatrix(T,-{3,3},{3,3})

o8 = | 12h 4  20 36 52 68  84  |
     | 10h 3  16 29 42 55  68  |
     | 8h  2  12 22 32 42  52  |
     | 6h  1  8  15 22 29  36  |
     | 4h  0  4  8  12 16  20  |
     | 2h  h  0  1  2  3   4   |
     | 0   2h 4h 6h 8h 10h 12h |

                      7                7
o8 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i9 : c={1,0}

o9 = {1, 0}

o9 : List

i10 : rT0=regionComplex(T,c,({},{0,1},{})); --a single position

i11 : cohomologyMatrix(rT0,-{3,3},{3,3})

o11 = | 0 0 0 0 0  0 0 |
      | 0 0 0 0 0  0 0 |
      | 0 0 0 0 0  0 0 |
      | 0 0 0 0 22 0 0 |
      | 0 0 0 0 0  0 0 |
      | 0 0 0 0 0  0 0 |
      | 0 0 0 0 0  0 0 |

                       7                7
o11 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i12 : rT1=regionComplex(T,c,({0},{1},{})); --a horizontal half line

i13 : cohomologyMatrix(rT1,-{3,3},{3,3})

o13 = | 0  0 0 0  0 0 0 |
      | 0  0 0 0  0 0 0 |
      | 0  0 0 0  0 0 0 |
      | 6h 1 8 15 0 0 0 |
      | 0  0 0 0  0 0 0 |
      | 0  0 0 0  0 0 0 |
      | 0  0 0 0  0 0 0 |

                       7                7
o13 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i14 : rT2=regionComplex(T,c,({},{0},{})); -- a vertical line

i15 : cohomologyMatrix(rT2,-{3,3},{3,3})

o15 = | 0 0 0 0 52 0 0 |
      | 0 0 0 0 42 0 0 |
      | 0 0 0 0 32 0 0 |
      | 0 0 0 0 22 0 0 |
      | 0 0 0 0 12 0 0 |
      | 0 0 0 0 2  0 0 |
      | 0 0 0 0 8h 0 0 |

                       7                7
o15 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i16 : rT3=regionComplex(T,c,({},{},{1})); -- a upper half plane

i17 : cohomologyMatrix(rT3,-{3,3},{3,3})

o17 = | 12h 4 20 36 52 68 84 |
      | 10h 3 16 29 42 55 68 |
      | 8h  2 12 22 32 42 52 |
      | 6h  1 8  15 22 29 36 |
      | 0   0 0  0  0  0  0  |
      | 0   0 0  0  0  0  0  |
      | 0   0 0  0  0  0  0  |

                       7                7
o17 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i18 : rT4=regionComplex(T,c,({0},{},{1})); --a north east quadrant

i19 : cohomologyMatrix(rT4,-{3,3},{3,3})

o19 = | 12h 4 20 36 0 0 0 |
      | 10h 3 16 29 0 0 0 |
      | 8h  2 12 22 0 0 0 |
      | 6h  1 8  15 0 0 0 |
      | 0   0 0  0  0 0 0 |
      | 0   0 0  0  0 0 0 |
      | 0   0 0  0  0 0 0 |

                       7                7
o19 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i20 : rT5=regionComplex(T,c,({1},{},{0})); --a south west quadrant

i21 : cohomologyMatrix(rT5,-{3,3},{3,3})

o21 = | 0 0 0 0 0  0   0   |
      | 0 0 0 0 0  0   0   |
      | 0 0 0 0 0  0   0   |
      | 0 0 0 0 0  0   0   |
      | 0 0 0 0 12 16  20  |
      | 0 0 0 0 2  3   4   |
      | 0 0 0 0 8h 10h 12h |

                       7                7
o21 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i22 : 
