-- -*- M2-comint -*- hash: -1866804999

i1 : n={1,1};

i2 : (S,E) = productOfProjectiveSpaces n;

i3 : T1 = (dual res trim (ideal vars E)^2)[1];

i4 : a=-{2,2};T2=T1**E^{a}[sum a];

i6 : W=beilinsonWindow T2,cohomologyMatrix(W,-2*n,2*n)

       15      16      4
o6 = (E   <-- E   <-- E , | 0 0 0  0 0 |)
                          | 0 0 0  0 0 |
      0       1       2   | 0 8 15 0 0 |
                          | 0 4 8  0 0 |
                          | 0 0 0  0 0 |

o6 : Sequence

i7 : T=tateExtension W;

i8 : low = -{2,2};high = {2,2};

i10 : cohomologyMatrix(T,low,high)

o10 = | 3 16 29 42 55 |
      | 2 12 22 32 42 |
      | 1 8  15 22 29 |
      | 0 4  8  12 16 |
      | h 0  1  2  3  |

                       5                5
o10 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i11 : sT1=strand(T,{-1,0},{1});

i12 : cohomologyMatrix(sT1,low,high)

o12 = | 0 0 0  0  0  |
      | 0 0 0  0  0  |
      | 1 8 15 22 29 |
      | 0 0 0  0  0  |
      | 0 0 0  0  0  |

                       5                5
o12 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i13 : sT2=strand(T,{-1,0},{0});

i14 : cohomologyMatrix(sT2,low,high)

o14 = | 0 16 0 0 0 |
      | 0 12 0 0 0 |
      | 0 8  0 0 0 |
      | 0 4  0 0 0 |
      | 0 0  0 0 0 |

                       5                5
o14 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i15 : sT3=strand(T,{-1,0},{0,1});

i16 : cohomologyMatrix(sT3, low,high)

o16 = | 0 0 0 0 0 |
      | 0 0 0 0 0 |
      | 0 8 0 0 0 |
      | 0 0 0 0 0 |
      | 0 0 0 0 0 |

                       5                5
o16 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i17 : 
