-- -*- M2-comint -*- hash: 883039691

i1 : n={1,1};

i2 : (S,E) = productOfProjectiveSpaces n;

i3 : T1 = (dual res trim (ideal vars E)^2)[1];

i4 : a=-{2,2};

i5 : T2=T1**E^{a}[sum a];

i6 : W=beilinsonWindow T2

      15      16      4
o6 = E   <-- E   <-- E
                      
     0       1       2

o6 : ChainComplex

i7 : cohomologyMatrix(W,-2*n,2*n)

o7 = | 0 0 0  0 0 |
     | 0 0 0  0 0 |
     | 0 8 15 0 0 |
     | 0 4 8  0 0 |
     | 0 0 0  0 0 |

                      5                5
o7 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i8 : T=tateExtension W

      1462      1189      954      754      586      447      334      244      174      121      82      54      35      20      10      7
o8 = E     <-- E     <-- E    <-- E    <-- E    <-- E    <-- E    <-- E    <-- E    <-- E    <-- E   <-- E   <-- E   <-- E   <-- E   <-- E
                                                                                                                                          
     -9        -8        -7       -6       -5       -4       -3       -2       -1       0        1       2       3       4       5       6

o8 : ChainComplex

i9 : cohomologyMatrix(T,-3*n,4*n)

o9 = | 14h 5  24 43 62 81  100 119 |
     | 12h 4  20 36 52 68  84  100 |
     | 10h 3  16 29 42 55  68  81  |
     | 8h  2  12 22 32 42  52  62  |
     | 6h  1  8  15 22 29  36  43  |
     | 4h  0  4  8  12 16  20  24  |
     | 2h  h  0  1  2  3   4   5   |
     | 0   2h 4h 6h 8h 10h 12h 14h |

                      8                8
o9 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i10 : cohomologyMatrix(beilinsonWindow T,-n,n)

o10 = | 0 0  0 |
      | 8 15 0 |
      | 4 8  0 |

                       3                3
o10 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i11 : cohomologyMatrix(T,-5*n,4*n) -- the view including the corner

o11 = | 0 33h 14h 5  24 43  62  81  100 119 |
      | 0 28h 12h 4  20 36  52  68  84  100 |
      | 0 23h 10h 3  16 29  42  55  68  81  |
      | 0 18h 8h  2  12 22  32  42  52  62  |
      | 0 13h 6h  1  8  15  22  29  36  43  |
      | 0 8h  4h  0  4  8   12  16  20  24  |
      | 0 3h  2h  h  0  1   2   3   4   5   |
      | 0 2h2 0   2h 4h 6h  8h  10h 12h 14h |
      | 0 7h2 2h2 3h 8h 13h 18h 23h 28h 33h |
      | 0 0   0   0  0  0   0   0   0   0   |

                       10                10
o11 : Matrix (ZZ[h, k])   <--- (ZZ[h, k])

i12 : 
