-- -*- M2-comint -*- hash: 1766924241

i1 : S = QQ[a..e];

i2 : D = simplicialComplex {a*b*c,c*d,e};

i3 : n = # vertices D

o3 = 5

i4 : ComplexIncludingMinElt = barycentricSubdivision D;

i5 : R = ring(ComplexIncludingMinElt);

i6 : B = faceDelete(R_0,ComplexIncludingMinElt);

i7 : colorfulSOP(B,n)

o7 = {v  + v  + v  + v  + v , v  + v  + v  + v , v  }
       1    2    3    4    5   6    7    8    9   10

o7 : List

i8 : S = QQ[a..e];

i9 : D = simplicialComplex {a*b*c,c*d,e};

i10 : colorfulSOP(D)

o10 = {v  + v  + v  + v  + v , v  + v  + v  + v , v  }
        1    2    3    4    5   6    7    8    9   10

o10 : List

i11 : 
