-- -*- M2-comint -*- hash: -614664496

i1 : d1 = matrix {
         {1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
         {-1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0},
         {0, -1, 0, 0, 0, -1, 0, 0, 0, 1, 1, 1, 0, 0, 0},
         {0, 0, -1, 0, 0, 0, -1, 0, 0, -1, 0, 0, 1, 1, 0},
         {0, 0, 0, -1, 0, 0, 0, -1, 0, 0, -1, 0, -1, 0, 1},
         {0, 0, 0, 0, -1, 0, 0, 0, -1, 0, 0, -1, 0, -1, -1}};

              6        15
o1 : Matrix ZZ  <--- ZZ

i2 : d2 = matrix {
         {-1, -1, 0, 0, 0, 0, 0, 0, 0, 0},
         {0, 0, -1, -1, 0, 0, 0, 0, 0, 0},
         {1, 0, 1, 0, 0, 0, 0, 0, 0, 0},
         {0, 1, 0, 0, -1, 0, 0, 0, 0, 0},
         {0, 0, 0, 1, 1, 0, 0, 0, 0, 0},
         {0, 0, 0, 0, 0, -1, -1, 0, 0, 0},
         {-1, 0, 0, 0, 0, 0, 0, -1, 0, 0},
         {0, -1, 0, 0, 0, 1, 0, 0, 0, 0},
         {0, 0, 0, 0, 0, 0, 1, 1, 0, 0},
         {0, 0, -1, 0, 0, 0, 0, 0, -1, 0},
         {0, 0, 0, 0, 0, -1, 0, 0, 1, 0},
         {0, 0, 0, -1, 0, 0, -1, 0, 0, 0},
         {0, 0, 0, 0, 0, 0, 0, 0, -1, -1},
         {0, 0, 0, 0, 0, 0, 0, -1, 0, 1},
         {0, 0, 0, 0, -1, 0, 0, 0, 0, -1}};

              15        10
o2 : Matrix ZZ   <--- ZZ

i3 : C = complex {d1,d2}

       6       15       10
o3 = ZZ  <-- ZZ   <-- ZZ
                       
     0       1        2

o3 : Complex

i4 : dd^C

           6                                                         15
o4 = 0 : ZZ  <---------------------------------------------------- ZZ   : 1
                | 1  1  1  1  1  0  0  0  0  0  0  0  0  0  0  |
                | -1 0  0  0  0  1  1  1  1  0  0  0  0  0  0  |
                | 0  -1 0  0  0  -1 0  0  0  1  1  1  0  0  0  |
                | 0  0  -1 0  0  0  -1 0  0  -1 0  0  1  1  0  |
                | 0  0  0  -1 0  0  0  -1 0  0  -1 0  -1 0  1  |
                | 0  0  0  0  -1 0  0  0  -1 0  0  -1 0  -1 -1 |

           15                                          10
     1 : ZZ   <------------------------------------- ZZ   : 2
                 | -1 -1 0  0  0  0  0  0  0  0  |
                 | 0  0  -1 -1 0  0  0  0  0  0  |
                 | 1  0  1  0  0  0  0  0  0  0  |
                 | 0  1  0  0  -1 0  0  0  0  0  |
                 | 0  0  0  1  1  0  0  0  0  0  |
                 | 0  0  0  0  0  -1 -1 0  0  0  |
                 | -1 0  0  0  0  0  0  -1 0  0  |
                 | 0  -1 0  0  0  1  0  0  0  0  |
                 | 0  0  0  0  0  0  1  1  0  0  |
                 | 0  0  -1 0  0  0  0  0  -1 0  |
                 | 0  0  0  0  0  -1 0  0  1  0  |
                 | 0  0  0  -1 0  0  -1 0  0  0  |
                 | 0  0  0  0  0  0  0  0  -1 -1 |
                 | 0  0  0  0  0  0  0  -1 0  1  |
                 | 0  0  0  0  -1 0  0  0  0  -1 |

o4 : ComplexMap

i5 : HH C

o5 = cokernel | 1  1  1  1  1  0  0  0  0  0  0  0  0  0  0  | <-- subquotient (| 0  1  0  0  0  0  0  0  0  0  |, | -1 -1 0  0  0  0  0  0  0  0  |) <-- image 0
              | -1 0  0  0  0  1  1  1  1  0  0  0  0  0  0  |                  | 1  0  0  0  0  0  0  0  0  0  |  | 0  0  -1 -1 0  0  0  0  0  0  |       
              | 0  -1 0  0  0  -1 0  0  0  1  1  1  0  0  0  |                  | 0  -1 1  0  -1 0  1  0  1  0  |  | 1  0  1  0  0  0  0  0  0  0  |      2
              | 0  0  -1 0  0  0  -1 0  0  -1 0  0  1  1  0  |                  | 0  0  0  0  0  1  0  0  0  0  |  | 0  1  0  0  -1 0  0  0  0  0  |
              | 0  0  0  -1 0  0  0  -1 0  0  -1 0  -1 0  1  |                  | -1 0  -1 0  1  -1 -1 0  -1 0  |  | 0  0  0  1  1  0  0  0  0  0  |
              | 0  0  0  0  -1 0  0  0  -1 0  0  -1 0  -1 -1 |                  | 0  0  0  0  1  0  0  0  0  0  |  | 0  0  0  0  0  -1 -1 0  0  0  |
                                                                                | 0  0  0  1  0  0  0  0  1  1  |  | -1 0  0  0  0  0  0  -1 0  0  |
     0                                                                          | 0  1  -1 0  0  0  0  0  -1 0  |  | 0  -1 0  0  0  1  0  0  0  0  |
                                                                                | 0  0  1  -1 -1 0  0  0  0  -1 |  | 0  0  0  0  0  0  1  1  0  0  |
                                                                                | 0  0  0  0  0  0  0  1  0  0  |  | 0  0  -1 0  0  0  0  0  -1 0  |
                                                                                | 0  0  0  0  0  0  0  0  0  1  |  | 0  0  0  0  0  -1 0  0  1  0  |
                                                                                | 1  0  0  0  1  0  0  -1 0  -1 |  | 0  0  0  -1 0  0  -1 0  0  0  |
                                                                                | 0  -1 1  0  -1 0  1  1  2  1  |  | 0  0  0  0  0  0  0  0  -1 -1 |
                                                                                | 0  0  0  1  0  0  0  0  0  0  |  | 0  0  0  0  0  0  0  -1 0  1  |
                                                                                | 0  0  0  0  -1 1  1  1  1  2  |  | 0  0  0  0  -1 0  0  0  0  -1 |
                                                                    
                                                                   1

o5 : Complex

i6 : prune HH_0 C

       1
o6 = ZZ

o6 : ZZ-module, free

i7 : prune HH_1 C

o7 = cokernel | 2 |

                              1
o7 : ZZ-module, quotient of ZZ

i8 : prune HH_2 C

o8 = 0

o8 : ZZ-module

i9 : S = ZZ/101[a..d, DegreeRank=>4];

i10 : I = intersect(ideal(a,b),ideal(c,d))

o10 = ideal (b*d, a*d, b*c, a*c)

o10 : Ideal of S

i11 : C = dual freeResolution (S^1/I)

       1      4      4      1
o11 = S  <-- S  <-- S  <-- S
                            
      -3     -2     -1     0

o11 : Complex

i12 : prune HH^1 C

o12 = 0

o12 : S-module

i13 : prune HH^2 C

o13 = cokernel {-1, -1, 0, 0} | b a 0 0 |
               {0, 0, -1, -1} | 0 0 d c |

                             2
o13 : S-module, quotient of S

i14 : prune HH^3 C

o14 = cokernel {-1, -1, -1, -1} | d c b a |

                             1
o14 : S-module, quotient of S

i15 : 
