-- -*- M2-comint -*- hash: -1747724697

i1 : R = ZZ/101[a,b,c];

i2 : I = ideal(a^2, a*b, b*c)

             2
o2 = ideal (a , a*b, b*c)

o2 : Ideal of R

i3 : C = freeResolution I

      1      3      2
o3 = R  <-- R  <-- R
                    
     0      1      2

o3 : Complex

i4 : f = augmentationMap C

                                           1
o4 = 0 : cokernel | a2 ab bc | <--------- R  : 0
                                  | 1 |

o4 : ComplexMap

i5 : assert isWellDefined f

i6 : assert isComplexMorphism f

i7 : assert isQuasiIsomorphism f

i8 : g = resolutionMap complex comodule I

                                           1
o8 = 0 : cokernel | a2 ab bc | <--------- R  : 0
                                  | 1 |

o8 : ComplexMap

i9 : assert(f == g)

i10 : 
