-- -*- M2-comint -*- hash: 663297773

i1 : S = ZZ/101[x_1..x_4];

i2 : F = freeResolution coker vars S

      1      4      6      4      1
o2 = S  <-- S  <-- S  <-- S  <-- S
                                  
     0      1      2      3      4

o2 : Complex

i3 : d = randomComplexMap(F, F, Cycle => true, InternalDegree => -1, Degree => -1)

                    1
o3 = -1 : 0 <----- S  : 0
               0

          1                          4
     0 : S  <---------------------- S  : 1
               | -29 30 -36 -24 |

          4                                     6
     1 : S  <--------------------------------- S  : 2
               {1} | -30 36  0  24  0  0   |
               {1} | -29 0   36 0   24 0   |
               {1} | 0   -29 30 0   0  24  |
               {1} | 0   0   0  -29 30 -36 |

          6                               4
     2 : S  <--------------------------- S  : 3
               {2} | -36 -24 0   0   |
               {2} | -30 0   -24 0   |
               {2} | -29 0   0   -24 |
               {2} | 0   -30 36  0   |
               {2} | 0   -29 0   36  |
               {2} | 0   0   -29 30  |

          4                   1
     3 : S  <--------------- S  : 4
               {3} | 24  |
               {3} | -36 |
               {3} | -30 |
               {3} | -29 |

o3 : ComplexMap

i4 : d^2

o4 = 0

o4 : ComplexMap

i5 : C = complex d

      1      4      6      4      1
o5 = S  <-- S  <-- S  <-- S  <-- S
                                  
     0      1      2      3      4

o5 : Complex

i6 : assert isWellDefined C

i7 : assert all(0..4, i -> dd^C_i == d_i)

i8 : e = randomComplexMap(F, F, InternalDegree => -1, Degree => -1)

                    1
o8 = -1 : 0 <----- S  : 0
               0

          1                         4
     0 : S  <--------------------- S  : 1
               | 19 19 -10 -29 |

          4                                       6
     1 : S  <----------------------------------- S  : 2
               {1} | -8  -38 34  -18 -28 16  |
               {1} | -22 -16 19  -13 -47 22  |
               {1} | -29 39  -47 -43 38  45  |
               {1} | -24 21  -39 -15 2   -34 |

          6                               4
     2 : S  <--------------------------- S  : 3
               {2} | -48 15  48  40  |
               {2} | -47 -23 36  11  |
               {2} | 47  39  35  46  |
               {2} | 19  43  11  -28 |
               {2} | -16 -17 -38 1   |
               {2} | 7   -11 33  -3  |

          4                   1
     3 : S  <--------------- S  : 4
               {3} | 22  |
               {3} | -47 |
               {3} | -23 |
               {3} | -7  |

o8 : ComplexMap

i9 : D = complex e

      1      4      6      4      1
o9 = S  <-- S  <-- S  <-- S  <-- S
                                  
     0      1      2      3      4

o9 : Complex

i10 : debugLevel = 1

o10 = 1

i11 : assert not isWellDefined D
-- expected maps in the differential to compose to zero 
--   differentials at indices (2, 1) fail this condition

i12 : 
