-- -*- M2-comint -*- hash: -1852113346

i1 : R = ZZ/101[x,y]/(x^3, y^3)

o1 = R

o1 : QuotientRing

i2 : C = freeResolution(coker vars R, LengthLimit=>6)

      1      2      3      4      5      6      7
o2 = R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R
                                                
     0      1      2      3      4      5      6

o2 : Complex

i3 : f = id_C

          1             1
o3 = 0 : R  <--------- R  : 0
               | 1 |

          2                   2
     1 : R  <--------------- R  : 1
               {1} | 1 0 |
               {1} | 0 1 |

          3                     3
     2 : R  <----------------- R  : 2
               {2} | 1 0 0 |
               {3} | 0 1 0 |
               {3} | 0 0 1 |

          4                       4
     3 : R  <------------------- R  : 3
               {4} | 1 0 0 0 |
               {4} | 0 1 0 0 |
               {4} | 0 0 1 0 |
               {4} | 0 0 0 1 |

          5                         5
     4 : R  <--------------------- R  : 4
               {5} | 1 0 0 0 0 |
               {5} | 0 1 0 0 0 |
               {6} | 0 0 1 0 0 |
               {6} | 0 0 0 1 0 |
               {6} | 0 0 0 0 1 |

          6                           6
     5 : R  <----------------------- R  : 5
               {7} | 1 0 0 0 0 0 |
               {7} | 0 1 0 0 0 0 |
               {7} | 0 0 1 0 0 0 |
               {7} | 0 0 0 1 0 0 |
               {7} | 0 0 0 0 1 0 |
               {7} | 0 0 0 0 0 1 |

          7                             7
     6 : R  <------------------------- R  : 6
               {8} | 1 0 0 0 0 0 0 |
               {8} | 0 1 0 0 0 0 0 |
               {8} | 0 0 1 0 0 0 0 |
               {9} | 0 0 0 1 0 0 0 |
               {9} | 0 0 0 0 1 0 0 |
               {9} | 0 0 0 0 0 1 0 |
               {9} | 0 0 0 0 0 0 1 |

o3 : ComplexMap

i4 : assert isWellDefined f

i5 : assert isComplexMorphism f

i6 : R = ZZ/101[a,b,c]

o6 = R

o6 : PolynomialRing

i7 : I = ideal(a^2, b^2, b*c, c^3)

             2   2        3
o7 = ideal (a , b , b*c, c )

o7 : Ideal of R

i8 : C = freeResolution I

      1      4      5      2
o8 = R  <-- R  <-- R  <-- R
                           
     0      1      2      3

o8 : Complex

i9 : D = Hom(C, C)

      2      13      34      46      34      13      2
o9 = R  <-- R   <-- R   <-- R   <-- R   <-- R   <-- R
                                                     
     -3     -2      -1      0       1       2       3

o9 : Complex

i10 : homomorphism' id_C

           46                  1
o10 = 0 : R   <-------------- R  : 0
                 {0}  | 1 |
                 {0}  | 1 |
                 {0}  | 0 |
                 {0}  | 0 |
                 {1}  | 0 |
                 {0}  | 0 |
                 {0}  | 1 |
                 {0}  | 0 |
                 {1}  | 0 |
                 {0}  | 0 |
                 {0}  | 0 |
                 {0}  | 1 |
                 {1}  | 0 |
                 {-1} | 0 |
                 {-1} | 0 |
                 {-1} | 0 |
                 {0}  | 1 |
                 {0}  | 1 |
                 {1}  | 0 |
                 {1}  | 0 |
                 {1}  | 0 |
                 {2}  | 0 |
                 {-1} | 0 |
                 {0}  | 1 |
                 {0}  | 0 |
                 {0}  | 0 |
                 {1}  | 0 |
                 {-1} | 0 |
                 {0}  | 0 |
                 {0}  | 1 |
                 {0}  | 0 |
                 {1}  | 0 |
                 {-1} | 0 |
                 {0}  | 0 |
                 {0}  | 0 |
                 {0}  | 1 |
                 {1}  | 0 |
                 {-2} | 0 |
                 {-1} | 0 |
                 {-1} | 0 |
                 {-1} | 0 |
                 {0}  | 1 |
                 {0}  | 1 |
                 {1}  | 0 |
                 {-1} | 0 |
                 {0}  | 1 |

o10 : ComplexMap

i11 : 
