-- -*- M2-comint -*- hash: -1273494858

i1 : S = ZZ/101[a,b,c,d];

i2 : I = minors(2, matrix{{a,b,c},{b,c,d}})

               2                        2
o2 = ideal (- b  + a*c, - b*c + a*d, - c  + b*d)

o2 : Ideal of S

i3 : C = freeResolution (S^1/I)

      1      3      2
o3 = S  <-- S  <-- S
                    
     0      1      2

o3 : Complex

i4 : assert isHomogeneous dd^C

i5 : f = randomComplexMap(C, C, Degree => -1)

                    1
o5 = -1 : 0 <----- S  : 0
               0

          1                                                                                                                                                                 3
     0 : S  <------------------------------------------------------------------------------------------------------------------------------------------------------------- S  : 1
               | 24a2-36ab+19b2-30ac+19bc-29c2-29ad-10bd-8cd-22d2 -29a2-24ab+39b2-38ac+21bc+19c2-16ad+34bd-47cd-39d2 -18a2-13ab-28b2-43ac-47bc+2c2-15ad+38bd+16cd+22d2 |

          3                                                2
     1 : S  <-------------------------------------------- S  : 2
               {2} | 45a-34b-48c-47d -17a-11b+48c+36d |
               {2} | 47a+19b-16c+7d  35a+11b-38c+33d  |
               {2} | 15a-23b+39c+43d 40a+11b+46c-28d  |

o5 : ComplexMap

i6 : assert isHomogeneous f

i7 : f = randomComplexMap(C, C, InternalDegree => 2)

          1                                                        1
o7 = 0 : S  <---------------------------------------------------- S  : 0
               | a2-3ab-23b2+22ac-7bc+29c2-47ad+2bd-47cd+15d2 |

          3                                                                                                                                                                    3
     1 : S  <---------------------------------------------------------------------------------------------------------------------------------------------------------------- S  : 1
               {2} | -37a2-13ab-18b2-10ac+39bc-22c2+30ad+27bd+32cd-9d2 13a2-26ab-11b2+22ac-8bc-8c2-49ad+43bd+36cd-3d2  -47a2+27ab-35b2-40ac-31bc-31c2+37ad-39bd-48cd-29d2 |
               {2} | -32a2-20ab-48b2+24ac-15bc-30ad+39bd+33cd-49d2     -22a2-30ab-28b2+41ac-6bc-9c2+16ad+35bd-35cd+6d2 -48a2+30ab-49b2-37ac+28bc+46c2+47ad-18bd+cd+40d2   |
               {2} | -33a2-19ab+44b2+17ac-39bc+9c2-20ad+36bd-39cd+4d2  40a2+3ab-2b2-31ac-41bc-13c2+25ad-49bd+4cd+30d2  -22a2+10ab+13b2+7ac-17bc+3c2+30ad-13bd-41cd+8d2    |

          2                                                                                                                  2
     2 : S  <-------------------------------------------------------------------------------------------------------------- S  : 2
               {3} | 8a2-29ab+49b2+30ac-18bc+23c2-46ad+42bd-28cd+15d2  44a2-39ab+20ac-47bc+47c2+19ad-28bd-28cd+6d2      |
               {3} | 18a2-16ab-18b2-46ac+27bc+23c2+12ad-21bd-37cd-23d2 -9a2-33ab+26b2+28ac+5bc-33c2-29ad-37bd-28cd+42d2 |

o7 : ComplexMap

i8 : assert isHomogeneous f

i9 : phi = map(S, S, {1,b,c,d})

o9 = map (S, S, {1, b, c, d})

o9 : RingMap S <--- S

i10 : D = phi C

       1      3      2
o10 = S  <-- S  <-- S
                     
      0      1      2

o10 : Complex

i11 : dd^D

           1                           3
o11 = 0 : S  <----------------------- S  : 1
                | b2-c bc-d c2-bd |

           3                     2
      1 : S  <----------------- S  : 2
                {2} | -c d  |
                {2} | b  -c |
                {2} | -1 b  |

o11 : ComplexMap

i12 : assert not isHomogeneous dd^D

i13 : g = randomComplexMap(D, D, InternalDegree => 1)

           1                          1
o13 = 0 : S  <---------------------- S  : 0
                | 44a+30b+4c+22d |

           3                                                               3
      1 : S  <----------------------------------------------------------- S  : 1
                {2} | 5a-20b-13c-29d 33a+16b+10c+31d -44a-5b-16c-35d  |
                {2} | 15a-4b+12c+3d  28a-6b+21c-30d  -39a-4b-24c-32d  |
                {2} | 9a-2b+20c-26d  -4a-14b-33c-42d -23a-18b+27c-45d |

           2                                                2
      2 : S  <-------------------------------------------- S  : 2
                {3} | 18a-28b+42c-11d -38a-26b+28c-33d |
                {3} | 8a+42b+49c+5d   9a-7b-46c+2d     |

o13 : ComplexMap

i14 : assert isHomogeneous g

i15 : 
