-- -*- M2-comint -*- hash: 1852265386

i1 : S = ZZ/32003[x,y,z];

i2 : C = freeResolution coker vars S

      1      3      3      1
o2 = S  <-- S  <-- S  <-- S
                           
     0      1      2      3

o2 : Complex

i3 : f = augmentationMap C

                                        1
o3 = 0 : cokernel | x y z | <--------- S  : 0
                               | 1 |

o3 : ComplexMap

i4 : assert isQuasiIsomorphism f

i5 : assert(0 == prune HH cone f)

i6 : assert isIsomorphism HH_0 f

i7 : assert isIsomorphism HH_1 f

i8 : D = complex{random(S^2, S^{-3,-3,-4})}

      2      3
o8 = S  <-- S
             
     0      1

o8 : Complex

i9 : prune HH D

                                                                                                                                                                                                                                                                                         1
o9 = cokernel | x3-2709x2y-7293xy2+10856y3+3980x2z-11102xyz+7611y2z-4512xz2-2645yz2+11682z3 15989x2y+6239xy2-5484y3-3269x2z-11632xyz+8838y2z+5916xz2+4223yz2+2704z3   10021x2y2+5151xy3-12405y4-10408x2yz+15788xy2z-6266y3z-10577x2z2-9208xyz2-5782y2z2+10728xz3+13597yz3-11490z4 | <-- S
              | 2794x2y+8580xy2+3768y3-10164x2z+12325xyz+3393y2z-3650xz2-6859yz2+7446z3     x3+13290x2y-12034xy2-2305y3+1291x2z-7317xyz-8020y2z-749xz2-8884yz2+8664z3 x2y2-14582xy3+13590y4-5127x2yz+14886xy2z+4549y3z-7332x2z2-3153xyz2-15321y2z2+1454xz3-6214yz3-3074z4         |      
                                                                                                                                                                                                                                                                                        1
     0

o9 : Complex

i10 : 
