-- -*- M2-comint -*- hash: -671739027

i1 : R = QQ[a,b,c]

o1 = R

o1 : PolynomialRing

i2 : C = freeResolution coker vars R

      1      3      3      1
o2 = R  <-- R  <-- R  <-- R
                           
     0      1      2      3

o2 : Complex

i3 : D = freeResolution coker matrix{{a^2, b^2, c^2}}

      1      3      3      1
o3 = R  <-- R  <-- R  <-- R
                           
     0      1      2      3

o3 : Complex

i4 : f = map(D, C, 0)

o4 = 0

o4 : ComplexMap

i5 : assert isWellDefined f

i6 : assert isComplexMorphism f

i7 : g = map(C, C, 0, Degree => 13)

o7 = 0

o7 : ComplexMap

i8 : assert isWellDefined g

i9 : assert(degree g == 13)

i10 : assert not isComplexMorphism g

i11 : assert isCommutative g

i12 : assert isHomogeneous g

i13 : assert(source g == C)

i14 : assert(target g == C)

i15 : assert(map(C, C, 1) === id_C)

i16 : 
