-- -*- M2-comint -*- hash: -597791803

i1 : R = ZZ/101[a,b,c];

i2 : C = freeResolution coker vars R

      1      3      3      1
o2 = R  <-- R  <-- R  <-- R
                           
     0      1      2      3

o2 : Complex

i3 : f = map(C[-1], C, dd^C, Degree => 0)

          1                 3
o3 = 1 : R  <------------- R  : 1
               | a b c |

          3                        3
     2 : R  <-------------------- R  : 2
               {1} | -b -c 0  |
               {1} | a  0  -c |
               {1} | 0  a  b  |

          3                  1
     3 : R  <-------------- R  : 3
               {2} | c  |
               {2} | -b |
               {2} | a  |

o3 : ComplexMap

i4 : assert isWellDefined f

i5 : assert(degree f == 0)

i6 : assert isCommutative f

i7 : assert isComplexMorphism f

i8 : assert not isComplexMorphism dd^C

i9 : 
