-- -*- M2-comint -*- hash: 668796464

i1 : S = ZZ/101[x_0..x_3];

i2 : I = borel monomialIdeal(x_1*x_2)

                     2         2
o2 = monomialIdeal (x , x x , x , x x , x x )
                     0   0 1   1   0 2   1 2

o2 : MonomialIdeal of S

i3 : E1 = Ext^1(S^1/I, S^1/I)

o3 = subquotient ({-2} | x_1 x_0 0   0   0   0   0   0   0   0   0   0   |, {-2} | 0 x_1x_2 x_0x_2 x_1^2 x_0x_1 x_0^2 0      0      0     0      0     0      0      0     0      0     0      0      0     0      0     0      0      0     0      0     |)
                  {-2} | 0   0   x_1 x_0 0   0   0   0   0   0   0   0   |  {-2} | 0 0      0      0     0      0     x_1x_2 x_0x_2 x_1^2 x_0x_1 x_0^2 0      0      0     0      0     0      0      0     0      0     0      0      0     0      0     |
                  {-2} | 0   0   0   0   x_1 x_0 0   0   0   0   0   0   |  {-2} | 0 0      0      0     0      0     0      0      0     0      0     x_1x_2 x_0x_2 x_1^2 x_0x_1 x_0^2 0      0      0     0      0     0      0      0     0      0     |
                  {-2} | 0   0   0   0   0   0   x_2 x_1 x_0 0   0   0   |  {-2} | 0 0      0      0     0      0     0      0      0     0      0     0      0      0     0      0     x_1x_2 x_0x_2 x_1^2 x_0x_1 x_0^2 0      0      0     0      0     |
                  {-2} | 0   0   0   0   0   0   0   0   0   x_2 x_1 x_0 |  {-2} | 0 0      0      0     0      0     0      0      0     0      0     0      0      0     0      0     0      0      0     0      0     x_1x_2 x_0x_2 x_1^2 x_0x_1 x_0^2 |

                               5
o3 : S-module, subquotient of S

i4 : h = yonedaProduct(E1, E1)

o4 = {-2} | 0 0 0 0 1 0 0 0 0 -1 0 0 0 0 1 0 0 0 -1 0 0 0 0 0 0 0 -1 0  0 0 0
     {-2} | 0 0 0 0 0 1 0 0 0 0  0 0 0 0 0 1 0 0 0  0 0 0 0 0 0 0 0  -1 0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  1 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 1 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  1 0 0 0 0 0 0 0 0  1 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 1 0 0 0 0 0 0 0  0 1 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     {-2} | 0 0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0
     ------------------------------------------------------------------------
     0 0 0  0 0 -1 0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 1  0 0 0  -1 0 0 0 0 1  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 -1 0 0 0  0  1 0 0 0 -1 0 0 0 0 0 0 0 -1 0  0 0 0 0 0 0 0  0 -1 0  0
     0 0 0  0 0 0  0  0 1 0 0 0  0 0 0 0 0 0 0 0  -1 0 0 0 0 0 1 0  0 0  -1 0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  1 0 0  0  0 0 0 0 0  1 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 1 0  0  0 0 0 0 0  0 1 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 -1 0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  0 0  0  0
     0 0 0  0 0 0  0  0 0 0 0 0  0 0 0 0 0 0 0 0  0  0 0 0 0 0 0 0  1 0  0  0
     ------------------------------------------------------------------------
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 1 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  -1 0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  1  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 1 0  0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 -1 0  0  0 0  0 0 -1 0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  -1 0  1 0  0 0 0  -1 1 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 -1 0 0 0  0  0 -1 0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  1  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 -1 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 1  0 0 0  0  0 1  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     0 0 0 0 0  1 0 0 0 0 0 0 0 0 0 0 0  0  0  0 0  0 0 0  0  0 0  0 0 0 0 0
     ------------------------------------------------------------------------
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  -1 0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 -1 0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  -1 1 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  -1 0  0  0 0  0 0 -1 0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  -1 0  0  0 0  0 0 -1 0  0 0 
     0 0  0  0 -1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 -1 0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 1  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  -1 0  1 0  0 0 0  -1 1 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 0  0 0 0  0  0 0 
     0 0  0  0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0  0  0  0 -1 0 0 0  0  0 -1
     ------------------------------------------------------------------------
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 -1 0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 -1 0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  -1 1 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 0  0 0 0 0 0 0 0 0 |
     0 0 0 0 0 0 0  0  0 -1 0 0 0 0 0 0 0 0 |

o4 : Matrix

i5 : assert isWellDefined h

i6 : assert(target h == Ext^2(S^1/I, S^1/I))

i7 : coker h == 0

o7 = true

i8 : R = S/(x_0*x_1, x_2*x_3);

i9 : E1 = Ext^1(R^1/(x_0, x_2), R^1/(x_0, x_2, x_3))

o9 = subquotient ({-1} | 0 x_3 x_2 x_0 |, {-1} | 0 x_3 x_2 x_0 0   0   0   |)
                  {-1} | 1 0   0   0   |  {-1} | 0 0   0   0   x_3 x_2 x_0 |

                               2
o9 : R-module, subquotient of R

i10 : E2 = Ext^2(R^1/(x_0, x_2, x_3), R^1/(x_0, x_1, x_2, x_3))

o10 = cokernel {-2} | 0 0 0 x_3 x_2 x_1 x_0 0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   |
               {-2} | 0 0 0 0   0   0   0   x_3 x_2 x_1 x_0 0   0   0   0   0   0   0   0   0   0   0   0   |
               {-2} | 0 0 0 0   0   0   0   0   0   0   0   x_3 x_2 x_1 x_0 0   0   0   0   0   0   0   0   |
               {-2} | 0 0 0 0   0   0   0   0   0   0   0   0   0   0   0   x_3 x_2 x_1 x_0 0   0   0   0   |
               {-2} | 0 0 0 0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   x_3 x_2 x_1 x_0 |

                             5
o10 : R-module, quotient of R

i11 : E3 = Ext^3(R^1/(x_0, x_2), R^1/(x_0, x_1, x_2, x_3))

o11 = cokernel {-3} | 0 0 0 x_3 x_2 x_1 x_0 0   0   0   0   0   0   0   0   0   0   0   0   |
               {-3} | 0 0 0 0   0   0   0   x_3 x_2 x_1 x_0 0   0   0   0   0   0   0   0   |
               {-3} | 0 0 0 0   0   0   0   0   0   0   0   x_3 x_2 x_1 x_0 0   0   0   0   |
               {-3} | 0 0 0 0   0   0   0   0   0   0   0   0   0   0   0   x_3 x_2 x_1 x_0 |

                             4
o11 : R-module, quotient of R

i12 : h = yonedaProduct(E1, E2)

o12 = {-3} | 0 1 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |
      {-3} | 0 0 -1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |
      {-3} | 0 0 0  0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |
      {-3} | 0 0 0  0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |

o12 : Matrix

i13 : assert isWellDefined h

i14 : assert(target h == E3)

i15 : prune coker h

o15 = cokernel {-3} | x_3 x_2 x_1 x_0 |

                             1
o15 : R-module, quotient of R

i16 : 
