-- -*- M2-comint -*- hash: -401655879

i1 : X = smoothFanoToricVariety(3,14);

i2 : Y = hirzebruchSurface 1;

i3 : f = map(Y, X, matrix{{1,0,0},{0,1,0}})

o3 = | 1 0 0 |
     | 0 1 0 |

o3 : ToricMap Y <--- X

i4 : assert (isWellDefined f and source f === X and target f === Y)

i5 : Z = toricProjectiveSpace 1;

i6 : g = map(Z, Y, matrix{{1, 0}})

o6 = | 1 0 |

o6 : ToricMap Z <--- Y

i7 : assert (isWellDefined g and source g === Y and target g === Z)

i8 : h = g * f

o8 = | 1 0 0 |

o8 : ToricMap Z <--- X

i9 : assert (isWellDefined h and source h === X and target h === Z)

i10 : X = hirzebruchSurface 1;

i11 : X2 = X ** X;

i12 : delta = diagonalToricMap X

o12 = | 1 0 |
      | 0 1 |
      | 1 0 |
      | 0 1 |

o12 : ToricMap X2 <--- X

i13 : assert (X2^[0] * delta == id_X and X2^[1] * delta == id_X)

i14 : 
