-- -*- M2-comint -*- hash: -1958679820

i1 : PP2 = toricProjectiveSpace 3;

i2 : D1 = abstractSheaf (PP2, PP2_0);

i3 : assert (rank D1 === 1 and variety D1 === abstractVariety PP2)

i4 : chern D1

o4 = 1 + t
          3

                     QQ[][t ..t ]
                           0   3
o4 : -------------------------------------------
     (t t t t , - t  + t , - t  + t , - t  + t )
       0 1 2 3     0    1     0    2     0    3

i5 : ch D1

              1 2   1 3
o5 = 1 + t  + -t  + -t
          3   2 3   6 3

                     QQ[][t ..t ]
                           0   3
o5 : -------------------------------------------
     (t t t t , - t  + t , - t  + t , - t  + t )
       0 1 2 3     0    1     0    2     0    3

i6 : D2 = abstractSheaf (PP2, PP2_1);

i7 : assert (D2 === D1)

i8 : FF2 = hirzebruchSurface 2

o8 = FF2

o8 : NormalToricVariety

i9 : D3 = abstractSheaf (FF2, 2*FF2_2 + FF2_3)

o9 = D3

o9 : an abstract sheaf of rank 1 on a variety

i10 : assert (rank D3 === 1 and variety D3 === abstractVariety FF2)

i11 : chern D3

o11 = 1 + (2t  + t )
             2    3

                  QQ[][t ..t ]
                        0   3
o11 : ------------------------------------
      (t t , t t , t  - t , t  + 2t  - t )
        0 2   1 3   0    2   1     2    3

i12 : D4 = abstractSheaf (FF2, 4*FF2_0 + FF2_1)

o12 = D3

o12 : an abstract sheaf of rank 1 on a variety

i13 : assert (D4 === D3)

i14 : 
