-- -*- M2-comint -*- hash: 925691207

i1 : X = hirzebruchSurface 1;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map(Y, X, matrix {{1, 0}})

o3 = | 1 0 |

o3 : ToricMap Y <--- X

i4 : f' = classGroup f

o4 = | 1 |
     | 0 |

              2        1
o4 : Matrix ZZ  <--- ZZ

i5 : assert (isWellDefined f and source f' == classGroup Y and
         target f' == classGroup X)

i6 : f'' = weilDivisorGroup f

o6 = | 0 1 |
     | 0 0 |
     | 1 0 |
     | 0 0 |

              4        2
o6 : Matrix ZZ  <--- ZZ

i7 : assert(f' * fromWDivToCl Y  == fromWDivToCl X  * f'')

i8 : Z = toricBlowup({0, 1}, X, {1,2});

i9 : assert (isWellDefined Z and not isSmooth Z)

i10 : g = map(Y, Z, matrix{{1, 0}})

o10 = | 1 0 |

o10 : ToricMap Y <--- Z

i11 : g' = classGroup g

o11 = | 1 |
      | 0 |
      | 0 |

               3        1
o11 : Matrix ZZ  <--- ZZ

i12 : g'' = weilDivisorGroup g

o12 = | 0 1 |
      | 0 0 |
      | 1 0 |
      | 0 0 |
      | 0 1 |

               5        2
o12 : Matrix ZZ  <--- ZZ

i13 : assert(g' * fromWDivToCl Y == fromWDivToCl Z  * g'')

i14 : assert (isWellDefined g and source g' == classGroup Y and
          target g' == classGroup Z)

i15 : 
