-- -*- M2-comint -*- hash: -1968044841

i1 : PP2 = toricProjectiveSpace 2;

i2 : D1 = PP2_0

o2 = PP2
        0

o2 : ToricDivisor on PP2

i3 : degree D1

o3 = {1}

o3 : List

i4 : OO D1

          1
o4 = OO    (1)
       PP2

o4 : coherent sheaf on PP2

i5 : D2 = 3*PP2_1

o5 = 3*PP2
          1

o5 : ToricDivisor on PP2

i6 : degree D2

o6 = {3}

o6 : List

i7 : OO D2

          1
o7 = OO    (3)
       PP2

o7 : coherent sheaf on PP2

i8 : FF2 = hirzebruchSurface 2;

i9 : D3 = -1*FF2_2 + 3*FF2_3

o9 = - FF2  + 3*FF2
          2        3

o9 : ToricDivisor on FF2

i10 : degree D3

o10 = {-1, 3}

o10 : List

i11 : OO D3

           1
o11 = OO     (-1, 3)
        FF2

o11 : coherent sheaf on FF2

i12 : 
