-- -*- M2-comint -*- hash: 2084059435

i1 : rayList = {{1,0},{0,1},{-1,1},{-1,0},{0,-1}}

o1 = {{1, 0}, {0, 1}, {-1, 1}, {-1, 0}, {0, -1}}

o1 : List

i2 : coneList = {{0,1},{1,2},{2,3},{3,4},{0,4}}

o2 = {{0, 1}, {1, 2}, {2, 3}, {3, 4}, {0, 4}}

o2 : List

i3 : X = normalToricVariety (rayList, coneList)

o3 = X

o3 : NormalToricVariety

i4 : rays X

o4 = {{1, 0}, {0, 1}, {-1, 1}, {-1, 0}, {0, -1}}

o4 : List

i5 : max X

o5 = {{0, 1}, {0, 4}, {1, 2}, {2, 3}, {3, 4}}

o5 : List

i6 : dim X

o6 = 2

i7 : assert (isWellDefined X and isProjective X and isSmooth X)

i8 : PP4 = toricProjectiveSpace 4;

i9 : rays PP4

o9 = {{-1, -1, -1, -1}, {1, 0, 0, 0}, {0, 1, 0, 0}, {0, 0, 1, 0}, {0, 0, 0,
     ------------------------------------------------------------------------
     1}}

o9 : List

i10 : max PP4

o10 = {{0, 1, 2, 3}, {0, 1, 2, 4}, {0, 1, 3, 4}, {0, 2, 3, 4}, {1, 2, 3, 4}}

o10 : List

i11 : dim PP4

o11 = 4

i12 : ring PP4

o12 = QQ[x ..x ]
          0   4

o12 : PolynomialRing

i13 : PP4' = normalToricVariety (rays PP4, max PP4, CoefficientRing => ZZ/32003, Variable => y)

o13 = PP4'

o13 : NormalToricVariety

i14 : ring PP4'

        ZZ
o14 = -----[y ..y ]
      32003  0   4

o14 : PolynomialRing

i15 : assert (isWellDefined PP4 and isProjective PP4 and isSmooth PP4)

i16 : PP2 = toricProjectiveSpace 2;

i17 : A = fromWDivToCl PP2

o17 = | 1 1 1 |

               1        3
o17 : Matrix ZZ  <--- ZZ

i18 : source A == weilDivisorGroup PP2

o18 = true

i19 : target A == classGroup PP2

o19 = true

i20 : degrees ring PP2

o20 = {{1}, {1}, {1}}

o20 : List

i21 : deg = matrix {toList (3:-1)}

o21 = | -1 -1 -1 |

               1        3
o21 : Matrix ZZ  <--- ZZ

i22 : X = normalToricVariety (rays PP2, max PP2, WeilToClass => deg);

i23 : A' = fromWDivToCl X

o23 = | -1 -1 -1 |

               1        3
o23 : Matrix ZZ  <--- ZZ

i24 : source A' == weilDivisorGroup X

o24 = true

i25 : target A' == classGroup X

o25 = true

i26 : degrees ring X

o26 = {{-1}, {-1}, {-1}}

o26 : List

i27 : (matrix A') * (matrix rays X)

o27 = 0

               1        2
o27 : Matrix ZZ  <--- ZZ

i28 : assert (isWellDefined X and isProjective X and isSmooth X)

i29 : rayList = {{1,0},{0,1},{-1,1},{-1,0},{0,-1}};

i30 : coneList = {{0,1},{1,2},{2,3},{3,4},{0,4}};

i31 : Y = normalToricVariety (rayList, coneList);

i32 : fromWDivToCl Y

o32 = | 1 -1 1 0 0 |
      | 1 0  0 1 0 |
      | 0 1  0 0 1 |

               3        5
o32 : Matrix ZZ  <--- ZZ

i33 : nefGenerators Y

o33 = | 1 0 0 |
      | 1 0 1 |
      | 0 1 1 |

               3        3
o33 : Matrix ZZ  <--- ZZ

i34 : deg = matrix{{1,-1,1,0,0},{0,1,-1,1,0},{0,0,1,-1,1}}

o34 = | 1 -1 1  0  0 |
      | 0 1  -1 1  0 |
      | 0 0  1  -1 1 |

               3        5
o34 : Matrix ZZ  <--- ZZ

i35 : Y' = normalToricVariety (rays Y, max Y, WeilToClass => deg);

i36 : fromWDivToCl Y'

o36 = | 1 -1 1  0  0 |
      | 0 1  -1 1  0 |
      | 0 0  1  -1 1 |

               3        5
o36 : Matrix ZZ  <--- ZZ

i37 : nefGenerators Y'

o37 = | 1 0 0 |
      | 0 1 0 |
      | 0 0 1 |

               3        3
o37 : Matrix ZZ  <--- ZZ

i38 : assert (isWellDefined Y and isWellDefined Y')

i39 : 
