-- -*- M2-comint -*- hash: 791810447

i1 : PP1 = smoothFanoToricVariety (1,0);

i2 : assert (rays PP1 === rays toricProjectiveSpace 1)

i3 : assert (max PP1 === max toricProjectiveSpace 1)

i4 : PP4 = smoothFanoToricVariety (4,0, CoefficientRing => ZZ/32003, Variable => y);

i5 : assert (rays PP4 === rays toricProjectiveSpace 4)

i6 : assert (max PP4 === max toricProjectiveSpace 4)

i7 : W = smoothFanoToricVariety (4,123);

i8 : rays W

o8 = {{1, 0, 0, 0}, {0, 1, 0, 0}, {-1, -1, 0, 0}, {0, 0, 1, 0}, {0, 0, 0, 1},
     ------------------------------------------------------------------------
     {0, 0, -1, -1}, {1, 0, 1, 0}, {0, 1, 0, 1}, {-1, -1, -1, -1}}

o8 : List

i9 : max W

o9 = {{0, 1, 5, 6}, {0, 1, 5, 7}, {0, 1, 6, 7}, {0, 2, 4, 6}, {0, 2, 4, 8},
     ------------------------------------------------------------------------
     {0, 2, 6, 8}, {0, 4, 5, 7}, {0, 4, 5, 8}, {0, 4, 6, 7}, {0, 5, 6, 8},
     ------------------------------------------------------------------------
     {1, 2, 3, 7}, {1, 2, 3, 8}, {1, 2, 7, 8}, {1, 3, 5, 6}, {1, 3, 5, 8},
     ------------------------------------------------------------------------
     {1, 3, 6, 7}, {1, 5, 7, 8}, {2, 3, 4, 6}, {2, 3, 4, 7}, {2, 3, 6, 8},
     ------------------------------------------------------------------------
     {2, 4, 7, 8}, {3, 4, 6, 7}, {3, 5, 6, 8}, {4, 5, 7, 8}}

o9 : List

i10 : 
