-- -*- M2-comint -*- hash: 1544271878

i1 : g=simpleLieAlgebra("A",2)

o1 = g

o1 : LieAlgebra

i2 : U=irreducibleLieAlgebraModule({4,2},g)

o2 = U

o2 : g module

i3 : V=irreducibleLieAlgebraModule({3,1},g)

o3 = V

o3 : g module

i4 : U++V

o4 = {LieAlgebra => g                                        }
      isIrreducible => false
      DecompositionIntoIrreducibles => HashTable{{3, 1} => 1}
                                                 {4, 2} => 1

o4 : g module

i5 : 
