-- -*- M2-comint -*- hash: 1060596242

i1 : g=simpleLieAlgebra("A",2)

o1 = g

o1 : LieAlgebra

i2 : h=simpleLieAlgebra("A",2)

o2 = g

o2 : LieAlgebra

i3 : g==h

o3 = true

i4 : 
