-- -*- M2-comint -*- hash: -140003589

i1 : g=simpleLieAlgebra("A",2)

o1 = g

o1 : LieAlgebra

i2 : V=irreducibleLieAlgebraModule({1,0},g)

o2 = V

o2 : g module

i3 : casimirScalar(V)

     8
o3 = -
     3

o3 : QQ

i4 : 
