-- -*- M2-comint -*- hash: 1276286416

i1 : dualCoxeterNumber("A",2)

o1 = 3

i2 : g=simpleLieAlgebra("A",2)

o2 = g

o2 : LieAlgebra

i3 : dualCoxeterNumber(g)

o3 = 3

i4 : 
