-- -*- M2-comint -*- hash: -346774568

i1 : g=simpleLieAlgebra("A",2);

i2 : U=irreducibleLieAlgebraModule({2,1},g);

i3 : V=irreducibleLieAlgebraModule({1,2},g);

i4 : fusionProduct(U,V,3)

o4 = {LieAlgebra => g                                        }
      isIrreducible => false
      DecompositionIntoIrreducibles => HashTable{{0, 0} => 1}
                                                 {1, 1} => 1

o4 : g module

i5 : 
