-- -*- M2-comint -*- hash: 1821376661

i1 : g=simpleLieAlgebra("A",2)

o1 = g

o1 : LieAlgebra

i2 : M=irreducibleLieAlgebraModule({2,1},g)

o2 = M

o2 : g module

i3 : N=irreducibleLieAlgebraModule({1,2},g)

o3 = N

o3 : g module

i4 : Z=irreducibleLieAlgebraModule({0,0},g)

o4 = Z

o4 : g module

i5 : isIsomorphic(M,N)

o5 = false

i6 : isIsomorphic(M,M)

o6 = true

i7 : isIsomorphic(M,M**Z)

o7 = true

i8 : isIsomorphic(M**N,N**M)

o8 = true

i9 : 
