-- -*- M2-comint -*- hash: -1256502595

i1 : g=simpleLieAlgebra("A",2)

o1 = g

o1 : LieAlgebra

i2 : V=irreducibleLieAlgebraModule({2,1},g)

o2 = V

o2 : g module

i3 : multiplicity({-1,1},V)

o3 = 2

i4 : 
