-- -*- M2-comint -*- hash: -747646592

i1 : g=simpleLieAlgebra("A",2)

o1 = g

o1 : LieAlgebra

i2 : V=irreducibleLieAlgebraModule({2,1},g)

o2 = V

o2 : g module

i3 : weightDiagram(V)

o3 = HashTable{{-1, -2} => 1}
               {-1, 1} => 2
               {-2, 0} => 1
               {-2, 3} => 1
               {-3, 2} => 1
               {0, -1} => 2
               {0, 2} => 1
               {1, -3} => 1
               {1, 0} => 2
               {2, -2} => 1
               {2, 1} => 1
               {3, -1} => 1

o3 : HashTable

i4 : 
