-- -*- M2-comint -*- hash: 1571635751

i1 : G = mixedGraph(digraph {{1,2},{1,3},{2,3},{3,4}},bigraph {{3,4}});

i2 : R=gaussianRing(G);

i3 : U = matrix{{6, 10, 1/3, 1}, {3/5, 3, 1/2, 1}, {4/5, 3/2, 9/8, 3/10}, {10/7, 2/3,1, 8/3}};

              4        4
o3 : Matrix QQ  <--- QQ

i4 : JnoSat=scoreEquations(R,U,Saturate=>false);

o4 : Ideal of QQ[l   ..l   , l   , l   , p   , p   , p   , p   , p   ]
                  1,2   1,3   2,3   3,4   1,1   2,2   3,3   4,4   3,4

i5 : dim JnoSat

o5 = 3

i6 : degree JnoSat

o6 = 1

i7 : J=scoreEquations(R,U)

o7 = ideal (192199680p    - 99333449, 267221621760p    - 849243924773,
                      3,4                          4,4                
     ------------------------------------------------------------------------
     1353974896462794079472640p    - 142165262245288892244817, 6898968p    -
                               3,3                                     2,2  
     ------------------------------------------------------------------------
     11533057, 19600p    - 95819, 20855l    + 90447,
                     1,1                3,4         
     ------------------------------------------------------------------------
     146915678869660815915l    - 4228634793402814499,
                           2,3                       
     ------------------------------------------------------------------------
     58766271547864326366l    + 4167005135395196717, 574914l    - 896035)
                          1,3                               1,2

o7 : Ideal of QQ[l   ..l   , l   , l   , p   , p   , p   , p   , p   ]
                  1,2   1,3   2,3   3,4   1,1   2,2   3,3   4,4   3,4

i8 : degree JnoSat==degree J

o8 = true

i9 : 
