-- -*- M2-comint -*- hash: -323714380

i1 : p = new Partition from {3,2,1}

o1 = Partition{3, 2, 1}

o1 : Partition

i2 : y = youngTableau(p,{2,0,3,4,5,1})

o2 = | 2 0 3 |
     | 4 5 |
     | 1 |

o2 : YoungTableau

i3 : e = spechtModuleElement(y,-2)

o3 = -2 | 2 0 3 |
        | 4 5 |
        | 1 |

o3 : SpechtModuleElement

i4 : y2 = youngTableau(p,{5,0,2,4,1,3})

o4 = | 5 0 2 |
     | 4 1 |
     | 3 |

o4 : YoungTableau

i5 : e2 = spechtModuleElement(y2)

o5 = | 5 0 2 |
     | 4 1 |
     | 3 |

o5 : SpechtModuleElement

i6 : e+e2

o6 = -2 | 2 0 3 | + | 5 0 2 |
        | 4 5 |     | 4 1 |
        | 1 |       | 3 |

o6 : SpechtModuleElement

i7 : e-e2

o7 = -2 | 2 0 3 | - | 5 0 2 |
        | 4 5 |     | 4 1 |
        | 1 |       | 3 |

o7 : SpechtModuleElement

i8 : 3*oo

o8 = -6 | 2 0 3 | - 3 | 5 0 2 |
        | 4 5 |       | 4 1 |
        | 1 |         | 3 |

o8 : SpechtModuleElement

i9 : peek oo

o9 = SpechtModuleElement{partition => Partition{3, 2, 1}    }
                         values => MutableHashTable{...2...}

i10 : peek ooo#values

o10 = MutableHashTable{{2, 0, 3, 4, 5, 1} => -6}
                       {5, 0, 2, 4, 1, 3} => -3

i11 : terms (3*(e-e2))

o11 = {(| 2 0 3 |, -6), (| 5 0 2 |, -3)}
        | 4 5 |          | 4 1 |
        | 1 |            | 3 |

o11 : List

i12 : {0,1,2,3,4,5} (3*(e-e2))

o12 = -6 | 2 0 3 | - 3 | 5 0 2 |
         | 4 5 |       | 4 1 |
         | 1 |         | 3 |

o12 : SpechtModuleElement

i13 : {1,0,2,3,4,5} (3*(e-e2))

o13 = -6 | 2 1 3 | - 3 | 5 1 2 |
         | 4 5 |       | 4 0 |
         | 0 |         | 3 |

o13 : SpechtModuleElement

i14 : 
