-- -*- M2-comint -*- hash: -2039247726

i1 : p = new Partition from {2,1}

o1 = Partition{2, 1}

o1 : Partition

i2 : y1 = youngTableau(p,{0,1,2})

o2 = | 0 1 |
     | 2 |

o2 : YoungTableau

i3 : y2 = youngTableau(p,{0,2,1})

o3 = | 0 2 |
     | 1 |

o3 : YoungTableau

i4 : y3 = youngTableau(p,{1,2,0})

o4 = | 1 2 |
     | 0 |

o4 : YoungTableau

i5 : t = tableauList p;

i6 : addTableau(t, y1);

i7 : addTableau(t, y2);

i8 : addTableau(t, y3);

i9 : t_0

o9 = | 0 1 |
     | 2 |

o9 : YoungTableau

i10 : t_2

o10 = | 1 2 |
      | 0 |

o10 : YoungTableau

i11 : 
