-- -*- M2-comint -*- hash: -820608905

i1 : p = new Partition from {2,1}

o1 = Partition{2, 1}

o1 : Partition

i2 : y1 = youngTableau(p,{0,1,2})

o2 = | 0 1 |
     | 2 |

o2 : YoungTableau

i3 : y2 = youngTableau(p,{0,2,1})

o3 = | 0 2 |
     | 1 |

o3 : YoungTableau

i4 : t = tableauList p

o4 = {}

o4 : TableauList

i5 : addTableau(t, y1)

o5 = {| 0 1 |}
      | 2 |

o5 : TableauList

i6 : addTableau(t, y2)

o6 = {| 0 1 |, | 0 2 |}
      | 2 |    | 1 |

o6 : TableauList

i7 : addTableau(t, {1,2,0})

o7 = {| 0 1 |, | 0 2 |, | 1 2 |}
      | 2 |    | 1 |    | 0 |

o7 : TableauList

i8 : peek t

o8 = TableauList{length => 3                 }
                 matrix => | 0 1 2 |
                           | 0 2 1 |
                           | 1 2 0 |
                 partition => Partition{2, 1}

i9 : 
     
     
