-- -*- M2-comint -*- hash: 1250951460

i1 : R = QQ[x_0..x_3]

o1 = R

o1 : PolynomialRing

i2 : p = new Partition from {2,2}

o2 = Partition{2, 2}

o2 : Partition

i3 : S  = youngTableau(p,{0,2,1,3})

o3 = | 0 2 |
     | 1 3 |

o3 : YoungTableau

i4 : higherSpechtPolynomials(S,R)

                                2            2      2      2        2          2          2        2
o4 = HashTable{{0, 1, 2, 3} => x x x  - x x x  + x x x  - x x x  - x x x  + x x x  - x x x  + x x x }
                                0 1 2    0 1 2    0 1 3    0 2 3    1 2 3    0 2 3    0 1 3    1 2 3
                                2          2      2          2        2        2          2        2
               {0, 2, 1, 3} => x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x
                                0 1 2    0 1 2    0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3

o4 : HashTable

i5 : stan = standardTableaux p

o5 = {| 0 1 |, | 0 2 |}
      | 2 3 |  | 1 3 |

o5 : TableauList

i6 : higherSpechtPolynomials(S, stan,R)

                                2            2      2      2        2          2          2        2
o6 = HashTable{{0, 1, 2, 3} => x x x  - x x x  + x x x  - x x x  - x x x  + x x x  - x x x  + x x x }
                                0 1 2    0 1 2    0 1 3    0 2 3    1 2 3    0 2 3    0 1 3    1 2 3
                                2          2      2          2        2        2          2        2
               {0, 2, 1, 3} => x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x
                                0 1 2    0 1 2    0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3

o6 : HashTable

i7 : higherSpechtPolynomials(p,R)

o7 = HashTable{{0, 1, 2, 3} => HashTable{{0, 1, 2, 3} => x x  - x x  - x x  + x x }                                            }
                                                          0 1    1 2    0 3    2 3
                                         {0, 2, 1, 3} => x x  - x x  - x x  + x x
                                                          0 2    1 2    0 3    1 3
                                                          2            2      2      2        2          2          2        2
               {0, 2, 1, 3} => HashTable{{0, 1, 2, 3} => x x x  - x x x  + x x x  - x x x  - x x x  + x x x  - x x x  + x x x }
                                                          0 1 2    0 1 2    0 1 3    0 2 3    1 2 3    0 2 3    0 1 3    1 2 3
                                                          2          2      2          2        2        2          2        2
                                         {0, 2, 1, 3} => x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x
                                                          0 1 2    0 1 2    0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3

o7 : HashTable

i8 : higherSpechtPolynomials(R)

                                                                                             3 2      2 3      3   2      3 2    2   3      2 3    3 2      2 3      3 2      3 2      2 3      2 3      3   2      3 2    3   2    3   2      3 2      3 2    2   3      2 3    2   3    2   3      2 3      2 3
o8 = HashTable{Partition{1, 1, 1, 1} => HashTable{{0, 1, 2, 3} => HashTable{{0, 1, 2, 3} => x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x }}}
                                                                                             0 1 2    0 1 2    0 1 2    0 1 2    0 1 2    0 1 2    0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3    0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3    0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3
                                                                                            2        2    2      2        2      2
               Partition{2, 1, 1} => HashTable{{0, 1, 2, 3} => HashTable{{0, 1, 2, 3} => - x x  + x x  + x x  - x x  - x x  + x x }            }
                                                                                            0 2    0 2    0 3    2 3    0 3    2 3
                                                                                            2        2    2      2        2      2
                                                                         {0, 2, 1, 3} => - x x  + x x  + x x  - x x  - x x  + x x
                                                                                            0 1    0 1    0 3    1 3    0 3    1 3
                                                                                            2        2    2      2        2      2
                                                                         {0, 3, 1, 2} => - x x  + x x  + x x  - x x  - x x  + x x
                                                                                            0 1    0 1    0 2    1 2    0 2    1 2
                                                                                            2            2    2          2          2        2
                                               {0, 2, 1, 3} => HashTable{{0, 1, 2, 3} => - x x x  + x x x  + x x x  - x x x  - x x x  + x x x }
                                                                                            0 1 2    0 1 2    0 1 3    1 2 3    0 1 3    1 2 3
                                                                                            2          2      2        2            2        2
                                                                         {0, 2, 1, 3} => - x x x  + x x x  + x x x  - x x x  - x x x  + x x x
                                                                                            0 1 2    0 1 2    0 2 3    1 2 3    0 2 3    1 2 3
                                                                                            2          2      2        2          2        2
                                                                         {0, 3, 1, 2} => - x x x  + x x x  + x x x  - x x x  - x x x  + x x x
                                                                                            0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3
                                                                                            2 2        2 2    2 2      2 2        2 2    2   2
                                               {0, 3, 1, 2} => HashTable{{0, 1, 2, 3} => - x x x  + x x x  + x x x  - x x x  - x x x  + x x x }
                                                                                            0 1 2    0 1 2    0 1 3    1 2 3    0 1 3    1 2 3
                                                                                            2   2      2 2    2 2      2 2        2 2      2 2
                                                                         {0, 2, 1, 3} => - x x x  + x x x  + x x x  - x x x  - x x x  + x x x
                                                                                            0 1 2    0 1 2    0 2 3    1 2 3    0 2 3    1 2 3
                                                                                            2   2      2 2    2   2    2   2      2 2      2 2
                                                                         {0, 3, 1, 2} => - x x x  + x x x  + x x x  - x x x  - x x x  + x x x
                                                                                            0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3
               Partition{2, 2} => HashTable{{0, 1, 2, 3} => HashTable{{0, 1, 2, 3} => x x  - x x  - x x  + x x }                                            }
                                                                                       0 1    1 2    0 3    2 3
                                                                      {0, 2, 1, 3} => x x  - x x  - x x  + x x
                                                                                       0 2    1 2    0 3    1 3
                                                                                       2            2      2      2        2          2          2        2
                                            {0, 2, 1, 3} => HashTable{{0, 1, 2, 3} => x x x  - x x x  + x x x  - x x x  - x x x  + x x x  - x x x  + x x x }
                                                                                       0 1 2    0 1 2    0 1 3    0 2 3    1 2 3    0 2 3    0 1 3    1 2 3
                                                                                       2          2      2          2        2        2          2        2
                                                                      {0, 2, 1, 3} => x x x  - x x x  - x x x  + x x x  + x x x  - x x x  - x x x  + x x x
                                                                                       0 1 2    0 1 2    0 1 3    0 1 3    0 2 3    1 2 3    0 2 3    1 2 3
               Partition{3, 1} => HashTable{{0, 1, 2, 3} => HashTable{{0, 1, 2, 3} => - x  + x }                  }
                                                                                         0    3
                                                                      {0, 1, 3, 2} => - x  + x
                                                                                         0    2
                                                                      {0, 2, 3, 1} => - x  + x
                                                                                         0    1
                                            {0, 1, 3, 2} => HashTable{{0, 1, 2, 3} => - x x  - x x  + x x  + x x }
                                                                                         0 1    0 2    1 3    2 3
                                                                      {0, 1, 3, 2} => - x x  + x x  - x x  + x x
                                                                                         0 1    1 2    0 3    2 3
                                                                      {0, 2, 3, 1} => - x x  + x x  - x x  + x x
                                                                                         0 2    1 2    0 3    1 3
                                            {0, 2, 3, 1} => HashTable{{0, 1, 2, 3} => - x x x  + x x x }
                                                                                         0 1 2    1 2 3
                                                                      {0, 1, 3, 2} => - x x x  + x x x
                                                                                         0 1 3    1 2 3
                                                                      {0, 2, 3, 1} => - x x x  + x x x
                                                                                         0 2 3    1 2 3
               Partition{4} => HashTable{{0, 1, 2, 3} => HashTable{{0, 1, 2, 3} => 1}}

o8 : HashTable

i9 : 
     
