-- -*- M2-comint -*- hash: -624362301

i1 : p = new Partition from {2,1}

o1 = Partition{2, 1}

o1 : Partition

i2 : y = youngTableau(p,{0,1,2})

o2 = | 0 1 |
     | 2 |

o2 : YoungTableau

i3 : t = tableauList p

o3 = {}

o3 : TableauList

i4 : addTableau(t,y)

o4 = {| 0 1 |}
      | 2 |

o4 : TableauList

i5 : peek t

o5 = TableauList{length => 1                 }
                 matrix => | 0 1 2 |
                           | 0 0 0 |
                           | 0 0 0 |
                 partition => Partition{2, 1}

i6 : t1 = tableauList (p,5)

o6 = {}

o6 : TableauList

i7 : addTableau(t1,y)

o7 = {| 0 1 |}
      | 2 |

o7 : TableauList

i8 : peek t1

o8 = TableauList{length => 1                 }
                 matrix => | 0 1 2 |
                           | 0 0 0 |
                           | 0 0 0 |
                           | 0 0 0 |
                           | 0 0 0 |
                 partition => Partition{2, 1}

i9 : 
