-- -*- M2-comint -*- hash: -667326518

i1 : R = QQ[x,y,z]/(x^3-x^2*z^5-z^2*y^5)

o1 = R

o1 : QuotientRing

i2 : S = integralClosure R

o2 = S

o2 : QuotientRing

i3 : describe S

                         QQ[w   , x..z]
                             1,0
o3 = -----------------------------------------------------
               3        2       5    2   2        5
     (w   x - y z, w   y z + x*z  - x , w    + y*z  - x*y)
       1,0          1,0                  1,0

i4 : icFractions R

       3
      y z
o4 = {---, x, y, z}
       x

o4 : List

i5 : gens S

o5 = {w   , x, y, z}
       1,0

o5 : List

i6 : trim ideal S

                     3        2       5    2   2        5
o6 = ideal (w   x - y z, w   y z + x*z  - x , w    + y*z  - x*y)
             1,0          1,0                  1,0

o6 : Ideal of QQ[w   , x..z]
                  1,0

i7 : use R

o7 = R

o7 : QuotientRing

i8 : I = ideal(y,z)

o8 = ideal (y, z)

o8 : Ideal of R

i9 : integralClosure I

o9 = ideal (z, y, x)

o9 : Ideal of R

i10 : integralClosure(I^2)

                 2        2
o10 = ideal (x, z , y*z, y )

o10 : Ideal of R

i11 : integralClosure(I, 2)

                 2        2
o11 = ideal (x, z , y*z, y )

o11 : Ideal of R

i12 : integralClosure(I, 3) == integralClosure(I^3)

o12 = true

i13 : 
