-- -*- M2-comint -*- hash: -142189188

i1 : R = ZZ/5[x,y,z]/ideal(x^6-z^6-y^2*z^4);

i2 : icFracP R

          2   3   2     3
         x   x   y z + z
o2 = {1, --, --, --------}
          z   2      x
             z

o2 : List

i3 : R = ZZ/5[x,y,u,v]/ideal(x^2*u-y^2*v);

i4 : icFracP(R)

         x*u
o4 = {1, ---}
          y

o4 : List

i5 : icFracP(R, ConductorElement => x)

         x*u
o5 = {1, ---}
          y

o5 : List

i6 : R=ZZ/2[u,v,w,x,y,z]/ideal(u^2*x^3+u*v*y^3+v^2*z^3);

i7 : icFracP(R)

            3      3
         u*y  + v*z
o7 = {1, -----------}
              u

o7 : List

i8 : icFracP(R, ConductorElement => x^2)

o8 = {1}

o8 : List

i9 : R=ZZ/2[u,v,w,x,y,z]/ideal(u^2*x^3+u*v*y^3+v^2*z^3);

i10 : icFracP(R, Limit => 1)

             2
       1  u*x
o10 = {-, ----}
       y   v*y

o10 : List

i11 : icFracP(R, Limit => 2)

             3      3
          u*y  + v*z
o11 = {1, -----------}
               u

o11 : List

i12 : icFracP(R)

             3      3
          u*y  + v*z
o12 = {1, -----------}
               u

o12 : List

i13 : R=ZZ/3[u,v,w,x,y,z]/ideal(u^2*x^4+u*v*y^4+v^2*z^4);

i14 : icFracP(R, Verbosity => 1)
Number of steps: 4,  Conductor Element: u*x^4-v*y^4

             4      4
          u*y  - v*z
o14 = {1, -----------}
               u

o14 : List

i15 : 
