-- -*- M2-comint -*- hash: 254547150

i1 : R = QQ[x,y]/ideal(x^3-y^2);

i2 : R' = integralClosure(R, Variable => symbol t)

o2 = R'

o2 : QuotientRing

i3 : trim ideal R'

                     2              2
o3 = ideal (t   y - x , t   x - y, t    - x)
             0,0         0,0        0,0

o3 : Ideal of QQ[t   , x..y]
                  0,0

i4 : R = QQ[x,y]/ideal(x^3-y^2);

i5 : R' = integralClosure(R, Variable => symbol t, Keep => {x})

o5 = R'

o5 : QuotientRing

i6 : trim ideal R'

            2
o6 = ideal(t    - x)
            0,0

o6 : Ideal of QQ[t   , x]
                  0,0

i7 : R = QQ[x,y]/ideal(x^3-y^2);

i8 : integralClosure(R, Variable => symbol t, Keep => {})

o8 = QQ[t   ]
         0,0

o8 : PolynomialRing

i9 : 
