-- -*- M2-comint -*- hash: -1174179150

i1 : R = QQ[x,y,z]/ideal(x^6-z^6-y^2*z^4-z^3);

i2 : R' = integralClosure(R, Variable => symbol t)

o2 = R'

o2 : QuotientRing

i3 : trim ideal R'

                     2   3      2     3
o3 = ideal (t   z - x , t    - y z - z  - 1)
             3,0         3,0

o3 : Ideal of QQ[t   , x..z]
                  3,0

i4 : 
