-- -*- M2-comint -*- hash: 1769253071

i1 : R = QQ[x,y,z]/ideal(x^6-z^6-y^2*z^4-z^3);

i2 : R' = integralClosure R

o2 = R'

o2 : QuotientRing

i3 : gens R'

o3 = {w   , x, y, z}
       3,0

o3 : List

i4 : icFractions R

       2
      x
o4 = {--, x, y, z}
       z

o4 : List

i5 : icMap R

o5 = map (R', R, {x, y, z})

o5 : RingMap R' <--- R

i6 : I = trim ideal R'

                     2   3      2     3
o6 = ideal (w   z - x , w    - y z - z  - 1)
             3,0         3,0

o6 : Ideal of QQ[w   , x..z]
                  3,0

i7 : S = ZZ/101[a..d]/ideal(a*(b-c),c*(b-d),b*(c-d));

i8 : C = decompose ideal S

o8 = {ideal (c, b), ideal (c - d, b - d), ideal (d, c, a), ideal (d, b, a)}

o8 : List

i9 : Rs = apply(C, I -> (ring I)/I);

i10 : Rs/integralClosure

        ZZ            ZZ           ZZ         ZZ
       ---[a..d]     ---[a..d]    ---[a..d]  ---[a..d]
       101           101          101        101
o10 = {---------, --------------, ---------, ---------}
         (c, b)   (c - d, b - d)  (d, c, a)  (d, b, a)

o10 : List

i11 : oo/prune

        ZZ         ZZ         ZZ      ZZ
o11 = {---[a, d], ---[a, d], ---[b], ---[c]}
       101        101        101     101

o11 : List

i12 : 
