-- -*- M2-comint -*- hash: 455440092

i1 : A = QQ<|x,y,z|>

o1 = A

o1 : FreeAlgebra

i2 : f = y*z + z*y - x^2

        2
o2 = - x  + y*z + z*y

o2 : A

i3 : g = x*z + z*x - y^2

            2
o3 = x*z - y  + z*x

o3 : A

i4 : h = z^2 - x*y - y*x

                    2
o4 = - x*y - y*x + z

o4 : A

i5 : I = ideal{f,g,h}

               2                     2                       2
o5 = ideal (- x  + y*z + z*y, x*z - y  + z*x, - x*y - y*x + z )

o5 : Ideal of A

i6 : B=A/I
Using numthreads = 0

o6 = B

o6 : FreeAlgebraQuotient

i7 : generators B

o7 = {x, y, z}

o7 : List

i8 : numgens B

o8 = 3

i9 : isCommutative B

o9 = false

i10 : coefficientRing B

o10 = QQ

o10 : Ring

i11 : x

o11 = x

o11 : B

i12 : C = skewPolynomialRing(QQ,(-1)_QQ,{x,y,z,w})
Using numthreads = 0

o12 = C

o12 : FreeAlgebraQuotient

i13 : x

o13 = x

o13 : C

i14 : use B

o14 = B

o14 : FreeAlgebraQuotient

i15 : x

o15 = x

o15 : B

i16 : use C

o16 = C

o16 : FreeAlgebraQuotient

i17 : sigma = map(C,C,{y,z,w,x})

o17 = map (C, C, {y, z, w, x})

o17 : RingMap C <--- C

i18 : D = oreExtension(C,sigma,a)
Using numthreads = 0

o18 = D

o18 : FreeAlgebraQuotient

i19 : generators D

o19 = {x, y, z, w, a}

o19 : List

i20 : numgens D

o20 = 5

i21 : 
