-- -*- M2-comint -*- hash: 1148903687

i1 : A = QQ<|x,y,z|>

o1 = A

o1 : FreeAlgebra

i2 : f = y*z + z*y - x^2

        2
o2 = - x  + y*z + z*y

o2 : A

i3 : g = x*z + z*x - y^2

            2
o3 = x*z - y  + z*x

o3 : A

i4 : h = z^2 - x*y - y*x

                    2
o4 = - x*y - y*x + z

o4 : A

i5 : I = ideal {f,g,h}

               2                     2                       2
o5 = ideal (- x  + y*z + z*y, x*z - y  + z*x, - x*y - y*x + z )

o5 : Ideal of A

i6 : Igb = NCGB(I,10)
Using numthreads = 0

o6 = | x2-yz-zy xz-y2+zx xy+yx-z2 yz2-z2y y2z-zy2 |

             1       5
o6 : Matrix A  <--- A

i7 : NCReductionTwoSided(x^4,I)

                  2       2
o7 = y*z*y*z + y*z y + z*y z + z*y*z*y

o7 : A

i8 : NCReductionTwoSided(x^4,Igb)

                           2 2
o8 = y*z*y*z + z*y*z*y + 2z y

o8 : A

i9 : 
