-- -*- M2-comint -*- hash: -788761574

i1 : B = threeDimSklyanin(QQ,{1,1,-1},{x,y,z})
Using numthreads = 0

o1 = B

o1 : FreeAlgebraQuotient

i2 : L = leftMultiplicationMap(x,2)

o2 = | 0  1 0  1  0  0 |
     | 0  0 -1 0  1  0 |
     | 0  0 1  0  0  0 |
     | -1 0 0  0  0  0 |
     | 0  0 0  0  1  0 |
     | -1 0 0  0  0  0 |
     | 0  0 0  -1 0  0 |
     | 1  0 0  0  0  1 |
     | 0  0 0  -1 0  0 |
     | 0  0 1  0  -1 0 |

              10        6
o2 : Matrix QQ   <--- QQ

i3 : kernel L

o3 = image 0

                               6
o3 : QQ-module, submodule of QQ

i4 : isRightRegular(x,2)

o4 = true

i5 : C = QQ<|x,y|>

o5 = C

o5 : FreeAlgebra

i6 : D = C/ideal{x^2+x*y,y^2}
Using numthreads = 0

o6 = D

o6 : FreeAlgebraQuotient

i7 : isRightRegular(x,1)

o7 = false

i8 : L = leftMultiplicationMap(x,1)

o8 = | -1 1 |
     | 0  0 |

              2        2
o8 : Matrix QQ  <--- QQ

i9 : M=matrix gens kernel L

o9 = | 1 |
     | 1 |

              2        1
o9 : Matrix QQ  <--- QQ

i10 : ncBasis(1,D)*M

o10 = | x+y |

              1       1
o10 : Matrix D  <--- D

i11 : 
