-- -*- M2-comint -*- hash: -1851887268

i1 : S = skewPolynomialRing(QQ,1_QQ,{x_1,x_2,x_3,x_4})
Using numthreads = 0

o1 = S

o1 : FreeAlgebraQuotient

i2 : L = lineSchemeFourDim(S,M);
Using numthreads = 0
Using numthreads = 0

o2 : Ideal of QQ[M   ..M   , M   ..M   , M   ]
                  1,2   1,4   2,3   2,4   3,4

i3 : netList minimalPrimes L

     +-------------------------------------+
o3 = |ideal(M   M    - M   M    + M   M   )|
     |       1,4 2,3    1,3 2,4    1,2 3,4 |
     +-------------------------------------+

i4 : S = skewPolynomialRing(QQ,(-1)_QQ,{x_1,x_2,x_3,x_4})
Using numthreads = 0

o4 = S

o4 : FreeAlgebraQuotient

i5 : L = lineSchemeFourDim(S,M);
Using numthreads = 0
Using numthreads = 0

o5 : Ideal of QQ[M   ..M   , M   ..M   , M   ]
                  1,2   1,4   2,3   2,4   3,4

i6 : netList minimalPrimes L

     +---------------------------------------+
o6 = |ideal (M   , M   , M   )               |
     |        3,4   2,4   1,4                |
     +---------------------------------------+
     |ideal (M   , M   , M   )               |
     |        3,4   2,3   1,3                |
     +---------------------------------------+
     |ideal (M   , M   , M   M    - M   M   )|
     |        3,4   1,2   1,4 2,3    1,3 2,4 |
     +---------------------------------------+
     |ideal (M   , M   , M   )               |
     |        2,4   2,3   1,2                |
     +---------------------------------------+
     |ideal (M   , M   , M   M    + M   M   )|
     |        2,4   1,3   1,4 2,3    1,2 3,4 |
     +---------------------------------------+
     |ideal (M   , M   , M   M    - M   M   )|
     |        2,3   1,4   1,3 2,4    1,2 3,4 |
     +---------------------------------------+
     |ideal (M   , M   , M   )               |
     |        1,4   1,3   1,2                |
     +---------------------------------------+

i7 : R = QQ <|x_4,x_1,x_2,x_3|>

o7 = R

o7 : FreeAlgebra

i8 : I = ideal {x_3^2 - x_1*x_2, x_4^2 - x_2*x_1, x_1*x_3 - x_2*x_4, x_3*x_1 - x_2*x_3, x_1*x_4 - x_4*x_2, x_4*x_1 - x_3*x_2}

                      2   2
o8 = ideal (- x x  + x , x  - x x , x x  - x x , - x x  + x x , - x x  +
               1 2    3   4    2 1   1 3    2 4     2 3    3 1     4 2  
     ------------------------------------------------------------------------
     x x , x x  - x x )
      1 4   4 1    3 2

o8 : Ideal of R

i9 : Igb = NCGB(I, 10);
Using numthreads = 0

             1       9
o9 : Matrix R  <--- R

i10 : S = R/I

o10 = S

o10 : FreeAlgebraQuotient

i11 : L = lineSchemeFourDim(S,M);
Using numthreads = 0
Using numthreads = 0

o11 : Ideal of QQ[M   ..M   , M   ..M   , M   ]
                   1,2   1,4   2,3   2,4   3,4

i12 : netList minimalPrimes L

      +-----------------------------------------------------------------+
      |                                 2                               |
o12 = |ideal (M   , M    - M   , M   , M    - M   M   )                 |
      |        3,4   1,4    2,3   1,2   2,3    1,3 2,4                  |
      +-----------------------------------------------------------------+
      |                                 2                               |
      |ideal (M   , M    + M   , M   , M    + M   M   )                 |
      |        3,4   1,4    2,3   1,2   2,3    1,3 2,4                  |
      +-----------------------------------------------------------------+
      |                                            2                    |
      |ideal (M   , M   , M    - M   , M   M    + M   )                 |
      |        2,4   1,3   1,2    3,4   1,4 2,3    3,4                  |
      +-----------------------------------------------------------------+
      |                                            2                    |
      |ideal (M   , M   , M    + M   , M   M    - M   )                 |
      |        2,4   1,3   1,2    3,4   1,4 2,3    3,4                  |
      +-----------------------------------------------------------------+
      |                                 2                               |
      |ideal (M   , M   , M    - M   , M    - M   M   )                 |
      |        2,3   1,4   1,3    2,4   2,4    1,2 3,4                  |
      +-----------------------------------------------------------------+
      |                                 2                               |
      |ideal (M   , M   , M    + M   , M    + M   M   )                 |
      |        2,3   1,4   1,3    2,4   2,4    1,2 3,4                  |
      +-----------------------------------------------------------------+
      |                                               2      2      2   |
      |ideal (M    - M   , M    - M   , M    + M   , M    - M    - M   )|
      |        1,4    2,3   1,3    2,4   1,2    3,4   2,3    2,4    3,4 |
      +-----------------------------------------------------------------+
      |                                               2      2      2   |
      |ideal (M    - M   , M    + M   , M    - M   , M    + M    + M   )|
      |        1,4    2,3   1,3    2,4   1,2    3,4   2,3    2,4    3,4 |
      +-----------------------------------------------------------------+
      |                                               2      2      2   |
      |ideal (M    + M   , M    - M   , M    - M   , M    + M    - M   )|
      |        1,4    2,3   1,3    2,4   1,2    3,4   2,3    2,4    3,4 |
      +-----------------------------------------------------------------+
      |                                               2      2      2   |
      |ideal (M    + M   , M    + M   , M    + M   , M    - M    + M   )|
      |        1,4    2,3   1,3    2,4   1,2    3,4   2,3    2,4    3,4 |
      +-----------------------------------------------------------------+

i13 : 
