-- -*- M2-comint -*- hash: 1991200804

i1 : B = skewPolynomialRing(QQ,(-1)_QQ,{x,y,z,w})
Using numthreads = 0

o1 = B

o1 : FreeAlgebraQuotient

i2 : sigma = map(B,B,{y,z,w,x})

o2 = map (B, B, {y, z, w, x})

o2 : RingMap B <--- B

i3 : C = oreExtension(B,sigma,a)
Using numthreads = 0

o3 = C

o3 : FreeAlgebraQuotient

i4 : sigmaC = map(C,C,{y,z,w,x,a})

o4 = map (C, C, {y, z, w, x, a})

o4 : RingMap C <--- C

i5 : normalElements(sigmaC,1)

o5 = 0

              1
o5 : Matrix QQ  <--- 0

i6 : normalElements(sigmaC,2)

o6 = 0

              1
o6 : Matrix QQ  <--- 0

i7 : normalElements(sigmaC * sigmaC,2)

o7 = 0

              1
o7 : Matrix QQ  <--- 0

i8 : normalElements(sigmaC * sigmaC * sigmaC, 3)

o8 = 0

              1
o8 : Matrix QQ  <--- 0

i9 : 
