-- -*- M2-comint -*- hash: -701532529

i1 : S = skewPolynomialRing(QQ,(-1)_QQ,{x_1,x_2})
Using numthreads = 0

o1 = S

o1 : FreeAlgebraQuotient

i2 : P = pointScheme(S,a)

o2 = ideal ()

o2 : Ideal of QQ[a ..a ]
                  1   2

i3 : S = skewPolynomialRing(QQ,(-1)_QQ,{x_1..x_4})
Using numthreads = 0

o3 = S

o3 : FreeAlgebraQuotient

i4 : P = pointScheme(S,a)

               2           2      2          2           2    2     
o4 = ideal (-2a a a , -2a a a , 2a a a , 2a a a , -2a a a , 2a a a ,
               1 2 3     1 2 3    1 2 4    1 2 4     1 2 3    1 3 4 
     ------------------------------------------------------------------------
          2       2           2          2        2        2
     -2a a a , -2a a a , -2a a a , 2a a a , 2a a a , 2a a a )
        1 3 4     2 3 4     2 3 4    1 2 4    1 3 4    2 3 4

o4 : Ideal of QQ[a ..a ]
                  1   4

i5 : netList minimalPrimes P

     +--------------+
o5 = |ideal (a , a )|
     |        4   3 |
     +--------------+
     |ideal (a , a )|
     |        4   2 |
     +--------------+
     |ideal (a , a )|
     |        4   1 |
     +--------------+
     |ideal (a , a )|
     |        3   2 |
     +--------------+
     |ideal (a , a )|
     |        3   1 |
     +--------------+
     |ideal (a , a )|
     |        2   1 |
     +--------------+

i6 : S = threeDimSklyanin (frac(QQ[a,b,c]),{a,b,c},{x,y,z}, DegreeLimit => 3)
Using numthreads = 0
Using GC ring in VectorArithmetic.

o6 = S

o6 : FreeAlgebraQuotient

i7 : P = pointScheme(S,X)

                    3          3     3    3    3                 3
o7 = ideal(- a*b*c*X  - a*b*c*X  + (a  + b  + c )X X X  - a*b*c*X )
                    1          2                  1 2 3          3

o7 : Ideal of frac(QQ[a..c])[X ..X ]
                              1   3

i8 : S = threeDimSklyanin (QQ,{1,1,-2},{x,y,z})
Using numthreads = 0

o8 = S

o8 : FreeAlgebraQuotient

i9 : P = pointScheme(S,X)

             3     3               3
o9 = ideal(2X  + 2X  - 6X X X  + 2X )
             1     2     1 2 3     3

o9 : Ideal of QQ[X ..X ]
                  1   3

i10 : netList minimalPrimes P

      +----------------------------------------+
o10 = |ideal(X  + X  + X )                     |
      |       1    2    3                      |
      +----------------------------------------+
      |       2           2                  2 |
      |ideal(X  - X X  + X  - X X  - X X  + X )|
      |       1    1 2    2    1 3    2 3    3 |
      +----------------------------------------+

i11 : R = QQ[zz,X_1,X_2,X_3]

o11 = R

o11 : PolynomialRing

i12 : PP = sub(P,R) + ideal {zz^2 + zz + 1}

               3     3               3    2
o12 = ideal (2X  + 2X  - 6X X X  + 2X , zz  + zz + 1)
               1     2     1 2 3     3

o12 : Ideal of R

i13 : minPP = minimalPrimes PP; netList minPP

      +---------------------------------------------------------------------------------------------------------+
      |                       2                                                                                 |
o14 = |ideal (X  + X  + X , zz  + zz + 1)                                                                       |
      |        1    2    3                                                                                      |
      +---------------------------------------------------------------------------------------------------------+
      |                                 2           2                  2                             2          |
      |ideal (zz*X  - zz*X  - X  + X , X  - X X  + X  - X X  - X X  + X , zz*X  - zz*X  + X  - X , zz  + zz + 1)|
      |           2       3    1    2   1    1 2    2    1 3    2 3    3      1       3    2    3               |
      +---------------------------------------------------------------------------------------------------------+
      |                                 2           2                  2                             2          |
      |ideal (zz*X  - zz*X  + X  - X , X  - X X  + X  - X X  - X X  + X , zz*X  - zz*X  + X  - X , zz  + zz + 1)|
      |           2       3    1    3   1    1 2    2    1 3    2 3    3      1       3    1    2               |
      +---------------------------------------------------------------------------------------------------------+

i15 : minPP / degree

o15 = {2, 2, 2}

o15 : List

i16 : 
