-- -*- M2-comint -*- hash: 251395120

i1 : B = threeDimSklyanin(ZZ/101,{1,1,-1},{x,y,z})
Using numthreads = 0

o1 = B

o1 : FreeAlgebraQuotient

i2 : NCGB(ideal B,5)

o2 = | x2-yz-zy xz-y2+zx xy+yx-z2 yz2-z2y y2z-zy2 |

              ZZ            1        ZZ            5
o2 : Matrix (---<|x, y, z|>)  <--- (---<|x, y, z|>)
             101                    101

i3 : C = threeDimSklyanin(ZZ/101,{2,3,5},{a,b,c})
Using numthreads = 0

o3 = C

o3 : FreeAlgebraQuotient

i4 : NCGB(ideal C,5)

o4 = | a2-40bc+41cb ac-32b2-33ca ab-49ba-48c2 b2a-25bc2+16cbc-17c2b
     ------------------------------------------------------------------------
     b2c-41bcb+33cb2-32c2a bcb2+48bc2a-15cb3+39cbca-3c2ba-18c4
     ------------------------------------------------------------------------
     b4-24bcba+15bc3+24cbc2-14c2bc-22c3b
     ------------------------------------------------------------------------
     bcbc2-41bc2bc+27bc3b-38cbcbc+43cbc2b-8c2bcb+36c3b2-21c4a
     ------------------------------------------------------------------------
     bcbcb-20bc2b2+42c2b3+11c2bca+15c3ba-30c5
     ------------------------------------------------------------------------
     bcbca-35bc2ba+10bc4+32cbcba+46cbc3+37c2bc2-19c3bc+28c4b
     ------------------------------------------------------------------------
     bc2b3-12bc3ba-2cbc2ba-37cbc4+26c2bcba+50c2bc3+40c3bc2+3c4bc-11c5b
     ------------------------------------------------------------------------
     bc2bca-29bc3ba+48bc5+2cbc2ba+37cbc4+21c2bcba-14c2bc3-39c3bc2-12c4bc-
     ------------------------------------------------------------------------
     41c5b bc2bc2+5bc3bc+33bc4b-12cbc3b+33c2bcbc-40c2bc2b+33c3bcb+6c4b2+42c5a
     ------------------------------------------------------------------------
     |

              ZZ            1        ZZ            13
o4 : Matrix (---<|a, b, c|>)  <--- (---<|a, b, c|>)
             101                    101

i5 : centralElements(B,3)

o5 = | y2x y3 yzx yzy zyx zy2 zyz z2x z2y z3 |

             1       10
o5 : Matrix B  <--- B

i6 : centralElements(C,3)

o6 = | b3 bca bcb bc2 cba cb2 cbc c2a c2b c3 |

             1       10
o6 : Matrix C  <--- C

i7 : apply(8, i -> numgens source ncBasis(i,C))
Using numthreads = 0

o7 = {1, 3, 6, 10, 15, 21, 28, 36}

o7 : List

i8 : apply(8, i -> binomial(i+2,2))

o8 = {1, 3, 6, 10, 15, 21, 28, 36}

o8 : List

i9 : 
