-- -*- M2-comint -*- hash: 1156214850

i1 : R = ZZ/(101)[x,y];

i2 : I = ideal (x^2,x*y);

o2 : Ideal of R

i3 : P1 = ideal (x);

o3 : Ideal of R

i4 : localize(I,P1)

o4 = ideal x

o4 : Ideal of R

i5 : P2 = ideal (x,y);

o5 : Ideal of R

i6 : localize(I,P2)

             2
o6 = ideal (x , x*y)

o6 : Ideal of R

i7 : R = ZZ/31991[x,y,z];

i8 : I = ideal(x^2,x*z,y*z);

o8 : Ideal of R

i9 : P1 = ideal(x,y);

o9 : Ideal of R

i10 : localize(I,P1)

o10 = ideal (y, x)

o10 : Ideal of R

i11 : P2 = ideal(x,z);

o11 : Ideal of R

i12 : localize(I,P2)

                 2
o12 = ideal (z, x )

o12 : Ideal of R

i13 : 
