-- -*- M2-comint -*- hash: 573036963

i1 : R = QQ[x_0..x_3]

o1 = R

o1 : PolynomialRing

i2 : (I1,I2,I3) = ({1,2,3},{2,3},{4,5}) / monomialCurveIdeal_R

              2                       2                 3      2          5  
o2 = (ideal (x  - x x , x x  - x x , x  - x x ), ideal(x  - x x ), ideal(x  -
              2    1 3   1 2    0 3   1    0 2          1    0 2          1  
     ------------------------------------------------------------------------
        4
     x x ))
      0 2

o2 : Sequence

i3 : M = comodule I1 ++ comodule I2 ++ comodule I3

o3 = cokernel | x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 0              0              |
              | 0            0             0            x_1^3-x_0x_2^2 0              |
              | 0            0             0            0              x_1^5-x_0x_2^4 |

                            3
o3 : R-module, quotient of R

i4 : associatedPrimes M

             3      2          5      4           2                       2
o4 = {ideal(x  - x x ), ideal(x  - x x ), ideal (x  - x x , x x  - x x , x  -
             1    0 2          1    0 2           2    1 3   1 2    0 3   1  
     ------------------------------------------------------------------------
     x x )}
      0 2

o4 : List

i5 : C = primaryDecomposition M;

i6 : netList C

     +------------------------------------------------------------------------------------------------+
o6 = |subquotient (| 1 0 |, | x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 0              0              |)|
     |             | 0 0 |  | 0            0             0            x_1^3-x_0x_2^2 0              | |
     |             | 0 1 |  | 0            0             0            0              x_1^5-x_0x_2^4 | |
     +------------------------------------------------------------------------------------------------+
     |subquotient (| 1 0 |, | x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 0              0              |)|
     |             | 0 1 |  | 0            0             0            x_1^3-x_0x_2^2 0              | |
     |             | 0 0 |  | 0            0             0            0              x_1^5-x_0x_2^4 | |
     +------------------------------------------------------------------------------------------------+
     |subquotient (| 0 0 |, | x_2^2-x_1x_3 x_1x_2-x_0x_3 x_1^2-x_0x_2 0              0              |)|
     |             | 1 0 |  | 0            0             0            x_1^3-x_0x_2^2 0              | |
     |             | 0 1 |  | 0            0             0            0              x_1^5-x_0x_2^4 | |
     +------------------------------------------------------------------------------------------------+

i7 : intersect C == 0 and all(C, isPrimary_M)

o7 = true

i8 : C / degree

o8 = {5, 3, 8}

o8 : List

i9 : I = intersect((ideal(x_0..x_3))^5, (ideal(x_0..x_2))^4, (ideal(x_0..x_1))^3)

             3         2       2         3       4       3     2 2     3     
o9 = ideal (x x x , x x x x , x x x x , x x x , x x , x x x , x x x , x x x ,
             1 2 3   0 1 2 3   0 1 2 3   0 2 3   1 3   0 1 3   0 1 3   0 1 3 
     ------------------------------------------------------------------------
      4     3 2     2 2   2   2   3 2   4       3     2 2     3       4   
     x x , x x , x x x , x x x , x x , x x , x x x , x x x , x x x , x x ,
      0 3   1 2   0 1 2   0 1 2   0 2   1 2   0 1 2   0 1 2   0 1 2   0 2 
     ------------------------------------------------------------------------
      5     4   2 3   3 2   4     5
     x , x x , x x , x x , x x , x )
      1   0 1   0 1   0 1   0 1   0

o9 : Ideal of R

i10 : S = R/I

o10 = S

o10 : QuotientRing

i11 : associatedPrimes S

o11 = {ideal (x , x ), ideal (x , x , x ), ideal (x , x , x , x )}
               1   0           2   1   0           3   2   1   0

o11 : List

i12 : comps = primaryDecomposition S

o12 = {subquotient (| x_1^3 x_0x_1^2 x_0^2x_1 x_0^3 |, | x_1^3x_2x_3
      -----------------------------------------------------------------------
      x_0x_1^2x_2x_3 x_0^2x_1x_2x_3 x_0^3x_2x_3 x_1^4x_3 x_0x_1^3x_3
      -----------------------------------------------------------------------
      x_0^2x_1^2x_3 x_0^3x_1x_3 x_0^4x_3 x_1^3x_2^2 x_0x_1^2x_2^2
      -----------------------------------------------------------------------
      x_0^2x_1x_2^2 x_0^3x_2^2 x_1^4x_2 x_0x_1^3x_2 x_0^2x_1^2x_2 x_0^3x_1x_2
      -----------------------------------------------------------------------
      x_0^4x_2 x_1^5 x_0x_1^4 x_0^2x_1^3 x_0^3x_1^2 x_0^4x_1 x_0^5 |),
      -----------------------------------------------------------------------
      subquotient (| x_1^3x_2 x_0x_1^2x_2 x_0^2x_1x_2 x_0^3x_2 x_1^4 x_0x_1^3
      -----------------------------------------------------------------------
      x_0^2x_1^2 x_0^3x_1 x_0^4 x_2^5 |, | x_1^3x_2x_3 x_0x_1^2x_2x_3
      -----------------------------------------------------------------------
      x_0^2x_1x_2x_3 x_0^3x_2x_3 x_1^4x_3 x_0x_1^3x_3 x_0^2x_1^2x_3
      -----------------------------------------------------------------------
      x_0^3x_1x_3 x_0^4x_3 x_1^3x_2^2 x_0x_1^2x_2^2 x_0^2x_1x_2^2 x_0^3x_2^2
      -----------------------------------------------------------------------
      x_1^4x_2 x_0x_1^3x_2 x_0^2x_1^2x_2 x_0^3x_1x_2 x_0^4x_2 x_1^5 x_0x_1^4
      -----------------------------------------------------------------------
      x_0^2x_1^3 x_0^3x_1^2 x_0^4x_1 x_0^5 |), subquotient (| x_3^5 x_2^5 |,
      -----------------------------------------------------------------------
      | x_1^3x_2x_3 x_0x_1^2x_2x_3 x_0^2x_1x_2x_3 x_0^3x_2x_3 x_1^4x_3
      -----------------------------------------------------------------------
      x_0x_1^3x_3 x_0^2x_1^2x_3 x_0^3x_1x_3 x_0^4x_3 x_1^3x_2^2 x_0x_1^2x_2^2
      -----------------------------------------------------------------------
      x_0^2x_1x_2^2 x_0^3x_2^2 x_1^4x_2 x_0x_1^3x_2 x_0^2x_1^2x_2 x_0^3x_1x_2
      -----------------------------------------------------------------------
      x_0^4x_2 x_1^5 x_0x_1^4 x_0^2x_1^3 x_0^3x_1^2 x_0^4x_1 x_0^5 |)}

o12 : List

i13 : apply(comps, Q -> ideal mingens(I + ideal gens Q))

               3     2   2     3           3       2     2       3     4 
o13 = {ideal (x , x x , x x , x ), ideal (x x , x x x , x x x , x x , x ,
               1   0 1   0 1   0           1 2   0 1 2   0 1 2   0 2   1 
      -----------------------------------------------------------------------
         3   2 2   3     4   5           5   3         2       2       
      x x , x x , x x , x , x ), ideal (x , x x x , x x x x , x x x x ,
       0 1   0 1   0 1   0   2           3   1 2 3   0 1 2 3   0 1 2 3 
      -----------------------------------------------------------------------
       3       4       3     2 2     3       4     5   3 2     2 2   2   2 
      x x x , x x , x x x , x x x , x x x , x x , x , x x , x x x , x x x ,
       0 2 3   1 3   0 1 3   0 1 3   0 1 3   0 3   2   1 2   0 1 2   0 1 2 
      -----------------------------------------------------------------------
       3 2   4       3     2 2     3       4     5     4   2 3   3 2   4   
      x x , x x , x x x , x x x , x x x , x x , x , x x , x x , x x , x x ,
       0 2   1 2   0 1 2   0 1 2   0 1 2   0 2   1   0 1   0 1   0 1   0 1 
      -----------------------------------------------------------------------
       5
      x )}
       0

o13 : List

i14 : I == intersect oo

o14 = true

i15 : 
