-- -*- M2-comint -*- hash: -1501156953

i1 : R = QQ[a..i];

i2 : I = permanents(2,genericMatrix(R,a,3,3))

o2 = ideal (b*d + a*e, c*d + a*f, c*e + b*f, b*g + a*h, c*g + a*i, c*h + b*i,
     ------------------------------------------------------------------------
     e*g + d*h, f*g + d*i, f*h + e*i)

o2 : Ideal of R

i3 : C = primaryDecomposition I;

i4 : I == intersect C

o4 = true

i5 : #C

o5 = 16

i6 : C / toString / print;
ideal(i,h,g,f,e,d)
ideal(i,h,g,f,c,b*d+a*e)
ideal(i,h,g,e,b,c*d+a*f)
ideal(i,h,g,d,a,c*e+b*f)
ideal(i,h,g,c,b,a)
ideal(i,h,f,e,c,b)
ideal(i,g,f,d,c,a)
ideal(i,f,e,d,c,b*g+a*h)
ideal(i,f,c,b,a,e*g+d*h)
ideal(h,g,e,d,b,a)
ideal(h,f,e,d,b,c*g+a*i)
ideal(h,e,c,b,a,f*g+d*i)
ideal(g,f,e,d,a,c*h+b*i)
ideal(g,d,c,b,a,f*h+e*i)
ideal(f,e,d,c,b,a)
ideal(i^2,f*h+e*i,c*h+b*i,f*g+d*i,e*g+d*h,c*g+a*i,b*g+a*h,c*e+b*f,c*d+a*f,b*d+a*e,a^2,g*h*i,c*f*i,h^3,g*h^2,e*h^2,d*h^2,b*h^2,a*h^2,b*e*h,g^3,d*g^2,a*g^2,a*d*g,f^3,e*f^2,d*f^2,c*f^2,b*f^2,a*f^2,d*e*f,e^3,d*e^2,b*e^2,a*e^2,d^3,a*d^2,c^3,b*c^2,a*c^2,a*b*c,b^3,a*b^2)

i7 : C / codim

o7 = {6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 9}

o7 : List

i8 : C / degree

o8 = {1, 2, 2, 2, 1, 1, 1, 2, 2, 1, 2, 2, 2, 2, 1, 82}

o8 : List

i9 : associatedPrimes I / print;
ideal (i, h, g, f, e, d)
ideal (i, h, g, f, c, b*d + a*e)
ideal (i, h, g, e, b, c*d + a*f)
ideal (i, h, g, d, a, c*e + b*f)
ideal (i, h, g, c, b, a)
ideal (i, h, f, e, c, b)
ideal (i, g, f, d, c, a)
ideal (i, f, e, d, c, b*g + a*h)
ideal (i, f, c, b, a, e*g + d*h)
ideal (h, g, e, d, b, a)
ideal (h, f, e, d, b, c*g + a*i)
ideal (h, e, c, b, a, f*g + d*i)
ideal (g, f, e, d, a, c*h + b*i)
ideal (g, d, c, b, a, f*h + e*i)
ideal (f, e, d, c, b, a)
ideal (i, h, g, f, e, d, c, b, a)

i10 : 
