-- -*- M2-comint -*- hash: 334216592

i1 : hooks(primaryDecomposition, Ideal)

o1 = {0 => (primaryDecomposition, Ideal, Strategy => Comodule)                 }
     {1 => (primaryDecomposition, Ideal, Strategy => EisenbudHunekeVasconcelos)}
     {2 => (primaryDecomposition, Ideal, Strategy => ShimoyamaYokoyama)        }
     {3 => (primaryDecomposition, Ideal, Strategy => Hybrid)                   }
     {4 => (primaryDecomposition, Ideal, Strategy => Monomial)                 }

o1 : NumberedVerticalList

i2 : Q = QQ[a..d]

o2 = Q

o2 : PolynomialRing

i3 : I = ideal(a^2*b,a*c^2,b*d,c*d^2);

o3 : Ideal of Q

i4 : primaryDecomposition(I, Strategy => Monomial)

                                                2              2   2        
o4 = {ideal (d, a), ideal (c, b), ideal (b, a, d ), ideal (d, c , a ), ideal
     ------------------------------------------------------------------------
          2   2
     (b, d , c )}

o4 : List

i5 : primaryDecomposition(I, Strategy => EisenbudHunekeVasconcelos)

                                                2              2   2        
o5 = {ideal (d, a), ideal (c, b), ideal (b, a, d ), ideal (d, c , a ), ideal
     ------------------------------------------------------------------------
          2   2
     (b, d , c )}

o5 : List

i6 : primaryDecomposition(I, Strategy => ShimoyamaYokoyama)

                                                2              2   2        
o6 = {ideal (d, a), ideal (c, b), ideal (b, a, d ), ideal (d, c , a ), ideal
     ------------------------------------------------------------------------
          2   2
     (b, d , c )}

o6 : List

i7 : Q = QQ[x,y];

i8 : I = intersect(ideal(x^2), ideal(y^2))

            2 2
o8 = ideal(x y )

o8 : Ideal of Q

i9 : primaryDecomposition(I, Strategy => Hybrid{1,1})

             2         2
o9 = {ideal x , ideal y }

o9 : List

i10 : primaryDecomposition(I, Strategy => Hybrid{1,2})

              2         2
o10 = {ideal x , ideal y }

o10 : List

i11 : primaryDecomposition(I, Strategy => Hybrid{2,1})

              2         2
o11 = {ideal x , ideal y }

o11 : List

i12 : primaryDecomposition(I, Strategy => Hybrid{2,2})

              2         2
o12 = {ideal x , ideal y }

o12 : List

i13 : 
