-- -*- M2-comint -*- hash: -1228008944

i1 : kk = ZZ/101;

i2 : R = kk[x_0..x_3];

i3 : HT = bettiStrataExamples R;

i4 : netList for k in {"[420]","[430]","[441a]","[441b]"} list (
             if doubling(8,pointsIdeal((HT#k)_0))===null then
             {k, betti res pointsIdeal((HT#k)_0), "No injective map"}
         else
             {k, betti res pointsIdeal((HT#k)_0),
                 betti res doubling(8,pointsIdeal((HT#k)_0))}
         )

     +------+--------------+-----------------+
     |      |       0 1 2 3|       0 1  2 3 4|
o4 = |[420] |total: 1 4 5 2|total: 1 6 10 6 1|
     |      |    0: 1 . . .|    0: 1 .  . . .|
     |      |    1: . 4 2 .|    1: . 4  2 . .|
     |      |    2: . . 3 2|    2: . 2  6 2 .|
     |      |              |    3: . .  2 4 .|
     |      |              |    4: . .  . . 1|
     +------+--------------+-----------------+
     |      |       0 1 2 3|       0 1  2 3 4|
     |[430] |total: 1 5 6 2|total: 1 7 12 7 1|
     |      |    0: 1 . . .|    0: 1 .  . . .|
     |      |    1: . 4 3 .|    1: . 4  3 . .|
     |      |    2: . 1 3 2|    2: . 3  6 3 .|
     |      |              |    3: . .  3 4 .|
     |      |              |    4: . .  . . 1|
     +------+--------------+-----------------+
     |      |       0 1 2 3|       0 1  2 3 4|
     |[441a]|total: 1 6 8 3|total: 1 9 16 9 1|
     |      |    0: 1 . . .|    0: 1 .  . . .|
     |      |    1: . 4 4 1|    1: . 4  4 1 .|
     |      |    2: . 2 4 2|    2: . 4  8 4 .|
     |      |              |    3: . 1  4 4 .|
     |      |              |    4: . .  . . 1|
     +------+--------------+-----------------+
     |      |       0 1 2 3|       0 1  2 3 4|
     |[441b]|total: 1 6 8 3|total: 1 9 16 9 1|
     |      |    0: 1 . . .|    0: 1 .  . . .|
     |      |    1: . 4 4 1|    1: . 4  4 1 .|
     |      |    2: . 2 4 2|    2: . 4  8 4 .|
     |      |              |    3: . 1  4 4 .|
     |      |              |    4: . .  . . 1|
     +------+--------------+-----------------+

i5 : Mpts = randomPoints(R,4,2)|(randomPoints(R,2,4)||(randomPoints(R,2,4)*0));

             4       6
o5 : Matrix R  <--- R

i6 : IGamma = pointsIdeal(Mpts);

o6 : Ideal of R

i7 : betti res IGamma

            0 1 2 3
o7 = total: 1 6 8 3
         0: 1 . . .
         1: . 5 6 2
         2: . . . .
         3: . 1 2 1

o7 : BettiTally

i8 : netList for k in {2,3,4,5,6} list (
         if doubling(k+4,IGamma)===null then {k, "No injective map"}
         else {k, betti res doubling(k+4,IGamma)})

     +-+-----------------+
o8 = |2|No injective map |
     +-+-----------------+
     | |       0 1  2 3 4|
     |3|total: 1 6 10 6 1|
     | |    0: 1 1  . . .|
     | |    1: . 3  5 2 .|
     | |    2: . 2  5 3 .|
     | |    3: . .  . 1 1|
     +-+-----------------+
     | |       0 1  2 3 4|
     |4|total: 1 9 16 9 1|
     | |    0: 1 .  . . .|
     | |    1: . 6  8 3 .|
     | |    2: . .  . . .|
     | |    3: . 3  8 6 .|
     | |    4: . .  . . 1|
     +-+-----------------+
     | |       0 1  2 3 4|
     |5|total: 1 9 16 9 1|
     | |    0: 1 .  . . .|
     | |    1: . 5  6 2 .|
     | |    2: . 1  2 1 .|
     | |    3: . 1  2 1 .|
     | |    4: . 2  6 5 .|
     | |    5: . .  . . 1|
     +-+-----------------+
     | |       0 1  2 3 4|
     |6|total: 1 9 16 9 1|
     | |    0: 1 .  . . .|
     | |    1: . 5  6 2 .|
     | |    2: . .  . . .|
     | |    3: . 2  4 2 .|
     | |    4: . .  . . .|
     | |    5: . 2  6 5 .|
     | |    6: . .  . . 1|
     +-+-----------------+

i9 : 
