-- -*- M2-comint -*- hash: -372130992

i1 : kk = ZZ/101;

i2 : R = kk[x_0..x_3];

i3 : HT = bettiStrataExamples(R);

i4 : MGamma = (HT#"[300c]")_0

o4 = | 1 0 1 -38 34  -18 -28 |
     | 0 1 1 -16 19  -13 -47 |
     | 0 0 0 39  -47 -43 38  |
     | 0 0 0 21  -39 -15 2   |

             4       7
o4 : Matrix R  <--- R

i5 : IGamma = pointsIdeal MGamma;

o5 : Ideal of R

i6 : F = quartic MGamma;

i7 : quarticType F

o7 = [300c]

i8 : Fperp = inverseSystem F;

o8 : Ideal of R

i9 : betti res Fperp

            0 1  2 3 4
o9 = total: 1 7 12 7 1
         0: 1 .  . . .
         1: . 3  . . .
         2: . 4 12 4 .
         3: . .  . 3 .
         4: . .  . . 1

o9 : BettiTally

i10 : Q = ideal super basis (2,Fperp);

o10 : Ideal of R

i11 : betti res Q

             0 1 2 3
o11 = total: 1 3 4 2
          0: 1 . . .
          1: . 3 . .
          2: . . 4 2

o11 : BettiTally

i12 : J = ideal(random(2,IGamma),random(2,IGamma),random(3,IGamma));

o12 : Ideal of R

i13 : betti res J

             0 1 2 3
o13 = total: 1 3 3 1
          0: 1 . . .
          1: . 2 . .
          2: . 1 1 .
          3: . . 2 .
          4: . . . 1

o13 : BettiTally

i14 : Ip = J : IGamma

                       2                                 2            2  
o14 = ideal (x x  - 18x  + 14x x  + 49x x  - 39x x  + 44x , x x  + 21x  -
              1 2      2      0 3      1 3      2 3      3   0 2      2  
      -----------------------------------------------------------------------
                                    2   2      2                             
      43x x  - 50x x  + 14x x  + 35x , x  - 42x  - 29x x  - 32x x  - 36x x  +
         0 3      1 3      2 3      3   1      2      0 3      1 3      2 3  
      -----------------------------------------------------------------------
         2            2                                 2   2     2         
      14x , x x  + 19x  + 44x x  - 36x x  - 23x x  - 35x , x  + 2x  - 23x x 
         3   0 1      2      0 3      1 3      2 3      3   0     2      0 3
      -----------------------------------------------------------------------
                             2
      - 32x x  - 18x x  - 31x )
           1 3      2 3      3

o14 : Ideal of R

i15 : betti res (Fperp:Ip)

             0 1  2 3 4
o15 = total: 1 7 11 8 3
          0: 1 .  . . .
          1: . 7  8 . .
          2: . .  3 8 3

o15 : BettiTally

i16 : l = random(1,R);

i17 : betti res (IGamma+l*Ip)

             0 1  2 3 4
o17 = total: 1 7 12 7 1
          0: 1 .  . . .
          1: . 3  . . .
          2: . 4 12 4 .
          3: . .  . 3 .
          4: . .  . . 1

o17 : BettiTally

i18 : 
