-- -*- M2-comint -*- hash: 1767289013

i1 : kk = ZZ/101;

i2 : R = kk[x_0..x_3];

i3 : HT = bettiStrataExamples(R);

i4 : MGamma = (HT#"[300a]")_0

o4 = | 1 1  1  1  1  1  1  1  |
     | 2 2  2  2  -2 -2 -2 -2 |
     | 3 3  -3 -3 3  3  -3 -3 |
     | 1 -1 1  -1 1  -1 1  -1 |

             4       8
o4 : Matrix R  <--- R

i5 : linforms = flatten entries((vars R) * MGamma);

i6 : F = sum for ell in linforms list random(kk)*ell^4

          4      3        2 2        3      4      3        2            2  
o6 = - 11x  + 36x x  + 39x x  + 43x x  + 26x  + 12x x  + 22x x x  + 43x x x 
          0      0 1      0 1      0 1      1      0 2      0 1 2      0 1 2
     ------------------------------------------------------------------------
          3        2 2          2      2 2       3        3      4     3    
     - 38x x  + 12x x  - 38x x x  + 48x x  + 7x x  - 35x x  + 18x  - 3x x  -
          1 2      0 2      0 1 2      1 2     0 2      1 2      2     0 3  
     ------------------------------------------------------------------------
        2            2        3        2                       2      
     35x x x  - 36x x x  - 13x x  + 14x x x  + 29x x x x  - 45x x x  +
        0 1 3      0 1 3      1 3      0 2 3      0 1 2 3      1 2 3  
     ------------------------------------------------------------------------
          2          2        3        2 2         2      2 2          2  
     20x x x  - 12x x x  + 42x x  + 35x x  + 7x x x  + 39x x  + 36x x x  +
        0 2 3      1 2 3      2 3      0 3     0 1 3      1 3      0 2 3  
     ------------------------------------------------------------------------
            2      2 2       3        3        3      4
     22x x x  + 12x x  - 3x x  + 22x x  - 29x x  - 11x
        1 2 3      2 3     0 3      1 3      2 3      3

o6 : R

i7 : Fperp = inverseSystem F;

o7 : Ideal of R

i8 : betti res Fperp

            0 1  2 3 4
o8 = total: 1 7 12 7 1
         0: 1 .  . . .
         1: . 3  . . .
         2: . 4 12 4 .
         3: . .  . 3 .
         4: . .  . . 1

o8 : BettiTally

i9 : Q = ideal super basis(2,Fperp);

o9 : Ideal of R

i10 : Q == pointsIdeal(MGamma)

o10 = true

i11 : 
