-- -*- M2-comint -*- hash: -1057978498

i1 : kk=ZZ/101

o1 = kk

o1 : QuotientRing

i2 : S=kk[x0,x1,x2]

o2 = S

o2 : PolynomialRing

i3 : M=random(S^5,S^{6:-1});--a random (5x6) matrix linear forms in P2

             5       6
o3 : Matrix S  <--- S

i4 : m5=minors(5,M);--the ideal of 15 points

o4 : Ideal of S

i5 : m52=saturate m5^2;--the square of the ideal of 15 points, saturated, with no forms of degree 8.

o5 : Ideal of S

i6 : betti res m52

            0  1 2
o6 = total: 1 10 9
         0: 1  . .
         1: .  . .
         2: .  . .
         3: .  . .
         4: .  . .
         5: .  . .
         6: .  . .
         7: .  . .
         8: . 10 9

o6 : BettiTally

i7 : kk=ZZ/101

o7 = kk

o7 : QuotientRing

i8 : S=kk[x0,x1,x2,x3,x4,x5,x6,x7];

i9 : M=random(S^3,S^{5:-1});--a random (3x5) matrix linear forms in P7

             3       5
o9 : Matrix S  <--- S

i10 : m3=minors(3,M);--the ideal of a 4-fold Y,

o10 : Ideal of S

i11 : M12=submatrix (M, {0,1},{0,1,2,3,4});

              2       5
o11 : Matrix S  <--- S

i12 : M23=submatrix (M, {1,2},{0,1,2,3,4});

              2       5
o12 : Matrix S  <--- S

i13 : S1=minors (2,M12);-- a divisor in Y of degree 5

o13 : Ideal of S

i14 : S2=minors (2,M23);-- another divisor equivalent to S1

o14 : Ideal of S

i15 : S12=saturate intersect(S1,S2);--the divisor S1+S2 on Y

o15 : Ideal of S

i16 : betti res S12 --the ten cubics are the same as the ones in the ideal of Y

             0  1   2   3   4   5  6  7
o16 = total: 1 60 240 426 420 240 75 10
          0: 1  .   .   .   .   .  .  .
          1: .  .   .   .   .   .  .  .
          2: . 10  15   6   .   .  .  .
          3: . 50 225 420 420 240 75 10

o16 : BettiTally

i17 : 
