-- -*- M2-comint -*- hash: 1499393348

i1 : kk = ZZ/101;

i2 : R = kk[x_0..x_3];

i3 : Q618 = (x_0^2+x_1^2+x_2^2+x_3^2)^2+x_0^4+x_1^4+x_2^4+x_3^4

       4     2 2     4     2 2     2 2     4     2 2     2 2     2 2     4
o3 = 2x  + 2x x  + 2x  + 2x x  + 2x x  + 2x  + 2x x  + 2x x  + 2x x  + 2x
       0     0 1     1     0 2     1 2     2     0 3     1 3     2 3     3

o3 : R

i4 : minimalBetti inverseSystem Q618

            0  1  2  3 4
o4 = total: 1 16 30 16 1
         0: 1  .  .  . .
         1: .  .  .  . .
         2: . 16 30 16 .
         3: .  .  .  . .
         4: .  .  .  . 1

o4 : BettiTally

i5 : quarticType Q618

o5 = [000]

i6 : Q619 = (x_0^2+x_1^2+x_2^2+x_3^2)^2

      4     2 2    4     2 2     2 2    4     2 2     2 2     2 2    4
o6 = x  + 2x x  + x  + 2x x  + 2x x  + x  + 2x x  + 2x x  + 2x x  + x
      0     0 1    1     0 2     1 2    2     0 3     1 3     2 3    3

o6 : R

i7 : minimalBetti inverseSystem Q619

            0  1  2  3 4
o7 = total: 1 16 30 16 1
         0: 1  .  .  . .
         1: .  .  .  . .
         2: . 16 30 16 .
         3: .  .  .  . .
         4: .  .  .  . 1

o7 : BettiTally

i8 : Q620V = x_0^4-x_1*x_2*x_3*(x_1+x_2+x_3)

      4    2          2          2
o8 = x  - x x x  - x x x  - x x x
      0    1 2 3    1 2 3    1 2 3

o8 : R

i9 : minimalBetti inverseSystem Q620V

            0  1  2  3 4
o9 = total: 1 11 20 11 1
         0: 1  .  .  . .
         1: .  3  3  1 .
         2: .  7 14  7 .
         3: .  1  3  3 .
         4: .  .  .  . 1

o9 : BettiTally

i10 : quarticType Q620V

o10 = [331]

i11 : Q620D = x_0^4+x_1^4+x_2^4+x_3^4-8*x_0*x_1*x_2*x_3

       4    4    4                4
o11 = x  + x  + x  - 8x x x x  + x
       0    1    2     0 1 2 3    3

o11 : R

i12 : minimalBetti inverseSystem Q620D

             0  1  2  3 4
o12 = total: 1 16 30 16 1
          0: 1  .  .  . .
          1: .  .  .  . .
          2: . 16 30 16 .
          3: .  .  .  . .
          4: .  .  .  . 1

o12 : BettiTally

i13 : quarticType Q620D

o13 = [000]

i14 : x5=x_0+x_1+x_2+x_3

o14 = x  + x  + x  + x
       0    1    2    3

o14 : R

i15 : Q = x_0^4+x_1^4+x_2^4+x_3^4+x5^4-random(kk)*(x_0^2+x_1^2+x_2^2+x_3^2+x5^2)^2;

i16 : minimalBetti inverseSystem Q

             0  1  2  3 4
o16 = total: 1 16 30 16 1
          0: 1  .  .  . .
          1: .  .  .  . .
          2: . 16 30 16 .
          3: .  .  .  . .
          4: .  .  .  . 1

o16 : BettiTally

i17 : Q = x_0^4+x_1^4+x_2^4+x_3^4+x5^4;

i18 : minimalBetti inverseSystem Q

             0 1  2 3 4
o18 = total: 1 6 10 6 1
          0: 1 .  . . .
          1: . 5  5 . .
          2: . 1  . 1 .
          3: . .  5 5 .
          4: . .  . . 1

o18 : BettiTally

i19 : quarticType Q

o19 = [550]

i20 : 
