-- -*- M2-comint -*- hash: -1702524799

i1 : kk=QQ;

i2 : U=kk[y0,y1,y2,y3,y4,y5,y6,y7];

i3 : P4=ideal(y0,y1,y2);--a P4

o3 : Ideal of U

i4 : T3=minors(2,matrix{{y0,y1,y2},{y3,y4,y5}});--a cubic 5-fold scroll with P4 as a ruling

o4 : Ideal of U

i5 : X2=P4+ideal(random(2,U));-- a quadric 3-fold in T3

o5 : Ideal of U

i6 : X18=T3+ideal(random(2,X2),random(3,X2));--a 3-fold of degree 18 in T3 that contains X2

o6 : Ideal of U

i7 : X16=X18:X2;--a 3-fold of degree 16 in T3 with betti table of type 420

o7 : Ideal of U

i8 : (dim X16, degree X16)

o8 = (4, 16)

o8 : Sequence

i9 : betti res X16

            0 1  2 3 4
o9 = total: 1 6 10 6 1
         0: 1 .  . . .
         1: . 4  2 . .
         2: . 2  6 2 .
         3: . .  2 4 .
         4: . .  . . 1

o9 : BettiTally

i10 : 
