-- -*- M2-comint -*- hash: -299794797

i1 : kk = QQ;

i2 : U = kk[y0,y1,y2,y3,y4,y5,y6,y7];

i3 : P3 = ideal(y0,y1,y2,y3); --a P3

o3 : Ideal of U

i4 : CI = ideal(y0, random(2, P3), random(2, P3), random(3, P3));

o4 : Ideal of U

i5 : X11 = CI : P3; -- degree 11, codim 4.

o5 : Ideal of U

i6 : (codim X11, degree X11)

o6 = (4, 11)

o6 : Sequence

i7 : s114 = X11 + P3; -- intersect X11 with the P3.  Take a random quartic in this ideal.

o7 : Ideal of U

i8 : X4 = ideal(y1,y2,y3, random(4, s114));

o8 : Ideal of U

i9 : X15 = intersect(X4, X11);

o9 : Ideal of U

i10 : assert isPrime(X4 + X15) -- a quartic in P^3.

i11 : (dim X15, degree X15)

o11 = (4, 15)

o11 : Sequence

i12 : betti resolution X15

             0 1  2 3 4
o12 = total: 1 7 12 7 1
          0: 1 .  . . .
          1: . 5  5 1 .
          2: . 1  2 1 .
          3: . 1  5 5 .
          4: . .  . . 1

o12 : BettiTally

i13 : 
