-- -*- M2-comint -*- hash: -1123130305

i1 : kk = QQ;

i2 : U = kk[y0,y1,y2,y3,y4,y5,y6,y7];

i3 : u7 = ideal vars U;

o3 : Ideal of U

i4 : P6 = ideal(y0); -- a P6

o4 : Ideal of U

i5 : P4 = ideal(y1,y2,y3); --a P4

o5 : Ideal of U

i6 : q1=(gens u7)*random(kk^8,kk^7);

             1       7
o6 : Matrix U  <--- U

i7 : q2=(gens u7)*random(kk^8,kk^7);

             1       7
o7 : Matrix U  <--- U

i8 : q3=(gens P4)*random(kk^3,kk^7);

             1       7
o8 : Matrix U  <--- U

i9 : q4=(gens P4)*random(kk^3,kk^7);

             1       7
o9 : Matrix U  <--- U

i10 : q5=(gens P4)*random(kk^3,kk^7);

              1       7
o10 : Matrix U  <--- U

i11 : q6=(gens P4)*random(kk^3,kk^7);

              1       7
o11 : Matrix U  <--- U

i12 : q7=(gens P4)*random(kk^3,kk^7);

              1       7
o12 : Matrix U  <--- U

i13 : F1=transpose q1|transpose q2|transpose q3|transpose q4|
         transpose q5|transpose q6|transpose q7;

              7       7
o13 : Matrix U  <--- U

i14 : F = F1-transpose F1;--a skew symmetric 7x7 matrix ;

              7       7
o14 : Matrix U  <--- U

i15 : Y14 = pfaffians (6,F); --a 4-fold of degree 14 that contain P4

o15 : Ideal of U

i16 : (dim Y14, degree Y14)

o16 = (5, 14)

o16 : Sequence

i17 : isSubset(Y14, P4)

o17 = true

i18 : Y13 = Y14:P4;--a 4-fold of degree 13

o18 : Ideal of U

i19 : dim Y13

o19 = 5

i20 : degree Y13

o20 = 13

i21 : X4 = trim(Y13 + P4);

o21 : Ideal of U

i22 : X13 = trim(P6 + Y13);--  A 3-fold of degree 13 in  P6

o22 : Ideal of U

i23 : dim X13

o23 = 4

i24 : degree X13

o24 = 13

i25 : X = intersect (X4,X13);  --A 3-fold of degree 17 in P7, the union of X13 and X4, with betti table of type 331

o25 : Ideal of U

i26 : dim X

o26 = 4

i27 : degree X

o27 = 17

i28 : betti res X

             0  1  2  3 4
o28 = total: 1 11 20 11 1
          0: 1  .  .  . .
          1: .  3  3  1 .
          2: .  7 14  7 .
          3: .  1  3  3 .
          4: .  .  .  . 1

o28 : BettiTally

i29 : Z = trim(X13 + X4);

o29 : Ideal of U

i30 : dim Z -- 3, therefore a surface in projective space

o30 = 3

i31 : degree Z

o31 = 4

i32 : dim X4

o32 = 4

i33 : X4 + ideal(y0) == Z

o33 = true

i34 : 
