-- -*- M2-comint -*- hash: -115310221

i1 : S=QQ[h_1..h_4];

i2 : SQ=QQ[x0,x1,y0,y1, Degrees=>{{1,0},{1,0},{0,1},{0,1}}];--quadric surface in PP^3

i3 : A=gens kernel matrix{{h_1,h_2,h_3,h_4}};

             4       6
o3 : Matrix S  <--- S

i4 : B=A++A++A++A++A++A;-- this gives a resolution of 6U

             24       36
o4 : Matrix S   <--- S

i5 : F_{Q}=x0^4*y0^4+x1^4*y0^4+x0^3*x1*y0*y1^3+x0^2*x1^2*y0^2*y1^2+x1^4*y1^4

       4  4     4  4     2  2  2  2     3        3     4  4
o5 = x0 y0  + x1 y0  + x0 x1 y0 y1  + x0 x1*y0*y1  + x1 y1

o5 : SQ

i6 : IS23=((gens intersect(inverseSystem(F_{Q}), ((ideal(x0,x1))^2*(ideal(y0,y1))^3)))); --F_{Q}^\perp(2,3)

              1        6
o6 : Matrix SQ  <--- SQ

i7 : ZX=sub((coefficients(
         IS23**matrix{{x0*y0,x1*y0,x0*y1,x1*y1}}
         ,  Monomials=>gens  ((ideal(x0,x1))^3*(ideal(y0,y1))^4)))_1, S)*B;-- the big matrix representing the multiplication map from the resolution of U\otimes F^{\perp}(2,3) to S(3,4)

             20       36
o7 : Matrix S   <--- S

i8 : Z1=submatrix(ZX,{0,1,2,3,4,5,6,7,8,9,10,11,13,14,15,16,17,18},{1,2,4,6,8,10,13,15,17,19,22,23,25,28,29,32,34,35});

             18       18
o8 : Matrix S   <--- S

i9 : D1=ideal det Z1;--rank <= 17 locus

o9 : Ideal of S

i10 : X1=decompose D1

                                                                  
o10 = {ideal h , ideal h , ideal h , ideal h , ideal(h h  - h h ),
              4         3         2         1         2 3    1 4  
      -----------------------------------------------------------------------
                   4           4             3               2 2  
      ideal(949968h  - 6713280h  - 540372420h h  + 481656096h h  -
                   1           2             2 3             2 3  
      -----------------------------------------------------------------------
                  3            4                  2                          
      214742080h h  + 47738880h  - 100117184265h h h  + 44496901348h h h h  -
                2 3            3                1 2 4               1 2 3 4  
      -----------------------------------------------------------------------
              2              2 2          4
      82880h h h  - 34412740h h  + 949968h )}
            1 3 4            1 4          4

o10 : List

i11 : X=(X1)_5--the ideal generated by X(F_{Q})

                   4           4             3               2 2  
o11 = ideal(949968h  - 6713280h  - 540372420h h  + 481656096h h  -
                   1           2             2 3             2 3  
      -----------------------------------------------------------------------
                  3            4                  2                          
      214742080h h  + 47738880h  - 100117184265h h h  + 44496901348h h h h  -
                2 3            3                1 2 4               1 2 3 4  
      -----------------------------------------------------------------------
              2              2 2          4
      82880h h h  - 34412740h h  + 949968h )
            1 3 4            1 4          4

o11 : Ideal of S

i12 : JX=ideal flatten jacobian X;

o12 : Ideal of S

i13 : JX=ideal mingens JX;

o13 : Ideal of S

i14 : codim JX

o14 = 4

i15 : IX=inverseSystem X;

o15 : Ideal of S

i16 : betti res IX

             0  1  2  3 4
o16 = total: 1 16 30 16 1
          0: 1  .  .  . .
          1: .  .  .  . .
          2: . 16 30 16 .
          3: .  .  .  . .
          4: .  .  .  . 1

o16 : BettiTally

i17 : quarticType X_0

o17 = [000]

i18 : 
