-- -*- M2-comint -*- hash: -832145131

i1 : needsPackage "RandomComplexes"

o1 = RandomComplexes

o1 : Package

i2 : h = {1,4,6,5,1}

o2 = {1, 4, 6, 5, 1}

o2 : List

i3 : r = {1,3,3,4}

o3 = {1, 3, 3, 4}

o3 : List

i4 : C = randomChainComplex(h,r)

       2       8       12       12       5
o4 = ZZ  <-- ZZ  <-- ZZ   <-- ZZ   <-- ZZ
                                        
     0       1       2        3        4

o4 : ChainComplex

i5 : CQ = C ** QQ

       2       8       12       12       5
o5 = QQ  <-- QQ  <-- QQ   <-- QQ   <-- QQ
                                        
     0       1       2        3        4

o5 : ChainComplex

i6 : prune HH CQ

           1
o6 = 0 : QQ

           4
     1 : QQ

           6
     2 : QQ

           5
     3 : QQ

           1
     4 : QQ

o6 : GradedModule

i7 : CR = C ** RR_53

         2         8         12         12         5
o7 = RR    <-- RR    <-- RR     <-- RR     <-- RR
       53        53        53         53         53
                                                
     0         1         2          3          4

o7 : ChainComplex

i8 : (h,U) = SVDComplex CR

                            
o8 = (HashTable{0 => 1}, 0 :
                1 => 4      
                2 => 6      
                3 => 5
                4 => 1      
                         1 :
                            
                            
                            
                            
                            
                            
                            
                            

                            
                         2 :
                            
                            
                            
                            
                            
                            
                            
                            
                            
                            
                            
                            

                            
                         3 :
                            
                            
                            
                            
                            
                            
                            
                            
                            
                            
                            
                            

                            
                         4 :
                            
                            
                            
                            
                            
     ------------------------------------------------------------------------
         2                     2
     RR    <-------------- RR    : 0                                         
       53     | -.6 .8 |     53
              | .8  .6 |

         8                                                                   
     RR    <-----------------------------------------------------------------
       53     | .29173   -.137215  -.131623  .0468896 .223586   -.591282  -.4
              | -.29173  -.164224  .226171   .42752   .798544   .0528485  .04
              | -.437595 -.0180683 .352459   -.694466 .130238   -.396905  .16
              | .29173   -.0673769 -.0868048 -.188439 .139439   -.224302  -.3
              | .29173   -.0270088 .357794   .38063   -.216759  -.52871   .54
              | -.29173  .834227   .117388   .248267  -.0818821 -.201917  -.3
              | -.437595 -.0881199 -.763237  .133167  -.0408504 -.340452  .26
              | -.437595 -.494881  .27465    .270161  -.469652  -.0594604 -.4

         12                                                                  
     RR     <----------------------------------------------------------------
       53      | .278738    .330931   -.0636129 -.127695  .645269    -.37313 
               | .181387    -.0175177 -.109373  .0842121  -.00579485 -.28904 
               | -.0897273  .357747   .0394609  -.281164  -.32376    -.508571
               | -.00779127 -.080533  .485993   -.0152504 .318467    -.035461
               | .091828    -.285434  -.641126  -.323891  -.0936544  -.047519
               | -.23277    .569208   -.360463  .127208   -.144131   .166691 
               | -.41609    -.111251  -.220639  -.417497  .399399    -.079248
               | .262495    -.0747623 -.0367352 -.0137386 -.0441806  .248257 
               | .352222    -.43251   -.0761961 -.150879  -.0524196  -.110043
               | .265256    .242179   .306708   -.7236    -.236879   .269692 
               | .51068     .142759   -.0770441 .233553   -.161111   -.294916
               | -.348465   -.257248  .22232    -.0287713 -.318621   -.497548

         12                                                                  
     RR     <----------------------------------------------------------------
       53      | -.409642  .0932651  -.0489842 -.127274 -.698196  .343166   .
               | -.437938  .55024    .565887   .223659  .115315   -.072463  .
               | -.371333  -.393548  -.0292137 .216358  .191764   .456632   .
               | .309475   .419368   -.11574   .208793  .0489245  .372494   -
               | -.0467424 .228516   -.385956  -.230435 .19515    .222109   .
               | -.250774  .131081   -.27622   .241195  .112536   -.413502  .
               | .285925   -.0416247 -.240923  .617916  -.306378  -.0890825 .
               | .0952472  -.196698  .199861   -.355998 -.349078  -.133132  .
               | .155527   .0656166  .0763583  -.393519 .288769   -.060593  .
               | .218964   -.248338  .489768   .210814  -.0915731 -.125286  .
               | -.199112  -.41337   .0745986  .151334  .315891   .17688    -
               | .372912   .105413   .29767    .0366188 .0450206  .482794   .

         5                                                              5
     RR    <------------------------------------------------------- RR    : 4
       53     | .67986   -.314387  .266634  -.10376  .597571    |     53
              | -.011089 -.0216509 -.466133 -.882608 .0559598   |
              | .100377  .927993   .220916  -.124605 .253818    |
              | .562364  .0587547  .259779  -.193793 -.758455   |
              | .459716  .189918   -.771581 .396428  -.00999282 |
     ------------------------------------------------------------------------
                                                                             



                             8
     ------------------- RR    : 1
     68787 .507125   |     53
     31064 -.108045  |
     1751  .031865   |
     38014 -.82662   |
     4552  -.134957  |
     00478 -.0760309 |
     212   -.119155  |
     27123 -.0929607 |

                                                                         12
     --------------------------------------------------------------- RR     :
       -.0550568 -.149257  .0994419 .343483   -.288709 -.0175142 |     53
       .215279   -.0463562 .582095  -.0528391 .602869  .332549   |
       .524284   .132265   -.299425 -.0577482 .0435356 -.180659  |
     6 .147799   -.194739  -.392797 -.34776   .046736  .563183   |
     2 -.0693368 -.166662  -.406577 .218058   .0951074 .358657   |
       .00382349 -.313962  .165528  -.347523  -.299797 .300846   |
     4 -.127977  .440031   .149537  -.435009  .0333189 -.0547549 |
       .430472   .56212    .157146  .130847   -.423142 .371799   |
       .230488   -.385748  .193573  -.453413  -.347266 -.282618  |
       -.26756   -.0739419 .184063  .0193586  .0787975 .0834074  |
       -.485077  .359289   -.193925 -.373577  -.016696 .0598106  |
       -.295612  -.0290586 .242106  .186446   -.378089 .297505   |

                                                                        12
     -------------------------------------------------------------- RR     : 
     159003   .0652602  -.34953   -.145514  -.156267  -.0484878 |     53
     031799   .179264   .128533   .00897505 .204915   .157822   |
     239502   .00841309 .555777   -.0678277 -.206114  -.0296132 |
     .102106  .167656   .0954876  -.210314  .0577     -.659551  |
     280777   .380458   -.0505981 .63602    .114416   .111181   |
     556437   -.398036  -.130473  .00434128 .00860814 -.341524  |
     226562   .314953   .0643643  -.150564  .207481   .393015   |
     271929   .0514907  .393733   .0449968  .585175   -.26439   |
     46663    .334014   -.0845043 -.575918  -.196241  .130831   |
     230163   .301068   -.178895  .381399   -.41697   -.295017  |
     .0501992 .176474   -.548818  -.118729  .510584   -.142416  |
     344887   -.545022  -.155578  .0971318  .126745   .243023   |
     ------------------------------------------------------------------------
       )















      2














     3

o8 : Sequence

i9 : source U

         2         8         12         12         5
o9 = RR    <-- RR    <-- RR     <-- RR     <-- RR
       53        53        53         53         53
                                                
     0         1         2          3          4

o9 : ChainComplex

i10 : (source U).dd

              2                                    8
o10 = 0 : RR    <----------------------------- RR    : 1
            53     | 34.2783 0 0 0 0 0 0 0 |     53
                   | 0       0 0 0 0 0 0 0 |

              8                                                        12
      1 : RR    <------------------------------------------------- RR     : 2
            53     | 0       0       0       0 0 0 0 0 0 0 0 0 |     53
                   | 160.387 0       0       0 0 0 0 0 0 0 0 0 |
                   | 0       85.9914 0       0 0 0 0 0 0 0 0 0 |
                   | 0       0       40.2416 0 0 0 0 0 0 0 0 0 |
                   | 0       0       0       0 0 0 0 0 0 0 0 0 |
                   | 0       0       0       0 0 0 0 0 0 0 0 0 |
                   | 0       0       0       0 0 0 0 0 0 0 0 0 |
                   | 0       0       0       0 0 0 0 0 0 0 0 0 |

              12                                                        12
      2 : RR     <------------------------------------------------- RR     : 3
            53      | 0       0       0       0 0 0 0 0 0 0 0 0 |     53
                    | 0       0       0       0 0 0 0 0 0 0 0 0 |
                    | 0       0       0       0 0 0 0 0 0 0 0 0 |
                    | 252.014 0       0       0 0 0 0 0 0 0 0 0 |
                    | 0       179.404 0       0 0 0 0 0 0 0 0 0 |
                    | 0       0       55.8422 0 0 0 0 0 0 0 0 0 |
                    | 0       0       0       0 0 0 0 0 0 0 0 0 |
                    | 0       0       0       0 0 0 0 0 0 0 0 0 |
                    | 0       0       0       0 0 0 0 0 0 0 0 0 |
                    | 0       0       0       0 0 0 0 0 0 0 0 0 |
                    | 0       0       0       0 0 0 0 0 0 0 0 0 |
                    | 0       0       0       0 0 0 0 0 0 0 0 0 |

              12                                                5
      3 : RR     <----------------------------------------- RR    : 4
            53      | 0       0       0       0       0 |     53
                    | 0       0       0       0       0 |
                    | 0       0       0       0       0 |
                    | 186.288 0       0       0       0 |
                    | 0       138.149 0       0       0 |
                    | 0       0       113.687 0       0 |
                    | 0       0       0       36.8099 0 |
                    | 0       0       0       0       0 |
                    | 0       0       0       0       0 |
                    | 0       0       0       0       0 |
                    | 0       0       0       0       0 |
                    | 0       0       0       0       0 |

o10 : ChainComplexMap

i11 : 
