-- -*- M2-comint -*- hash: -1580138251

i1 : B = random(RR^30, RR^5);

                30          5
o1 : Matrix RR     <--- RR
              53          53

i2 : C = random(RR^5, RR^30);

                5          30
o2 : Matrix RR    <--- RR
              53         53

i3 : A = B*C;

                30          30
o3 : Matrix RR     <--- RR
              53          53

i4 : numericRank A

o4 = 5

i5 : first SVD A

o5 = {37.3735    }
     {2.8333     }
     {2.49293    }
     {2.28935    }
     {1.7274     }
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {4.06231e-15}
     {6.1077e-16 }

o5 : VerticalList

i6 : B = mutableMatrix random(RR^100, RR^50);

i7 : C = mutableMatrix random(RR^50, RR^100);

i8 : A = B*C;

i9 : numericRank A

o9 = 50

i10 : B = mutableMatrix random(CC^100, CC^50);

i11 : C = mutableMatrix random(CC^50, CC^100);

i12 : A = B*C;

i13 : numericRank A

o13 = 50

i14 : 
