-- -*- M2-comint -*- hash: -2132971610

i1 : X = newField("2*a*x_0*ax_1")

o1 = 2a*x ax
         0  1

o1 : DiffAlgField

i2 : ring X

      QQ[i]
o2 = ------[][a][x ..x ][ax ..ax ]
      2           0   1    0    1
     i  + 1

o2 : PolynomialRing

i3 : Y = newField("x_0*ax_2")

o3 = x ax
      0  2

o3 : DiffAlgField

i4 : ring Y

      QQ[i]
o4 = ------[][x ..x ][ax ..ax ]
      2        0   2    0    2
     i  + 1

o4 : PolynomialRing

i5 : X+Y

o5 = 2a*x ax  + x ax
         0  1    0  2

o5 : DiffAlgField

i6 : ring (X+Y)

      QQ[i]
o6 = ------[][a][x ..x ][ax ..ax ]
      2           0   2    0    2
     i  + 1

o6 : PolynomialRing

i7 : Z = newField("ax_5")

o7 = ax
       5

o7 : DiffAlgField

i8 : ring Z

      QQ[i]
o8 = ------[][x ..x ][ax ..ax ]
      2        0   5    0    5
     i  + 1

o8 : PolynomialRing

i9 : 
