-- -*- M2-comint -*- hash: -1508795585

i1 : w = newForm("a * x_1 * dx_0 * dx_1")

o1 = a*x dx dx
        1  0  1

o1 : DiffAlgForm

i2 : ring w

      QQ[i]
o2 = ------[][a][x ..x ][dx ..dx ]
      2           0   1    0    1
     i  + 1

o2 : PolynomialRing, 2 skew commutative variables

i3 : z = newForm("x_0^2 * dx_2 - x_2^2 * dx_0")

        2       2
o3 = - x dx  + x dx
        2  0    0  2

o3 : DiffAlgForm

i4 : ring z

      QQ[i]
o4 = ------[][x ..x ][dx ..dx ]
      2        0   2    0    2
     i  + 1

o4 : PolynomialRing, 3 skew commutative variables

i5 : w ^ z

        2
o5 = a*x x dx dx dx
        0 1  0  1  2

o5 : DiffAlgForm

i6 : ring (w+z)

      QQ[i]
o6 = ------[][a][x ..x ][dx ..dx ]
      2           0   2    0    2
     i  + 1

o6 : PolynomialRing, 3 skew commutative variables

i7 : v = newForm("dx_5")

o7 = dx
       5

o7 : DiffAlgForm

i8 : ring v

      QQ[i]
o8 = ------[][x ..x ][dx ..dx ]
      2        0   5    0    5
     i  + 1

o8 : PolynomialRing, 6 skew commutative variables

i9 : 
