-- -*- M2-comint -*- hash: 844342539

i1 : w = random newForm(2,1,2,"a")

        2             2                            2            2          
o1 = (2x  - 2x x  + 6x  - 3x x  + 6x x )dx  + (- 7x  + 5x x  - x  - 2x x  -
        0     0 1     1     0 2     1 2   0        0     0 1    1     0 2  
     ------------------------------------------------------------------------
             2            2             2                     2
     x x  + x )dx  + (- 3x  - 4x x  + 7x  + 2x x  - 7x x  - 3x )dx
      1 2    2   1        0     0 1     1     0 2     1 2     2   2

o1 : DiffAlgForm

i2 : singularIdeal(w)

              2             2                      2            2          
o2 = ideal (2x  - 2x x  + 6x  - 3x x  + 6x x , - 7x  + 5x x  - x  - 2x x  -
              0     0 1     1     0 2     1 2      0     0 1    1     0 2  
     ------------------------------------------------------------------------
             2      2             2                     2
     x x  + x , - 3x  - 4x x  + 7x  + 2x x  - 7x x  - 3x )
      1 2    2      0     0 1     1     0 2     1 2     2

               QQ[i]
o2 : Ideal of ------[][x ..x ]
               2        0   2
              i  + 1

i3 : w = random newForm(2,1,2,"a");

i4 : r = radial 2;

i5 : F = r_w

      3     2         2     3     2                  2         2      2    3
o5 = x  + 6x x  + 3x x  - 4x  + 5x x  - 10x x x  + 6x x  + 3x x  - x x  + x
      0     0 1     0 1     1     0 2      0 1 2     1 2     0 2    1 2    2

o5 : DiffAlgForm

i6 : degree F

o6 = {2, 0, 3}

o6 : List

i7 : (gens singularIdeal F)_0_0

      3     2         2     3     2                  2         2      2    3
o7 = x  + 6x x  + 3x x  - 4x  + 5x x  - 10x x x  + 6x x  + 3x x  - x x  + x
      0     0 1     0 1     1     0 2      0 1 2     1 2     0 2    1 2    2

      QQ[i]
o7 : ------[][x ..x ]
      2        0   2
     i  + 1

i8 : 
