-- -*- M2-comint -*- hash: -1657977064

i1 : E = tangentBundle(pp1ProductFan 2,"Type" => "Kaneyama")

o1 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o1 : ToricVectorBundleKaneyama

i2 : Ed = dual E

o2 = {dimension of the variety => 2 }
      number of affine charts => 4
      rank of the vector bundle => 2

o2 : ToricVectorBundleKaneyama

i3 : details Ed

o3 = (HashTable{0 => (| 1 0 |, | 1 0 |)    }, HashTable{(0, 1) => | 1 0  |})
                      | 0 1 |  | 0 1 |                            | 0 -1 |
                1 => (| 1 0  |, | 1 0  |)               (0, 2) => | -1 0 |
                      | 0 -1 |  | 0 -1 |                          | 0  1 |
                2 => (| -1 0 |, | -1 0 |)               (1, 3) => | -1 0 |
                      | 0  1 |  | 0  1 |                          | 0  1 |
                3 => (| -1 0  |, | -1 0  |)             (2, 3) => | 1 0  |
                      | 0  -1 |  | 0  -1 |                        | 0 -1 |

o3 : Sequence

i4 : Ed == cotangentBundle(pp1ProductFan 2,"Type" => "Kaneyama")

o4 = false

i5 : E = tangentBundle projectiveSpaceFan 2

o5 = {dimension of the variety => 2 }
      number of affine charts => 3
      number of rays => 3
      rank of the vector bundle => 2

o5 : ToricVectorBundleKlyachko

i6 : Ed = dual E

o6 = {dimension of the variety => 2 }
      number of affine charts => 3
      number of rays => 3
      rank of the vector bundle => 2

o6 : ToricVectorBundleKlyachko

i7 : details Ed

o7 = HashTable{| -1 | => (| 0  -1 |, | 1 0 |)}
               | -1 |     | -1 1  |
               | 0 | => (| 0 1 |, | 1 0 |)
               | 1 |     | 1 0 |
               | 1 | => (| 1 0 |, | 1 0 |)
               | 0 |     | 0 1 |

o7 : HashTable

i8 : Ed == cotangentBundle projectiveSpaceFan 2

o8 = false

i9 : 
