-- -*- M2-comint -*- hash: -705716129

i1 : X = toricProjectiveSpace(1)**toricProjectiveSpace(1);

i2 : S = ring X;

i3 : B = ideal X;

o3 : Ideal of S

i4 : J = saturate(intersect(
         ideal(x_1 - x_0, x_3 - 4*x_2),
         ideal(x_1 - 2*x_0, x_3 - 5*x_2),
         ideal(x_1 - 3*x_0, x_3 - 6*x_2)), B);

o4 : Ideal of S

i5 : minres = res J;

i6 : multigraded betti minres

        0             1               2         3
o6 = 0: 1             .               .         .
     2: .            ab               .         .
     3: . a3+a2b+ab2+b3               .         .
     4: .             . 2a3b+2a2b2+2ab3         .
     5: .             .               . a3b2+a2b3

o6 : MultigradedBettiTally

i7 : multigradedRegularity(X, J)

o7 = {{0, 2}, {1, 1}, {2, 0}}

o7 : List

i8 : vres = virtualOfPair(J, {{3,1}})

      1      3      2
o8 = S  <-- S  <-- S  <-- 0 <-- 0
                                 
     0      1      2      3     4

o8 : ChainComplex

i9 : multigraded betti vres

        0      1    2
o9 = 0: 1      .    .
     2: .     ab    .
     3: . a3+a2b    .
     4: .      . 2a3b

o9 : MultigradedBettiTally

i10 : 
