-- -*- M2-comint -*- hash: -1609301446

i1 : R = ZZ/101[x_0,x_1,x_2,x_3,x_4,Degrees=>{2:{1,0},3:{0,1}}];

i2 : B = intersect(ideal(x_0,x_1),ideal(x_2,x_3,x_4));

o2 : Ideal of R

i3 : I = ideal(x_0^2*x_2^2+x_1^2*x_3^2+x_0*x_1*x_4^2, x_0^3*x_4+x_1^3*(x_2+x_3));

o3 : Ideal of R

i4 : idealSheafGens(2,I,B)

              2 2    2 2        2   3      3      3
o4 = {ideal (x x  + x x  + x x x , x x  + x x  + x x )}
              0 2    1 3    0 1 4   1 2    1 3    0 4

o4 : List

i5 : 
