-- -*- M2-comint -*- hash: -1812733966

i1 : peek specificSlackMatrix "perles1"
(dimension, 8)

o1 = Matrix{cache => CacheTable{}                                                                                                                                                                                                                                                }
            RawMatrix => 0 0 0 .381966 .618034 .276393 0       0       0       0       0       0       0       .381966 .276393 .236068 .447214 .236068 .381966 .276393 .618034 0       0       0       0 0       0       0       0       0       0       0       0       0       
                         0 0 0 .618034 0       0       .618034 .381966 .276393 0       0       0       0       .236068 .447214 .381966 .276393 0       0       0       0       .276393 .236068 .381966 1 0       0       0       0       0       0       0       0       0       
                         0 0 0 0       0       0       .381966 0       0       .381966 .276393 0       0       .381966 .276393 0       0       .381966 .236068 0       0       .276393 0       0       0 .105573 1       0       0       0       0       0       0       0       
                         0 0 0 0       .381966 0       0       0       0       0       0       .276393 .381966 0       0       .381966 .276393 0       0       .276393 0       0       .381966 .236068 0 0       0       .381966 .618034 .105573 0       0       0       0       
                         0 0 0 0       0       0       0       .618034 0       .618034 0       .723607 0       0       0       0       0       0       0       0       0       .447214 .381966 0       0 .447214 0       1.61803 1       0       .276393 1.61803 .723607 0       
                         1 0 0 0       0       0       0       0       0       0       .723607 0       .618034 0       0       0       0       .381966 0       .447214 0       0       0       0       0 0       1.61803 0       0       .447214 0       0       0       .276393 
                         0 1 0 0       0       0       0       0       .723607 0       0       0       0       0       0       0       0       0       0       0       0       0       0       .381966 1 0       0       0       0       .447214 .276393 0       0       .447214 
                         0 0 1 0       0       .723607 0       0       0       0       0       0       0       0       0       0       0       0       .381966 0       1       0       0       0       0 .447214 0       0       0       0       .447214 1       .723607 .276393 
                         1 0 0 1       0       0       0       1       0       0       0       0       0       0       0       0       0       0       0       0       .618034 0       0       0       1 0       0       1       0       0       0       1.61803 .447214 0       
                         0 1 0 0       1       0       0       0       0       1       0       0       0       1       0       0       0       1       1       0       1       0       0       0       0 0       1.61803 1       .618034 0       0       1       0       0       
                         0 0 1 0       0       0       1       0       0       0       0       0       1       0       0       1       0       0       0       0       0       0       1       1       1 0       1       0       1       0       0       0       0       0       
                         0 0 0 0       0       1       0       0       1       0       1       1       0       0       1       0       1       0       0       1       0       1       0       0       0 1       0       0       0       1       1       0       1       1       

            ring => RR
                      53
                          12
            target => RR
                        53
                          34
            source => RR
                        53

i2 : peek specificSlackMatrix "perles2"
(dimension, 8)

o2 = Matrix{cache => CacheTable{}                                                                                                                                                                                                                                       }
            RawMatrix => 8.01592 12.3895 9.98459 0      0       0       10.0556  0       0       0      0       0       0       0       8.0552  0       0       0       0       0       0       0       0       0       6.08418 0       0       0       0       0       
                         0       2.61201 1.48343 0      0       5.88981 1.07692  0       .193124 0      4.22353 0       0       0       0       0       0       0       0       1.58198 0       0       1.77879 0       .979913 2.30656 1.3969  0       0       1.51872 
                         .776541 .320214 .93418  0      .972667 0       0        0       0       1.3495 3.31745 .293671 1.42587 1.77962 1.23085 1.06068 0       3.05166 1.28138 0       7.3186  .597798 1.3509  .954094 .985993 1.44624 0       3.7944  .306002 1.14899 
                         0       0       3.12332 5.5983 0       0       .786008  0       2.51556 0      4.62053 4.9376  0       0       0       0       3.24017 0       0       2.06082 0       0       0       0       0       0       1.79646 0       0       0       
                         0       0       0       0      5.43926 12.0634 0        0       0       0      0       0       10.2391 10.1162 0       5.54237 0       0       0       0       0       0       0       0       0       0       0       0       0       0       
                         0       0       0       0      0       0       .0815211 12.8553 2.10439 0      0       0       0       0       0       1.70477 2.77375 0       0       .158168 24.1704 0       0       0       0       0       1.78409 5.578   0       1.76326 
                         0       0       0       0      0       0       0        0       7.18693 6.3903 10.5164 13.8854 10.9342 0       0       0       0       0       5.3515  0       0       0       0       4.92949 0       10.4479 0       0       0       0       
                         0       0       0       0      0       0       0        0       0       0      0       9.19894 5.35682 9.20659 2.71395 3.69218 5.98608 0       5.33146 0       37.8997 5.1117  0       5.65514 0       0       0       13.2252 0       0       
                         0       0       0       0      0       0       0        0       0       0      0       0       0       0       0       0       0       18.4504 6.72194 8.19903 84.1558 7.90648 8.87031 0       0       0       0       0       0       0       
                         1.51133 6.2131  0       0      3.09631 0       0        20.5617 0       4.2602 0       0       0       0       0       0       0       9.11228 0       0       0       0       0       0       0       0       0       0       0       0       
                         0       0       0       0      0       0       0        0       0       0      0       0       0       0       0       0       0       0       0       0       0       0       0       9.6277  3.94992 11.1553 7.02255 24.8246 11.3839 7.56903 
                         1.6962  0       0       6.4017 2.49176 0       0        0       0       0      0       0       0       4.35916 0       0       0       6.81618 0       0       0       4.32106 0       0       0       0       0       0       .310109 0       

            ring => RR
                      53
                          12
            target => RR
                        53
                          30
            source => RR
                        53

i3 : peek specificSlackMatrix "barnette"
(dimension, 4)

o3 = Matrix{cache => CacheTable{}      }
            RawMatrix => 1 0 0 0 1 1 0 
                         1 0 0 0 0 1 1 
                         1 0 0 1 0 0 1 
                         1 0 0 1 1 0 0 
                         1 0 1 0 0 0 0 
                         0 1 0 0 1 1 0 
                         0 1 0 0 0 1 1 
                         0 1 0 1 0 0 1 
                         0 1 0 1 1 0 0 
                         0 1 1 0 0 0 0 

            ring => RR
                      53
                          7
            source => RR
                        53
                          10
            target => RR
                        53

i4 : peek specificSlackMatrix "toric-non-graphic"
(dimension, 5)

o4 = Matrix{cache => CacheTable{}        }
            RawMatrix => 0 1 1 0 0 0 0 1 
                         1 1 1 0 0 0 0 0 
                         0 0 1 1 0 0 0 0 
                         0 1 0 0 0 1 0 0 
                         1 0 1 0 0 0 1 0 
                         0 0 1 0 0 0 1 1 
                         0 0 0 0 0 1 1 0 
                         1 1 0 0 1 0 0 0 
                         0 1 0 0 1 0 0 1 
                         0 0 0 1 1 0 0 0 
                         0 0 0 0 1 0 1 1 
                         1 0 0 0 1 0 1 0 

            ring => RR
                      53
                          8
            source => RR
                        53
                          12
            target => RR
                        53

i5 : peek specificSlackMatrix "pu-non-mcmullen"
(dimension, 5)

o5 = Matrix{cache => CacheTable{}            }
            RawMatrix => 0 0 1 0 0 0 1 1 0 0 
                         1 1 1 0 0 0 0 0 0 0 
                         0 0 0 1 1 0 1 0 0 0 
                         0 1 0 1 0 0 0 0 0 1 
                         0 1 1 1 0 0 0 0 1 0 
                         1 0 0 0 1 1 0 0 0 0 
                         0 0 1 0 0 1 0 1 1 0 
                         0 0 0 0 0 1 0 1 0 1 
                         0 0 0 1 1 1 0 0 1 0 

            ring => RR
                      53
                          9
            target => RR
                        53
                          10
            source => RR
                        53

i6 : peek specificSlackMatrix "fano-matroid"
(dimension, 2)

o6 = Matrix{cache => CacheTable{}      }
            RawMatrix => 1 0 1 0 0 1 1 
                         0 0 1 1 1 1 0 
                         0 1 1 0 1 0 1 
                         1 1 1 1 0 0 0 
                         1 0 0 1 1 0 1 
                         1 1 0 0 1 1 0 
                         0 1 0 1 0 1 1 

                       ZZ 7
            source => (--)
                        2
                       ZZ 7
            target => (--)
                        2
                    ZZ
            ring => --
                     2

i7 : peek specificSlackMatrix "complex-matroid"
(dimension, 2)

o7 = Matrix{cache => CacheTable{}                                     }
            RawMatrix => 0  a 1 1    0    1  0   a-1 -a+1 a    1 0    
                         -a 0 1 a    0    0  1   -1  1    -1   0 -a+1 
                         1  0 a 0    -a+1 a  0   -a  1    0    1 1    
                         1  a a 0    0    1  a-1 0   0    1    1 a    
                         a  0 0 -a+1 -a+1 a  -a  0   -a+1 a    1 0    
                         0  1 0 0    a    -a a   1   a-1  -a+1 0 a    
                         0  1 1 1    1    0  1   0   1    0    1 1    
                         a  1 0 -a+1 1    0  0   1   0    1    1 a    

                       QQ[a]
            ring => ----------
                     2
                    a  - a + 1
                      /   QQ[a]  \8
            target => |----------|
                      | 2        |
                      \a  - a + 1/
                      /   QQ[a]  \12
            source => |----------|
                      | 2        |
                      \a  - a + 1/

i8 : peek specificSlackMatrix "nonfano-matroid"
(dimension, 2)

o8 = Matrix{cache => CacheTable{}                }
            RawMatrix => 1  0 1  0  0  1 1  1  1 
                         0  0 1  1  -1 1 2  0  0 
                         0  1 -1 0  1  0 -1 -1 1 
                         -1 1 -1 1  0  0 0  -2 0 
                         1  0 0  -1 1  0 -1 1  1 
                         1  1 0  0  1  1 0  0  2 
                         0  1 0  1  0  1 1  -1 1 

            ring => RR
                      53
                          7
            target => RR
                        53
                          9
            source => RR
                        53

i9 : peek specificSlackMatrix "perles-matroid"
(dimension, 2)

o9 = Matrix{cache => CacheTable{}                                                                                                                        }
            RawMatrix => 0        1        -2.61803 .381966  0        .381966  0 -1       1        .381966  1        -1.61803 -.618034 -.618034 0        
                         -4.23607 1        0        0        .381966  .381966  0 -.618034 .381966  -1.61803 0        -1.61803 0        -.618034 4.23607  
                         1        .381966  1        0        .381966  -.618034 1 0        0        .381966  -1.61803 1        .381966  0        0        
                         1        0        -.618034 -1.61803 -.618034 0        0 -.618034 -2.61803 1        .236068  0        .381966  0        -1       
                         -.618034 0        -.618034 -.618034 0        -1.61803 1 0        -.618034 0        .381966  -.618034 0        -.618034 -.618034 
                         -.618034 -1.61803 0        1        0        0        1 -.618034 0        -.618034 1        -1.61803 1        .381966  -.618034 
                         0        1        0        1        1        1        1 0        1        1        1        0        1        1        1        
                         0        0        .381966  -1.61803 1        -1.61803 1 1        0        -1.61803 0        -.618034 -.618034 -.618034 1        
                         0        1.38197  1        0        1        0        1 .381966  -1.61803 0        -1.61803 -1.61803 .381966  .381966  1        

            ring => RR
                      53
                          9
            target => RR
                        53
                          15
            source => RR
                        53

i10 : peek specificSlackMatrix "perles-matroid-QQ"
(dimension, 2)

o10 = Matrix{cache => CacheTable{}                                                                  }
             RawMatrix => 0    1    a-3  -a+3 0    -a+3 0 -1   1    -a+3 1     a-2  -a+2 -a+2 0     
                          2a-5 1    0    0    -a+3 -a+3 0 -a+2 -a+3 a-2  0     a-2  0    -a+2 -2a+5 
                          1    a    1    0    a    a-1  1 0    0    a    -a+1  1    a    0    0     
                          1    0    a-1  -a+1 a-1  0    0 a-1  -a   1    -2a+1 0    a    0    -1    
                          -a+2 0    -a+2 a-1  0    a-2  1 0    a-1  0    a     -a+2 0    a-1  a-1   
                          -a+2 -a+1 0    1    0    0    1 a-1  0    -a+2 1     -a+1 1    a    a-1   
                          0    1    0    1    1    1    1 0    1    1    1     0    1    1    1     
                          0    0    -a+3 a-2  1    a-2  1 1    0    a-2  0     -a+2 a-1  a-1  1     
                          0    a+1  1    0    1    0    1 a    -a+1 0    -a+1  -a+1 a    a    1     

                        QQ[a]
             ring => -----------
                      2
                     a  - 3a + 1
                       /   QQ[a]   \9
             target => |-----------|
                       | 2         |
                       \a  - 3a + 1/
                       /   QQ[a]   \15
             source => |-----------|
                       | 2         |
                       \a  - 3a + 1/

i11 : 
