-- -*- M2-comint -*- hash: 736061327

i1 : v = 6;

i2 : B = {{1, 2, 4}, {0, 2, 3}, {0, 1, 4}, {3, 4, 5}, {0, 1, 2}};

i3 : fillPl = symbolicSlackOfPlucker(v, B)

o3 = | -p_(0,1,2,4) 0           0            -p_(0,3,4,5) 0           |
     | 0            p_(0,1,2,3) 0            -p_(1,3,4,5) 0           |
     | 0            0           -p_(0,1,2,4) -p_(2,3,4,5) 0           |
     | -p_(1,2,3,4) 0           -p_(0,1,3,4) 0            p_(0,1,2,3) |
     | 0            p_(0,2,3,4) 0            0            p_(0,1,2,4) |
     | p_(1,2,4,5)  p_(0,2,3,5) p_(0,1,4,5)  0            p_(0,1,2,5) |

                                                                                                                                                                      6                                                                                                                                                                5
o3 : Matrix (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])  <--- (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])
                 0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5              0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5

i4 : V = {{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {1, 0, 1}, {1, 1, 0}};

i5 : B = {{1, 2, 4}, {0, 2, 3}, {0, 1, 4}, {3, 4, 5}, {0, 1, 2}};

i6 : fillPl = symbolicSlackOfPlucker(V, B)

o6 = | -p_(0,1,2,4) 0           0            -p_(0,3,4,5) 0           |
     | 0            p_(0,1,2,3) 0            -p_(1,3,4,5) 0           |
     | 0            0           -p_(0,1,2,4) -p_(2,3,4,5) 0           |
     | -p_(1,2,3,4) 0           -p_(0,1,3,4) 0            p_(0,1,2,3) |
     | 0            p_(0,2,3,4) 0            0            p_(0,1,2,4) |
     | p_(1,2,4,5)  p_(0,2,3,5) p_(0,1,4,5)  0            p_(0,1,2,5) |

                                                                                                                                                                      6                                                                                                                                                                5
o6 : Matrix (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])  <--- (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])
                 0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5              0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5

i7 : V = {{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {1, 0, 1}, {1, 1, 0}};

i8 : fillPl = symbolicSlackOfPlucker V

Input has been reordered to
{{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {1, 1, 0}, {0, 0, 1}, {1, 0, 1}}

o8 = | 0            -p_(0,1,3,5) 0            0           -p_(0,2,3,4) |
     | p_(0,1,2,4)  0            0            0           -p_(1,2,3,4) |
     | 0            p_(1,2,3,5)  -p_(0,1,2,4) 0           0            |
     | -p_(0,2,3,4) 0            -p_(0,1,3,4) p_(0,1,2,3) 0            |
     | 0            -p_(1,3,4,5) 0            p_(0,1,2,4) 0            |
     | p_(0,2,4,5)  0            p_(0,1,4,5)  p_(0,1,2,5) p_(2,3,4,5)  |

                                                                                                                                                                      6                                                                                                                                                                5
o8 : Matrix (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])  <--- (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])
                 0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5              0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5

i9 : V = {{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {1, 0, 1}, {1, 1, 0}};

i10 : B = {{1, 2, 4}, {0, 2, 3}, {0, 1, 4}, {3, 4, 5}, {0, 1, 2}};

i11 : fillPl = symbolicSlackOfPlucker(slackMatrix V, B)

Order of vertices is 
{{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {1, 1, 0}, {0, 0, 1}, {1, 0, 1}}

o11 = | -p_(0,1,2,4) 0           0            -p_(0,3,4,5) 0           |
      | 0            p_(0,1,2,3) 0            -p_(1,3,4,5) 0           |
      | 0            0           -p_(0,1,2,4) -p_(2,3,4,5) 0           |
      | -p_(1,2,3,4) 0           -p_(0,1,3,4) 0            p_(0,1,2,3) |
      | 0            p_(0,2,3,4) 0            0            p_(0,1,2,4) |
      | p_(1,2,4,5)  p_(0,2,3,5) p_(0,1,4,5)  0            p_(0,1,2,5) |

                                                                                                                                                                       6                                                                                                                                                                5
o11 : Matrix (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])  <--- (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])
                  0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5              0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5

i12 : V = {{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {1, 0, 1}, {1, 1, 0}};

i13 : fillPl = symbolicSlackOfPlucker(slackMatrix V)

Order of vertices is 
{{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {1, 1, 0}, {0, 0, 1}, {1, 0, 1}}

o13 = | 0            -p_(0,1,3,5) 0            0           -p_(0,2,3,4) |
      | p_(0,1,2,4)  0            0            0           -p_(1,2,3,4) |
      | 0            p_(1,2,3,5)  -p_(0,1,2,4) 0           0            |
      | -p_(0,2,3,4) 0            -p_(0,1,3,4) p_(0,1,2,3) 0            |
      | 0            -p_(1,3,4,5) 0            p_(0,1,2,4) 0            |
      | p_(0,2,4,5)  0            p_(0,1,4,5)  p_(0,1,2,5) p_(2,3,4,5)  |

                                                                                                                                                                       6                                                                                                                                                                5
o13 : Matrix (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])  <--- (QQ[p       ..p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       , p       ])
                  0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5              0,1,2,3   0,1,2,4   0,1,3,4   0,2,3,4   1,2,3,4   0,1,2,5   0,1,3,5   0,2,3,5   1,2,3,5   0,1,4,5   0,2,4,5   1,2,4,5   0,3,4,5   1,3,4,5   2,3,4,5

i14 : 
