-- -*- M2-comint -*- hash: -1173814906

i1 : R = ZZ/32003[a,b,c, d];

i2 : M = ideal (a^2, a*b, b^2);

o2 : Ideal of R

i3 : L = smallerMonomials M;

i4 : findWeightVector(M,L)

o4 = ({2, 2, 1, 1}, {1, 1, 2, 1, 1, 2, 2, 1, 1, 2, 1, 1, 2, 2, 1, 1, 2, 1, 1,
     ------------------------------------------------------------------------
     2, 2})

o4 : Sequence

i5 : M = ideal"ab"

o5 = ideal(a*b)

o5 : Ideal of R

i6 : L1 = standardMonomials M

        2   2             2                  2
o6 = {{a , b , a*c, b*c, c , a*d, b*d, c*d, d }}

o6 : List

i7 : findWeightVector(M,L1)

i8 : 
