-- -*- M2-comint -*- hash: 1661309731

i1 : R = ZZ/32003[a,b,c,d];

i2 : M = ideal (a^2, a*b, b^2)

             2        2
o2 = ideal (a , a*b, b )

o2 : Ideal of R

i3 : F = groebnerFamily M

             2                                      2              2       
o3 = ideal (a  + t a*c + t b*c + t a*d + t b*d + t c  + t c*d + t d , a*b +
                  1       2       4       5       3      6       7         
     ------------------------------------------------------------------------
                                           2                2   2           
     t a*c + t b*c + t  a*d + t  b*d + t  c  + t  c*d + t  d , b  + t  a*c +
      8       9       11       12       10      13       14          15     
     ------------------------------------------------------------------------
                                    2                2
     t  b*c + t  a*d + t  b*d + t  c  + t  c*d + t  d )
      16       18       19       17      20       21

                ZZ
o3 : Ideal of -----[t , t ..t , t  , t  ..t  , t  , t  ..t  , t ..t , t ..t , t ..t , t  ..t  , t  ..t  , t  ..t  ][a..d]
              32003  3   6   7   10   13   14   17   20   21   1   2   4   5   8   9   11   12   15   16   18   19

i4 : netList F_*

     +---------------------------------------------------------------+
     | 2                                      2              2       |
o4 = |a  + t a*c + t b*c + t a*d + t b*d + t c  + t c*d + t d        |
     |      1       2       4       5       3      6       7         |
     +---------------------------------------------------------------+
     |                                            2                2 |
     |a*b + t a*c + t b*c + t  a*d + t  b*d + t  c  + t  c*d + t  d  |
     |       8       9       11       12       10      13       14   |
     +---------------------------------------------------------------+
     | 2                                           2                2|
     |b  + t  a*c + t  b*c + t  a*d + t  b*d + t  c  + t  c*d + t  d |
     |      15       16       18       19       17      20       21  |
     +---------------------------------------------------------------+

i5 : U = ring F

o5 = U

o5 : PolynomialRing

i6 : T = coefficientRing U

o6 = T

o6 : PolynomialRing

i7 : gens T

o7 = {t , t , t , t  , t  , t  , t  , t  , t  , t , t , t , t , t , t , t  ,
       3   6   7   10   13   14   17   20   21   1   2   4   5   8   9   11 
     ------------------------------------------------------------------------
     t  , t  , t  , t  , t  }
      12   15   16   18   19

o7 : List

i8 : gens U

o8 = {a, b, c, d}

o8 : List

i9 : L = standardMonomials M

                  2                  2               2                  2  
o9 = {{a*c, b*c, c , a*d, b*d, c*d, d }, {a*c, b*c, c , a*d, b*d, c*d, d },
     ------------------------------------------------------------------------
                 2                  2
     {a*c, b*c, c , a*d, b*d, c*d, d }}

o9 : List

i10 : F2 = groebnerFamily (M, L)

              2                                      2              2       
o10 = ideal (a  + t a*c + t b*c + t a*d + t b*d + t c  + t c*d + t d , a*b +
                   1       2       4       5       3      6       7         
      -----------------------------------------------------------------------
                                            2                2   2           
      t a*c + t b*c + t  a*d + t  b*d + t  c  + t  c*d + t  d , b  + t  a*c +
       8       9       11       12       10      13       14          15     
      -----------------------------------------------------------------------
                                     2                2
      t  b*c + t  a*d + t  b*d + t  c  + t  c*d + t  d )
       16       18       19       17      20       21

                 ZZ
o10 : Ideal of -----[t , t ..t , t  , t  ..t  , t  , t  ..t  , t ..t , t ..t , t ..t , t  ..t  , t  ..t  , t  ..t  ][a..d]
               32003  3   6   7   10   13   14   17   20   21   1   2   4   5   8   9   11   12   15   16   18   19

i11 : kk = ZZ/101

o11 = kk

o11 : QuotientRing

i12 : E = kk[a,b,c,d,e,SkewCommutative => true]

o12 = E

o12 : PolynomialRing, 5 skew commutative variables

i13 : I = ideal(a*d,a*c,a*b,b*d*e,b*c*e,b*c*d)

o13 = ideal (a*d, a*c, a*b, b*d*e, b*c*e, b*c*d)

o13 : Ideal of E

i14 : F1 = groebnerFamily I

o14 = ideal (a*d + t b*d + t a*e + t c*d + t b*e + t c*e + t d*e, a*c + t b*c
                    1       3       2       4       5       6            7   
      -----------------------------------------------------------------------
      + t b*d + t  a*e + t c*d + t  b*e + t  c*e + t  d*e, a*b + t  b*c +
         8       10       9       11       12       13            14     
      -----------------------------------------------------------------------
      t  b*d + t  a*e + t  c*d + t  b*e + t  c*e + t  d*e, b*d*e + t  c*d*e,
       15       17       16       18       19       20              21      
      -----------------------------------------------------------------------
      b*c*e + t  c*d*e, b*c*d + t  c*d*e)
               22                23

o14 : Ideal of kk[t  ..t  , t ..t , t  ..t  , t  , t  , t , t , t , t  , t  ..t  , t  , t  , t , t , t ..t , t  , t  ..t  ][a..e]
                   19   20   5   6   12   13   16   18   2   4   9   11   14   15   17   23   1   3   7   8   10   21   22

i15 : netList F1_*

      +------------------------------------------------------------------+
o15 = |a*d + t b*d + t a*e + t c*d + t b*e + t c*e + t d*e               |
      |       1       3       2       4       5       6                  |
      +------------------------------------------------------------------+
      |a*c + t b*c + t b*d + t  a*e + t c*d + t  b*e + t  c*e + t  d*e   |
      |       7       8       10       9       11       12       13      |
      +------------------------------------------------------------------+
      |a*b + t  b*c + t  b*d + t  a*e + t  c*d + t  b*e + t  c*e + t  d*e|
      |       14       15       17       16       18       19       20   |
      +------------------------------------------------------------------+
      |b*d*e + t  c*d*e                                                  |
      |         21                                                       |
      +------------------------------------------------------------------+
      |b*c*e + t  c*d*e                                                  |
      |         22                                                       |
      +------------------------------------------------------------------+
      |b*c*d + t  c*d*e                                                  |
      |         23                                                       |
      +------------------------------------------------------------------+

i16 : F2 = groebnerFamily(I, AllStandard => true)

o16 = ideal (a*d + t a*e + t b*c + t b*d + t c*d + t b*e + t c*e + t d*e, a*c
                    4       1       2       3       5       6       7        
      -----------------------------------------------------------------------
      + t  a*e + t b*c + t b*d + t  c*d + t  b*e + t  c*e + t  d*e, a*b +
         11       8       9       10       12       13       14          
      -----------------------------------------------------------------------
      t  a*e + t  b*c + t  b*d + t  c*d + t  b*e + t  c*e + t  d*e, b*d*e +
       18       15       16       17       19       20       21            
      -----------------------------------------------------------------------
      t  c*d*e, b*c*e + t  c*d*e, b*c*d + t  c*d*e)
       22                23                24

o16 : Ideal of kk[t  ..t  , t ..t , t  ..t  , t  , t  , t , t , t  , t  , t  ..t  , t  , t  , t ..t , t ..t , t , t  , t  ..t  ][a..e]
                   20   21   6   7   13   14   17   19   3   5   10   12   15   16   18   24   1   2   8   9   4   11   22   23

i17 : netList F2_*

      +------------------------------------------------------------------+
o17 = |a*d + t a*e + t b*c + t b*d + t c*d + t b*e + t c*e + t d*e       |
      |       4       1       2       3       5       6       7          |
      +------------------------------------------------------------------+
      |a*c + t  a*e + t b*c + t b*d + t  c*d + t  b*e + t  c*e + t  d*e  |
      |       11       8       9       10       12       13       14     |
      +------------------------------------------------------------------+
      |a*b + t  a*e + t  b*c + t  b*d + t  c*d + t  b*e + t  c*e + t  d*e|
      |       18       15       16       17       19       20       21   |
      +------------------------------------------------------------------+
      |b*d*e + t  c*d*e                                                  |
      |         22                                                       |
      +------------------------------------------------------------------+
      |b*c*e + t  c*d*e                                                  |
      |         23                                                       |
      +------------------------------------------------------------------+
      |b*c*d + t  c*d*e                                                  |
      |         24                                                       |
      +------------------------------------------------------------------+

i18 : J2 = trim groebnerStratum F2

                                                                            
o18 = ideal (t   + t  t  + t  t   - t t  t   + t  t   - t t  t  , t  - t   +
              14    24 9    10 11    9 11 22    12 23    8 11 23   7    13  
      -----------------------------------------------------------------------
                                                                           
      t  t  - t  t  + t  t  + t t   + t  t   - t t t   - t t  t   + t t   -
       24 2    24 8    10 4    3 11    12 22    9 4 22    2 11 22    5 23  
      -----------------------------------------------------------------------
                                                                            
      t t t   - t t  t  , t  + t  t  - t t  - t t   + t t t   + t t t  , t  
       8 4 23    1 11 23   6    24 1    3 4    5 22    2 4 22    1 4 23   21
      -----------------------------------------------------------------------
                                                                             
      + t  t   - t  t   + t  t   + t  t   - t  t t   + t  t t   + t  t  t   -
         10 18    10 24    16 24    17 11    18 9 22    24 9 22    10 11 22  
      -----------------------------------------------------------------------
                        2                                            
      t  t  t   - t t  t   - t  t   + t  t   - t  t t   - t  t  t   +
       16 11 22    9 11 22    13 23    19 23    18 8 23    15 11 23  
      -----------------------------------------------------------------------
                                                                            
      t  t  t   - t t  t  t  , t   - t t   + t t   + t  t   - t  t  + t  t  
       12 22 23    8 11 22 23   20    3 18    3 24    15 24    17 4    13 22
      -----------------------------------------------------------------------
                                                                       
      - t  t   + t  t t   - t  t t   + t  t t   - t  t t   + t  t t   -
         19 22    18 2 22    24 2 22    24 8 22    10 4 22    16 4 22  
      -----------------------------------------------------------------------
                     2         2          2                                 
      t t  t   - t  t   + t t t   + t t  t   + t  t t   - t  t t   + t t t  
       3 11 22    12 22    9 4 22    2 11 22    18 1 23    24 1 23    3 4 23
      -----------------------------------------------------------------------
                                                                2           
      + t  t t   - t t t  t   + t t t  t   + t t  t  t   - t t t  , t  t   -
         15 4 23    2 4 22 23    8 4 22 23    1 11 22 23    1 4 23   17 18  
      -----------------------------------------------------------------------
                                                                          
      t  t   + t  t  t   - t  t  t   - t  t  t   + t  t  t   + t  t  t   -
       17 24    10 18 22    16 18 22    10 24 22    16 24 22    17 11 22  
      -----------------------------------------------------------------------
            2          2           2           2          3              
      t  t t   + t  t t   + t  t  t   - t  t  t   - t t  t   - t t  t   -
       18 9 22    24 9 22    10 11 22    16 11 22    9 11 22    3 18 23  
      -----------------------------------------------------------------------
                                                                             
      t  t  t   + t t  t   + t  t  t   - t  t t   + t  t t  t   - t  t t  t  
       15 18 23    3 24 23    15 24 23    17 4 23    18 2 22 23    24 2 22 23
      -----------------------------------------------------------------------
                                                                             
      - t  t t  t   + t  t t  t   - t  t t  t   + t  t t  t   - t t  t  t   -
         18 8 22 23    24 8 22 23    10 4 22 23    16 4 22 23    3 11 22 23  
      -----------------------------------------------------------------------
                          2             2             2             2   
      t  t  t  t   + t t t  t   + t t  t  t   - t t  t  t   + t  t t   -
       15 11 22 23    9 4 22 23    2 11 22 23    8 11 22 23    18 1 23  
      -----------------------------------------------------------------------
            2         2          2            2            2             2   
      t  t t   + t t t   + t  t t   - t t t  t   + t t t  t   + t t  t  t   -
       24 1 23    3 4 23    15 4 23    2 4 22 23    8 4 22 23    1 11 22 23  
      -----------------------------------------------------------------------
           3                                                        
      t t t  , t  t   - t  t t  - t  t t   + t  t  t   - t  t  t   -
       1 4 23   17 12    17 9 4    17 8 11    10 12 22    12 16 22  
      -----------------------------------------------------------------------
                                                                  2   
      t  t t t   + t  t t t   - t  t t  t   + t  t t  t   - t  t t   +
       10 9 4 22    16 9 4 22    10 8 11 22    16 8 11 22    12 9 22  
      -----------------------------------------------------------------------
       2   2            2                                                   
      t t t   + t t t  t   - t t  t   - t  t  t   + t t t t   + t  t t t   +
       9 4 22    8 9 11 22    3 12 23    12 15 23    3 9 4 23    15 9 4 23  
      -----------------------------------------------------------------------
                                                                           
      t t t  t   + t  t t  t   + t  t t  t   - t  t t  t   - t t t t  t   +
       3 8 11 23    15 8 11 23    12 2 22 23    12 8 22 23    2 9 4 22 23  
      -----------------------------------------------------------------------
                                      2                  2           2   
      t t t t  t   - t t t  t  t   + t t  t  t   + t  t t   - t t t t   -
       8 9 4 22 23    2 8 11 22 23    8 11 22 23    12 1 23    1 9 4 23  
      -----------------------------------------------------------------------
              2                                                     
      t t t  t  , t  t  - t  t t  - t  t t   + t t  t   - t t  t   -
       1 8 11 23   17 5    17 2 4    17 1 11    5 10 22    5 16 22  
      -----------------------------------------------------------------------
                                                                 2   
      t  t t t   + t  t t t   - t  t t  t   + t  t t  t   - t t t   +
       10 2 4 22    16 2 4 22    10 1 11 22    16 1 11 22    5 9 22  
      -----------------------------------------------------------------------
             2            2                                                 
      t t t t   + t t t  t   - t t t   - t t  t   + t t t t   + t  t t t   +
       2 9 4 22    1 9 11 22    3 5 23    5 15 23    3 2 4 23    15 2 4 23  
      -----------------------------------------------------------------------
                                                            2          
      t t t  t   + t  t t  t   + t t t  t   - t t t  t   - t t t  t   +
       3 1 11 23    15 1 11 23    5 2 22 23    5 8 22 23    2 4 22 23  
      -----------------------------------------------------------------------
                                                          2           2   
      t t t t  t   - t t t  t  t   + t t t  t  t   + t t t   - t t t t   -
       2 8 4 22 23    1 2 11 22 23    1 8 11 22 23    5 1 23    1 2 4 23  
      -----------------------------------------------------------------------
       2    2                                                               
      t t  t  , t  t   - t  t   + t  t  t  - t  t  t  + t  t  t  + t  t  t  
       1 11 23   13 17    17 19    17 24 8    17 10 4    17 16 4    17 15 11
      -----------------------------------------------------------------------
                                                                     
      + t  t  t   - t  t  t   - t  t  t   + t  t  t   + t  t  t t   -
         13 10 22    19 10 22    13 16 22    19 16 22    10 24 8 22  
      -----------------------------------------------------------------------
                     2                         2                       
      t  t  t t   - t  t t   + 2t  t  t t   - t  t t   + t  t  t  t   -
       16 24 8 22    10 4 22     10 16 4 22    16 4 22    10 15 11 22  
      -----------------------------------------------------------------------
                                         2          2            2   
      t  t  t  t   - t  t t  t   - t  t t   + t  t t   - t  t t t   +
       15 16 11 22    17 8 11 22    13 9 22    19 9 22    24 8 9 22  
      -----------------------------------------------------------------------
              2            2             2             2             2   
      t  t t t   - t  t t t   - t  t t  t   + t  t t  t   - t  t t  t   +
       10 9 4 22    16 9 4 22    10 8 11 22    16 8 11 22    15 9 11 22  
      -----------------------------------------------------------------------
              3                                                              
      t t t  t   - t  t t   + t  t t   - t  t  t   + t  t  t   - t t  t t   -
       8 9 11 22    13 3 23    19 3 23    13 15 23    19 15 23    3 24 8 23  
      -----------------------------------------------------------------------
                                                                         
      t  t  t t   + t t  t t   + t  t  t t   - t t  t t   - t  t  t t   +
       15 24 8 23    3 10 4 23    10 15 4 23    3 16 4 23    15 16 4 23  
      -----------------------------------------------------------------------
                                  2                                     
      t  t t t   - t t  t  t   - t  t  t   + t  t t  t   - t  t t  t   -
       17 8 4 23    3 15 11 23    15 11 23    13 2 22 23    19 2 22 23  
      -----------------------------------------------------------------------
                                                      2                      
      t  t t  t   + t  t t  t   + t  t t t  t   - t  t t  t   - t  t t t  t  
       13 8 22 23    19 8 22 23    24 2 8 22 23    24 8 22 23    10 2 4 22 23
      -----------------------------------------------------------------------
                                                                          
      + t  t t t  t   + 2t  t t t  t   - 2t  t t t  t   + t  t t  t  t   +
         16 2 4 22 23     10 8 4 22 23     16 8 4 22 23    15 2 11 22 23  
      -----------------------------------------------------------------------
                             2               2        2    2             2   
      t t t  t  t   - t t t t  t   - t t t  t  t   + t t  t  t   + t  t t   -
       3 8 11 22 23    8 9 4 22 23    2 8 11 22 23    8 11 22 23    13 1 23  
      -----------------------------------------------------------------------
            2            2            2            2           2   
      t  t t   + t  t t t   - t  t t t   + t  t t t   - t t t t   -
       19 1 23    24 1 8 23    10 1 4 23    16 1 4 23    3 8 4 23  
      -----------------------------------------------------------------------
              2             2              2     2      2               2   
      t  t t t   + t  t t  t   + t t t t  t   - t t t  t   - t t t  t  t   +
       15 8 4 23    15 1 11 23    2 8 4 22 23    8 4 22 23    1 8 11 22 23  
      -----------------------------------------------------------------------
             3
      t t t t  )
       1 8 4 23

o18 : Ideal of kk[t  ..t  , t ..t , t  ..t  , t  , t  , t , t , t  , t  , t  ..t  , t  , t  , t ..t , t ..t , t , t  , t  ..t  ]
                   20   21   6   7   13   14   17   19   3   5   10   12   15   16   18   24   1   2   8   9   4   11   22   23

i19 : C2 = decompose J2

                                         2                               
o19 = {ideal (t   + t  t   - t  t   - t t   - t t   - t  t   + t t  t   -
               17    10 22    16 22    9 22    3 23    15 23    2 22 23  
      -----------------------------------------------------------------------
                    2                                                       
      t t  t   + t t  , t   + t  t  + t  t   - t t  t   + t  t   - t t  t  ,
       8 22 23    1 23   14    24 9    10 11    9 11 22    12 23    8 11 23 
      -----------------------------------------------------------------------
                                                                            
      t  - t   + t  t  - t  t  + t  t  + t t   + t  t   - t t t   - t t  t  
       7    13    24 2    24 8    10 4    3 11    12 22    9 4 22    2 11 22
      -----------------------------------------------------------------------
                                                                         
      + t t   - t t t   - t t  t  , t  + t  t  - t t  - t t   + t t t   +
         5 23    8 4 23    1 11 23   6    24 1    3 4    5 22    2 4 22  
      -----------------------------------------------------------------------
                                                                            
      t t t  , t   + t  t   - t  t   + t  t   - t  t t   + t  t t   - t  t  
       1 4 23   21    10 18    10 24    16 24    18 9 22    24 9 22    13 23
      -----------------------------------------------------------------------
                                                                       2  
      + t  t   - t  t t   + t t  t   + t  t  t   - t t  t  t   - t t  t  ,
         19 23    18 8 23    3 11 23    12 22 23    2 11 22 23    1 11 23 
      -----------------------------------------------------------------------
                                                                            
      t   - t t   + t t   + t  t   + t  t   - t  t   + t  t t   - t  t t   +
       20    3 18    3 24    15 24    13 22    19 22    18 2 22    24 2 22  
      -----------------------------------------------------------------------
                                2          2
      t  t t   - t t  t   - t  t   + t t  t   + t  t t   - t  t t   +
       24 8 22    3 11 22    12 22    2 11 22    18 1 23    24 1 23  
      -----------------------------------------------------------------------
      t t  t  t  ), ideal (t   - t   + t  t   - t t  , t   - t t  - t t  , t 
       1 11 22 23           18    24    11 22    4 23   12    9 4    8 11   5
      -----------------------------------------------------------------------
      - t t  - t t  , t   + t  t  + t  t   - t t  t   + t t t  , t   - t   +
         2 4    1 11   14    24 9    10 11    9 11 22    9 4 23   13    19  
      -----------------------------------------------------------------------
      t  t  - t  t  + t  t  + t  t   - t t  t   + t t t  , t  - t   + t  t  +
       24 8    10 4    16 4    15 11    8 11 22    8 4 23   7    19    24 2  
      -----------------------------------------------------------------------
      t  t  + t t   + t  t   - t t  t   + t t t  , t  + t  t  - t t  -
       16 4    3 11    15 11    2 11 22    2 4 23   6    24 1    3 4  
      -----------------------------------------------------------------------
      t t  t   + t t t  , t   + t  t   + t  t   - t  t  t   + t  t t  , t   +
       1 11 22    1 4 23   21    16 24    17 11    16 11 22    16 4 23   20  
      -----------------------------------------------------------------------
      t  t   - t  t  - t  t  t   + t  t t  )}
       15 24    17 4    15 11 22    15 4 23

o19 : List

i20 : netList C2_0_*

      +--------------------------------------------------------------------------------------------------------------------------------------------------+
      |                           2                                              2                                                                       |
o20 = |t   + t  t   - t  t   - t t   - t t   - t  t   + t t  t   - t t  t   + t t                                                                        |
      | 17    10 22    16 22    9 22    3 23    15 23    2 22 23    8 22 23    1 23                                                                      |
      +--------------------------------------------------------------------------------------------------------------------------------------------------+
      |t   + t  t  + t  t   - t t  t   + t  t   - t t  t                                                                                                 |
      | 14    24 9    10 11    9 11 22    12 23    8 11 23                                                                                               |
      +--------------------------------------------------------------------------------------------------------------------------------------------------+
      |t  - t   + t  t  - t  t  + t  t  + t t   + t  t   - t t t   - t t  t   + t t   - t t t   - t t  t                                                 |
      | 7    13    24 2    24 8    10 4    3 11    12 22    9 4 22    2 11 22    5 23    8 4 23    1 11 23                                               |
      +--------------------------------------------------------------------------------------------------------------------------------------------------+
      |t  + t  t  - t t  - t t   + t t t   + t t t                                                                                                       |
      | 6    24 1    3 4    5 22    2 4 22    1 4 23                                                                                                     |
      +--------------------------------------------------------------------------------------------------------------------------------------------------+
      |                                                                                                                               2                  |
      |t   + t  t   - t  t   + t  t   - t  t t   + t  t t   - t  t   + t  t   - t  t t   + t t  t   + t  t  t   - t t  t  t   - t t  t                   |
      | 21    10 18    10 24    16 24    18 9 22    24 9 22    13 23    19 23    18 8 23    3 11 23    12 22 23    2 11 22 23    1 11 23                 |
      +--------------------------------------------------------------------------------------------------------------------------------------------------+
      |                                                                                                 2          2                                     |
      |t   - t t   + t t   + t  t   + t  t   - t  t   + t  t t   - t  t t   + t  t t   - t t  t   - t  t   + t t  t   + t  t t   - t  t t   + t t  t  t  |
      | 20    3 18    3 24    15 24    13 22    19 22    18 2 22    24 2 22    24 8 22    3 11 22    12 22    2 11 22    18 1 23    24 1 23    1 11 22 23|
      +--------------------------------------------------------------------------------------------------------------------------------------------------+

i21 : netList C2_1_*

      +---------------------------------------------------------------+
o21 = |t   - t   + t  t   - t t                                       |
      | 18    24    11 22    4 23                                     |
      +---------------------------------------------------------------+
      |t   - t t  - t t                                               |
      | 12    9 4    8 11                                             |
      +---------------------------------------------------------------+
      |t  - t t  - t t                                                |
      | 5    2 4    1 11                                              |
      +---------------------------------------------------------------+
      |t   + t  t  + t  t   - t t  t   + t t t                        |
      | 14    24 9    10 11    9 11 22    9 4 23                      |
      +---------------------------------------------------------------+
      |t   - t   + t  t  - t  t  + t  t  + t  t   - t t  t   + t t t  |
      | 13    19    24 8    10 4    16 4    15 11    8 11 22    8 4 23|
      +---------------------------------------------------------------+
      |t  - t   + t  t  + t  t  + t t   + t  t   - t t  t   + t t t   |
      | 7    19    24 2    16 4    3 11    15 11    2 11 22    2 4 23 |
      +---------------------------------------------------------------+
      |t  + t  t  - t t  - t t  t   + t t t                           |
      | 6    24 1    3 4    1 11 22    1 4 23                         |
      +---------------------------------------------------------------+
      |t   + t  t   + t  t   - t  t  t   + t  t t                     |
      | 21    16 24    17 11    16 11 22    16 4 23                   |
      +---------------------------------------------------------------+
      |t   + t  t   - t  t  - t  t  t   + t  t t                      |
      | 20    15 24    17 4    15 11 22    15 4 23                    |
      +---------------------------------------------------------------+

i22 : 
