-- -*- M2-comint -*- hash: 1648293091

i1 : kk = ZZ/101;

i2 : S = kk[a..f];

i3 : I = minors(2, genericSymmetricMatrix(S, 3))

               2                                                  2         
o3 = ideal (- b  + a*d, - b*c + a*e, - c*d + b*e, - b*c + a*e, - c  + a*f, -
     ------------------------------------------------------------------------
                                             2
     c*e + b*f, - c*d + b*e, - c*e + b*f, - e  + d*f)

o3 : Ideal of S

i4 : pts = randomPointsOnRationalVariety(I, 4)

o4 = {| -25 20 -30 -16 24 -36 |, | 19 -29 19 23 -29 19 |, | -44 46 -8 7 -10
     ------------------------------------------------------------------------
     -29 |, | 8 41 -24 46 -22 -29 |}

o4 : List

i5 : for p in pts list sub(I, p) == 0

o5 = {true, true, true, true}

o5 : List

i6 : S = kk[a..d];

i7 : F = groebnerFamily ideal"a2,ab,ac,b2"

             2                      2                      2               
o7 = ideal (a  + t b*c + t a*d + t c  + t b*d + t c*d + t d , a*b + t b*c +
                  1       3       2      4       5       6           7     
     ------------------------------------------------------------------------
                2                         2                              2  
     t a*d + t c  + t  b*d + t  c*d + t  d , a*c + t  b*c + t  a*d + t  c  +
      9       8      10       11       12           13       15       14    
     ------------------------------------------------------------------------
                           2   2                         2                  
     t  b*d + t  c*d + t  d , b  + t  b*c + t  a*d + t  c  + t  b*d + t  c*d
      16       17       18          19       21       20      22       23   
     ------------------------------------------------------------------------
           2
     + t  d )
        24

o7 : Ideal of kk[t , t , t  , t , t , t  , t  , t  , t , t , t , t  , t  , t  , t , t , t  , t  , t  , t  , t  , t  , t  , t  ][a..d]
                  6   5   12   2   4   11   18   24   1   3   8   10   17   23   7   9   14   16   20   22   13   15   19   21

i8 : J = groebnerStratum F;

o8 : Ideal of kk[t , t , t  , t , t , t  , t  , t  , t , t , t , t  , t  , t  , t , t , t  , t  , t  , t  , t  , t  , t  , t  ]
                  6   5   12   2   4   11   18   24   1   3   8   10   17   23   7   9   14   16   20   22   13   15   19   21

i9 : compsJ = decompose J;

i10 : compsJ = compsJ/trim;

i11 : #compsJ == 2

o11 = true

i12 : compsJ/dim

o12 = {11, 8}

o12 : List

i13 : netList randomPointsOnRationalVariety(compsJ_0, 10)

      +----------------------------------------------------------------------------------------+
o13 = || -6 -26 42 -37 -23 28 29 -18 -3 -16 5 23 34 19 -32 -13 -38 15 -18 21 -39 -47 39 -43 |  |
      +----------------------------------------------------------------------------------------+
      || 14 -34 -33 9 27 11 32 41 4 -28 15 -36 2 16 -21 -48 -15 -20 -34 38 45 22 -47 -47 |     |
      +----------------------------------------------------------------------------------------+
      || 32 35 11 -9 -27 15 0 -12 7 19 24 7 15 -23 28 -11 47 -40 -17 7 43 39 -16 48 |          |
      +----------------------------------------------------------------------------------------+
      || -49 -8 -5 -45 -36 -5 47 -21 -34 35 -25 32 33 40 35 1 36 1 -28 -38 46 11 11 -3 |       |
      +----------------------------------------------------------------------------------------+
      || 35 14 -9 -22 -14 19 -10 48 23 -47 50 9 2 29 -37 -13 22 2 -37 -7 15 -47 -23 -10 |      |
      +----------------------------------------------------------------------------------------+
      || 35 -49 -37 32 -48 42 -10 -49 42 -18 -34 25 -22 32 -35 24 30 -15 -20 27 -32 -9 39 -30 ||
      +----------------------------------------------------------------------------------------+
      || -29 -40 30 -5 36 -41 -24 1 34 -15 20 -33 33 -49 -14 -20 -48 21 17 0 -19 -33 39 44 |   |
      +----------------------------------------------------------------------------------------+
      || -28 27 38 13 36 38 0 35 12 36 -33 -24 4 13 -35 -11 -39 34 -49 -39 22 -26 9 -8 |       |
      +----------------------------------------------------------------------------------------+
      || 8 -20 1 -28 27 -39 40 0 -38 -8 44 -44 -22 -30 -28 -6 43 50 -28 -3 16 41 36 35 |       |
      +----------------------------------------------------------------------------------------+
      || -12 -11 18 -43 28 44 44 5 -12 -35 19 -50 3 -31 3 -49 -9 -50 -41 40 -2 25 6 -13 |      |
      +----------------------------------------------------------------------------------------+

i14 : netList randomPointsOnRationalVariety(compsJ_1, 10)

      +-------------------------------------------------------------------------------------+
o14 = || 38 -31 49 39 4 46 -29 -5 -39 -40 14 -11 -31 46 43 -26 4 30 -35 27 -40 37 -47 0 |   |
      +-------------------------------------------------------------------------------------+
      || -1 -5 -10 -10 -11 42 6 46 -4 47 42 -40 47 -27 -20 49 -39 -31 -37 -29 -48 30 -48 0 ||
      +-------------------------------------------------------------------------------------+
      || 29 18 20 1 18 26 -31 -45 -21 10 22 -30 10 32 -31 -21 -49 28 -22 46 1 40 -18 0 |    |
      +-------------------------------------------------------------------------------------+
      || -17 3 17 -9 -36 -45 49 30 -45 24 -28 41 8 -4 -26 -28 7 30 -41 -17 -13 3 13 0 |     |
      +-------------------------------------------------------------------------------------+
      || 37 33 -47 -20 -49 45 29 19 41 13 -38 44 23 40 -48 45 8 -29 42 -46 49 -18 30 0 |    |
      +-------------------------------------------------------------------------------------+
      || -9 -3 -26 13 35 49 -8 49 -40 13 -20 9 27 5 -8 -15 -28 15 -18 -16 -46 12 18 0 |     |
      +-------------------------------------------------------------------------------------+
      || 28 32 0 0 -17 -44 25 42 7 -35 29 -17 19 8 -9 -26 -21 23 20 -23 44 -39 -37 0 |      |
      +-------------------------------------------------------------------------------------+
      || -30 -29 27 14 17 39 33 15 -35 50 -50 45 -33 13 24 -44 0 -47 -9 47 -28 6 -28 0 |    |
      +-------------------------------------------------------------------------------------+
      || 7 -12 42 -29 30 1 3 -28 -7 36 -26 -40 42 38 -20 -23 28 -29 -28 5 -37 -33 26 0 |    |
      +-------------------------------------------------------------------------------------+
      || 28 -10 13 -39 -20 11 13 -13 -37 8 -36 -29 -29 17 24 -50 44 30 -13 22 5 -20 4 0 |   |
      +-------------------------------------------------------------------------------------+

i15 : 
