-- -*- M2-comint -*- hash: -716485749

i1 : R = ZZ/32003[a..d];

i2 : M = ideal (a^2, b^2, a*b*c);

o2 : Ideal of R

i3 : L1 = smallerMonomials M

                       2                  2               2                
o3 = {{a*b, a*c, b*c, c , a*d, b*d, c*d, d }, {a*c, b*c, c , a*d, b*d, c*d,
     ------------------------------------------------------------------------
      2       2     2   3                        2      2     2     2   3
     d }, {a*c , b*c , c , a*b*d, a*c*d, b*c*d, c d, a*d , b*d , c*d , d }}

o3 : List

i4 : smallerMonomials(M, b^2)

                 2                  2
o4 = {a*c, b*c, c , a*d, b*d, c*d, d }

o4 : List

i5 : 
