-- -*- M2-comint -*- hash: -579150132

i1 : R = ZZ/32003[a..d];

i2 : M = ideal (a^2, a*b, b^3, a*c);

o2 : Ideal of R

i3 : L1 = standardMonomials M

        2        2                  2     2        2                  2  
o3 = {{b , b*c, c , a*d, b*d, c*d, d }, {b , b*c, c , a*d, b*d, c*d, d },
     ------------------------------------------------------------------------
       2      2   3   2           2      2     2     2   3     2        2 
     {b c, b*c , c , b d, b*c*d, c d, a*d , b*d , c*d , d }, {b , b*c, c ,
     ------------------------------------------------------------------------
                     2
     a*d, b*d, c*d, d }}

o3 : List

i4 : standardMonomials({3}, M)

       2      2   3   2           2      2     2     2   3
o4 = {b c, b*c , c , b d, b*c*d, c d, a*d , b*d , c*d , d }

o4 : List

i5 : standardMonomials(2, M)

       2        2                  2
o5 = {b , b*c, c , a*d, b*d, c*d, d }

o5 : List

i6 : 
