-- -*- M2-comint -*- hash: -2053324831

i1 : R = ZZ/32003[a..d];

i2 : M = ideal (a^2, b^2, a*b*c);

o2 : Ideal of R

i3 : tailMonomials M

                       2                  2               2                
o3 = {{a*b, a*c, b*c, c , a*d, b*d, c*d, d }, {a*c, b*c, c , a*d, b*d, c*d,
     ------------------------------------------------------------------------
      2       2     2   3                        2      2     2     2   3
     d }, {a*c , b*c , c , a*b*d, a*c*d, b*c*d, c d, a*d , b*d , c*d , d }}

o3 : List

i4 : tailMonomials(M, AllStandard => true)

                       2                  2                    2           
o4 = {{a*b, a*c, b*c, c , a*d, b*d, c*d, d }, {a*b, a*c, b*c, c , a*d, b*d,
     ------------------------------------------------------------------------
           2       2     2   3                        2      2     2     2 
     c*d, d }, {a*c , b*c , c , a*b*d, a*c*d, b*c*d, c d, a*d , b*d , c*d ,
     ------------------------------------------------------------------------
      3
     d }}

o4 : List

i5 : tailMonomials(M, b^2)

                 2                  2
o5 = {a*c, b*c, c , a*d, b*d, c*d, d }

o5 : List

i6 : tailMonomials(M, b^2, AllStandard=>true)

                      2                  2
o6 = {a*b, a*c, b*c, c , a*d, b*d, c*d, d }

o6 : List

i7 : 
