-- -*- M2-comint -*- hash: -1081555277

i1 : Gr24 = generalizedFlagVariety("A",3,{2})

o1 = a "GKM variety" with an action of a 4-dimensional torus

o1 : GKMVariety

i2 : peek Gr24

o2 = GKMVariety{cache => CacheTable{...2...}                                                                     }
                characterRing => ZZ[T ..T ]
                                     0   3
                charts => HashTable{{set {0, 1}} => {{0, -1, 1, 0}, {0, -1, 0, 1}, {-1, 0, 1, 0}, {-1, 0, 0, 1}}}
                                    {set {0, 2}} => {{0, 1, -1, 0}, {0, 0, -1, 1}, {-1, 1, 0, 0}, {-1, 0, 0, 1}}
                                    {set {0, 3}} => {{0, 1, 0, -1}, {0, 0, 1, -1}, {-1, 1, 0, 0}, {-1, 0, 1, 0}}
                                    {set {1, 2}} => {{1, 0, -1, 0}, {1, -1, 0, 0}, {0, 0, -1, 1}, {0, -1, 0, 1}}
                                    {set {1, 3}} => {{1, 0, 0, -1}, {1, -1, 0, 0}, {0, 0, 1, -1}, {0, -1, 1, 0}}
                                    {set {2, 3}} => {{1, 0, 0, -1}, {1, 0, -1, 0}, {0, 1, 0, -1}, {0, 1, -1, 0}}
                momentGraph => a "moment graph" on 6 vertices with 12 edges 
                points => {{set {0, 1}}, {set {0, 2}}, {set {0, 3}}, {set {1, 2}}, {set {1, 3}}, {set {2, 3}}}

i3 : G = momentGraph Gr24

o3 = a "moment graph" on 6 vertices with 12 edges 

o3 : MomentGraph

i4 : underlyingGraph G

o4 = Graph{{set {0, 1}} => {{set {0, 2}}, {set {0, 3}}, {set {1, 2}}, {set {1, 3}}}}
           {set {0, 2}} => {{set {0, 1}}, {set {0, 3}}, {set {1, 2}}, {set {2, 3}}}
           {set {0, 3}} => {{set {0, 1}}, {set {0, 2}}, {set {1, 3}}, {set {2, 3}}}
           {set {1, 2}} => {{set {0, 1}}, {set {0, 2}}, {set {1, 3}}, {set {2, 3}}}
           {set {1, 3}} => {{set {0, 1}}, {set {0, 3}}, {set {1, 2}}, {set {2, 3}}}
           {set {2, 3}} => {{set {0, 2}}, {set {0, 3}}, {set {1, 2}}, {set {1, 3}}}

o4 : Graph

i5 : O1 = ampleKClass Gr24 --the O(1) bundle on Gr24 via its PlÃ¼cker embedding

o5 = an "equivariant K-class" on a GKM variety 

o5 : KClass

i6 : euler O1

o6 = T T  + T T  + T T  + T T  + T T  + T T
      0 1    0 2    0 3    1 2    1 3    2 3

o6 : ZZ[T ..T ]
         0   3

i7 : euler (O1^2)

      2 2    2        2        2 2    2        2 2      2        2          2
o7 = T T  + T T T  + T T T  + T T  + T T T  + T T  + T T T  + T T T  + T T T 
      0 1    0 1 2    0 1 3    0 2    0 2 3    0 3    0 1 2    0 1 3    0 1 2
     ------------------------------------------------------------------------
                        2      2          2    2 2    2        2 2      2    
     + 2T T T T  + T T T  + T T T  + T T T  + T T  + T T T  + T T  + T T T  +
         0 1 2 3    0 1 3    0 2 3    0 2 3    1 2    1 2 3    1 3    1 2 3  
     ------------------------------------------------------------------------
          2    2 2
     T T T  + T T
      1 2 3    2 3

o7 : ZZ[T ..T ]
         0   3

i8 : P1 =  bruhatOrder Gr24

o8 = P1

o8 : Poset

i9 : Sch = generalizedSchubertVariety(Gr24,{set{1,2}})

o9 = a "GKM variety" with an action of a 4-dimensional torus

o9 : GKMVariety

i10 : P2 = bruhatOrder Sch

o10 = P2

o10 : Poset

i11 : Fl4 = generalizedFlagVariety("A",3,{1,2,3},Gr24.characterRing) --Fl(4) with the torus having the same character ring as Gr24

o11 = a "GKM variety" with an action of a 4-dimensional torus

o11 : GKMVariety

i12 : f = flagMap(Fl4,Gr24)

o12 = an "equivariant map" of GKM varieties 

o12 : EquivariantMap

i13 : Fl4 === f.source and Gr24 === f.target

o13 = true

i14 : (trivialKClass Gr24) === (pushforward f)(trivialKClass Fl4)

o14 = true

i15 : SpGr26 = generalizedFlagVariety("C",3,{2})

o15 = a "GKM variety" with an action of a 3-dimensional torus

o15 : GKMVariety

i16 : peek SpGr26

o16 = GKMVariety{cache => CacheTable{...2...}                                                                                                                                                                  }
                 characterRing => ZZ[T ..T ]
                                      0   2
                 charts => HashTable{{set {0*, 1*}} => {{1, 0, 1}, {1, 0, -1}, {0, 1, 1}, {0, 1, -1}, {1, 1, 0}, {2, 0, 0}, {0, 2, 0}}      }
                                     {set {0*, 1}} => {{1, 0, 1}, {1, 0, -1}, {0, -1, 1}, {0, -1, -1}, {2, 0, 0}, {1, -1, 0}, {0, -2, 0}}
                                     {set {0*, 2*}} => {{1, 1, 0}, {1, -1, 0}, {1, 0, 1}, {2, 0, 0}, {0, 0, 2}, {0, 1, 1}, {0, -1, 1}}
                                     {set {0*, 2}} => {{1, 1, 0}, {1, -1, 0}, {2, 0, 0}, {1, 0, -1}, {0, 0, -2}, {0, 1, -1}, {0, -1, -1}}
                                     {set {0, 1*}} => {{-1, 0, 1}, {-1, 0, -1}, {0, 1, 1}, {0, 1, -1}, {0, 2, 0}, {-1, 1, 0}, {-2, 0, 0}}
                                     {set {0, 1}} => {{-1, 0, 1}, {-1, 0, -1}, {0, -1, 1}, {0, -1, -1}, {0, -2, 0}, {-2, 0, 0}, {-1, -1, 0}}
                                     {set {0, 2*}} => {{-1, 1, 0}, {-1, -1, 0}, {0, 0, 2}, {-1, 0, 1}, {-2, 0, 0}, {0, 1, 1}, {0, -1, 1}}
                                     {set {0, 2}} => {{-1, 1, 0}, {-1, -1, 0}, {0, 0, -2}, {-2, 0, 0}, {-1, 0, -1}, {0, 1, -1}, {0, -1, -1}}
                                     {set {1*, 2*}} => {{0, 1, 1}, {0, 2, 0}, {0, 0, 2}, {1, 1, 0}, {-1, 1, 0}, {1, 0, 1}, {-1, 0, 1}}
                                     {set {1*, 2}} => {{0, 2, 0}, {0, 1, -1}, {0, 0, -2}, {1, 1, 0}, {-1, 1, 0}, {1, 0, -1}, {-1, 0, -1}}
                                     {set {1, 2*}} => {{0, 0, 2}, {0, -1, 1}, {0, -2, 0}, {1, -1, 0}, {-1, -1, 0}, {1, 0, 1}, {-1, 0, 1}}
                                     {set {1, 2}} => {{0, 0, -2}, {0, -2, 0}, {0, -1, -1}, {1, -1, 0}, {-1, -1, 0}, {1, 0, -1}, {-1, 0, -1}}
                 momentGraph => a "moment graph" on 12 vertices with 42 edges 
                 points => {{set {1, 2}}, {set {1, 2*}}, {set {1*, 2}}, {set {1*, 2*}}, {set {0, 2}}, {set {0, 2*}}, {set {0*, 2}}, {set {0*, 2*}}, {set {0, 1}}, {set {0, 1*}}, {set {0*, 1}}, {set {0*, 1*}}}

i17 : momentGraph SpGr26

o17 = a "moment graph" on 12 vertices with 42 edges 

o17 : MomentGraph

i18 : euler ampleKClass SpGr26

                              -1      -1      -1        -1      -1      -1  
o18 = T T  + T T  + T T  + T T   + T T   + T T   + 2 + T  T  + T  T  + T  T 
       0 1    0 2    1 2    0 2     0 1     1 2         1  2    0  1    0  2
      -----------------------------------------------------------------------
         -1 -1    -1 -1    -1 -1
      + T  T   + T  T   + T  T
         1  2     0  2     0  1

o18 : ZZ[T ..T ]
          0   2

i19 : SOGr25 = generalizedFlagVariety("B",2,{2,2}) --inputing {2} instead of {2,2} results in error: spin groups not implemented yet

o19 = a "GKM variety" with an action of a 2-dimensional torus

o19 : GKMVariety

i20 : peek SOGr25

o20 = GKMVariety{cache => CacheTable{...2...}                                          }
                 characterRing => ZZ[T ..T ]
                                      0   1
                 charts => HashTable{{set {0*, 1*}} => {{1, 1}, {1, 0}, {0, 1}}  }
                                     {set {0*, 1}} => {{1, 0}, {1, -1}, {0, -1}}
                                     {set {0, 1*}} => {{0, 1}, {-1, 1}, {-1, 0}}
                                     {set {0, 1}} => {{0, -1}, {-1, 0}, {-1, -1}}
                 momentGraph => a "moment graph" on 4 vertices with 6 edges 
                 points => {{set {0, 1}}, {set {0, 1*}}, {set {0*, 1}}, {set {0*, 1*}}}

i21 : euler ampleKClass SOGr25

                          -1        -1      -1    -1    -1 -1
o21 = T T  + T  + T  + T T   + 2 + T  T  + T   + T   + T  T
       0 1    0    1    0 1         0  1    1     0     0  1

o21 : ZZ[T ..T ]
          0   1

i22 : SOGr38 = generalizedFlagVariety("D",4,{3,4})

o22 = a "GKM variety" with an action of a 4-dimensional torus

o22 : GKMVariety

i23 : SOGr38.points

o23 = {{set {1, 2, 3}}, {set {1, 2, 3*}}, {set {1, 2*, 3}}, {set {1, 2*,
      -----------------------------------------------------------------------
      3*}}, {set {1*, 2, 3}}, {set {1*, 2, 3*}}, {set {1*, 2*, 3}}, {set {1*,
      -----------------------------------------------------------------------
      2*, 3*}}, {set {0, 2, 3}}, {set {0, 2, 3*}}, {set {0, 2*, 3}}, {set {0,
      -----------------------------------------------------------------------
      2*, 3*}}, {set {0*, 2, 3}}, {set {0*, 2, 3*}}, {set {0*, 2*, 3}}, {set
      -----------------------------------------------------------------------
      {0*, 2*, 3*}}, {set {0, 1, 3}}, {set {0, 1, 3*}}, {set {0, 1*, 3}},
      -----------------------------------------------------------------------
      {set {0, 1*, 3*}}, {set {0*, 1, 3}}, {set {0*, 1, 3*}}, {set {0*, 1*,
      -----------------------------------------------------------------------
      3}}, {set {0*, 1*, 3*}}, {set {0, 1, 2}}, {set {0, 1, 2*}}, {set {0,
      -----------------------------------------------------------------------
      1*, 2}}, {set {0, 1*, 2*}}, {set {0*, 1, 2}}, {set {0*, 1, 2*}}, {set
      -----------------------------------------------------------------------
      {0*, 1*, 2}}, {set {0*, 1*, 2*}}}

o23 : List

i24 : SOGr48odd = generalizedFlagVariety("D",4,{3,3})

o24 = a "GKM variety" with an action of a 4-dimensional torus

o24 : GKMVariety

i25 : SOGr48odd.points

o25 = {{set {0*, 1, 2, 3}}, {set {0*, 1, 2*, 3*}}, {set {0*, 1*, 2, 3*}},
      -----------------------------------------------------------------------
      {set {0*, 1*, 2*, 3}}, {set {0, 1, 2, 3*}}, {set {0, 1, 2*, 3}}, {set
      -----------------------------------------------------------------------
      {0, 1*, 2, 3}}, {set {0, 1*, 2*, 3*}}}

o25 : List

i26 : SOGr48even = generalizedFlagVariety("D",4,{4,4})

o26 = a "GKM variety" with an action of a 4-dimensional torus

o26 : GKMVariety

i27 : SOGr48even.points

o27 = {{set {0, 1, 2, 3}}, {set {0, 1, 2*, 3*}}, {set {0, 1*, 2, 3*}}, {set
      -----------------------------------------------------------------------
      {0, 1*, 2*, 3}}, {set {0*, 1, 2, 3*}}, {set {0*, 1, 2*, 3}}, {set {0*,
      -----------------------------------------------------------------------
      1*, 2, 3}}, {set {0*, 1*, 2*, 3*}}}

o27 : List

i28 : 
