-- -*- M2-comint -*- hash: 1241011558

i1 : FF1 = hirzebruchSurface 1;

i2 : X = makeGKMVariety FF1;

i3 : peek FF1

o3 = NormalToricVariety{cache => CacheTable{...6...}              }
                        max => {{0, 1}, {0, 3}, {1, 2}, {2, 3}}
                        rays => {{1, 0}, {0, 1}, {-1, 1}, {0, -1}}

i4 : peek X

o4 = GKMVariety{cache => CacheTable{...1...}                               }
                characterRing => ZZ[T ..T ]
                                     0   1
                charts => HashTable{{0, 1} => {{-1, 0}, {0, -1}}}
                                    {0, 3} => {{-1, 0}, {0, 1}}
                                    {1, 2} => {{-1, -1}, {1, 0}}
                                    {2, 3} => {{1, 0}, {1, 1}}
                momentGraph => a "moment graph" on 4 vertices with 4 edges 
                points => {{0, 1}, {0, 3}, {1, 2}, {2, 3}}

i5 : Y = normalToricVariety(X); -- X defined in the previous example above

i6 : Y === FF1

o6 = true

i7 : antiK = - toricDivisor(FF1) -- the anti-canonical class on FF1

o7 = FF1  + FF1  + FF1  + FF1
        0      1      2      3

o7 : ToricDivisor on FF1

i8 : TantiK = makeKClass(X,antiK)

o8 = an "equivariant K-class" on a GKM variety 

o8 : KClass

i9 : isWellDefined TantiK

o9 = true

i10 : euler TantiK

                          -1        -1    -1    -1 -1    -2 -1
o10 = T T  + T  + T  + T T   + 1 + T   + T   + T  T   + T  T
       0 1    0    1    0 1         1     0     0  1     0  1

o10 : ZZ[T ..T ]
          0   1

i11 : X = makeGKMVariety toricProjectiveSpace 2; -- the torus is C^2

i12 : Y = projectiveSpace 2; -- the torus is C^3

i13 : peek X

o13 = GKMVariety{cache => CacheTable{...1...}                               }
                 characterRing => ZZ[T ..T ]
                                      0   1
                 charts => HashTable{{0, 1} => {{0, 1}, {-1, 1}} }
                                     {0, 2} => {{1, 0}, {1, -1}}
                                     {1, 2} => {{-1, 0}, {0, -1}}
                 momentGraph => a "moment graph" on 3 vertices with 3 edges 
                 points => {{0, 1}, {0, 2}, {1, 2}}

i14 : peek Y

o14 = GKMVariety{cache => CacheTable{...1...}                               }
                 characterRing => ZZ[T ..T ]
                                      0   2
                 charts => HashTable{set {0} => {{-1, 1, 0}, {-1, 0, 1}}}
                                     set {1} => {{1, -1, 0}, {0, -1, 1}}
                                     set {2} => {{1, 0, -1}, {0, 1, -1}}
                 momentGraph => a "moment graph" on 3 vertices with 3 edges 
                 points => {set {0}, set {1}, set {2}}

i15 : 
