-- -*- M2-comint -*- hash: -1783752501

i1 : R = makeCharacterRing 2;

i2 : X = projectiveSpace(1,R);

i3 : Y = generalizedFlagVariety("C",2,{2},R);

i4 : Z = X ** Y;

i5 : peek Z

o5 = GKMVariety{cache => CacheTable{}                                                                                                                                                                                                     }
                characterRing => R
                charts => HashTable{(set {0}, {set {0*, 1*}}) => {{-1, 1}, {1, 1}, {2, 0}, {0, 2}}  }
                                    (set {0}, {set {0*, 1}}) => {{-1, 1}, {2, 0}, {1, -1}, {0, -2}}
                                    (set {0}, {set {0, 1*}}) => {{-1, 1}, {0, 2}, {-1, 1}, {-2, 0}}
                                    (set {0}, {set {0, 1}}) => {{-1, 1}, {0, -2}, {-2, 0}, {-1, -1}}
                                    (set {1}, {set {0*, 1*}}) => {{1, -1}, {1, 1}, {2, 0}, {0, 2}}
                                    (set {1}, {set {0*, 1}}) => {{1, -1}, {2, 0}, {1, -1}, {0, -2}}
                                    (set {1}, {set {0, 1*}}) => {{1, -1}, {0, 2}, {-1, 1}, {-2, 0}}
                                    (set {1}, {set {0, 1}}) => {{1, -1}, {0, -2}, {-2, 0}, {-1, -1}}
                points => {(set {0}, {set {0, 1*}}), (set {0}, {set {0, 1}}), (set {1}, {set {0*, 1*}}), (set {1}, {set {0*, 1}}), (set {0}, {set {0*, 1}}), (set {0}, {set {0*, 1*}}), (set {1}, {set {0, 1*}}), (set {1}, {set {0, 1}})}

i6 : G = momentGraph X;

i7 : H = momentGraph Y;

i8 : momentGraph(Z, G** H);

i9 : peek Z

o9 = GKMVariety{cache => CacheTable{}                                                                                                                                                                                                     }
                characterRing => R
                charts => HashTable{(set {0}, {set {0*, 1*}}) => {{-1, 1}, {1, 1}, {2, 0}, {0, 2}}  }
                                    (set {0}, {set {0*, 1}}) => {{-1, 1}, {2, 0}, {1, -1}, {0, -2}}
                                    (set {0}, {set {0, 1*}}) => {{-1, 1}, {0, 2}, {-1, 1}, {-2, 0}}
                                    (set {0}, {set {0, 1}}) => {{-1, 1}, {0, -2}, {-2, 0}, {-1, -1}}
                                    (set {1}, {set {0*, 1*}}) => {{1, -1}, {1, 1}, {2, 0}, {0, 2}}
                                    (set {1}, {set {0*, 1}}) => {{1, -1}, {2, 0}, {1, -1}, {0, -2}}
                                    (set {1}, {set {0, 1*}}) => {{1, -1}, {0, 2}, {-1, 1}, {-2, 0}}
                                    (set {1}, {set {0, 1}}) => {{1, -1}, {0, -2}, {-2, 0}, {-1, -1}}
                momentGraph => a "moment graph" on 8 vertices with 17 edges 
                points => {(set {0}, {set {0, 1*}}), (set {0}, {set {0, 1}}), (set {1}, {set {0*, 1*}}), (set {1}, {set {0*, 1}}), (set {0}, {set {0*, 1}}), (set {0}, {set {0*, 1*}}), (set {1}, {set {0, 1*}}), (set {1}, {set {0, 1}})}

i10 : 
      
      
