-- -*- M2-comint -*- hash: -778102849

i1 : R = makeCharacterRing 4;

i2 : X = generalizedFlagVariety("A",3,{1,2,3},R);

i3 : Y = generalizedFlagVariety("A",3,{2,3},R);

i4 : Z = generalizedFlagVariety("A",3,{2},R);

i5 : f = flagMap(X,Y); --the projection of Fl(1,2,3;4) onto Fl(2,3;4)

i6 : g = flagMap(Y,Z); --the projection of Fl(2,3;4) onto Gr(2;4)

i7 : h = compose(g,f)

o7 = an "equivariant map" of GKM varieties 

o7 : EquivariantMap

i8 : h === flagMap(X,Z)

o8 = true

i9 : 
     
