-- -*- M2-comint -*- hash: -1202598222

i1 : R = makeCharacterRing 4

o1 = R

o1 : PolynomialRing

i2 : X = makeGKMVariety({set{0},set{1},set{2},set{3}},R)

o2 = a "GKM variety" with an action of a 4-dimensional torus

o2 : GKMVariety

i3 : X.?momentGraph

o3 = false

i4 : PP3 = projectiveSpace 3

o4 = a "GKM variety" with an action of a 4-dimensional torus

o4 : GKMVariety

i5 : G = momentGraph PP3

o5 = a "moment graph" on 4 vertices with 6 edges 

o5 : MomentGraph

i6 : momentGraph(X,G)

i7 : X.?momentGraph

o7 = true

i8 : momentGraph X

o8 = a "moment graph" on 4 vertices with 6 edges 

o8 : MomentGraph

i9 : momentGraph(X,G)
 warning: overwriting a previously defined moment graph on this GKM variety 

i10 : 
