-- -*- M2-comint -*- hash: 1895149582

i1 : P = divisorPoset 12;

i2 : HP = hibiIdeal P

o2 = monomialIdeal (x x x x x x , x x x x x y , x x x x y y , x x x x y y ,
                     0 1 2 3 4 5   0 1 2 3 4 5   0 1 2 4 3 5   0 1 2 3 4 5 
     ------------------------------------------------------------------------
     x x x y y y , x x x y y y , x x y y y y , x x y y y y , x y y y y y ,
      0 1 3 2 4 5   0 1 2 3 4 5   0 2 1 3 4 5   0 1 2 3 4 5   0 1 2 3 4 5 
     ------------------------------------------------------------------------
     y y y y y y )
      0 1 2 3 4 5

o2 : MonomialIdeal of QQ[x ..x , y ..y ]
                          0   5   0   5

i3 : betti res HP

            0  1  2 3
o3 = total: 1 10 12 3
         0: 1  .  . .
         1: .  .  . .
         2: .  .  . .
         3: .  .  . .
         4: .  .  . .
         5: . 10 12 3

o3 : BettiTally

i4 : betti res (HP^2)

            0  1   2  3  4 5
o4 = total: 1 50 100 66 16 1
         0: 1  .   .  .  . .
         1: .  .   .  .  . .
         2: .  .   .  .  . .
         3: .  .   .  .  . .
         4: .  .   .  .  . .
         5: .  .   .  .  . .
         6: .  .   .  .  . .
         7: .  .   .  .  . .
         8: .  .   .  .  . .
         9: .  .   .  .  . .
        10: .  .   .  .  . .
        11: . 50 100 66 16 1

o4 : BettiTally

i5 : betti res (HP^3)

            0   1   2   3   4  5 6
o5 = total: 1 175 450 425 180 33 2
         0: 1   .   .   .   .  . .
         1: .   .   .   .   .  . .
         2: .   .   .   .   .  . .
         3: .   .   .   .   .  . .
         4: .   .   .   .   .  . .
         5: .   .   .   .   .  . .
         6: .   .   .   .   .  . .
         7: .   .   .   .   .  . .
         8: .   .   .   .   .  . .
         9: .   .   .   .   .  . .
        10: .   .   .   .   .  . .
        11: .   .   .   .   .  . .
        12: .   .   .   .   .  . .
        13: .   .   .   .   .  . .
        14: .   .   .   .   .  . .
        15: .   .   .   .   .  . .
        16: .   .   .   .   .  . .
        17: . 175 450 425 180 33 2

o5 : BettiTally

i6 : pdim module HP

o6 = 2

i7 : dilworthNumber P

o7 = 2

i8 : LP = distributiveLattice P;

i9 : cvrs = partition(last, coveringRelations LP);

i10 : iCvrs = tally apply(keys cvrs, i -> #cvrs#i);

i11 : gk = prepend(1, apply(sort keys iCvrs, k -> iCvrs#k))

o11 = {1, 6, 3}

o11 : List

i12 : apply(#gk, i -> sum(i..<#gk, j -> binomial(j, i) * gk_j))

o12 = {10, 12, 3}

o12 : List

i13 : 
