-- -*- M2-comint -*- hash: -1875261872

i1 : n = 3;

i2 : B = booleanLattice n;

i3 : C2 = chain 2;

i4 : C = product(n, i -> C2);

i5 : areIsomorphic(B, C)

o5 = true

i6 : P = {2, 3, 5, 7, 11, 13, 17, 19};

i7 : D = divisorPoset product take(P, n);

i8 : areIsomorphic(B, D)

o8 = true

i9 : R = QQ[x_1..x_n];

i10 : I = monomialIdeal apply(R_*, x -> x^2);

o10 : MonomialIdeal of R

i11 : M = standardMonomialPoset I;

i12 : areIsomorphic(B, M)

o12 = true

i13 : 
