-- -*- M2-comint -*- hash: -504018694

i1 : n = 4;

i2 : isUpperSemilattice chain n

o2 = true

i3 : B = booleanLattice n;

i4 : isUpperSemilattice B

o4 = true

i5 : isUpperSemilattice flagPoset(B, {1,2,3})

o5 = false

i6 : B' = flagPoset(B, {1,2,3,4});

i7 : isLattice B'

o7 = false

i8 : isUpperSemilattice B'

o8 = true

i9 : 
