-- -*- M2-comint -*- hash: 1870530232

i1 : n = 4;

i2 : isLowerSemilattice chain n

o2 = true

i3 : B = booleanLattice n;

i4 : isLowerSemilattice B

o4 = true

i5 : isLowerSemilattice flagPoset(B, {1,2,3})

o5 = false

i6 : B' = flagPoset(B, {0,1,2,3});

i7 : isLattice B'

o7 = false

i8 : isLowerSemilattice B'

o8 = true

i9 : 
