-- -*- M2-comint -*- hash: 526429609

i1 : P = poset {{1, 2}, {1, 3}, {1, 4}, {2, 5}, {3, 5}, {4, 5}};

i2 : isLattice P

o2 = true

i3 : isAtomic P

o3 = true

i4 : isAtomic booleanLattice 4

o4 = true

i5 : Q = poset {{1, 2}, {1, 3}, {2, 4}, {2, 5}, {3, 4}, {4, 6}, {5, 6}};

i6 : isLattice Q

o6 = true

i7 : isAtomic Q

o7 = false

i8 : isAtomic chain 5

o8 = false

i9 : 
