-- -*- M2-comint -*- hash: 207973672

i1 : G = {a,b,c,d};

i2 : R = {{a,b}, {a,c}, {c,d}};

i3 : P = poset(G, R)

o3 = P

o3 : Poset

i4 : poset {{1,2},{2,3},{3,4}}

o4 = Relation Matrix: | 1 1 1 1 |
                      | 0 1 1 1 |
                      | 0 0 1 1 |
                      | 0 0 0 1 |

o4 : Poset

i5 : cmp = (a,b) -> b % a == 0;

i6 : G = toList(1..10);

i7 : P = poset(G, cmp)

o7 = P

o7 : Poset

i8 : S = QQ[x,y,z];

i9 : G = {x^2, x*y, z^2, x^2*y*z, x*y*z^3, x^2*y^2*z^3};

i10 : R = flatten for g in G list for h in G list if h %g == 0 then {g,h} else continue;

i11 : M = matrix apply(G, g -> apply(G, h -> if h %g == 0 then 1 else 0));

               6        6
o11 : Matrix ZZ  <--- ZZ

i12 : P = poset(G, R, M)

o12 = P

o12 : Poset

i13 : 
