-- -*- M2-comint -*- hash: 659068275

i1 : c = 2

o1 = 2

i2 : S = ZZ/32003[x_0..x_(c-1),a_(0,0)..a_(c-1,c-1)];

i3 : A = genericMatrix(S,a_(0,0),c,c);

             2       2
o3 : Matrix S  <--- S

i4 : f = matrix{{x_0..x_(c-1)}}*map(S^{c:-1},S^{c:-2},A)

o4 = | x_0a_(0,0)+x_1a_(0,1) x_0a_(1,0)+x_1a_(1,1) |

             1       2
o4 : Matrix S  <--- S

i5 : R = S/ideal f;

i6 : kR = R^1/ideal(x_0..x_(c-1))

o6 = cokernel | x_0 x_1 |

                            1
o6 : R-module, quotient of R

i7 : MF = matrixFactorization(f,highSyzygy kR)

o7 = {{2} | a_(0,0) -a_(0,1) a_(1,0) -a_(1,1) |, {3} | x_0  a_(0,1) 0   
      {2} | x_1     x_0      0       0        |  {3} | -x_1 a_(0,0) 0   
      {2} | 0       0        x_1     x_0      |  {3} | 0    0       x_0 
                                                 {3} | 0    0       -x_1
     ------------------------------------------------------------------------
     a_(1,1) 0       |, {2} | 0 0 1 |}
     a_(1,0) 0       |  {2} | 0 1 0 |
     a_(0,1) a_(1,1) |  {2} | 1 0 0 |
     a_(0,0) a_(1,0) |

o7 : List

i8 : netList BRanks MF

     +-+-+
o8 = |2|2|
     +-+-+
     |1|2|
     +-+-+

i9 : netList dMaps MF

     +-----------------------------------------+
o9 = |{2} | a_(0,0) -a_(0,1) |                 |
     |{2} | x_1     x_0      |                 |
     +-----------------------------------------+
     |{2} | a_(0,0) -a_(0,1) a_(1,0) -a_(1,1) ||
     |{2} | x_1     x_0      0       0        ||
     |{2} | 0       0        x_1     x_0      ||
     +-----------------------------------------+

i10 : netList bMaps MF

      +------------------------+
o10 = |{2} | a_(0,0) -a_(0,1) ||
      |{2} | x_1     x_0      ||
      +------------------------+
      |{2} | x_1 x_0 |         |
      +------------------------+

i11 : netList psiMaps MF

      +------------------------+
o11 = |{2} | a_(1,0) -a_(1,1) ||
      |{2} | 0       0        ||
      +------------------------+

i12 : 
