-- -*- M2-comint -*- hash: 338279384

i1 : setRandomSeed 100

o1 = 100

i2 : S = ZZ/101[a,b,c,d];

i3 : f = map(S^1, S^4, (i,j) -> S_j^3)

o3 = | a3 b3 c3 d3 |

             1       4
o3 : Matrix S  <--- S

i4 : R = S/ideal f;

i5 : M = R^1/ideal"ab2+cd2";

i6 : betti (F = res(M, LengthLimit => 5))

            0 1 2  3  4  5
o6 = total: 1 1 5 16 35 64
         0: 1 . .  .  .  .
         1: . . .  .  .  .
         2: . 1 .  .  .  .
         3: . . 1  .  .  .
         4: . . 3  8  5  .
         5: . . 1  8 25 32
         6: . . .  .  5 32

o6 : BettiTally

i7 : E = ExtModuleData M;

i8 : E_2

o8 = 2

i9 : E_3

o9 = 1

i10 : r = max(2*E_2,2*E_3+1)

o10 = 4

i11 : Er = ExtModuleData coker F.dd_r;

i12 : regularity Er_0

o12 = 0

i13 : regularity Er_1

o13 = 0

i14 : regularity evenExtModule(coker F.dd_(r-1))

o14 = 1

i15 : ff = f*random(source f, source f);

              1       4
o15 : Matrix S  <--- S

i16 : matrixFactorization(ff, coker F.dd_(r+1));

i17 : 
