-- -*- M2-comint -*- hash: 186209047

i1 : setRandomSeed 0

o1 = 0

i2 : S = ZZ/101[a,b,c,d];

i3 : ff1 = matrix"a3,b3,c3,d3";

             1       4
o3 : Matrix S  <--- S

i4 : ff =ff1*random(source ff1, source ff1);

             1       4
o4 : Matrix S  <--- S

i5 : R = S/ideal ff;

i6 : M = highSyzygy (R^1/ideal"a2b2");

i7 : complexity M

o7 = 2

i8 : mf = matrixFactorization (ff, M)

o8 = {{7} | -a -36b 0 a |, {8} | 35a2  48b  0     -33b 0     |, {6} | 0   36
      {6} | b2 a2   0 0 |  {8} | -35b2 -35a 0     0    0     |  {7} | -36 0 
      {7} | 0  0    b a |  {8} | 0     0    33b2  33a  -33b2 |  {7} | 1   0 
                           {8} | 0     0    -43a2 -33b 0     |
     ------------------------------------------------------------------------
     0  |}
     36 |
     0  |

o8 : List

i9 : complexity mf

o9 = 2

i10 : betti res (R^1/ideal"a2b2", LengthLimit=>10)

             0 1 2 3 4 5 6 7 8 9 10
o10 = total: 1 1 2 3 4 5 6 7 8 9 10
          0: 1 . . . . . . . . .  .
          1: . . . . . . . . . .  .
          2: . . . . . . . . . .  .
          3: . 1 2 1 . . . . . .  .
          4: . . . 2 4 2 . . . .  .
          5: . . . . . 3 6 3 . .  .
          6: . . . . . . . 4 8 4  .
          7: . . . . . . . . . 5 10

o10 : BettiTally

i11 : 
