-- -*- M2-comint -*- hash: 481967005

i1 : S = ZZ/101[a,b,c];

i2 : R = S/ideal"a3,b3,c3";

i3 : M = module ideal vars R;

i4 : betti presentation M

            0 1
o4 = total: 3 6
         1: 3 3
         2: . 3

o4 : BettiTally

i5 : betti (F = cosyzygyRes(3,M))

            0 1 2 3 4
o5 = total: 3 1 1 3 6
        -7: 3 1 . . .
        -6: . . . . .
        -5: . . . . .
        -4: . . . . .
        -3: . . . . .
        -2: . . 1 3 3
        -1: . . . . 3

o5 : BettiTally

i6 : cosyzygyRes M

      1      1      3      6
o6 = R  <-- R  <-- R  <-- R
                           
     0      1      2      3

o6 : ChainComplex

i7 : 
