-- -*- M2-comint -*- hash: -2028397737

i1 : kk= ZZ/101

o1 = kk

o1 : QuotientRing

i2 : S = kk[x,y,z]

o2 = S

o2 : PolynomialRing

i3 : I2 = ideal"x3,yz"

             3
o3 = ideal (x , y*z)

o3 : Ideal of S

i4 : R2 = S/I2

o4 = R2

o4 : QuotientRing

i5 : M2 = R2^1/ideal"x2,y,z"

o5 = cokernel | x2 y z |

                              1
o5 : R2-module, quotient of R2

i6 : betti res (M2, LengthLimit =>10)

            0 1 2 3 4  5  6  7  8  9 10
o6 = total: 1 3 5 7 9 11 13 15 17 19 21
         0: 1 2 2 2 2  2  2  2  2  2  2
         1: . 1 3 4 4  4  4  4  4  4  4
         2: . . . 1 3  4  4  4  4  4  4
         3: . . . . .  1  3  4  4  4  4
         4: . . . . .  .  .  1  3  4  4
         5: . . . . .  .  .  .  .  1  3

o6 : BettiTally

i7 : E = ExtModule M2

                 8
o7 = (kk[X ..X ])
          0   1

o7 : kk[X ..X ]-module, free, degrees {0..1, 2:1, 3:2, 3}
         0   1

i8 : apply(toList(0..10), i->hilbertFunction(i, E))

o8 = {1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21}

o8 : List

i9 : Eeven = evenExtModule M2

                 4
o9 = (kk[X ..X ])
          0   1

o9 : kk[X ..X ]-module, free, degrees {0..1, 2:1}
         0   1

i10 : apply(toList(0..5), i->hilbertFunction(i, Eeven))

o10 = {1, 5, 9, 13, 17, 21}

o10 : List

i11 : 
