-- -*- M2-comint -*- hash: -689124005

i1 : kk = ZZ/101;

i2 : S = kk[a,b,c];

i3 : ff = matrix{{a^4, b^4,c^4}};

             1       3
o3 : Matrix S  <--- S

i4 : R = S/ideal ff;

i5 : Ops = kk[x_1,x_2,x_3];

i6 : MM = Ops^1/(x_1*ideal(x_2^2,x_3));

i7 : N = moduleAsExt(MM,R);

i8 : betti res( N, LengthLimit => 10)

             0  1  2  3  4  5  6  7  8  9 10
o8 = total: 36 27 29 31 33 35 37 39 41 43 45
        -6: 18  6  .  .  .  .  .  .  .  .  .
        -5:  .  .  .  .  .  .  .  .  .  .  .
        -4: 18 21 21  7  .  .  .  .  .  .  .
        -3:  .  .  .  .  .  .  .  .  .  .  .
        -2:  .  .  8 24 24  8  .  .  .  .  .
        -1:  .  .  .  .  .  .  .  .  .  .  .
         0:  .  .  .  .  9 27 27  9  .  .  .
         1:  .  .  .  .  .  .  .  .  .  .  .
         2:  .  .  .  .  .  . 10 30 30 10  .
         3:  .  .  .  .  .  .  .  .  .  .  .
         4:  .  .  .  .  .  .  .  . 11 33 33
         5:  .  .  .  .  .  .  .  .  .  .  .
         6:  .  .  .  .  .  .  .  .  .  . 12

o8 : BettiTally

i9 : hfModuleAsExt(12,MM,3)

o9 = (23, 25, 27, 29, 31, 33, 35, 37, 39, 41)

o9 : Sequence

i10 : 
