-- -*- M2-comint -*- hash: -1837162337

i1 : kk = ZZ/101

o1 = kk

o1 : QuotientRing

i2 : S = kk[a,b,c]

o2 = S

o2 : PolynomialRing

i3 : ff = matrix"a2,b2,c2"

o3 = | a2 b2 c2 |

             1       3
o3 : Matrix S  <--- S

i4 : R = S/ideal ff

o4 = R

o4 : QuotientRing

i5 : M = R^1/ideal"a,bc"

o5 = cokernel | a bc |

                            1
o5 : R-module, quotient of R

i6 : k = 1

o6 = 1

i7 : m = k+5

o7 = 6

i8 : F = res(M, LengthLimit => m)

      1      2      4      7      11      16      22
o8 = R  <-- R  <-- R  <-- R  <-- R   <-- R   <-- R
                                                  
     0      1      2      3      4       5       6

o8 : ChainComplex

i9 : syzygies = apply(1..m, i->coker F.dd_i);

i10 : t1 = makeT(ff,F,k+4);

i11 : t2 = makeT(ff,F,k+2);

i12 : T2Components = flatten for i from 0 to 1 list(for j from i+1 to 2 list map(F_k, F_(k+4), t2_i*t1_j-t2_j*t1_i));

i13 : g = map(syzygies_k, syzygies_(k+4), T2Components_2)

o13 = {1} | 0 0 0 0 0 -c 0 0 b 0 0 0 0 0 0 0 |
      {2} | 0 0 0 0 0 0  0 0 0 0 0 0 0 0 0 0 |

o13 : Matrix

i14 : isStablyTrivial g

o14 = true

i15 : 
