-- -*- M2-comint -*- hash: -1480979743

i1 : kk=ZZ/101;

i2 : S = kk[a,b,c];

i3 : E = S^1/ideal"ab"++S^1/ideal vars S;

i4 : f1 =matrix"a";

             1       1
o4 : Matrix S  <--- S

i5 : f2 =matrix"a+b,c";

             1       2
o5 : Matrix S  <--- S

i6 : f3 = matrix"a+b";

             1       1
o6 : Matrix S  <--- S

i7 : f4 = matrix"a+b, a2+b";

             1       2
o7 : Matrix S  <--- S

i8 : isQuasiRegular(f1,E)

o8 = false

i9 : isQuasiRegular(f2,E)

o9 = true

i10 : isQuasiRegular(f3,E)

o10 = true

i11 : isQuasiRegular(f4,E)

o11 = false

i12 : 
