-- -*- M2-comint -*- hash: -1153188152

i1 : setRandomSeed 0

o1 = 0

i2 : kk = ZZ/101

o2 = kk

o2 : QuotientRing

i3 : S = kk[a,b,u,v]

o3 = S

o3 : PolynomialRing

i4 : ff = matrix"au,bv"

o4 = | au bv |

             1       2
o4 : Matrix S  <--- S

i5 : R = S/ideal ff

o5 = R

o5 : QuotientRing

i6 : M0 = R^1/ideal"a,b"

o6 = cokernel | a b |

                            1
o6 : R-module, quotient of R

i7 : M = highSyzygy M0

o7 = cokernel {2} | b -a 0 0 |
              {2} | 0 0  a b |
              {2} | 0 v  0 u |

                            3
o7 : R-module, quotient of R

i8 : MF = matrixFactorization(ff,M);

i9 : netList BRanks MF

     +-+-+
o9 = |2|2|
     +-+-+
     |1|2|
     +-+-+

i10 : netList bMaps MF

      +-----------+
o10 = |{2} | a b ||
      |{2} | 0 u ||
      +-----------+
      |{2} | b a ||
      +-----------+

i11 : betti res(M, LengthLimit => 7)

             0 1 2 3 4 5 6  7
o11 = total: 3 4 5 6 7 8 9 10
          2: 3 4 5 6 7 8 9 10

o11 : BettiTally

i12 : infiniteBettiNumbers (MF,7)

o12 = {3, 4, 5, 6, 7, 8, 9, 10}

o12 : List

i13 : betti res pushForward(map(R,S),M)

             0 1 2
o13 = total: 3 5 2
          2: 3 4 .
          3: . 1 2

o13 : BettiTally

i14 : finiteBettiNumbers MF

o14 = {3, 5, 2}

o14 : List

i15 : 
