-- -*- M2-comint -*- hash: 1377752294

i1 : R = QQ[a..d];

i2 : I = ideal(a^3-b^2*c, b*c^2-c*d^2, c^3)

             3    2      2      2   3
o2 = ideal (a  - b c, b*c  - c*d , c )

o2 : Ideal of R

i3 : gbList I

       3     2      2   3    2    2 2     4
o3 = {c , b*c  - c*d , a  - b c, c d , c*d }

o3 : List

i4 : 
