-- -*- M2-comint -*- hash: -827343976

i1 : R = QQ[x,y,t,s,MonomialOrder=>Lex];

i2 : F = {x + y^2 - t, t^2 -s};

i3 : T = triaSystem(R,F,{});

i4 : isStronglyNormalized(T)

o4 = true

i5 : R = QQ[x,y,z,MonomialOrder=>Lex];

i6 : F = {x*y - y*z, y^2 - z^2};

i7 : T = triaSystem(R,F,{y});

i8 : isStronglyNormalized(T)

o8 = false

i9 : 
