-- -*- M2-comint -*- hash: 1822348971

i1 : fromJSON "2"

o1 = 2

i2 : fromJSON "2.71828"

o2 = 2.71828

o2 : RR (of precision 53)

i3 : fromJSON "\"Hello, world!\""

o3 = Hello, world!

i4 : fromJSON "true"

o4 = true

i5 : fromJSON "false"

o5 = false

i6 : fromJSON "null"

o6 = nil

o6 : Symbol

i7 : fromJSON "{\"foo\": 1, \"bar\": 2}"

o7 = HashTable{bar => 2}
               foo => 1

o7 : HashTable

i8 : fromJSON "[1, 2, 3]"

o8 = {1, 2, 3}

o8 : List

i9 : jsonFile = temporaryFileName() | ".json"

o9 = /private/tmp/M2-29413-0/0.json

i10 : jsonFile << "[1, 2, 3]" << endl << close

o10 = /private/tmp/M2-29413-0/0.json

o10 : File

i11 : fromJSON openIn jsonFile

o11 = {1, 2, 3}

o11 : List

i12 : 
