-- -*- M2-comint -*- hash: 1977353003

i1 : R = QQ[a..e];

i2 : fTriangle simplicialComplex {a*b*c, c*d*e, a*d, a*e, b*d, b*e}

o2 = Tally{(2, 2) => 4}
           (3, 0) => 1
           (3, 1) => 5
           (3, 2) => 6
           (3, 3) => 2

o2 : Tally

i3 : fTriangle simplicialComplex {a*b*c*d*e}

o3 = Tally{(5, 0) => 1 }
           (5, 1) => 5
           (5, 2) => 10
           (5, 3) => 10
           (5, 4) => 5
           (5, 5) => 1

o3 : Tally

i4 : 
