-- -*- M2-comint -*- hash: 574360571

i1 : R = QQ[a..e];

i2 : hTriangle simplicialComplex {a*b*c, c*d*e, a*d, a*e, b*d, b*e}

o2 = Tally{(2, 2) => 4 }
           (3, 0) => 1
           (3, 1) => 2
           (3, 2) => -1

o2 : Tally

i3 : hTriangle simplicialComplex {a*b*c*d*e}

o3 = Tally{(5, 0) => 1}

o3 : Tally

i4 : 
