-- -*- M2-comint -*- hash: -321534297

i1 : R = ZZ[a..e];

i2 : smplex = simplicialComplex{a*b*c*d*e}

o2 = simplicialComplex | abcde |

o2 : SimplicialComplex

i3 : hVector smplex

o3 = HashTable{0 => 1}
               1 => 0
               2 => 0
               3 => 0
               4 => 0
               5 => 0

o3 : HashTable

i4 : R = ZZ[x_1..x_5];

i5 : delta = simplicialComplex{x_1*x_2*x_3,x_2*x_4,x_3*x_5}

o5 = simplicialComplex | x_3x_5 x_2x_4 x_1x_2x_3 |

o5 : SimplicialComplex

i6 : hVector delta

o6 = HashTable{0 => 1 }
               1 => 2
               2 => -2
               3 => 0

o6 : HashTable

i7 : grading = {{1,0,0},{1,0,0},{1,0,0},{0,1,0},{0,0,1}};

i8 : R = ZZ[x_1,x_2,x_3,y,z, Degrees => grading];

i9 : gamma = simplicialComplex{x_1*y*z,x_2*y,x_3*z}

o9 = simplicialComplex | x_3z x_2y x_1yz |

o9 : SimplicialComplex

i10 : hVector(gamma, Flag => true)

o10 = HashTable{{0, 0, 0} => 1 }
                {1, 0, 0} => 2
                {1, 0, 1} => -1
                {1, 1, 0} => -1

o10 : HashTable

i11 : 
