-- -*- M2-comint -*- hash: -1919966389

i1 : R = QQ[a..f];

i2 : shellingOrder simplicialComplex {a*b*c*d*e}

o2 = {a*b*c*d*e}

o2 : List

i3 : shellingOrder simplicialComplex {a*b*c, b*c*d, c*d*e}

o3 = {c*d*e, b*c*d, a*b*c}

o3 : List

i4 : shellingOrder simplicialComplex {a*b*c, c*d*e}

o4 = {}

o4 : List

i5 : shellingOrder simplicialComplex {a*b*c, c*d, d*e, e*f, d*f}

o5 = {a*b*c, c*d, d*e, d*f, e*f}

o5 : List

i6 : shellingOrder simplicialComplex {a*b*c, c*d, d*e*f}

o6 = {}

o6 : List

i7 : S = simplicialComplex {a*b*c, b*c*d, c*d*e, d*e*f};

i8 : shellingOrder S

o8 = {d*e*f, c*d*e, b*c*d, a*b*c}

o8 : List

i9 : shellingOrder(S, Random => true)

o9 = {b*c*d, a*b*c, c*d*e, d*e*f}

o9 : List

i10 : shellingOrder(S, Permutation => {3,2,1,0})

o10 = {a*b*c, b*c*d, c*d*e, d*e*f}

o10 : List

i11 : 
