-- -*- M2-comint -*- hash: 1957834493

i1 : L = lieAlgebra{a,b}/{a a b,b b b a}

o1 = L

o1 : LieAlgebra

i2 : E = extAlgebra(5,L)

o2 = E

o2 : ExtAlgebra

i3 : describe E

o3 = generators => {ext_0, ext_1, ext_2, ext_3}
     Weights => {{1, 1}, {1, 1}, {3, 2}, {4, 2}}
     Signs => {1, 1, 0, 0}
     lieAlgebra => L
     Field => QQ
     computedDegree => 5

i4 : parent E

o4 = ExtElement

o4 : Type

i5 : ext_0 ext_1

o5 = 0

o5 : E

i6 : M = minimalModel(5,L)

o6 = M

o6 : LieAlgebra

i7 : describe M

o7 = generators => {fr , fr , fr , fr }
                      0    1    2    3
     Weights => {{1, 0}, {1, 0}, {3, 1}, {4, 1}}
     Signs => {0, 0, 1, 1}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {0, 0, (fr_0 fr_1 fr_0), (fr_1 fr_1 fr_1 fr_0)}
     Field => QQ
     computedDegree => 5
     map => fr  => a
              0
            fr  => b
              1
            fr  => 0
              2
            fr  => 0
              3
            source => M
            target => L

i8 : gens E

o8 = {ext_0, ext_1, ext_2, ext_3}

o8 : List

i9 : 
