-- -*- M2-comint -*- hash: -1972623874

i1 : L = lieAlgebra{a,b}

o1 = L

o1 : LieAlgebra

i2 : dims(1,5,L)

o2 = {2, 1, 2, 3, 6}

o2 : List

i3 : basis(2,L)

o3 = {(b a)}

o3 : List

i4 : basis(3,L)

o4 = {(a b a), (b b a)}

o4 : List

i5 : p = (a b) (a a b + 3 b b a)

o5 =  - (a b a b a) + 3 (a b b b a) + (b a a b a) - 3 (b b a b a)

o5 : L

i6 : basis(5,L)

o6 = {(a a a b a), (b a a b a), (a b a b a), (b b a b a), (a b b b a), (b b b
     ------------------------------------------------------------------------
     b a)}

o6 : List

i7 : Q = L/{p}

o7 = Q

o7 : LieAlgebra

i8 : dims(1,5,Q)

o8 = {2, 1, 2, 3, 5}

o8 : List

i9 : L = lieAlgebra{a,b}

o9 = L

o9 : LieAlgebra

i10 : M = lieAlgebra{a,b}/{a b}

o10 = M

o10 : LieAlgebra

i11 : R = QQ[a,b]

o11 = R

o11 : PolynomialRing

i12 : use L

i13 : a b

o13 =  - (b a)

o13 : L

i14 : use M

i15 : a b

o15 = 0

o15 : M

i16 : use R

o16 = R

o16 : PolynomialRing

i17 : a*b

o17 = a*b

o17 : R

i18 : 
      
