-- -*- M2-comint -*- hash: 365170843

i1 : L = holonomy({{a1,a2,a3},{a1,a4,a5},{a2,a4,a6}})

o1 = L

o1 : LieAlgebra

i2 : ideal L

o2 = {(a2 a1) - (a3 a2), (a3 a1) + (a3 a2), (a4 a1) - (a5 a4), (a5 a1) + (a5
     ------------------------------------------------------------------------
     a4), (a4 a2) - (a6 a4), (a6 a2) + (a6 a4), (a4 a3), (a5 a2), (a5 a3),
     ------------------------------------------------------------------------
     (a6 a1), (a6 a3), (a6 a5)}

o2 : List

i3 : L0 = L/{a1+a2+a3+a4+a5+a6}

o3 = L0

o3 : LieAlgebra

i4 : L0 = minimalPresentation(3,L0)

o4 = L0

o4 : LieAlgebra

i5 : describe L0

o5 = generators => {a2, a3, a4, a5, a6}
     Weights => {{1, 0}, {1, 0}, {1, 0}, {1, 0}, {1, 0}}
     Signs => {0, 0, 0, 0, 0}
     ideal => {(a6 a5), (a6 a3), (a6 a2) + (a6 a4), (a5 a3), (a5 a2), (a4 a3), (a4 a2) - (a6 a4)}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i6 : L1 = holonomy({{a2,a3},{a4,a5}},{{a2,a4,a6}})

o6 = L1

o6 : LieAlgebra

i7 : L0==L1

o7 = true

i8 : L6 = holonomy({{a2,a4}},{{a1,a2,a3},{a1,a4,a5}})

o8 = L6

o8 : LieAlgebra

i9 : describe L6

o9 = generators => {a2, a4, a1, a3, a5}
     Weights => {{1, 0}, {1, 0}, {1, 0}, {1, 0}, {1, 0}}
     Signs => {0, 0, 0, 0, 0}
     ideal => { - (a1 a2) - (a3 a2), (a3 a2) + (a3 a1),  - (a1 a4) - (a5 a4), (a5 a4) + (a5 a1), (a3 a4), (a5 a2), (a5 a3)}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i10 : dims(1,6,L6)

o10 = {5, 3, 6, 9, 18, 27}

o10 : List

i11 : dims(1,6,L1)

o11 = {5, 3, 6, 9, 18, 27}

o11 : List

i12 : dims(1,6,L)

o12 = {6, 3, 6, 9, 18, 27}

o12 : List

i13 : 
      describe holonomyLocal(1,L1)

o13 = generators => {a4, a5}
      Weights => {{1, 0}, {1, 0}}
      Signs => {0, 0}
      ideal => {}
      ambient => LieAlgebra{...10...}
      diff => {}
      Field => QQ
      computedDegree => 0


i14 : describe holonomyLocal(2,L1)

o14 = generators => {a2, a4, a6}
      Weights => {{1, 0}, {1, 0}, {1, 0}}
      Signs => {0, 0, 0}
      ideal => {(a4 a2) - (a6 a4), (a6 a2) + (a6 a4)}
      ambient => LieAlgebra{...10...}
      diff => {}
      Field => QQ
      computedDegree => 0


i15 : I1=decompose(L1)

o15 = I1

o15 : FGLieIdeal

i16 : dim(3,I1)

o16 = 0

i17 : Q = holonomy({{a1,a2,a3},{a1,a4,a5},{a2,a4,a6},{a3,a5,a6}})

o17 = Q

o17 : LieAlgebra

i18 : decompose Q

o18 = finitely generated ideal of Q

o18 : FGLieIdeal

i19 : basis(3,oo)

o19 = {(a6 a5 a4), (a5 a6 a4)}

o19 : List

i20 : Q1 = holonomy({{a2,a3},{a4,a5}},{{a2,a4,a6},{a3,a5,a6}})

o20 = Q1

o20 : LieAlgebra

i21 : decompose Q1

o21 = finitely generated ideal of Q1

o21 : FGLieIdeal

i22 : basis(3,oo)

o22 = {(a6 a5 a4), (a5 a6 a4)}

o22 : List

i23 : L0 = holonomyLocal(0,Q1)

o23 = L0

o23 : LieAlgebra

i24 : L1 = holonomyLocal(1,Q1)

o24 = L1

o24 : LieAlgebra

i25 : L2 = holonomyLocal(2,Q1)

o25 = L2

o25 : LieAlgebra

i26 : L3 = holonomyLocal(3,Q1)

o26 = L3

o26 : LieAlgebra

i27 : M = L0++L1++L2++L3

o27 = M

o27 : LieAlgebra

i28 : gens M

o28 = {pr_0, pr_1, pr_2, pr_3, pr_4, pr_5, pr_6, pr_7, pr_8, pr_9}

o28 : List

i29 : f = map(M,Q1,{pr_0+pr_4,pr_1+pr_7,pr_2+pr_5,pr_3+pr_8,pr_6+pr_9})
warning: the map might not be well defined, 
         use isWellDefined

o29 = f

o29 : LieAlgebraMap

i30 : describe f

o30 = a2 => pr_0 + pr_4
      a3 => pr_1 + pr_7
      a4 => pr_2 + pr_5
      a5 => pr_3 + pr_8
      a6 => pr_6 + pr_9
      source => Q1
      target => M

i31 : kernel f

o31 = ideal of Q1

o31 : LieIdeal

i32 : basis(3,oo)

o32 = {(a6 a5 a4), (a5 a6 a4)}

o32 : List

i33 : use Q

i34 : f=map(Q,Q,{a2,a3,a1,a6,a4,a5})
warning: the map might not be well defined, 
         use isWellDefined

o34 = f

o34 : LieAlgebraMap

i35 : g=map(Q,Q,{a2,a3,a1,a5,a6,a4})
warning: the map might not be well defined, 
         use isWellDefined

o35 = g

o35 : LieAlgebraMap

i36 : isIsomorphism f

o36 = true

i37 : isIsomorphism g

o37 = false

i38 : describe f

o38 = a1 => a2
      a2 => a3
      a3 => a1
      a4 => a6
      a5 => a4
      a6 => a5
      source => Q
      target => Q

i39 : I=decompose Q

o39 = I

o39 : FGLieIdeal

i40 : use Q

i41 : f1=map(Q,Q,{a1,a3,a2,a5,a4,a6})
warning: the map might not be well defined, 
         use isWellDefined

o41 = f1

o41 : LieAlgebraMap

i42 : f2=map(Q,Q,{a2,a3,a1,a6,a4,a5})
warning: the map might not be well defined, 
         use isWellDefined

o42 = f

o42 : LieAlgebraMap

i43 : f3=map(Q,Q,{a6,a3,a5,a2,a4,a1})
warning: the map might not be well defined, 
         use isWellDefined

o43 = f3

o43 : LieAlgebraMap

i44 : f4=map(Q,Q,{a6,a5,a3,a4,a2,a1})
warning: the map might not be well defined, 
         use isWellDefined

o44 = f4

o44 : LieAlgebraMap

i45 : trace(4,I,f1)

o45 = -1

o45 : QQ

i46 : trace(4,I,f2)

o46 = 0

o46 : QQ

i47 : trace(4,I,f3)

o47 = -1

o47 : QQ

i48 : trace(4,I,f4)

o48 = 1

o48 : QQ

i49 : 
