-- -*- M2-comint -*- hash: 1830447452

i1 : M = lieAlgebra({x,y},Weights => {2,2})

o1 = M

o1 : LieAlgebra

i2 : L = lieAlgebra({a,b},Signs => 1)

o2 = L

o2 : LieAlgebra

i3 : f1 = map(L,M,{a a,b b})

o3 = f1

o3 : LieAlgebraMap

i4 : describe f1

o4 = x => (a a)
     y => (b b)
     source => M
     target => L

i5 : M = lieAlgebra{a,b,c}

o5 = M

o5 : LieAlgebra

i6 : L = lieAlgebra({a,b,d},Weights => {2,1,1})

o6 = L

o6 : LieAlgebra

i7 : f2 = map(L,M)

o7 = f2

o7 : LieAlgebraMap

i8 : describe f2

o8 = a => 0
     b => b
     c => 0
     source => M
     target => L

i9 : F=lieAlgebra({a,b},Weights => {{1,0},{2,1}},Signs => 1,
         LastWeightHomological => true)

o9 = F

o9 : LieAlgebra

i10 : D=differentialLieAlgebra{0_F,a a}

o10 = D

o10 : LieAlgebra

i11 : f=map(D,F)
warning: the map might not be well defined, 
           use isWellDefined

o11 = f

o11 : LieAlgebraMap

i12 : isWellDefined(2,f)
the map is well defined for all degrees
the map does not commute with the differential

o12 = false

i13 : use F

i14 : Q=F/{a a}

o14 = Q

o14 : LieAlgebra

i15 : g=map(Q,D)
warning: the map might not be well defined, 
           use isWellDefined

o15 = g

o15 : LieAlgebraMap

i16 : isWellDefined(2,g)
the map is well defined for all degrees
the map commutes with the differential for all degrees

o16 = true

i17 : isSurjective f

o17 = true

i18 : use F

i19 : Q1=F/{a a}

o19 = Q1

o19 : LieAlgebra

i20 : Q1===Q

o20 = false

i21 : Q1==Q

o21 = true

i22 : h=map(Q1,Q)

o22 = h

o22 : LieAlgebraMap

i23 : isIsomorphism h

o23 = true

i24 : use Q

i25 : d=lieDerivation(g,{a b,b b})

o25 = d

o25 : LieDerivation

i26 : isWellDefined(2,d)
the derivation is well defined for all degrees

o26 = true

i27 : use D

i28 : f=map(D,F)
warning: the map might not be well defined, 
           use isWellDefined

o28 = f

o28 : LieAlgebraMap

i29 : d=lieDerivation(f,{a b,b b})
warning: the derivation might not be well defined, use isWellDefined

o29 = d

o29 : LieDerivation

i30 : isWellDefined(2,d)
the map defining the 
            derivation is not well defined

o30 = false

i31 : L = lieAlgebra{a,b}/{a a a b,b b b a}

o31 = L

o31 : LieAlgebra

i32 : dims(1,20,L)

o32 = {2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1, 2, 1}

o32 : List

i33 : deuler = euler L

o33 = deuler

o33 : LieDerivation

i34 : deuler b a b a b a b a

o34 = 8 (b a b a b a b a)

o34 : L

i35 : basis(7,L)

o35 = {(a b a b a b a), (b b a b a b a)}

o35 : List

i36 : da61 = lieDerivation{a b a b a b a,0_L}
warning: the derivation might not be well defined, use isWellDefined

o36 = da61

o36 : LieDerivation

i37 : isWellDefined(4,da61)
the derivation is well defined for all degrees

o37 = true

i38 : db61 = lieDerivation{0_L,a b a b a b a}
warning: the derivation might not be well defined, use isWellDefined

o38 = db61

o38 : LieDerivation

i39 : isWellDefined(4,db61)

o39 = false

i40 : da62 = lieDerivation{b b a b a b a,0_L}
warning: the derivation might not be well defined, use isWellDefined

o40 = da62

o40 : LieDerivation

i41 : isWellDefined(4,da62)

o41 = false

i42 : db62 = lieDerivation{0_L,b b a b a b a}
warning: the derivation might not be well defined, use isWellDefined

o42 = db62

o42 : LieDerivation

i43 : isWellDefined(4,db62)
the derivation is well defined for all degrees

o43 = true

i44 : M = lieAlgebra{a,b}

o44 = M

o44 : LieAlgebra

i45 : f = map(L,M)

o45 = f

o45 : LieAlgebraMap

i46 : use L

i47 : dMb61 = lieDerivation(f,{0_L,a b a b a b a})

o47 = dMb61

o47 : LieDerivation

i48 : dMa62 = lieDerivation(f,{b b a b a b a,0_L})

o48 = dMa62

o48 : LieDerivation

i49 : use M

i50 : dMb61 a a a b

o50 = 0

o50 : L

i51 : dMa62 a a a b

o51 = 2 (b a b a b a b a b a)

o51 : L

i52 : use L

i53 : da61+db62===innerDerivation(b a b a b a)

o53 = true

i54 : da7=lieDerivation({b a b a b a b a,0_L})
warning: the derivation might not be well defined, use isWellDefined

o54 = da7

o54 : LieDerivation

i55 : isWellDefined(4,da7)
the derivation is well defined for all degrees

o55 = true

i56 : db7=lieDerivation({0_L,b a b a b a b a})
warning: the derivation might not be well defined, use isWellDefined

o56 = db7

o56 : LieDerivation

i57 : isWellDefined(4,db7)
the derivation is well defined for all degrees

o57 = true

i58 : da7===innerDerivation(b b a b a b a)

o58 = true

i59 : db7===innerDerivation(a b a b a b a)

o59 = true

i60 : d2 = lieDerivation({a b a,0_L})
warning: the derivation might not be well defined, use isWellDefined

o60 = d2

o60 : LieDerivation

i61 : d4 = lieDerivation({a b a b a,0_L})
warning: the derivation might not be well defined, use isWellDefined

o61 = d4

o61 : LieDerivation

i62 : describe d2 d4

o62 = a => (a b a b a b a)
      b => 0
      map => id_L
      sign => 0
      weight => {6, 0}
      source => L
      target => L

i63 : d6 = lieDerivation({a b a b a b a,0_L})
warning: the derivation might not be well defined, use isWellDefined

o63 = da61

o63 : LieDerivation

i64 : describe d2 d6

o64 = a => 2 (a b a b a b a b a)
      b => 0
      map => id_L
      sign => 0
      weight => {8, 0}
      source => L
      target => L

i65 : d16 = lieDerivation({a b a b a b a b a b a b a b a b a,0_L})
warning: the derivation might not be well defined, use isWellDefined

o65 = d16

o65 : LieDerivation

i66 : describe d2 d16

o66 = a => 7 (a b a b a b a b a b a b a b a b a b a)
      b => 0
      map => id_L
      sign => 0
      weight => {18, 0}
      source => L
      target => L

i67 : 
