-- -*- M2-comint -*- hash: 1738890484

i1 : F=lieAlgebra({a,b,c,r3,r4,r42},
        Weights => {{1,0},{1,0},{2,0},{3,1},{4,1},{4,2}},
        Signs=>{0,0,0,1,1,0},LastWeightHomological=>true)

o1 = F

o1 : LieAlgebra

i2 : D=differentialLieAlgebra{0_F,0_F,0_F,a c,a a c,r4 - a r3}

o2 = D

o2 : LieAlgebra

i3 : I=lieIdeal{b c - a c,a b,b r4 - a r4}

o3 = I

o3 : FGLieIdeal

i4 : Q=D/I

o4 = Q

o4 : LieAlgebra

i5 : f=map(Q,D)

o5 = f

o5 : LieAlgebraMap

i6 : J=lieIdeal{a c}

o6 = J

o6 : FGLieIdeal

i7 : K=inverse(f,J)

o7 = K

o7 : LieIdeal

i8 : use D

i9 : I+lieIdeal{a c}

o9 = finitely generated ideal of D

o9 : FGLieIdeal

i10 : dims(6,oo)

o10 = | 0 1 4 7 16 30 |
      | 0 0 0 0 2  9  |
      | 0 0 0 0 0  1  |
      | 0 0 0 0 0  0  |
      | 0 0 0 0 0  0  |
      | 0 0 0 0 0  0  |

               6        6
o10 : Matrix ZZ  <--- ZZ

i11 : dims(6,K)

o11 = | 0 1 4 7 16 30 |
      | 0 0 0 0 2  9  |
      | 0 0 0 0 0  1  |
      | 0 0 0 0 0  0  |
      | 0 0 0 0 0  0  |
      | 0 0 0 0 0  0  |

               6        6
o11 : Matrix ZZ  <--- ZZ

i12 : 
