-- -*- M2-comint -*- hash: 2033920689

i1 : L = lieAlgebra{a,b}

o1 = L

o1 : LieAlgebra

i2 : I=lieIdeal{a a b}

o2 = I

o2 : FGLieIdeal

i3 : Q=L/I

o3 = Q

o3 : LieAlgebra

i4 : f=map(Q,L)

o4 = f

o4 : LieAlgebraMap

i5 : J=kernel f

o5 = J

o5 : LieIdeal

i6 : I===J

o6 = false

i7 : describe I

o7 = generators => { - (a b a)}
     lieAlgebra => L

i8 : describe J

o8 = inverse => {f, finitely generated ideal of Q}
     lieAlgebra => L

i9 : J#inverse_1===zeroIdeal Q

o9 = true

i10 : 
      
      
