-- -*- M2-comint -*- hash: 659234596

i1 : L = lieAlgebra{a,b}

o1 = L

o1 : LieAlgebra

i2 : M = lieAlgebra{a,b,c}

o2 = M

o2 : LieAlgebra

i3 : f = map(L,M)

o3 = f

o3 : LieAlgebraMap

i4 : use L

i5 : der = lieDerivation(f,{a a b,b b a,a a b+b b a})

o5 = der

o5 : LieDerivation

i6 : describe der

o6 = a =>  - (a b a)
     b => (b b a)
     c =>  - (a b a) + (b b a)
     map => f
     sign => 0
     weight => {2, 0}
     source => M
     target => L

i7 : use M

i8 : der a c

o8 =  - (a a b a) + (b a b a)

o8 : L

i9 : 
