-- -*- M2-comint -*- hash: 276469618

i1 : L = lieAlgebra{a,b,c}

o1 = L

o1 : LieAlgebra

i2 : A=lieIdeal{a}

o2 = A

o2 : FGLieIdeal

i3 : B=lieIdeal{b}

o3 = B

o3 : FGLieIdeal

i4 : S=A@B

o4 = S

o4 : LieIdeal

i5 : basis(3,S)

o5 = {(a b a), (b b a), (c b a), (b c a)}

o5 : List

i6 : T=A+B

o6 = T

o6 : FGLieIdeal

i7 : dims(1,3,L/T)

o7 = {1, 0, 0}

o7 : List

i8 : dims(1,5,L/A@B)

o8 = {3, 2, 4, 6, 12}

o8 : List

i9 : dims(1,5,L/A++L/B)

o9 = {4, 2, 4, 6, 12}

o9 : List

i10 : 
