-- -*- M2-comint -*- hash: 2072365251

i1 : M = lieAlgebra{a,b,c}

o1 = M

o1 : LieAlgebra

i2 : L = M/{a b}

o2 = L

o2 : LieAlgebra

i3 : N = lieAlgebra({d}, Weights=>{2})

o3 = N

o3 : LieAlgebra

i4 : f = map(L,N,{a c})

o4 = f

o4 : LieAlgebraMap

i5 : Q = L/f

o5 = Q

o5 : LieAlgebra

i6 : describe Q

o6 = generators => {a, b, c}
     Weights => {{1, 0}, {1, 0}, {1, 0}}
     Signs => {0, 0, 0}
     ideal => { - (b a),  - (c a)}
     ambient => M
     diff => {}
     Field => QQ
     computedDegree => 0


i7 : 
