-- -*- M2-comint -*- hash: 1207490186

i1 : M = lieAlgebra{a,b}

o1 = M

o1 : LieAlgebra

i2 : L = lieAlgebra{a,b}

o2 = L

o2 : LieAlgebra

i3 : f = map(L,M,{a,b})

o3 = f

o3 : LieAlgebraMap

i4 : g = map(L,M,{b,a})

o4 = g

o4 : LieAlgebraMap

i5 : describe(f-g)

o5 = a => a - b
     b =>  - a + b
     source => M
     target => L

i6 : 
