-- -*- M2-comint -*- hash: 690007508

i1 : L = lieAlgebra{a,b}

o1 = L

o1 : LieAlgebra

i2 : M = lieAlgebra{a,b,c}

o2 = M

o2 : LieAlgebra

i3 : N = lieAlgebra{a1,b1}

o3 = N

o3 : LieAlgebra

i4 : f = map(L,M)

o4 = f

o4 : LieAlgebraMap

i5 : use M

i6 : g = map(M,N,{b,a})

o6 = g

o6 : LieAlgebraMap

i7 : use L

i8 : d = lieDerivation(f,{a a b,b b a,a a b+b b a})

o8 = d

o8 : LieDerivation

i9 : describe d

o9 = a =>  - (a b a)
     b => (b b a)
     c =>  - (a b a) + (b b a)
     map => f
     sign => 0
     weight => {2, 0}
     source => M
     target => L

i10 : describe(f*g)

o10 = a1 => b
      b1 => a
      source => N
      target => L

i11 : describe(d*g)

o11 = a1 => (b b a)
      b1 =>  - (a b a)
      map => homomorphism from N to L
      sign => 0
      weight => {2, 0}
      source => N
      target => L

i12 : 
      
      
