-- -*- M2-comint -*- hash: 2041232220

i1 : M = lieAlgebra{a,b}

o1 = M

o1 : LieAlgebra

i2 : L = lieAlgebra{a1,b1}

o2 = L

o2 : LieAlgebra

i3 : f = map(L,M,{b1,a1})

o3 = f

o3 : LieAlgebraMap

i4 : d = lieDerivation(f,{a1,b1})

o4 = d

o4 : LieDerivation

i5 : e = lieDerivation(f,{2 b1,2 a1})

o5 = e

o5 : LieDerivation

i6 : u = d+e

o6 = u

o6 : LieDerivation

i7 : describe u

o7 = a => a1 + 2 b1
     b => 2 a1 + b1
     map => f
     sign => 0
     weight => {0, 0}
     source => M
     target => L

i8 : u a b

o8 = 4 (b1 a1)

o8 : L

i9 : 
