-- -*- M2-comint -*- hash: 951941553

i1 : R=QQ[x]

o1 = R

o1 : PolynomialRing

i2 : L=koszulDual R

o2 = L

o2 : LieAlgebra

i3 : describe L

o3 = generators => {ko }
                      0
     Weights => {{1, 0}}
     Signs => {1}
     ideal => { - (1/2)(ko_0 ko_0)}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i4 : M=minimalModel(4,L)

o4 = M

o4 : LieAlgebra

i5 : describe M

o5 = generators => {fr , fr , fr , fr }
                      0    1    2    3
     Weights => {{1, 0}, {2, 1}, {3, 2}, {4, 3}}
     Signs => {1, 1, 1, 1}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {0, (fr_0 fr_0), (fr_0 fr_1), (fr_1 fr_1) + 4 (fr_0 fr_2)}
     Field => QQ
     computedDegree => 4
     map => fr  => ko_0
              0
            fr  => 0
              1
            fr  => 0
              2
            fr  => 0
              3
            source => M
            target => L

i6 : E=extAlgebra(4,L)

o6 = E

o6 : ExtAlgebra

i7 : gE=gens E

o7 = {ext_0, ext_1, ext_2, ext_3}

o7 : List

i8 : weight\gE

o8 = {{1, 1}, {2, 2}, {3, 3}, {4, 4}}

o8 : List

i9 : sign\gE

o9 = {0, 0, 0, 0}

o9 : List

i10 : dims(4,E)

o10 = | 1 0 0 0 |
      | 0 1 0 0 |
      | 0 0 1 0 |
      | 0 0 0 1 |

               4        4
o10 : Matrix ZZ  <--- ZZ

i11 : ext_0 ext_0 ext_0 ext_0

o11 = 8ext_3

o11 : E

i12 : R = QQ[x,y,z,u]

o12 = R

o12 : PolynomialRing

i13 : I = {x^2,y^2,z^2,u^2,x*y+z*u}

        2   2   2   2
o13 = {x , y , z , u , x*y + z*u}

o13 : List

i14 : S = R/I

o14 = S

o14 : QuotientRing

i15 : hilbertSeries(S,Order=>4)

                 2
o15 = 1 + 4T + 5T

o15 : ZZ[T]

i16 : L = koszulDual(S)

o16 = L

o16 : LieAlgebra

i17 : E=extAlgebra(4,L)

o17 = E

o17 : ExtAlgebra

i18 : dims(4,E)

o18 = | 4 0 0 0 |
      | 0 5 0 0 |
      | 0 0 0 5 |
      | 0 0 0 0 |

               4        4
o18 : Matrix ZZ  <--- ZZ

i19 : L=lieAlgebra{a,b,c}

o19 = L

o19 : LieAlgebra

i20 : a@b@c++3@a@c@b++2@c@b@a/2@b@c@a

o20 = (a b c) + 3 (a c b) + 2 (c b a) - 2 (b c a)

o20 : L

i21 : normalForm oo

o21 = 0

o21 : L

i22 : F=lieAlgebra({e12,e23,e34,e45,e13,e24,e35,e14,e25,e15},
          Weights => {1,1,1,1,2,2,2,3,3,4})

o22 = F

o22 : LieAlgebra

i23 : I={e12@e34,e12@e45,e23@e45,e12@e13,e12@e35,e12@e14,
                e12@e15,e23@e45,e23@e13,e23@e24,e23@e14,e23@e25,
                e23@e15,e34@e24,e34@e35,e34@e14,e34@e25,e34@e15,
                e45@e13,e45@e35,e45@e25,e45@e15,e13@e24,e13@e14,
                e13@e25,e13@e15,e24@e35,e24@e14,e24@e25,e24@e15,
                e35@e14,e35@e25,e35@e15,e14@e25,e14@e15,e25@e15,
                e12@e23/e13, e12@e24/e14,
                e12@e25/e15, e13@e34/e14,
                e13@e35/e15, e14@e45/e15,
                e23@e34/e24, e23@e35/e25,
                e24@e45/e25, e34@e45/e35}

o23 = {(e12 e34), (e12 e45), (e23 e45), (e12 e13), (e12 e35), (e12 e14), (e12
      -----------------------------------------------------------------------
      e15), (e23 e45), (e23 e13), (e23 e24), (e23 e14), (e23 e25), (e23 e15),
      -----------------------------------------------------------------------
      (e34 e24), (e34 e35), (e34 e14), (e34 e25), (e34 e15), (e45 e13), (e45
      -----------------------------------------------------------------------
      e35), (e45 e25), (e45 e15), (e13 e24), (e13 e14), (e13 e25), (e13 e15),
      -----------------------------------------------------------------------
      (e24 e35), (e24 e14), (e24 e25), (e24 e15), (e35 e14), (e35 e25), (e35
      -----------------------------------------------------------------------
      e15), (e14 e25), (e14 e15), (e25 e15), (e12 e23) - e13, (e12 e24) -
      -----------------------------------------------------------------------
      e14, (e12 e25) - e15, (e13 e34) - e14, (e13 e35) - e15, (e14 e45) -
      -----------------------------------------------------------------------
      e15, (e23 e34) - e24, (e23 e35) - e25, (e24 e45) - e25, (e34 e45) -
      -----------------------------------------------------------------------
      e35}

o23 : List

i24 : L=F/I

o24 = L

o24 : LieAlgebra

i25 : dims(1,5,L)

o25 = {4, 3, 2, 1, 0}

o25 : List

i26 : M=minimalPresentation(4,L)

o26 = M

o26 : LieAlgebra

i27 : describe M

o27 = generators => {e12, e23, e34, e45}
      Weights => {{1, 0}, {1, 0}, {1, 0}, {1, 0}}
      Signs => {0, 0, 0, 0}
      ideal => {(e45 e23), (e45 e12), (e34 e12), (e45 e45 e34), (e34 e45 e34), (e34 e34 e23), (e23 e34 e23), (e23 e23 e12), (e12 e23 e12)}
      ambient => LieAlgebra{...10...}
      diff => {}
      Field => QQ
      computedDegree => 0


i28 : F = lieAlgebra({a,b,c,r3,r4,r42},
         Weights => {{1,0},{1,0},{2,0},{3,1},{4,1},{4,2}},
         Signs => {0,0,0,1,1,0},
         LastWeightHomological => true)

o28 = F

o28 : LieAlgebra

i29 : D = differentialLieAlgebra{0_F,0_F,0_F,a c,a a c,r4 - a r3}

o29 = D

o29 : LieAlgebra

i30 : L = D/{b c - a c,a b,b r4 - a r4}

o30 = L

o30 : LieAlgebra

i31 : M = minimalModel(5,L)

o31 = M

o31 : LieAlgebra

i32 : describe M

o32 = generators => {fr , fr , fr , fr , fr , fr , fr }
                       0    1    2    3    4    5    6
      Weights => {{1, 0}, {1, 0}, {2, 0}, {2, 1}, {3, 1}, {3, 1}, {5, 2}}
      Signs => {0, 0, 0, 1, 1, 1, 0}
      ideal => {}
      ambient => LieAlgebra{...10...}
      diff => {0, 0, 0, (fr_1 fr_0), (fr_1 fr_2), (fr_0 fr_2), (fr_0 fr_3 fr_2) + (fr_0 fr_0 fr_4) - (fr_0 fr_1 fr_5)}
      Field => QQ
      computedDegree => 5
      map => fr  => a
               0
             fr  => b
               1
             fr  => c
               2
             fr  => 0
               3
             fr  => r3
               4
             fr  => r3
               5
             fr  =>  - (a r42) + (b r42)
               6
             source => M
             target => L

i33 : 
      HL = lieHomology L

o33 = HL

o33 : VectorSpace

i34 : dims(5,HL)

o34 = | 2 1 0 0 0 |
      | 0 0 0 1 1 |
      | 0 0 0 0 0 |
      | 0 0 0 0 0 |
      | 0 0 0 0 0 |

               5        5
o34 : Matrix ZZ  <--- ZZ

i35 : describe minimalPresentation(3,L)

o35 = generators => {a, b, c}
      Weights => {{1, 0}, {1, 0}, {2, 0}}
      Signs => {0, 0, 0}
      ideal => {(b a), (b c), (a c)}
      ambient => LieAlgebra{...10...}
      diff => {}
      Field => QQ
      computedDegree => 0


i36 : 
      HM = lieHomology M

o36 = HM

o36 : VectorSpace

i37 : dims(5,HM)

o37 = | 2 1 0 0 0 |
      | 0 0 0 1 1 |
      | 0 0 0 0 0 |
      | 0 0 0 0 0 |
      | 0 0 0 0 0 |

               5        5
o37 : Matrix ZZ  <--- ZZ

i38 : 
      f = map M

o38 = f

o38 : LieAlgebraMap

i39 : dims(5,L)

o39 = | 2 1 1 1 2 |
      | 0 0 1 3 5 |
      | 0 0 0 1 2 |
      | 0 0 0 0 0 |
      | 0 0 0 0 0 |

               5        5
o39 : Matrix ZZ  <--- ZZ

i40 : image f

o40 = finitely generated subalgebra of L

o40 : FGLieSubAlgebra

i41 : dims(5,oo)

o41 = | 2 1 1 1 2 |
      | 0 0 1 2 4 |
      | 0 0 0 0 1 |
      | 0 0 0 0 0 |
      | 0 0 0 0 0 |

               5        5
o41 : Matrix ZZ  <--- ZZ

i42 : basis(5,1,HL)

o42 = {(b a r3) - (b b r3)}

o42 : List

i43 : basis(5,1,HM)

o43 = {(fr_1 fr_3 fr_2) + (fr_1 fr_0 fr_4) - (fr_1 fr_1 fr_5)}

o43 : List

i44 : f\oo

o44 = {(b a r3) - (b b r3)}

o44 : List

i45 : 
      
