-- -*- M2-comint -*- hash: -553040394

i1 : M = lieAlgebra{a,b}

o1 = M

o1 : LieAlgebra

i2 : L = lieAlgebra{a,b}

o2 = L

o2 : LieAlgebra

i3 : f = map(L,M,{a,b})

o3 = f

o3 : LieAlgebraMap

i4 : describe(-2 f)

o4 = a =>  - 2 a
     b =>  - 2 b
     source => M
     target => L

i5 : 
