-- -*- M2-comint -*- hash: 740880854

i1 : F = toField(ZZ/7[x]/{x^2+1})

o1 = F

o1 : PolynomialRing

i2 : M = lieAlgebra({a,b},Field=>F)

o2 = M

o2 : LieAlgebra

i3 : L = lieAlgebra({a,b},Field=>F)

o3 = L

o3 : LieAlgebra

i4 : f = map(L,M,{x a,3 b})

o4 = f

o4 : LieAlgebraMap

i5 : describe((3*x) f)

o5 = a => (-3)a
     b => (2*x)b
     source => M
     target => L

i6 : 
