-- -*- M2-comint -*- hash: 1814440712

i1 : M = lieAlgebra{a,b,c}

o1 = M

o1 : LieAlgebra

i2 : L = M/{a b}

o2 = L

o2 : LieAlgebra

i3 : a c

o3 =  - (c a)

o3 : L

i4 : Q = L/{a c}

o4 = Q

o4 : LieAlgebra

i5 : ideal(Q)

o5 = { - (b a),  - (c a)}

o5 : List

i6 : class\oo

o6 = {M, M}

o6 : List

i7 : f=map(Q,L)

o7 = f

o7 : LieAlgebraMap

i8 : I = kernel f

o8 = I

o8 : LieIdeal

i9 : R = L/I

o9 = R

o9 : LieAlgebra

i10 : ambient R

o10 = L

o10 : LieAlgebra

i11 : ideal R

o11 = I

o11 : LieIdeal

i12 : 
