-- -*- M2-comint -*- hash: 287776429

i1 : L = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
           Signs=>{1,1,1},LastWeightHomological=>true)

o1 = L

o1 : LieAlgebra

i2 : D= differentialLieAlgebra({0_L,a a,a b})

o2 = D

o2 : LieAlgebra

i3 : J=lieIdeal({b b + 4 a c})

o3 = J

o3 : FGLieIdeal

i4 : Q=D/J

o4 = Q

o4 : LieAlgebra

i5 : H=lieHomology Q

o5 = H

o5 : VectorSpace

i6 : basis(5,H)

o6 = {(b c)}

o6 : List

i7 : Z=cycles Q

o7 = Z

o7 : LieSubAlgebra

i8 : basis(3,Z)

o8 = {(a b)}

o8 : List

i9 : 
     
