-- -*- M2-comint -*- hash: -652627460

i1 : L = lieAlgebra({a,b,c},Weights=>{1,2,3})

o1 = L

o1 : LieAlgebra

i2 : dims(1,3,L)

o2 = {1, 1, 2}

o2 : List

i3 : computedDegree L

o3 = 3

i4 : firstDegree(c a b+a b c)

o4 = 6

i5 : computedDegree L

o5 = 6

i6 : 
