-- -*- M2-comint -*- hash: -136112119

i1 : L=holonomy({{a0,a1,a2},{a0,a3,a4},{a1,a3,a5},{a2,a4,a5}})

o1 = L

o1 : LieAlgebra

i2 : I=decompose L

o2 = I

o2 : FGLieIdeal

i3 : dims(1,4,I)

o3 = {0, 0, 2, 9}

o3 : List

i4 : basis(3,I)

o4 = {(a5 a4 a3), (a4 a5 a3)}

o4 : List

i5 : 
