-- -*- M2-comint -*- hash: 1322983822

i1 : L = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
     	         Signs=>{1,1,1},LastWeightHomological=>true)

o1 = L

o1 : LieAlgebra

i2 : D= differentialLieAlgebra({0_L,a a,a b})

o2 = D

o2 : LieAlgebra

i3 : I=lieIdeal{b b+4 a c}

o3 = I

o3 : FGLieIdeal

i4 : Q=D/I

o4 = Q

o4 : LieAlgebra

i5 : describe Q

o5 = generators => {a, b, c}
     Weights => {{1, 0}, {2, 1}, {3, 2}}
     Signs => {1, 1, 1}
     ideal => { - (a a a), (b b) + 4 (a c), (a a b) + (a a b) - (b a a) - 4 (a a b), (a a b) + (a a b) - (b a a) - 4 (a a b), (a a a a) + (a a a a) - (a a a a) - (a a a a) - 4 (a a a a)}
     ambient => L
     diff => {0, (a a), (a b)}
     Field => QQ
     computedDegree => 0


i6 : describe I

o6 = generators => {(b b) + 4 (a c), (a a b) + (a a b) - (b a a) - 4 (a a b)}
     lieAlgebra => D

i7 : describe map(Q,D)

o7 = a => a
     b => b
     c => c
     source => D
     target => Q

i8 : describe differential D

o8 = a => 0
     b => (a a)
     c => (a b)
     map => id_D
     sign => 1
     weight => {0, -1}
     source => D
     target => D

i9 : describe extAlgebra(5,Q)

o9 = generators => {ext_0, ext_1, ext_2, ext_3}
     Weights => {{1, 1}, {2, 2}, {3, 3}, {4, 4}}
     Signs => {0, 0, 0, 0}
     lieAlgebra => Q
     Field => QQ
     computedDegree => 5

i10 : 
