-- -*- M2-comint -*- hash: 1823301939

i1 : L = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
           Signs=>{1,1,1},LastWeightHomological=>true)

o1 = L

o1 : LieAlgebra

i2 : D= differentialLieAlgebra({0_L,a a,a b})

o2 = D

o2 : LieAlgebra

i3 : J=lieIdeal({b b + 4 a c})

o3 = J

o3 : FGLieIdeal

i4 : Q=D/J

o4 = Q

o4 : LieAlgebra

i5 : H=lieHomology Q

o5 = H

o5 : VectorSpace

i6 : dim({5,3},H)

o6 = 1

i7 : Z=cycles Q

o7 = Z

o7 : LieSubAlgebra

i8 : dim({5,3},Z)

o8 = 1

i9 : 
