-- -*- M2-comint -*- hash: 238885285

i1 : L = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
                  Signs=>{1,1,1},LastWeightHomological=>true)

o1 = L

o1 : LieAlgebra

i2 : D= differentialLieAlgebra({0_L,a a,a b})

o2 = D

o2 : LieAlgebra

i3 : J=lieIdeal({b b + 4 a c})

o3 = J

o3 : FGLieIdeal

i4 : Q=D/J

o4 = Q

o4 : LieAlgebra

i5 : dims(7,Q)

o5 = | 1 1 0 0 0 0 0 |
     | 0 1 1 1 1 1 1 |
     | 0 0 1 1 1 1 2 |
     | 0 0 0 0 1 1 2 |
     | 0 0 0 0 0 1 1 |
     | 0 0 0 0 0 0 0 |
     | 0 0 0 0 0 0 0 |

              7        7
o5 : Matrix ZZ  <--- ZZ

i6 : Z=cycles Q

o6 = Z

o6 : LieSubAlgebra

i7 : dims(5,Z)

o7 = | 1 1 0 0 0 |
     | 0 0 1 1 1 |
     | 0 0 0 0 0 |
     | 0 0 0 0 1 |
     | 0 0 0 0 0 |

              5        5
o7 : Matrix ZZ  <--- ZZ

i8 : H=lieHomology Q

o8 = H

o8 : VectorSpace

i9 : dims(1,5,H)

o9 = {1, 0, 0, 0, 1}

o9 : List

i10 : E=extAlgebra(5,Q)

o10 = E

o10 : ExtAlgebra

i11 : dims(4,E)

o11 = | 1 0 0 0 |
      | 0 1 0 0 |
      | 0 0 1 0 |
      | 0 0 0 1 |

               4        4
o11 : Matrix ZZ  <--- ZZ

i12 : 
