-- -*- M2-comint -*- hash: 1136721132

i1 : L = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
          Signs=>1,LastWeightHomological=>true)

o1 = L

o1 : LieAlgebra

i2 : D= differentialLieAlgebra({0_L,a a,a b})

o2 = D

o2 : LieAlgebra

i3 : d=euler D

o3 = d

o3 : LieDerivation

i4 : d a b c

o4 = 6 (a b c)

o4 : D

i5 : describe d

o5 = a => a
     b => 2 b
     c => 3 c
     map => id_D
     sign => 0
     weight => {0, 0}
     source => D
     target => D

i6 : ic=innerDerivation c

o6 = ic

o6 : LieDerivation

i7 : e=d ic

o7 = e

o7 : LieDerivation

i8 : describe e

o8 = a => 3 (a c)
     b => 3 (b c)
     c => 3 (c c)
     map => id_D
     sign => 1
     weight => {3, 2}
     source => D
     target => D

i9 : e===(firstDegree ic) ic

o9 = true

i10 : 
