-- -*- M2-comint -*- hash: 513406090

i1 : L = lieAlgebra({a,b,c},Weights=>{1,2,3})

o1 = L

o1 : LieAlgebra

i2 : firstDegree(c a b+a b c)

o2 = 6

i3 : E = extAlgebra(5,L)

o3 = E

o3 : ExtAlgebra

i4 : apply(gens E,firstDegree)

o4 = {1, 2, 3}

o4 : List

i5 : d=lieDerivation({a c b,b b c,c c b})

o5 = d

o5 : LieDerivation

i6 : firstDegree d

o6 = 5

i7 : 
