-- -*- M2-comint -*- hash: 387797015

i1 : L=holonomy({{a0,a1,a2,a3},{a0,a4,a5},{a1,a4,a6}})

o1 = L

o1 : LieAlgebra

i2 : describe L

o2 = generators => {a0, a1, a2, a3, a4, a5, a6}
     Weights => {{1, 0}, {1, 0}, {1, 0}, {1, 0}, {1, 0}, {1, 0}, {1, 0}}
     Signs => {0, 0, 0, 0, 0, 0, 0}
     ideal => {(a1 a0) - (a2 a1) - (a3 a1), (a2 a0) + (a2 a1) - (a3 a2), (a3 a0) + (a3 a1) + (a3 a2), (a4 a0) - (a5 a4), (a5 a0) + (a5 a4), (a4 a1) - (a6 a4), (a6 a1) + (a6 a4), (a4 a2), (a4 a3), (a5 a1), (a5 a2), (a5 a3), (a6 a0), (a6 a2), (a6 a3), (a6 a5)}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i3 : dims(1,4,L)

o3 = {7, 5, 12, 24}

o3 : List

i4 : M=holonomy({{a1,a2,a3},{a4,a5}},{{a1,a4,a6}})

o4 = M

o4 : LieAlgebra

i5 : describe M

o5 = generators => {a1, a2, a3, a4, a5, a6}
     Weights => {{1, 0}, {1, 0}, {1, 0}, {1, 0}, {1, 0}, {1, 0}}
     Signs => {0, 0, 0, 0, 0, 0}
     ideal => {(a4 a1) - (a6 a4), (a6 a1) + (a6 a4), (a4 a2), (a4 a3), (a5 a1), (a5 a2), (a5 a3), (a6 a2), (a6 a3), (a6 a5)}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i6 : dims(1,4,M)

o6 = {6, 5, 12, 24}

o6 : List

i7 : 
