-- -*- M2-comint -*- hash: -1926656960

i1 : H=holonomy({{a1,a2},{a3,a4}},{{a1,a3,a5},{a2,a4,a5}})

o1 = H

o1 : LieAlgebra

i2 : describe holonomyLocal(1,H)

o2 = generators => {a3, a4}
     Weights => {{1, 0}, {1, 0}}
     Signs => {0, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i3 : describe holonomyLocal(2,H)

o3 = generators => {a1, a3, a5}
     Weights => {{1, 0}, {1, 0}, {1, 0}}
     Signs => {0, 0, 0}
     ideal => {(a3 a1) - (a5 a3), (a5 a1) + (a5 a3)}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i4 : 
