-- -*- M2-comint -*- hash: 322017668

i1 : L=lieAlgebra{a,b}/{a a a b,b b b a}

o1 = L

o1 : LieAlgebra

i2 : ideal L

o2 = { - (a a b a), (b b b a)}

o2 : List

i3 : describe L

o3 = generators => {a, b}
     Weights => {{1, 0}, {1, 0}}
     Signs => {0, 0}
     ideal => { - (a a b a), (b b b a)}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i4 : F=lieAlgebra{a,b}

o4 = F

o4 : LieAlgebra

i5 : f=map(L,F)

o5 = f

o5 : LieAlgebraMap

i6 : J=kernel f

o6 = J

o6 : LieIdeal

i7 : N=F/J

o7 = N

o7 : LieAlgebra

i8 : ideal N

o8 = J

o8 : LieIdeal

i9 : 
