-- -*- M2-comint -*- hash: -516362181

i1 : F=lieAlgebra({a,b,c,r3,r4,r42},
       Weights => {{1,0},{1,0},{2,0},{3,1},{4,1},{4,2}},Signs=>{0,0,0,1,1,0},
       LastWeightHomological=>true)

o1 = F

o1 : LieAlgebra

i2 : D=differentialLieAlgebra{0_F,0_F,0_F,a c,a a c,r4 - a r3}

o2 = D

o2 : LieAlgebra

i3 : I=lieIdeal{b c - a c,a b,b r4 - a r4}

o3 = I

o3 : FGLieIdeal

i4 : S=lieIdeal{a c}

o4 = S

o4 : FGLieIdeal

i5 : Q=D/I

o5 = Q

o5 : LieAlgebra

i6 : f=map(Q,D)

o6 = f

o6 : LieAlgebraMap

i7 : T=image(f,S)

o7 = T

o7 : LieSubAlgebra

i8 : basis(5,T)

o8 = {(b b b c), (c b c)}

o8 : List

i9 : 
