-- -*- M2-comint -*- hash: -423090156

i1 : L = lieAlgebra{a,b,c}

o1 = L

o1 : LieAlgebra

i2 : x = (basis(2,L))_0 (basis(3,L))_4

o2 =  - (a c b b a) + (b a c b a) - (b c a b a) + (c b a b a)

o2 : L

i3 : R = L#cache.mbRing

o3 = R

o3 : PolynomialRing

i4 : numgens R

o4 = 80

i5 : indexForm x

o5 = mb       - mb       - mb        + mb
       {5, 5}     {5, 7}     {5, 12}     {5, 15}

o5 : R

i6 : standardForm(oo,L)

o6 =  - (a c b b a) + (b a c b a) - (b c a b a) + (c b a b a)

o6 : L

i7 : indexForm a a b c

o7 = - mb       + 2mb       - mb
         {4, 2}      {4, 5}     {4, 9}

o7 : R

i8 : standardForm(oo,L)

o8 = 2 (a c b a) - (b a c a) - (c a b a)

o8 : L

i9 : a a b c===oo

o9 = true

i10 : 
      
