-- -*- M2-comint -*- hash: -842999043

i1 : F=lieAlgebra{a,b,c}

o1 = F

o1 : LieAlgebra

i2 : I=lieIdeal{b c - a c}

o2 = I

o2 : FGLieIdeal

i3 : Q=F/I

o3 = Q

o3 : LieAlgebra

i4 : f=map(Q,F)

o4 = f

o4 : LieAlgebraMap

i5 : J=lieIdeal{a b}

o5 = J

o5 : FGLieIdeal

i6 : K=inverse(f,J)

o6 = K

o6 : LieIdeal

i7 : dims(1,6,F/K)

o7 = {3, 1, 2, 3, 6, 9}

o7 : List

i8 : dims(1,6,Q/J)

o8 = {3, 1, 2, 3, 6, 9}

o8 : List

i9 : 
