-- -*- M2-comint -*- hash: 620810807

i1 : F = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
         Signs=>{1,1,1},LastWeightHomological=>true)

o1 = F

o1 : LieAlgebra

i2 : D = differentialLieAlgebra({0_F,a a,a b})

o2 = D

o2 : LieAlgebra

i3 : d = differential D

o3 = d

o3 : LieDerivation

i4 : B = boundaries D

o4 = B

o4 : LieSubAlgebra

i5 : x = (a a b a c) + (a a a b c)

o5 = (a a b a c) + (a a a b c)

o5 : D

i6 : member(x,B)

o6 = true

i7 : S = inverse(d,lieIdeal{x})

o7 = S

o7 : LieSubAlgebra

i8 : weight x

o8 = {8, 3}

o8 : List

i9 : basis(8,4,S)

o9 = {(a a c c), (b b a c) + (b a b c)}

o9 : List

i10 : d\oo

o10 = {2 (a a b a c) + 2 (a a a b c), 2 (a a b a c) + 2 (a a a b c)}

o10 : List

i11 : 
      
