-- -*- M2-comint -*- hash: -540805865

i1 : F=lieAlgebra{a,b}

o1 = F

o1 : LieAlgebra

i2 : L=F/{a a a b,b b b a}

o2 = L

o2 : LieAlgebra

i3 : e=euler L

o3 = e

o3 : LieDerivation

i4 : isWellDefined(4,e)
the derivation is well defined for all degrees

o4 = true

i5 : d4=lieDerivation{0_L,a b a b a}
warning: the derivation might not be well defined, use isWellDefined

o5 = d4

o5 : LieDerivation

i6 : isWellDefined(4,d4)

o6 = false

i7 : d5=lieDerivation{0_L,b a b a b a}
warning: the derivation might not be well defined, use isWellDefined

o7 = d5

o7 : LieDerivation

i8 : isWellDefined(4,d5)
the derivation is well defined for all degrees

o8 = true

i9 : di=innerDerivation(a b a b a)

o9 = d5

o9 : LieDerivation

i10 : isWellDefined(4,di)
the derivation is well defined for all degrees

o10 = true

i11 : di===d5

o11 = true

i12 : 
