-- -*- M2-comint -*- hash: 1394729760

i1 : F=lieAlgebra{a,b,c}

o1 = F

o1 : LieAlgebra

i2 : L=F/{a b,a b c}

o2 = L

o2 : LieAlgebra

i3 : M=minimalModel(3,L)

o3 = M

o3 : LieAlgebra

i4 : isSurjective map M

o4 = true

i5 : f=map(F,L)
warning: the map might not be well defined, 
           use isWellDefined

o5 = f

o5 : LieAlgebraMap

i6 : isSurjective f

o6 = true

i7 : isWellDefined(3,f)
the map is not well defined
the map commutes with the differential for all degrees

o7 = false

i8 : g=map(L,F)

o8 = g

o8 : LieAlgebraMap

i9 : isSurjective g

o9 = true

i10 : 
      
