-- -*- M2-comint -*- hash: 1626179029

i1 : L=lieAlgebra({a,b},Signs=>1,LastWeightHomological=>true,
         Weights=>{{1,0},{2,1}})

o1 = L

o1 : LieAlgebra

i2 : F=lieAlgebra({a,b,c},
         Weights=>{{1,0},{2,1},{5,2}},Signs=>1,LastWeightHomological=>true)

o2 = F

o2 : LieAlgebra

i3 : D=differentialLieAlgebra{0_F,a a,a a a b}

o3 = D

o3 : LieAlgebra

i4 : Q1=D/{a a a a b,a b a b + a c}

o4 = Q1

o4 : LieAlgebra

i5 : use F

i6 : Q2=F/{a a a a b,a b a b + a c}

o6 = Q2

o6 : LieAlgebra

i7 : f=map(D,Q1)
warning: the map might not be well defined, 
           use isWellDefined

o7 = f

o7 : LieAlgebraMap

i8 : isWellDefined(6,f)
the map is not well defined
the map commutes with the differential for all degrees

o8 = false

i9 : g=map(Q1,Q2)
warning: the map might not be well defined, 
           use isWellDefined

o9 = g

o9 : LieAlgebraMap

i10 : isWellDefined(6,g)
the map is well defined for all degrees
the map does not commute with the differential

o10 = false

i11 : h=map(Q1,D)

o11 = h

o11 : LieAlgebraMap

i12 : isWellDefined(6,h)
the map is well defined for all degrees
the map commutes with the differential for all degrees

o12 = true

i13 : 
      
