-- -*- M2-comint -*- hash: 218164225

i1 : L = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
            Signs=>{1,1,1},LastWeightHomological=>true)

o1 = L

o1 : LieAlgebra

i2 : D= differentialLieAlgebra({0_L,a a,a b})

o2 = D

o2 : LieAlgebra

i3 : Q=D/{b b+4 a c}

o3 = Q

o3 : LieAlgebra

i4 : d=differential Q

o4 = d

o4 : LieDerivation

i5 : Z=kernel d

o5 = Z

o5 : LieSubAlgebra

i6 : C=cycles Q

o6 = C

o6 : LieSubAlgebra

i7 : dims(8,Z)

o7 = | 1 1 0 0 0 0 0 0 |
     | 0 0 1 1 1 1 1 1 |
     | 0 0 0 0 0 0 1 2 |
     | 0 0 0 0 1 1 1 1 |
     | 0 0 0 0 0 0 0 1 |
     | 0 0 0 0 0 0 0 0 |
     | 0 0 0 0 0 0 0 0 |
     | 0 0 0 0 0 0 0 0 |

              8        8
o7 : Matrix ZZ  <--- ZZ

i8 : dims(8,C)

o8 = | 1 1 0 0 0 0 0 0 |
     | 0 0 1 1 1 1 1 1 |
     | 0 0 0 0 0 0 1 2 |
     | 0 0 0 0 1 1 1 1 |
     | 0 0 0 0 0 0 0 1 |
     | 0 0 0 0 0 0 0 0 |
     | 0 0 0 0 0 0 0 0 |
     | 0 0 0 0 0 0 0 0 |

              8        8
o8 : Matrix ZZ  <--- ZZ

i9 : 
     
     
