-- -*- M2-comint -*- hash: -736694064

i1 : describe lieAlgebra({a,b},Weights=>{{1,2},{2,3}})

o1 = generators => {a, b}
     Weights => {{1, 2, 0}, {2, 3, 0}}
     Signs => {0, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i2 : describe lieAlgebra({a,b},Weights=>{{2,1},{3,2}},
         LastWeightHomological=>true)

o2 = generators => {a, b}
     Weights => {{2, 1}, {3, 2}}
     Signs => {0, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i3 : describe lieAlgebra{a,b}

o3 = generators => {a, b}
     Weights => {{1, 0}, {1, 0}}
     Signs => {0, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i4 : describe lieAlgebra({a,b},Weights=>{{1,0},{1,0}})

o4 = generators => {a, b}
     Weights => {{1, 0, 0}, {1, 0, 0}}
     Signs => {0, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i5 : describe lieAlgebra({a,b},Weights=>{{1,0},{1,0}},
         LastWeightHomological=>true)

o5 = generators => {a, b}
     Weights => {{1, 0}, {1, 0}}
     Signs => {0, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i6 : describe lieAlgebra({a,b},Weights=>{1,2})

o6 = generators => {a, b}
     Weights => {{1, 0}, {2, 0}}
     Signs => {0, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i7 : 
