-- -*- M2-comint -*- hash: -2069618001

i1 : L=lieAlgebra{a,b}/{a a a b,b b b a}

o1 = L

o1 : LieAlgebra

i2 : dims(1,4,L)

o2 = {2, 1, 2, 1}

o2 : List

i3 : L#cache.max

o3 = 5

i4 : L#cache.lieRing

o4 = QQ[aR ..aR ]
          0    9

o4 : PolynomialRing

i5 : dims(1,6,L)

o5 = {2, 1, 2, 1, 2, 1}

o5 : List

i6 : L#cache.max

o6 = 11

i7 : numgens L#cache.lieRing

o7 = 22

i8 : dims(1,10,L)

o8 = {2, 1, 2, 1, 2, 1, 2, 1, 2, 1}

o8 : List

i9 : L#cache.max

o9 = 11

i10 : numgens L#cache.lieRing

o10 = 22

i11 : 
      
      
