-- -*- M2-comint -*- hash: 40472984

i1 : F=lieAlgebra({a,b,c,r3,r4,r42},
        Weights => {{1,0},{1,0},{2,0},{3,1},{4,1},{4,2}},
        Signs=>{0,0,0,1,1,0},LastWeightHomological=>true)

o1 = F

o1 : LieAlgebra

i2 : D=differentialLieAlgebra{0_F,0_F,0_F,a c,a a c,r4 - a r3}

o2 = D

o2 : LieAlgebra

i3 : S=lieSubAlgebra{b c - a c,a b,b r4 - a r4}

o3 = S

o3 : FGLieSubAlgebra

i4 : describe S

o4 = generators => { - (a c) + (b c),  - (b a),  - (a r4) + (b r4),  - (a a a
     lieAlgebra => D
     ------------------------------------------------------------------------
     c) + (b a a c)}

i5 : basis(5,S)

o5 = {(a b a c) - (a b b c) - (b a a c) + (b a b c), (a a a c) - (b a a c),
     ------------------------------------------------------------------------
     (a r4) - (b r4)}

o5 : List

i6 : d=differential D

o6 = d

o6 : LieDerivation

i7 : d\S#gens

o7 = {0, 0,  - (a a a c) + (b a a c), 0}

o7 : List

i8 : (b c-a c) a b

o8 = (a b a c) - (a b b c) - (b a a c) + (b a b c)

o8 : D

i9 : 
