-- -*- M2-comint -*- hash: 1626705288

i1 : L=lieAlgebra({x,y},Signs=>1)

o1 = L

o1 : LieAlgebra

i2 : M=lieAlgebra({a,b},Weights=>{2,2})/{b a b}

o2 = M

o2 : LieAlgebra

i3 : f = map(L,M,{x x,0_L})
warning: the map might not be well defined, 
         use isWellDefined

o3 = f

o3 : LieAlgebraMap

i4 : d = lieDerivation(f,{x,y})
warning: the derivation might not be well defined, use isWellDefined

o4 = d

o4 : LieDerivation

i5 : isWellDefined(6,d)
the derivation is well defined for all degrees

o5 = true

i6 : describe d

o6 = a => x
     b => y
     map => f
     sign => 1
     weight => {-1, 0}
     source => M
     target => L

i7 : d a b

o7 =  - (y x x)

o7 : L

i8 : L=lieAlgebra({x,y},Signs=>1)

o8 = L

o8 : LieAlgebra

i9 : e = euler L

o9 = e

o9 : LieDerivation

i10 : d1 = lieDerivation{x y,0_L}

o10 = d1

o10 : LieDerivation

i11 : d3 = lieDerivation{x x x y,0_L}

o11 = d3

o11 : LieDerivation

i12 : describe d3

o12 = x =>  - (1/2)(x y x x)
      y => 0
      map => id_L
      sign => 1
      weight => {3, 0}
      source => L
      target => L

i13 : e d1

o13 = d1

o13 : LieDerivation

i14 : e d3

o14 = derivation from L to L

o14 : LieDerivation

i15 : oo===3 d3

o15 = true

i16 : 
