-- -*- M2-comint -*- hash: -1810648366

i1 : F1 = lieAlgebra{a,b}

o1 = F1

o1 : LieAlgebra

i2 : L1=F1/{a a b - b b a, a a a a b}

o2 = L1

o2 : LieAlgebra

i3 : dims(1,6,L1)

o3 = {2, 1, 1, 1, 1, 0}

o3 : List

i4 : describe L1

o4 = generators => {a, b}
     Weights => {{1, 0}, {1, 0}}
     Signs => {0, 0}
     ideal => { - (a b a) - (b b a),  - (a a a b a)}
     ambient => F1
     diff => {}
     Field => QQ
     computedDegree => 6


i5 : F2 = lieAlgebra({a,b,c},Weights=>{{1,0},{1,0},{2,1}},
            Signs=>{1,1,1},LastWeightHomological=>true)

o5 = F2

o5 : LieAlgebra

i6 : D2 = differentialLieAlgebra{0_F2,0_F2,a a + b b}

o6 = D2

o6 : LieAlgebra

i7 : L2=D2/{a b,a c}

o7 = L2

o7 : LieAlgebra

i8 : describe L2

o8 = generators => {a, b, c}
     Weights => {{1, 0}, {1, 0}, {2, 1}}
     Signs => {1, 1, 1}
     ideal => {(b a), (a c),  - (a a a) - (a b b)}
     ambient => F2
     diff => {0, 0, (a a) + (b b)}
     Field => QQ
     computedDegree => 0


i9 : dims(5,L2)

o9 = | 2 2 0 0 0 |
     | 0 1 1 1 1 |
     | 0 0 0 1 1 |
     | 0 0 0 0 0 |
     | 0 0 0 0 0 |

              5        5
o9 : Matrix ZZ  <--- ZZ

i10 : describe lieAlgebra{}

o10 = generators => {}
      Weights => {}
      Signs => {}
      ideal => {}
      ambient => LieAlgebra{...10...}
      diff => {}
      Field => QQ
      computedDegree => 0


i11 : 
