-- -*- M2-comint -*- hash: 1562615420

i1 : describe lieAlgebra{a,b}

o1 = generators => {a, b}
     Weights => {{1, 0}, {1, 0}}
     Signs => {0, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i2 : describe lieAlgebra({a,b},Signs=>{1,0})

o2 = generators => {a, b}
     Weights => {{1, 0}, {1, 0}}
     Signs => {1, 0}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i3 : describe lieAlgebra({a,b},Signs=>1)

o3 = generators => {a, b}
     Weights => {{1, 0}, {1, 0}}
     Signs => {1, 1}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i4 : 
