-- -*- M2-comint -*- hash: 1369955573

i1 : F = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
               Signs=>{1,1,1},LastWeightHomological=>true)

o1 = F

o1 : LieAlgebra

i2 : D = differentialLieAlgebra({0_F,a a,a b})

o2 = D

o2 : LieAlgebra

i3 : I = lieIdeal{a b,c}

o3 = I

o3 : FGLieIdeal

i4 : gens I

o4 = {(a b), c,  - (a a a), (a b)}

o4 : List

i5 : C = cycles D

o5 = C

o5 : LieSubAlgebra

i6 : basis(4,C)

o6 = {(a a b), (b b) + 4 (a c)}

o6 : List

i7 : I = lieIdeal C

o7 = I

o7 : LieIdeal

i8 : basis(4,I)

o8 = {(a a b), (a c), (b b)}

o8 : List

i9 : 
