-- -*- M2-comint -*- hash: -866649704

i1 : F = toField(ZZ/7[x]/ideal{x^2+1})

o1 = F

o1 : PolynomialRing

i2 : L = lieAlgebra({a,b},Field=>F)

o2 = L

o2 : LieAlgebra

i3 : (3*x+2) a b + (2*x+3) b a

o3 = (-x+1)(b a)

o3 : L

i4 : 
