-- -*- M2-comint -*- hash: 1356193406

i1 : L1=lieAlgebra({a,b},Signs=>1,LastWeightHomological=>true,
         Weights=>{{1,0},{2,1}})/{a a}

o1 = L1

o1 : LieAlgebra

i2 : F2=lieAlgebra({a,b,c},
         Weights=>{{1,0},{2,1},{5,2}},Signs=>1,LastWeightHomological=>true)

o2 = F2

o2 : LieAlgebra

i3 : D2=differentialLieAlgebra{0_F2,a a,a a a b}

o3 = D2

o3 : LieAlgebra

i4 : L2=D2/{a a a a b,a b a b + a c}

o4 = L2

o4 : LieAlgebra

i5 : use L1

i6 : f=map(L1,L2,{a,0_L1,a b b})
warning: the map might not be well defined, 
         use isWellDefined

o6 = f

o6 : LieAlgebraMap

i7 : isWellDefined(6,f)
the map is well defined for all degrees
the map commutes with the differential for all degrees

o7 = true

i8 : describe f

o8 = a => a
     b => 0
     c => (a b b)
     source => L2
     target => L1

i9 : use L2

i10 : f c c

o10 = 2 (a b b a b b)

o10 : L1

i11 : 
