-- -*- M2-comint -*- hash: 1692877207

i1 : R=QQ[x]

o1 = R

o1 : PolynomialRing

i2 : L=koszulDual R

o2 = L

o2 : LieAlgebra

i3 : describe L

o3 = generators => {ko }
                      0
     Weights => {{1, 0}}
     Signs => {1}
     ideal => { - (1/2)(ko_0 ko_0)}
     ambient => LieAlgebra{...10...}
     diff => {}
     Field => QQ
     computedDegree => 0


i4 : E=extAlgebra(5,L)

o4 = E

o4 : ExtAlgebra

i5 : dims(5,E)

o5 = | 1 0 0 0 0 |
     | 0 1 0 0 0 |
     | 0 0 1 0 0 |
     | 0 0 0 1 0 |
     | 0 0 0 0 1 |

              5        5
o5 : Matrix ZZ  <--- ZZ

i6 : describe minimalModel(5,L)

o6 = generators => {fr , fr , fr , fr , fr }
                      0    1    2    3    4
     Weights => {{1, 0}, {2, 1}, {3, 2}, {4, 3}, {5, 4}}
     Signs => {1, 1, 1, 1, 1}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {0, (fr_0 fr_0), (fr_0 fr_1), (fr_1 fr_1) + 4 (fr_0 fr_2), 2 (fr_1 fr_2) + (fr_0 fr_3)}
     Field => QQ
     computedDegree => 5
     map => fr  => ko_0
              0
            fr  => 0
              1
            fr  => 0
              2
            fr  => 0
              3
            fr  => 0
              4
            source => LieAlgebra{...10...}
            target => L

i7 : L1=lieAlgebra{a,b,c}/{a b,a b c}

o7 = L1

o7 : LieAlgebra

i8 : M1= minimalModel(3,L1)

o8 = M1

o8 : LieAlgebra

i9 : describe M1

o9 = generators => {fr , fr , fr , fr , fr }
                      0    1    2    3    4
     Weights => {{1, 0}, {1, 0}, {1, 0}, {2, 1}, {3, 1}}
     Signs => {0, 0, 0, 1, 1}
     ideal => {}
     ambient => LieAlgebra{...10...}
     diff => {0, 0, 0, (fr_1 fr_0), (fr_1 fr_2 fr_0)}
     Field => QQ
     computedDegree => 3
     map => fr  => a
              0
            fr  => b
              1
            fr  => c
              2
            fr  => 0
              3
            fr  => 0
              4
            source => M1
            target => L1

i10 : H=lieHomology M1

o10 = H

o10 : VectorSpace

i11 : dims(6,L1)===dims(6,H)

o11 = true

i12 : 
      
      
      
      
      
