-- -*- M2-comint -*- hash: 1233529226

i1 : L = lieAlgebra({a,b,c,d,e}, Field=>ZZ/7)

o1 = L

o1 : LieAlgebra

i2 : Q = L/apply(7,i->random(2,L))

o2 = Q

o2 : LieAlgebra

i3 : dims(1,8,Q)

o3 = {5, 3, 5, 3, 5, 3, 5, 3}

o3 : List

i4 : random({4,0},Q)

o4 = (-2)(d e e a) - (e e e a) + (-3)(e e e d)

o4 : Q

i5 : 
