-- -*- M2-comint -*- hash: 1032079722

i1 : L = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
     	 LastWeightHomological=>true, Signs => 1)

o1 = L

o1 : LieAlgebra

i2 : D=differentialLieAlgebra{0_L,a a,a b}/{a a b, a a c, b a b}

o2 = D

o2 : LieAlgebra

i3 : x=a b c+2 c b a

o3 =  - 2 (b a c) - (a b c)

o3 : D

i4 : sign x

o4 = 1

i5 : E=extAlgebra(5,D)

o5 = E

o5 : ExtAlgebra

i6 : b=basis(5,E)

o6 = {ext_4, ext_5}

o6 : List

i7 : apply(b,sign)

o7 = {1, 1}

o7 : List

i8 : sign differential D

o8 = 1

i9 : 
