-- -*- M2-comint -*- hash: -585682568

i1 : L = lieAlgebra{a,b}

o1 = L

o1 : LieAlgebra

i2 : b3 = basis(3,L)

o2 = {(a b a), (b b a)}

o2 : List

i3 : Q = L#cache.mbRing

o3 = Q

o3 : PolynomialRing

i4 : gens Q

o4 = {mb      , mb      , mb      , mb      , mb      }
        {1, 0}    {1, 1}    {2, 0}    {3, 0}    {3, 1}

o4 : List

i5 : c3 = {indexForm a a b,indexForm b a b}

o5 = {-mb      , -mb      }
         {3, 0}     {3, 1}

o5 : List

i6 : standardForm(c3,L)

o6 = { - (a b a),  - (b b a)}

o6 : List

i7 : standardForm(mb_{3,0}+2*mb_{3,1},L)

o7 = (a b a) + 2 (b b a)

o7 : L

i8 : indexForm oo

o8 = mb       + 2mb
       {3, 0}      {3, 1}

o8 : Q

i9 : 
