-- -*- M2-comint -*- hash: -557439708

i1 : L = lieAlgebra({a,b,c},Weights=>{{1,0},{2,1},{3,2}},
     	 LastWeightHomological=>true, Signs => 1)

o1 = L

o1 : LieAlgebra

i2 : D=differentialLieAlgebra{0_L,a a,a b}/{a a b, a a c, b a b}

o2 = D

o2 : LieAlgebra

i3 : x=a b c+2 c b a

o3 =  - 2 (b a c) - (a b c)

o3 : D

i4 : weight x

o4 = {6, 3}

o4 : List

i5 : weight 0_D

o5 = {0, 0}

o5 : List

i6 : E=extAlgebra(5,D)

o6 = E

o6 : ExtAlgebra

i7 : b=basis(5,E)

o7 = {ext_4, ext_5}

o7 : List

i8 : apply(b,weight)

o8 = {{5, 4}, {5, 4}}

o8 : List

i9 : weight differential D

o9 = {0, -1}

o9 : List

i10 : 
