-- -*- M2-comint -*- hash: -83375363

i1 : S = ZZ/101[a,b,c,d]

o1 = S

o1 : PolynomialRing

i2 : ff = matrix{{a,b,c,d}}

o2 = | a b c d |

             1       4
o2 : Matrix S  <--- S

i3 : (koszul ff).dd_2

o3 = {1} | -b -c 0  -d 0  0  |
     {1} | a  0  -c 0  -d 0  |
     {1} | 0  a  b  0  0  -d |
     {1} | 0  0  0  a  b  c  |

             4       6
o3 : Matrix S  <--- S

i4 : (trueKoszul ff).dd_2

o4 = {1} | -b -c -d 0  0  0  |
     {1} | a  0  0  -c -d 0  |
     {1} | 0  a  0  b  0  -d |
     {1} | 0  0  a  0  b  c  |

             4       6
o4 : Matrix S  <--- S

i5 : basis(2,(ZZ/101[a,b,c,d, SkewCommutative => true]))

o5 = | ab ac ad bc bd cd |

              ZZ       1        ZZ       6
o5 : Matrix (---[a..d])  <--- (---[a..d])
             101               101

i6 : 
