-- -*- M2-comint -*- hash: -1306438560

i1 : R=ZZ/32003[a..c];

i2 : LPP(R,{1,3,6,5,3},{3,3,4})

             3   3   4   2    2      2       2   2 3
o2 = ideal (a , b , c , a b, a c, a*b , a*b*c , b c )

o2 : Ideal of R

i3 : LPP(R,{1,3,4,2,1},{2,3,5}) --an Artinian lex ideal

             2   3   5          2   2      3
o3 = ideal (a , b , c , a*b, a*c , b c, b*c )

o3 : Ideal of R

i4 : LPP(R,{1,3,4,2,1},{2,4,3}) --exponents not in weakly increasing order

i5 : LPP(R,{1,3,4,2,1},{2,2,3}) --no LPP ideal with this Hilbert function and power sequence

i6 : 
