-- -*- M2-comint -*- hash: -718045700

i1 : R=ZZ/32003[a..c];

i2 : L=lexIdeal(R,{1,3,6,9,9,6,2});

o2 : Ideal of R

i3 : betti res L

            0  1  2  3
o3 = total: 1 16 27 12
         0: 1  .  .  .
         1: .  .  .  .
         2: .  1  .  .
         3: .  3  5  2
         4: .  5  9  4
         5: .  5  9  4
         6: .  2  4  2

o3 : BettiTally

i4 : cancelAll L

total: 1 4 5 2
    0: 1 . . .
    1: . . . .
    2: . 1 . .
    3: . 3 . .
    4: . . 2 .
    5: . . 3 .
    6: . . . 2

o4 = {{3, 4, 4, 4}, {6, 6, 7, 7, 7}, {9, 9}}

o4 : List

i5 : M=lexIdeal(R,{1,3,4,3,2});

o5 : Ideal of R

i6 : betti res M

            0 1  2 3
o6 = total: 1 7 10 4
         0: 1 .  . .
         1: . 2  1 .
         2: . 2  3 1
         3: . 1  2 1
         4: . 2  4 2

o6 : BettiTally

i7 : cancelAll M

total: 1 3 5 3
    0: 1 . . .
    1: . 2 . .
    2: . 1 2 1
    3: . . . .
    4: . . 3 2

o7 = {{2, 2, 3}, {4, 4, 6, 6, 6}, {5, 7, 7}}

o7 : List

i8 : A=ZZ/32003[a..e];

i9 : J=lexIdeal(A,{1,5,12,10,6,3})

                       2     2     2                        2      2     2 
o9 = ideal (a*c, a*b, a , b*e , a*e , b*d*e, a*d*e, b*c*e, b e, b*d , a*d ,
     ------------------------------------------------------------------------
             2      2   2    3       2   2 2     2    2      3      3   2 2 
     b*c*d, b d, b*c , b c, b , c*d*e , c e , c*d e, c d*e, c e, c*d , c d ,
     ------------------------------------------------------------------------
      3    4     4   3 2   4    5   6     5   2 4
     c d, c , c*e , d e , d e, d , e , d*e , d e )

o9 : Ideal of A

i10 : betti res J

             0  1   2   3  4  5
o10 = total: 1 32 102 130 76 17
          0: 1  .   .   .  .  .
          1: .  3   3   1  .  .
          2: . 13  41  50 28  6
          3: .  9  31  40 23  5
          4: .  4  15  21 13  3
          5: .  3  12  18 12  3

o10 : BettiTally

i11 : cancelAll J

total: 1 13 31 28 17 8
    0: 1  .  .  .  . .
    1: .  3  .  .  . .
    2: . 10 31 23  . .
    3: .  .  .  .  8 5
    4: .  .  .  .  . .
    5: .  .  .  5  9 3

o11 = {{2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3}, {4, 4, 4, 4, 4, 4, 4, 4, 4,
      -----------------------------------------------------------------------
      4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4}, {5,
      -----------------------------------------------------------------------
      5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 8, 8,
      -----------------------------------------------------------------------
      8, 8, 8}, {7, 7, 7, 7, 7, 7, 7, 7, 9, 9, 9, 9, 9, 9, 9, 9, 9}, {8, 8,
      -----------------------------------------------------------------------
      8, 8, 8, 10, 10, 10}}

o11 : List

i12 : 
