-- -*- M2-comint -*- hash: 298842125

i1 : R=ZZ/32003[a..c];

i2 : generateLPPs(R,{1,3,4,3,2})

                          2   2   4                               2   2   5 
o2 = {{{2, 2, 4}, ideal (a , b , c , a*b*c)}, {{2, 2, 5}, ideal (a , b , c ,
     ------------------------------------------------------------------------
               3     4                        2   3   4          2   2 3   
     a*b*c, a*c , b*c )}, {{2, 3, 4}, ideal (a , b , c , a*b, a*c , b c )},
     ------------------------------------------------------------------------
                         2   3   5          2   2 2     4
     {{2, 3, 5}, ideal (a , b , c , a*b, a*c , b c , b*c )}}

o2 : List

i3 : generateLPPs(R,{1,3,4,3,2},PrintIdeals=>true)
                  2   2   4
{2, 2, 4} ideal (a , b , c , a*b*c)
                  2   2   5            3     4
{2, 2, 5} ideal (a , b , c , a*b*c, a*c , b*c )
                  2   3   4          2   2 3
{2, 3, 4} ideal (a , b , c , a*b, a*c , b c )
                  2   3   5          2   2 2     4
{2, 3, 5} ideal (a , b , c , a*b, a*c , b c , b*c )

                          2   2   4                               2   2   5 
o3 = {{{2, 2, 4}, ideal (a , b , c , a*b*c)}, {{2, 2, 5}, ideal (a , b , c ,
     ------------------------------------------------------------------------
               3     4                        2   3   4          2   2 3   
     a*b*c, a*c , b*c )}, {{2, 3, 4}, ideal (a , b , c , a*b, a*c , b c )},
     ------------------------------------------------------------------------
                         2   3   5          2   2 2     4
     {{2, 3, 5}, ideal (a , b , c , a*b, a*c , b c , b*c )}}

o3 : List

i4 : 
