-- -*- M2-comint -*- hash: -1360168005

i1 : R=ZZ/32003[a..c];

i2 : hilbertFunct ideal(a^3,b^3,c^3)

o2 = {1, 3, 6, 7, 6, 3, 1}

o2 : List

i3 : hilbertFunct ideal(a^3,a*b^2)

o3 = {1, 3, 6, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23,
     ------------------------------------------------------------------------
     24, 25}

o3 : List

i4 : hilbertFunct(ideal(a^3,a*b^2),MaxDegree=>4)

o4 = {1, 3, 6, 8, 9}

o4 : List

i5 : M=ideal(a^3,b^4,a*c);

o5 : Ideal of R

i6 : Q=R/M;

i7 : hilbertFunct ideal(c^4)

o7 = {1, 3, 5, 6, 5, 3, 1}

o7 : List

i8 : hilbertFunct ideal(b*c,a*b)

o8 = {1, 3, 3, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}

o8 : List

i9 : 
