-- -*- M2-comint -*- hash: -1082732536

i1 : R=ZZ/32003[a..c];

i2 : isLexIdeal lexIdeal(R,{1,3,4,3,1})

o2 = true

i3 : isLexIdeal ideal(a^3-a^2*b)

o3 = false

i4 : isLexIdeal ideal(a^3,a^2*b)

o4 = true

i5 : isLexIdeal ideal(a^3,a^2*b,a^3-a^2*b) --not given as a monomial ideal but still a lex ideal

o5 = true

i6 : Q=R/ideal(a^3,b^3,a*c^2);

i7 : isLexIdeal ideal(a^2*b,a^2*c)

o7 = true

i8 : isLexIdeal ideal(a^2*b,a*b^2)

o8 = false

i9 : 
