-- -*- M2-comint -*- hash: -888021110

i1 : R=ZZ/32003[a..c];

i2 : multUpperBound ideal(a^4,b^4,c^4)

degree = 64  upper bound = 64

o2 = true

i3 : multUpperBound ideal(a^3,b^5,c^6,a^2*b,a*b*c)

degree = 46  upper bound = 132

o3 = true

i4 : 
