-- -*- M2-comint -*- hash: -1891288898

i1 : S=ZZ/32003[a..c];

i2 : multBounds ideal(a^4,b^4,c^4)

lower bound = 64 degree = 64 upper bound = 64

o2 = true

i3 : multBounds ideal(a^3,b^4,c^5,a*b^3,b*c^2,a^2*c^3)

              35                           140
lower bound = -- degree = 27 upper bound = ---
               2                            3

o3 = true

i4 : 
