-- -*- M2-comint -*- hash: 910479361

i1 : S=ZZ/32003[a..c];

i2 : betti res lexIdeal(S,{1,3,4,2,1}) --just to see the resolution of the lex ideal

            0 1  2 3
o2 = total: 1 7 10 4
         0: 1 .  . .
         1: . 2  1 .
         2: . 3  5 2
         3: . 1  2 1
         4: . 1  2 1

o2 : BettiTally

i3 : multUpperHF(S,{1,3,4,2,1})

total: 1 4 5 2
    0: 1 . . .
    1: . 2 . .
    2: . 2 4 1
    3: . . . .
    4: . . 1 1

degree = 11  upper bound = 21

o3 = true

i4 : 
