-- -*- M2-comint -*- hash: -1840438448

i1 : R=ZZ/32003[a..c];

i2 : multLowerBound ideal(a^4,b^4,c^4)

lower bound = 64 degree = 64

o2 = true

i3 : multLowerBound ideal(a^3,b^5,c^6,a^2*b,a*b*c)

lower bound = 16 degree = 46

o3 = true

i4 : 
