-- -*- M2-comint -*- hash: -1588190946

i1 : Q = priorityQueue {3,7,1,5}

o1 = PriorityQueue{...4...}

o1 : PriorityQueue

i2 : min Q

o2 = 1

i3 : deleteMin Q;

i4 : insert(Q,2);

i5 : min Q

o5 = 2

i6 : R = priorityQueue {4,6,8};

i7 : QR = mergePQ(Q,R);

i8 : length QR

o8 = 7

i9 : 
