-- -*- M2-comint -*- hash: -1965477906

i1 : n={1,1};

i2 : (S,E) = productOfProjectiveSpaces n;

i3 : W=(chainComplex {map(E^0,E^1,0),map(E^1,E^0,0)})[1]

             1
o3 = 0  <-- E  <-- 0
                    
     -1     0      1

o3 : ChainComplex

i4 : time T=tateExtension W;
     -- used 0.172148 seconds

i5 : cohomologyMatrix(T,-{3,3},{3,3})

o5 = | 8h  4h  0 4  8  12 16 |
     | 6h  3h  0 3  6  9  12 |
     | 4h  2h  0 2  4  6  8  |
     | 2h  h   0 1  2  3  4  |
     | 0   0   0 0  0  0  0  |
     | 2h2 h2  0 h  2h 3h 4h |
     | 4h2 2h2 0 2h 4h 6h 8h |

                      7                7
o5 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i6 : W=beilinsonWindow T

             1
o6 = 0  <-- E  <-- 0
                    
     -1     0      1

o6 : ChainComplex

i7 : cohomologyMatrix(W,-{2,2},{2,2})

o7 = | 0 0 0 0 0 |
     | 0 0 0 0 0 |
     | 0 0 1 0 0 |
     | 0 0 0 0 0 |
     | 0 0 0 0 0 |

                      5                5
o7 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i8 : a={2,-3}

o8 = {2, -3}

o8 : List

i9 : W2=beilinsonWindow (T**E^{a}[sum a])

      4      11      6
o9 = E  <-- E   <-- E
                     
     -1     0       1

o9 : ChainComplex

i10 : cohomologyMatrix(W2,-{2,2},{2,2})

o10 = | 0 0  0  0 0 |
      | 0 0  0  0 0 |
      | 0 8h 4h 0 0 |
      | 0 6h 3h 0 0 |
      | 0 0  0  0 0 |

                       5                5
o10 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i11 : cohomologyMatrix(tateExtension W2,-{2,2},{2,2})

o11 = | 18h 12h 6h 0 6 |
      | 15h 10h 5h 0 5 |
      | 12h 8h  4h 0 4 |
      | 9h  6h  3h 0 3 |
      | 6h  4h  2h 0 2 |

                       5                5
o11 : Matrix (ZZ[h, k])  <--- (ZZ[h, k])

i12 : 
