-- -*- M2-comint -*- hash: 1746634730

i1 : A=matrix{{0,-1,0},{1,0,0},{0,0,-1}}

o1 = | 0 -1 0  |
     | 1 0  0  |
     | 0 0  -1 |

              3        3
o1 : Matrix ZZ  <--- ZZ

i2 : B=matrix{{0,-1,0},{1,0,0},{0,0,1}}

o2 = | 0 -1 0 |
     | 1 0  0 |
     | 0 0  1 |

              3        3
o2 : Matrix ZZ  <--- ZZ

i3 : C4xC2=finiteAction({A,B},QQ[x,y,z])

o3 = QQ[x..z] <- {| 0 -1 0  |, | 0 -1 0 |}
                  | 1 0  0  |  | 1 0  0 |
                  | 0 0  -1 |  | 0 0  1 |

o3 : FiniteGroupAction

i4 : time P1=primaryInvariants C4xC2
     -- used 2.09933 seconds

       2    2   2   4    4
o4 = {x  + y , z , x  + y }

o4 : List

i5 : time P2=primaryInvariants(C4xC2,Dade=>true)
     -- used 0.482951 seconds

           8         7          6 2         5 3         4 4         3 5  
o5 = {4096x  + 24576x y + 38912x y  - 18432x y  - 65280x y  + 18432x y  +
     ------------------------------------------------------------------------
           2 6           7        8         6 2         5   2         4 2 2  
     38912x y  - 24576x*y  + 4096y  - 23040x z  - 69120x y*z  - 28800x y z  -
     ------------------------------------------------------------------------
           2 4 2           5 2         6 2         4 4         3   4  
     28800x y z  + 69120x*y z  - 23040y z  + 42768x z  + 31104x y*z  +
     ------------------------------------------------------------------------
           2 2 4           3 4         4 4         2 6         2 6        8 
     67392x y z  - 31104x*y z  + 42768y z  - 29160x z  - 29160y z  + 6561z ,
     ------------------------------------------------------------------------
            8          7           6 2          5 3           4 4  
     104976x  - 629856x y + 997272x y  + 472392x y  - 1673055x y  -
     ------------------------------------------------------------------------
            3 5          2 6            7          8           6 2  
     472392x y  + 997272x y  + 629856x*y  + 104976y  - 1428840x z  +
     ------------------------------------------------------------------------
             5   2           4 2 2           2 4 2             5 2  
     4286520x y*z  - 1786050x y z  - 1786050x y z  - 4286520x*y z  -
     ------------------------------------------------------------------------
             6 2           4 4           3   4            2 2 4  
     1428840y z  + 6417873x z  - 4667544x y*z  + 10113012x y z  +
     ------------------------------------------------------------------------
               3 4           4 4            2 6            2 6           8 
     4667544x*y z  + 6417873y z  - 10588410x z  - 10588410y z  + 5764801z ,
     ------------------------------------------------------------------------
             8            7              6 2              5 3  
     1679616x  - 59719680x y + 789543936x y  - 4539432960x y  +
     ------------------------------------------------------------------------
                4 4              3 5             2 6              7  
     8903312896x y  + 4539432960x y  + 789543936x y  + 59719680x*y  +
     ------------------------------------------------------------------------
             8            6 2              5   2              4 2 2  
     1679616y  - 68864256x z  + 1224253440x y*z  - 5372262144x y z  -
     ------------------------------------------------------------------------
                2 4 2                5 2            6 2             4 4  
     5372262144x y z  - 1224253440x*y z  - 68864256y z  + 722864736x z  -
     ------------------------------------------------------------------------
               3   4              2 2 4               3 4             4 4  
     302330880x y*z  + 2721397824x y z  + 302330880x*y z  + 722864736y z  -
     ------------------------------------------------------------------------
               2 6             2 6            8
     348625296x z  - 348625296y z  + 43046721z }

o5 : List

i6 : time secondaryInvariants(P1,C4xC2)
     -- used 0.0882416 seconds

          3       3
o6 = {1, x y - x*y }

o6 : List

i7 : time secondaryInvariants(P2,C4xC2)
     -- used 3.87651 seconds

          2   2    2   4   2 2    2 2   2 2   3       3   4    4   6   2 4  
o7 = {1, z , x  + y , z , x z  + y z , x y , x y - x*y , x  + y , z , x z  +
     ------------------------------------------------------------------------
      2 4   2 2 2   3   2      3 2   4 2    4 2   4 2    2 4   5       5   6
     y z , x y z , x y*z  - x*y z , x z  + y z , x y  + x y , x y - x*y , x 
     ------------------------------------------------------------------------
        6   3   4      3 4   4 4    4 4   4 2 2    2 4 2   5   2      5 2 
     + y , x y*z  - x*y z , x z  + y z , x y z  + x y z , x y*z  - x*y z ,
     ------------------------------------------------------------------------
      6 2    6 2   4 4   5 3    3 5   6 2    2 6   7       7   8    8   5   4
     x z  + y z , x y , x y  - x y , x y  + x y , x y - x*y , x  + y , x y*z 
     ------------------------------------------------------------------------
          5 4   6 4    6 4   4 4 2   5 3 2    3 5 2   6 2 2    2 6 2   7   2
     - x*y z , x z  + y z , x y z , x y z  - x y z , x y z  + x y z , x y*z 
     ------------------------------------------------------------------------
          7 2   8 2    8 2   6 4    4 6   7 3    3 7   8 2    2 8   9   
     - x*y z , x z  + y z , x y  + x y , x y  - x y , x y  + x y , x y -
     ------------------------------------------------------------------------
        9   10    10   8 4    8 4   8 2 2    2 8 2   9   2      9 2   10 2  
     x*y , x   + y  , x z  + y z , x y z  + x y z , x y*z  - x*y z , x  z  +
     ------------------------------------------------------------------------
      10 2   7 5    5 7   8 4    4 8   9 3    3 9   10 2    2 10   11   
     y  z , x y  - x y , x y  + x y , x y  - x y , x  y  + x y  , x  y -
     ------------------------------------------------------------------------
        11   12    12   10 2 2    2 10 2   11   2      11 2   12 2    12 2 
     x*y  , x   + y  , x  y z  + x y  z , x  y*z  - x*y  z , x  z  + y  z ,
     ------------------------------------------------------------------------
      10 4    4 10   11 3    3 11   12 2    2 12   13       13   14    14 
     x  y  + x y  , x  y  - x y  , x  y  + x y  , x  y - x*y  , x   + y  ,
     ------------------------------------------------------------------------
      14 2    14 2   13 3    3 13   14 2    2 14   15       15   16    16 
     x  z  + y  z , x  y  - x y  , x  y  + x y  , x  y - x*y  , x   + y  ,
     ------------------------------------------------------------------------
      17       17   18    18   20    20
     x  y - x*y  , x   + y  , x   + y  }

o7 : List

i8 : #oo

o8 = 64

i9 : K=GF(101);

i10 : C4xC2=finiteAction({A,B},K[x,y,z])

o10 = K[x..z] <- {| 0 -1 0  |, | 0 -1 0 |}
                  | 1 0  0  |  | 1 0  0 |
                  | 0 0  -1 |  | 0 0  1 |

o10 : FiniteGroupAction

i11 : primaryInvariants(C4xC2,Dade=>true)

           8      7       6 2      5 3      4 4      3 5      2 6        7  
o11 = {- 6x  + 13x y + 45x y  + 46x y  + 42x y  - 46x y  + 45x y  - 13x*y  -
      -----------------------------------------------------------------------
        8      6 2      5   2      4 2 2      2 4 2        5 2      6 2  
      6y  - 34x z  + 20x y*z  + 37x y z  + 37x y z  - 20x*y z  - 34y z  -
      -----------------------------------------------------------------------
         4 4      3   4      2 2 4        3 4      4 4      2 6      2 6  
      39x z  - 45x y*z  - 12x y z  + 45x*y z  - 39y z  + 40x z  + 40y z  -
      -----------------------------------------------------------------------
         8       8      7      6 2      5 3      4 4      3 5     2 6  
      45z , - 33x  - 33x y + 6x y  - 23x y  - 42x y  + 23x y  + 6x y  +
      -----------------------------------------------------------------------
           7      8      6 2     5   2      4 2 2      2 4 2       5 2  
      33x*y  - 33y  + 16x z  + 8x y*z  - 15x y z  - 15x y z  - 8x*y z  +
      -----------------------------------------------------------------------
         6 2      4 4     3   4      2 2 4       3 4      4 4      2 6  
      16y z  - 23x z  - 9x y*z  - 13x y z  + 9x*y z  - 23y z  - 14x z  -
      -----------------------------------------------------------------------
         2 6      8       8      7       6 2      5 3      4 4      3 5  
      14y z  - 30z , - 20x  - 24x y + 49x y  - 15x y  + 39x y  + 15x y  +
      -----------------------------------------------------------------------
         2 6        7      8      6 2      5   2      4 2 2      2 4 2  
      49x y  + 24x*y  - 20y  - 18x z  - 31x y*z  - 22x y z  - 22x y z  +
      -----------------------------------------------------------------------
           5 2      6 2      4 4      3   4      2 2 4        3 4      4 4  
      31x*y z  - 18y z  + 41x z  + 24x y*z  - 34x y z  - 24x*y z  + 41y z  +
      -----------------------------------------------------------------------
         2 6      2 6      8
      18x z  + 18y z  - 20z }

o11 : List

i12 : 
