-- -*- M2-comint -*- hash: 1156893780

i1 : S = QQ[z]

o1 = S

o1 : PolynomialRing

i2 : I = ideal(z^2 - 1)

            2
o2 = ideal(z  - 1)

o2 : Ideal of S

i3 : M = matrix{{(z+1)/2, (1-z)/2},{(1-z)/2, (z+1)/2}}

o3 = | 1/2z+1/2  -1/2z+1/2 |
     | -1/2z+1/2 1/2z+1/2  |

             2       2
o3 : Matrix S  <--- S

i4 : sub(M,z=>1),sub(M,z=>-1)

o4 = (| 1 0 |, | 0 1 |)
      | 0 1 |  | 1 0 |

o4 : Sequence

i5 : R = QQ[x,y]

o5 = R

o5 : PolynomialRing

i6 : V = linearlyReductiveAction(I, M, R)

                   2
o6 = R <- S/ideal(z  - 1) via 

     | 1/2z+1/2  -1/2z+1/2 |
     | -1/2z+1/2 1/2z+1/2  |

o6 : LinearlyReductiveAction

i7 : H = hilbertIdeal V

                    2
o7 = ideal (x + y, y )

o7 : Ideal of R

i8 : invariants V

o8 = {x + y, x*y}

o8 : List

i9 : 
