-- -*- M2-comint -*- hash: -1358052412

i1 : R = QQ[x_1,x_2]

o1 = R

o1 : PolynomialRing

i2 : W = matrix{{1,-1}}

o2 = | 1 -1 |

              1        2
o2 : Matrix ZZ  <--- ZZ

i3 : T = diagonalAction(W, R)

            *
o3 = R <- QQ  via 

     | 1 -1 |

o3 : DiagonalAction

i4 : invariants T

o4 = {x x }
       1 2

o4 : List

i5 : R = QQ[x_1..x_3]

o5 = R

o5 : PolynomialRing

i6 : d = {3,3}

o6 = {3, 3}

o6 : List

i7 : W = matrix{{1,0,1},{0,1,1}}

o7 = | 1 0 1 |
     | 0 1 1 |

              2        3
o7 : Matrix ZZ  <--- ZZ

i8 : A = diagonalAction(W, d, R)

o8 = R <- ZZ/3 x ZZ/3 via 

     | 1 0 1 |
     | 0 1 1 |

o8 : DiagonalAction

i9 : invariants A

       3   3   3       2   2 2
o9 = {x , x , x , x x x , x x x }
       3   2   1   1 2 3   1 2 3

o9 : List

i10 : R = QQ[x_1, x_2]

o10 = R

o10 : PolynomialRing

i11 : d = {3}

o11 = {3}

o11 : List

i12 : W1 = matrix{{1,-1}, {-1,1}}

o12 = | 1  -1 |
      | -1 1  |

               2        2
o12 : Matrix ZZ  <--- ZZ

i13 : W2 = matrix {{1,0}}

o13 = | 1 0 |

               1        2
o13 : Matrix ZZ  <--- ZZ

i14 : D = diagonalAction(W1, W2, d, R)

              * 2
o14 = R <- (QQ )  x ZZ/3 via 

      (| 1  -1 |, | 1 0 |)
       | -1 1  |

o14 : DiagonalAction

i15 : invariants D

        3 3
o15 = {x x }
        1 2

o15 : List

i16 : 
