-- -*- M2-comint -*- hash: 2035911016

i1 : S = QQ[z]

o1 = S

o1 : PolynomialRing

i2 : I = ideal(z^2 - 1)

            2
o2 = ideal(z  - 1)

o2 : Ideal of S

i3 : M = matrix{{(z+1)/2, (1-z)/2},{(1-z)/2, (z+1)/2}}

o3 = | 1/2z+1/2  -1/2z+1/2 |
     | -1/2z+1/2 1/2z+1/2  |

             2       2
o3 : Matrix S  <--- S

i4 : sub(M,z=>1),sub(M,z=>-1)

o4 = (| 1 0 |, | 0 1 |)
      | 0 1 |  | 1 0 |

o4 : Sequence

i5 : R = QQ[x,y]

o5 = R

o5 : PolynomialRing

i6 : L = linearlyReductiveAction(I, M, R)

                   2
o6 = R <- S/ideal(z  - 1) via 

     | 1/2z+1/2  -1/2z+1/2 |
     | -1/2z+1/2 1/2z+1/2  |

o6 : LinearlyReductiveAction

i7 : S = QQ[z];

i8 : I = ideal(z^2 - 1);

o8 : Ideal of S

i9 : M = matrix{{(z+1)/2, (1-z)/2},{(1-z)/2, (z+1)/2}};

             2       2
o9 : Matrix S  <--- S

i10 : Q = QQ[x,y] / ideal(x*y)

o10 = Q

o10 : QuotientRing

i11 : L = linearlyReductiveAction(I, M, Q)

                    2
o11 = Q <- S/ideal(z  - 1) via 

      | 1/2z+1/2  -1/2z+1/2 |
      | -1/2z+1/2 1/2z+1/2  |

o11 : LinearlyReductiveAction

i12 : 
