-- -*- M2-comint -*- hash: 1455160495

i1 : R = QQ[x_1..x_4]

o1 = R

o1 : PolynomialRing

i2 : W = matrix{{0,1,-1,1},{1,0,-1,-1}}

o2 = | 0 1 -1 1  |
     | 1 0 -1 -1 |

              2        4
o2 : Matrix ZZ  <--- ZZ

i3 : T = diagonalAction(W, R)

             * 2
o3 = R <- (QQ )  via 

     | 0 1 -1 1  |
     | 1 0 -1 -1 |

o3 : DiagonalAction

i4 : weights T

o4 = (| 0 1 -1 1  |, 0)
      | 1 0 -1 -1 |

o4 : Sequence

i5 : R = QQ[x_1..x_3]

o5 = R

o5 : PolynomialRing

i6 : d = {3,3}

o6 = {3, 3}

o6 : List

i7 : W = matrix{{1,0,1},{0,1,1}}

o7 = | 1 0 1 |
     | 0 1 1 |

              2        3
o7 : Matrix ZZ  <--- ZZ

i8 : A = diagonalAction(W, d, R)

o8 = R <- ZZ/3 x ZZ/3 via 

     | 1 0 1 |
     | 0 1 1 |

o8 : DiagonalAction

i9 : weights A

o9 = (0, | 1 0 1 |)
         | 0 1 1 |

o9 : Sequence

i10 : 
