-- -*- M2-comint -*- hash: 874170436

i1 : R = QQ[x,y];

i2 : I = ideal(x^3,y^2);

o2 : Ideal of R

i3 : J = janetBasis I;

i4 : basisElements J

o4 = | y2 xy2 x3 x2y2 |

             1       4
o4 : Matrix R  <--- R

i5 : R = QQ[x,y,z];

i6 : M = matrix {{x*y,x^3*z}};

             1       2
o6 : Matrix R  <--- R

i7 : J = janetBasis M;

i8 : F = factorModuleBasis J

     +--+------+
o8 = |1 |{z, y}|
     +--+------+
     |x |{z}   |
     +--+------+
     | 2|      |
     |x |{z}   |
     +--+------+
     | 3|      |
     |x |{x}   |
     +--+------+

o8 : FactorModuleBasis

i9 : basisElements F

o9 = | 1 x x2 x3 |

             1       4
o9 : Matrix R  <--- R

i10 : multVar F

o10 = {set {y, z}, set {z}, set {z}, set {x}}

o10 : List

i11 : 
