-- -*- M2-comint -*- hash: 1339118543

i1 : R = QQ[x,y,z];

i2 : M = matrix {{x*y,x^3*z}};

             1       2
o2 : Matrix R  <--- R

i3 : J = janetBasis M;

i4 : F = factorModuleBasis J

     +--+------+
o4 = |1 |{z, y}|
     +--+------+
     |x |{z}   |
     +--+------+
     | 2|      |
     |x |{z}   |
     +--+------+
     | 3|      |
     |x |{x}   |
     +--+------+

o4 : FactorModuleBasis

i5 : basisElements F

o5 = | 1 x x2 x3 |

             1       4
o5 : Matrix R  <--- R

i6 : multVar F

o6 = {set {y, z}, set {z}, set {z}, set {x}}

o6 : List

i7 : R = QQ[x,y];

i8 : M = matrix {{x*y-y^3, x*y^2, x*y-x}, {x, y^2, x}};

             2       3
o8 : Matrix R  <--- R

i9 : J = janetBasis M

     +--------------+------+
o9 = || y3-x |      |{y}   |
     ||   0  |      |      |
     +--------------+------+
     || xy-x |      |{y}   |
     ||   x  |      |      |
     +--------------+------+
     || x2y-x2 |    |{y}   |
     ||   x2   |    |      |
     +--------------+------+
     || x3 |        |{y, x}|
     || x2 |        |      |
     +--------------+------+
     ||    -x   |   |{y}   |
     || xy-y2+x |   |      |
     +--------------+------+
     || x2 |        |{y}   |
     || y3 |        |      |
     +--------------+------+
     ||     -x2    ||{y}   |
     || x2y-xy2+x2 ||      |
     +--------------+------+
     ||     0     | |{y, x}|
     || x3+2x2+y2 | |      |
     +--------------+------+

o9 : InvolutiveBasis

i10 : F = factorModuleBasis J

      +------+--+
o10 = || 1 | |{}|
      || 0 | |  |
      +------+--+
      || y | |{}|
      || 0 | |  |
      +------+--+
      || y2 ||{}|
      ||  0 ||  |
      +------+--+
      || x | |{}|
      || 0 | |  |
      +------+--+
      || x2 ||{}|
      ||  0 ||  |
      +------+--+
      || 0 | |{}|
      || 1 | |  |
      +------+--+
      || 0 | |{}|
      || y | |  |
      +------+--+
      ||  0 ||{}|
      || y2 ||  |
      +------+--+
      || 0 | |{}|
      || x | |  |
      +------+--+
      ||  0 ||{}|
      || x2 ||  |
      +------+--+

o10 : FactorModuleBasis

i11 : basisElements F

o11 = | 1 y y2 x x2 0 0 0  0 0  |
      | 0 0 0  0 0  1 y y2 x x2 |

              2       10
o11 : Matrix R  <--- R

i12 : multVar F

o12 = {set {}, set {}, set {}, set {}, set {}, set {}, set {}, set {}, set
      -----------------------------------------------------------------------
      {}, set {}}

o12 : List

i13 : 
