-- -*- M2-comint -*- hash: -1342505629

i1 : R = QQ[x,y,z];

i2 : I = ideal(x*y*z);

o2 : Ideal of R

i3 : J = janetBasis I;

i4 : N = invNoetherNormalization J

o4 = {{x, - x + y, - x + z}, {z, y}}

o4 : List

i5 : R = QQ[w,x,y,z];

i6 : I = ideal(y^2*z-w*x*y^2, x*y*z-w*z^2, y^2*z-w*x^2*y*z);

o6 : Ideal of R

i7 : J = janetBasis I;

i8 : N = invNoetherNormalization J

o8 = {{w, x, - x + y, - w - x + z}, {z, y}}

o8 : List

i9 : 
