-- -*- M2-comint -*- hash: 771647340

i1 : R = QQ[x,y];

i2 : I = ideal(x^3,y^2);

o2 : Ideal of R

i3 : J = janetBasis I

     +----+------+
     | 2  |      |
o3 = |y   |{y}   |
     +----+------+
     |   2|      |
     |x*y |{y}   |
     +----+------+
     | 3  |      |
     |x   |{y, x}|
     +----+------+
     | 2 2|      |
     |x y |{y}   |
     +----+------+

o3 : InvolutiveBasis

i4 : isPommaretBasis J

o4 = true

i5 : R = QQ[x,y];

i6 : I = ideal(x*y,y^2);

o6 : Ideal of R

i7 : J = janetBasis I

     +---+------+
     | 2 |      |
o7 = |y  |{y}   |
     +---+------+
     |x*y|{y, x}|
     +---+------+

o7 : InvolutiveBasis

i8 : isPommaretBasis J

o8 = false

i9 : 
