-- -*- M2-comint -*- hash: 526936498

i1 : R = ZZ/32003[a..d];

i2 : I = monomialCurveIdeal(R,{1,3,4})

                        3      2     2    2    3    2
o2 = ideal (b*c - a*d, c  - b*d , a*c  - b d, b  - a c)

o2 : Ideal of R

i3 : M = ideal"a,b,c,d"; -- maximal ideal at the origin

o3 : Ideal of R

i4 : P = ideal"a,b,c"; -- prime ideal

o4 : Ideal of R

i5 : RM = R_M

o5 = RM

o5 : LocalRing, maximal ideal (a, b, c, d)

i6 : RP = localRing(R, P)

o6 = RP

o6 : LocalRing, maximal ideal (a, b, c)

i7 : C = res I

      1      4      4      1
o7 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o7 : ChainComplex

i8 : D = C ** RM;

i9 : E = pruneComplex D

       1       4       4       1
o9 = RM  <-- RM  <-- RM  <-- RM
                              
     0       1       2       3

o9 : ChainComplex

i10 : D' = C ** RP;

i11 : E' = pruneComplex D'

        1       2       1
o11 = RP  <-- RP  <-- RP
                       
      0       1       2

o11 : ChainComplex

i12 : 
