-- -*- M2-comint -*- hash: 1842313096

i1 : S = QQ[x,y,z,w];

i2 : I = ideal"xz-y2,yw-z2,xw-yz"; -- The twisted cubic curve

o2 : Ideal of S

i3 : R = S_I

o3 = R

                                  2           2
o3 : LocalRing, maximal ideal (- y  + x*z, - z  + y*w, - y*z + x*w)

i4 : K = frac(S/I)

o4 = K

o4 : FractionField

i5 : max R

               2           2
o5 = ideal (- y  + x*z, - z  + y*w, - y*z + x*w)

o5 : Ideal of R

i6 : R.maxIdeal

               2           2
o6 = ideal (- y  + x*z, - z  + y*w, - y*z + x*w)

o6 : Ideal of S

i7 : R.residueMap

o7 = map (K, R, {x, y, z, w})

o7 : RingMap K <--- R

i8 : I ** R

               2           2
o8 = ideal (- y  + x*z, - z  + y*w, - y*z + x*w)

o8 : Ideal of R

i9 : 
