-- -*- M2-comint -*- hash: 416318890

i1 : R = QQ[x,y,z];

i2 : RP = localRing(R, ideal gens R);

i3 : I = ideal"x5+y3+z3,x3+y5+z3,x3+y3+z5"

             5    3    3   5    3    3   5    3    3
o3 = ideal (x  + y  + z , y  + x  + z , z  + x  + y )

o3 : Ideal of RP

i4 : M = RP^1/I

o4 = cokernel | x5+y3+z3 y5+x3+z3 z5+x3+y3 |

                              1
o4 : RP-module, quotient of RP

i5 : elapsedTime hilbertSamuelFunction(M, 0, 6)
 -- 1.38736 seconds elapsed

o5 = {1, 3, 6, 7, 6, 3, 1}

o5 : List

i6 : oo//sum

o6 = 27

i7 : R = ZZ/32003[x,y];

i8 : RP = localRing(R, ideal gens R);

i9 : N = RP^1

       1
o9 = RP

o9 : RP-module, free

i10 : q = ideal"x2,y3"

              2   3
o10 = ideal (x , y )

o10 : Ideal of RP

i11 : elapsedTime hilbertSamuelFunction(N, 0, 5) -- n+1 -- 0.02 seconds
 -- 0.0708002 seconds elapsed

o11 = {1, 2, 3, 4, 5, 6}

o11 : List

i12 : elapsedTime hilbertSamuelFunction(q, N, 0, 5) -- 6(n+1) -- 0.32 seconds
 -- 1.21886 seconds elapsed

o12 = {6, 12, 18, 24, 30, 36}

o12 : List

i13 : 
