-- -*- M2-comint -*- hash: 2080072673

i1 : R = ZZ/32003[x,y,z,w,SkewCommutative=>true]

o1 = R

o1 : PolynomialRing, 4 skew commutative variables

i2 : m = matrix{{x,y*z},{z*w,x}}

o2 = | x  yz |
     | zw x  |

             2       2
o2 : Matrix R  <--- R

i3 : setMaxIdeal(ideal(x,y,z,w))

o3 = ideal (x, y, z, w)

o3 : Ideal of R

i4 : C = localResolution(coker m, LengthLimit=>10)

      2      2      2      2      2      2      2      2      2      2      2
o4 = R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R
                                                                            
     0      1      2      3      4      5      6      7      8      9      10

o4 : ChainComplex

i5 : C = localResolution(coker m)

      2      2      2      2      2      2      2      2      2      2      2
o5 = R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R  <-- R
                                                                            
     0      1      2      3      4      5      6      7      8      9      10

o5 : ChainComplex

i6 : C^2

o6 = 0

o6 : R-module

i7 : C.dd_4

o7 = {6} | -zw x  |
     {6} | -x  yz |

             2       2
o7 : Matrix R  <--- R

i8 : R = QQ[x,y,z]

o8 = R

o8 : PolynomialRing

i9 : setMaxIdeal ideal vars R

o9 = ideal (x, y, z)

o9 : Ideal of R

i10 : m = matrix {{x-1, y, z-1}}

o10 = | x-1 y z-1 |

              1       3
o10 : Matrix R  <--- R

i11 : C = resolution coker m

       1      3      3      1
o11 = R  <-- R  <-- R  <-- R  <-- 0
                                   
      0      1      2      3      4

o11 : ChainComplex

i12 : C.dd

           1                     3
o12 = 0 : R  <----------------- R  : 1
                | x-1 y z-1 |

           3                             3
      1 : R  <------------------------- R  : 2
                {1} | -y  -z+1 0    |
                {1} | x-1 0    -z+1 |
                {1} | 0   x-1  y    |

           3                   1
      2 : R  <--------------- R  : 3
                {2} | z-1 |
                {2} | -y  |
                {2} | x-1 |

           1
      3 : R  <----- 0 : 4
                0

o12 : ChainComplexMap

i13 : LC = localResolution coker m

       1      3      2
o13 = R  <-- R  <-- R  <-- 0
                            
      0      1      2      3

o13 : ChainComplex

i14 : LC.dd

           1                     3
o14 = 0 : R  <----------------- R  : 1
                | z-1 y x-1 |

           3                         2
      1 : R  <--------------------- R  : 2
                {1} | -x+1 y    |
                {1} | 0    -z+1 |
                {1} | z-1  0    |

           2
      2 : R  <----- 0 : 3
                0

o14 : ChainComplexMap

i15 : 
