-- -*- M2-comint -*- hash: -373640207

i1 : R = ZZ/32003[x,y,z,w,SkewCommutative=>true]

o1 = R

o1 : PolynomialRing, 4 skew commutative variables

i2 : m = matrix{{x,y*z},{z*w,x}}

o2 = | x  yz |
     | zw x  |

             2       2
o2 : Matrix R  <--- R

i3 : setMaxIdeal(ideal(x,y,z,w))

o3 = ideal (x, y, z, w)

o3 : Ideal of R

i4 : localsyz m

o4 = {2} | -yz -x |
     {2} | x   zw |

             2       2
o4 : Matrix R  <--- R

i5 : m * localsyz m

o5 = 0

             2       2
o5 : Matrix R  <--- R

i6 : 
