-- -*- M2-comint -*- hash: 1391003026

i1 : R = ZZ/32003[x,y]

o1 = R

o1 : PolynomialRing

i2 : m = matrix{{x,y-1},{0,x}}

o2 = | x y-1 |
     | 0 x   |

             2       2
o2 : Matrix R  <--- R

i3 : setMaxIdeal(ideal(x,y))

o3 = ideal (x, y)

o3 : Ideal of R

i4 : localComplement m

o4 = | 0 |
     | 1 |

             2       1
o4 : Matrix R  <--- R

i5 : 
