-- -*- M2-comint -*- hash: 325525533

i1 : R1 = QQ[x_0..x_3];

i2 : R2 = QQ[z_0..z_2];

i3 : R = superRing(R1, R2);

i4 : P1 = matrix{{x_0, x_1}, {x_2, x_3}};

             2       2
o4 : Matrix R  <--- R

i5 : P2 = matrix{{0, 0}, {0, 0}};

              2        2
o5 : Matrix ZZ  <--- ZZ

i6 : P3 = matrix{{0, 0}, {0, 0}};

              2        2
o6 : Matrix ZZ  <--- ZZ

i7 : P4 = matrix{{x_1, x_2}, {x_0, x_1}};

             2       2
o7 : Matrix R  <--- R

i8 : SP = superMatrixGenerator(P1, P2, P3, P4);

i9 : superTrace(SP, R, {z_0, z_1})

o9 = x  - 2x  + x
      0     1    3

o9 : R

i10 : 
