-- -*- M2-comint -*- hash: -1063690654

i1 : LP = {{-1, 0, -1, 1}, {-1, 0, 1, 0}, {-1, 0, 2, -1}, {-1, 1, -1, 0}, {1, 0, -1, 0}, {1, 0, 1, 0}, {2, -1, -1, 0}, {0, 0, 1, 0}, {1, 0, 0, 0}, {0,0,0,0}}

o1 = {{-1, 0, -1, 1}, {-1, 0, 1, 0}, {-1, 0, 2, -1}, {-1, 1, -1, 0}, {1, 0,
     ------------------------------------------------------------------------
     -1, 0}, {1, 0, 1, 0}, {2, -1, -1, 0}, {0, 0, 1, 0}, {1, 0, 0, 0}, {0, 0,
     ------------------------------------------------------------------------
     0, 0}}

o1 : List

i2 : A = transpose matrix LP

o2 = | -1 -1 -1 -1 1  1 2  0 1 0 |
     | 0  0  0  1  0  0 -1 0 0 0 |
     | -1 1  2  -1 -1 1 -1 1 0 0 |
     | 1  0  -1 0  0  0 0  0 0 0 |

              4        10
o2 : Matrix ZZ  <--- ZZ

i3 : elapsedTime Ts = allTriangulations(A, Fine => true);
 -- 0.230474 seconds elapsed

i4 : select(Ts, T -> isStar T)

o4 = {triangulation {{0, 1, 2, 3, 9}, {0, 1, 2, 6, 9}, {0, 1, 3, 7, 9}, {0,
     ------------------------------------------------------------------------
     1, 6, 7, 9}, {0, 2, 3, 6, 9}, {0, 3, 4, 6, 9}, {0, 3, 4, 8, 9}, {0, 3,
     ------------------------------------------------------------------------
     5, 7, 9}, {0, 3, 5, 8, 9}, {0, 4, 6, 8, 9}, {0, 5, 6, 7, 9}, {0, 5, 6,
     ------------------------------------------------------------------------
     8, 9}, {1, 2, 3, 7, 9}, {1, 2, 6, 7, 9}, {2, 3, 4, 6, 9}, {2, 3, 4, 8,
     ------------------------------------------------------------------------
     9}, {2, 3, 5, 7, 9}, {2, 3, 5, 8, 9}, {2, 4, 6, 8, 9}, {2, 5, 6, 7, 9},
     ------------------------------------------------------------------------
     {2, 5, 6, 8, 9}}}

o4 : List

i5 : #oo == 1

o5 = true

i6 : #Ts == 51

o6 = true

i7 : T = regularFineTriangulation A

o7 = triangulation {{0, 1, 2, 3, 9}, {0, 1, 2, 6, 9}, {0, 1, 3, 7, 9}, {0, 1, 6, 7, 9}, {0, 2, 3, 4, 6}, {0, 2, 3, 4, 9}, {0, 2, 4, 6, 9}, {0, 3, 4, 7, 8}, {0, 3, 4, 7, 9}, {0, 3, 5, 7, 8}, {0, 4, 6, 7, 8}, {0, 4, 6, 7, 9}, {0, 5, 6, 7, 8}, {1, 2, 3, 7, 9}, {1, 2, 6, 7, 9}, {2, 3, 4, 7, 8}, {2, 3, 4, 7, 9}, {2, 3, 5, 7, 8}, {2, 4, 6, 7, 8}, {2, 4, 6, 7, 9}, {2, 5, 6, 7, 8}}

o7 : Triangulation

i8 : elapsedTime Ts2 = generateTriangulations T;
 -- 1.53809 seconds elapsed

i9 : #Ts2 == #Ts

o9 = true

i10 : 
