-- -*- M2-comint -*- hash: -298334062

i1 : A = transpose matrix {{0,3},{0,1},{-1,-1},{1,-1},{-4,-2},{4,-2}}

o1 = | 0 0 -1 1  -4 4  |
     | 3 1 -1 -1 -2 -2 |

              2        6
o1 : Matrix ZZ  <--- ZZ

i2 : Ts = allTriangulations A

o2 = {triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3},
     ------------------------------------------------------------------------
     {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4},
     ------------------------------------------------------------------------
     {0, 3, 5}, {1, 2, 3}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 3},
     ------------------------------------------------------------------------
     {0, 1, 4}, {0, 3, 5}, {1, 2, 3}, {1, 2, 4}, {2, 3, 4}, {3, 4, 5}},
     ------------------------------------------------------------------------
     triangulation {{0, 2, 3}, {0, 2, 4}, {0, 3, 5}, {2, 3, 4}, {3, 4, 5}},
     ------------------------------------------------------------------------
     triangulation {{0, 3, 4}, {0, 3, 5}, {3, 4, 5}}, triangulation {{0, 2,
     ------------------------------------------------------------------------
     3}, {0, 2, 4}, {0, 3, 5}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1,
     ------------------------------------------------------------------------
     3}, {0, 1, 4}, {0, 3, 5}, {1, 3, 4}, {3, 4, 5}}, triangulation {{0, 1,
     ------------------------------------------------------------------------
     4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5}, {2, 3, 4}, {3, 4, 5}},
     ------------------------------------------------------------------------
     triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4}, {1, 2, 3}, {1, 3, 5},
     ------------------------------------------------------------------------
     {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3},
     ------------------------------------------------------------------------
     {1, 2, 4}, {1, 3, 5}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 4},
     ------------------------------------------------------------------------
     {0, 1, 5}, {1, 3, 4}, {1, 3, 5}, {3, 4, 5}}, triangulation {{0, 2, 4},
     ------------------------------------------------------------------------
     {0, 2, 5}, {2, 4, 5}}, triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4},
     ------------------------------------------------------------------------
     {1, 2, 5}, {2, 4, 5}}, triangulation {{0, 4, 5}}, triangulation {{0, 1,
     ------------------------------------------------------------------------
     4}, {0, 1, 5}, {1, 2, 4}, {1, 2, 5}, {2, 4, 5}}, triangulation {{0, 1,
     ------------------------------------------------------------------------
     4}, {0, 1, 5}, {1, 4, 5}}}

o2 : List

i3 : #Ts == 16

o3 = true

i4 : netList Ts

     +-------------------------------------------------------------------------------------------+
o4 = |triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3}, {2, 3, 4}, {3, 4, 5}}|
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3}, {2, 3, 5}, {2, 4, 5}}|
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 3}, {0, 1, 4}, {0, 3, 5}, {1, 2, 3}, {1, 2, 4}, {2, 3, 4}, {3, 4, 5}}|
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 2, 3}, {0, 2, 4}, {0, 3, 5}, {2, 3, 4}, {3, 4, 5}}                      |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 3, 4}, {0, 3, 5}, {3, 4, 5}}                                            |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 2, 3}, {0, 2, 4}, {0, 3, 5}, {2, 3, 5}, {2, 4, 5}}                      |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 3}, {0, 1, 4}, {0, 3, 5}, {1, 3, 4}, {3, 4, 5}}                      |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5}, {2, 3, 4}, {3, 4, 5}}|
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4}, {1, 2, 3}, {1, 3, 5}, {2, 3, 5}, {2, 4, 5}}|
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5}, {2, 3, 5}, {2, 4, 5}}|
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 4}, {0, 1, 5}, {1, 3, 4}, {1, 3, 5}, {3, 4, 5}}                      |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 2, 4}, {0, 2, 5}, {2, 4, 5}}                                            |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4}, {1, 2, 5}, {2, 4, 5}}                      |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 4, 5}}                                                                  |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 4}, {1, 2, 5}, {2, 4, 5}}                      |
     +-------------------------------------------------------------------------------------------+
     |triangulation {{0, 1, 4}, {0, 1, 5}, {1, 4, 5}}                                            |
     +-------------------------------------------------------------------------------------------+

i5 : tri = Ts#0

o5 = triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3}, {2, 3, 4}, {3, 4, 5}}

o5 : Triangulation

i6 : isWellDefined tri

o6 = true

i7 : isRegularTriangulation tri

o7 = true

i8 : Ts/isRegularTriangulation

o8 = {true, true, true, true, true, true, true, true, true, true, true, true,
     ------------------------------------------------------------------------
     true, true, true, true}

o8 : List

i9 : regularTriangulationWeights tri

      97  47  1
o9 = {--, --, -, 0, 0, 0}
      16  16  8

o9 : List

i10 : tally for tri in Ts list sort unique flatten max tri

o10 = Tally{{0, 1, 2, 3, 4, 5} => 6}
            {0, 1, 2, 4, 5} => 2
            {0, 1, 3, 4, 5} => 2
            {0, 1, 4, 5} => 1
            {0, 2, 3, 4, 5} => 2
            {0, 2, 4, 5} => 1
            {0, 3, 4, 5} => 1
            {0, 4, 5} => 1

o10 : Tally

i11 : options allTriangulations

o11 = OptionTable{ConnectedToRegular => true}
                  Fine => false
                  Homogenize => true
                  RegularOnly => true

o11 : OptionTable

i12 : Ts = allTriangulations(A, Fine => true);

i13 : #Ts == 6

o13 = true

i14 : T1s = allTriangulations(A, RegularOnly => true)

o14 = {triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3},
      -----------------------------------------------------------------------
      {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4},
      -----------------------------------------------------------------------
      {0, 3, 5}, {1, 2, 3}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 3},
      -----------------------------------------------------------------------
      {0, 1, 4}, {0, 3, 5}, {1, 2, 3}, {1, 2, 4}, {2, 3, 4}, {3, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 2, 3}, {0, 2, 4}, {0, 3, 5}, {2, 3, 4}, {3, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 3, 4}, {0, 3, 5}, {3, 4, 5}}, triangulation {{0, 2,
      -----------------------------------------------------------------------
      3}, {0, 2, 4}, {0, 3, 5}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1,
      -----------------------------------------------------------------------
      3}, {0, 1, 4}, {0, 3, 5}, {1, 3, 4}, {3, 4, 5}}, triangulation {{0, 1,
      -----------------------------------------------------------------------
      4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5}, {2, 3, 4}, {3, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4}, {1, 2, 3}, {1, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3},
      -----------------------------------------------------------------------
      {1, 2, 4}, {1, 3, 5}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 4},
      -----------------------------------------------------------------------
      {0, 1, 5}, {1, 3, 4}, {1, 3, 5}, {3, 4, 5}}, triangulation {{0, 2, 4},
      -----------------------------------------------------------------------
      {0, 2, 5}, {2, 4, 5}}, triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4},
      -----------------------------------------------------------------------
      {1, 2, 5}, {2, 4, 5}}, triangulation {{0, 4, 5}}, triangulation {{0, 1,
      -----------------------------------------------------------------------
      4}, {0, 1, 5}, {1, 2, 4}, {1, 2, 5}, {2, 4, 5}}, triangulation {{0, 1,
      -----------------------------------------------------------------------
      4}, {0, 1, 5}, {1, 4, 5}}}

o14 : List

i15 : T2s = allTriangulations(A, RegularOnly => false)

o15 = {triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3},
      -----------------------------------------------------------------------
      {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4},
      -----------------------------------------------------------------------
      {0, 3, 5}, {1, 2, 3}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 3},
      -----------------------------------------------------------------------
      {0, 1, 4}, {0, 3, 5}, {1, 2, 3}, {1, 2, 4}, {2, 3, 4}, {3, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4}, {1, 2, 3}, {1, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 2, 3}, {0, 2, 4}, {0, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 3, 4}, {0, 3, 5}, {3, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 2, 3}, {0, 2, 4}, {0, 3, 5}, {2, 3, 5}, {2, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4},
      -----------------------------------------------------------------------
      {1, 2, 3}, {1, 3, 5}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 3},
      -----------------------------------------------------------------------
      {0, 1, 4}, {0, 3, 5}, {1, 3, 4}, {3, 4, 5}}, triangulation {{0, 1, 3},
      -----------------------------------------------------------------------
      {0, 1, 4}, {0, 3, 5}, {1, 2, 3}, {1, 2, 4}, {2, 3, 5}, {2, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 4}, {0, 1, 5}, {1, 3, 4},
      -----------------------------------------------------------------------
      {1, 3, 5}, {3, 4, 5}}, triangulation {{0, 2, 4}, {0, 2, 5}, {2, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4}, {1, 2, 5}, {2, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 4, 5}}, triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2,
      -----------------------------------------------------------------------
      4}, {1, 2, 5}, {2, 4, 5}}, triangulation {{0, 1, 4}, {0, 1, 5}, {1, 4,
      -----------------------------------------------------------------------
      5}}}

o15 : List

i16 : #T1s

o16 = 16

i17 : #T2s

o17 = 18

i18 : T3s = allTriangulations(A, RegularOnly => false, ConnectedToRegular => false)

o18 = {triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3},
      -----------------------------------------------------------------------
      {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4},
      -----------------------------------------------------------------------
      {0, 3, 5}, {1, 2, 3}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 2},
      -----------------------------------------------------------------------
      {0, 1, 5}, {0, 2, 4}, {1, 2, 3}, {1, 3, 5}, {2, 3, 4}, {3, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4}, {1, 2, 3}, {1, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4},
      -----------------------------------------------------------------------
      {1, 2, 5}, {2, 4, 5}}, triangulation {{0, 1, 3}, {0, 1, 4}, {0, 3, 5},
      -----------------------------------------------------------------------
      {1, 2, 3}, {1, 2, 4}, {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 1, 3},
      -----------------------------------------------------------------------
      {0, 1, 4}, {0, 3, 5}, {1, 2, 3}, {1, 2, 4}, {2, 3, 5}, {2, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 1, 3}, {0, 1, 4}, {0, 3, 5}, {1, 3, 4}, {3, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3},
      -----------------------------------------------------------------------
      {1, 2, 4}, {1, 3, 5}, {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 1, 4},
      -----------------------------------------------------------------------
      {0, 1, 5}, {1, 2, 4}, {1, 2, 5}, {2, 4, 5}}, triangulation {{0, 1, 4},
      -----------------------------------------------------------------------
      {0, 1, 5}, {1, 3, 4}, {1, 3, 5}, {3, 4, 5}}, triangulation {{0, 1, 4},
      -----------------------------------------------------------------------
      {0, 1, 5}, {1, 4, 5}}, triangulation {{0, 2, 3}, {0, 2, 4}, {0, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 4}, {3, 4, 5}}, triangulation {{0, 2, 3}, {0, 2, 4}, {0, 3, 5},
      -----------------------------------------------------------------------
      {2, 3, 5}, {2, 4, 5}}, triangulation {{0, 2, 4}, {0, 2, 5}, {2, 4, 5}},
      -----------------------------------------------------------------------
      triangulation {{0, 3, 4}, {0, 3, 5}, {3, 4, 5}}, triangulation {{0, 4,
      -----------------------------------------------------------------------
      5}}}

o18 : List

i19 : #T3s

o19 = 18

i20 : netList Ts

      +-------------------------------------------------------------------------------------------+
o20 = |triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3}, {2, 3, 4}, {3, 4, 5}}|
      +-------------------------------------------------------------------------------------------+
      |triangulation {{0, 1, 2}, {0, 1, 3}, {0, 2, 4}, {0, 3, 5}, {1, 2, 3}, {2, 3, 5}, {2, 4, 5}}|
      +-------------------------------------------------------------------------------------------+
      |triangulation {{0, 1, 3}, {0, 1, 4}, {0, 3, 5}, {1, 2, 3}, {1, 2, 4}, {2, 3, 4}, {3, 4, 5}}|
      +-------------------------------------------------------------------------------------------+
      |triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5}, {2, 3, 4}, {3, 4, 5}}|
      +-------------------------------------------------------------------------------------------+
      |triangulation {{0, 1, 2}, {0, 1, 5}, {0, 2, 4}, {1, 2, 3}, {1, 3, 5}, {2, 3, 5}, {2, 4, 5}}|
      +-------------------------------------------------------------------------------------------+
      |triangulation {{0, 1, 4}, {0, 1, 5}, {1, 2, 3}, {1, 2, 4}, {1, 3, 5}, {2, 3, 5}, {2, 4, 5}}|
      +-------------------------------------------------------------------------------------------+

i21 : for tri in Ts list isWellDefined tri

o21 = {true, true, true, true, true, true}

o21 : List

i22 : for tri in Ts list isRegularTriangulation tri

o22 = {true, true, true, true, true, true}

o22 : List

i23 : for tri in Ts list regularTriangulationWeights tri

        97  47  1             87  41    1             157  15  1           
o23 = {{--, --, -, 0, 0, 0}, {--, --, - -, 0, 0, 0}, {---, --, -, 0, 0, 0},
        16  16  8             16  16    8              40   8  4           
      -----------------------------------------------------------------------
       45  19  1             107  9    1             35  13    1
      {--, --, -, 0, 0, 0}, {---, -, - -, 0, 0, 0}, {--, --, - -, 0, 0, 0}}
       16  16  8              40  8    4             16  16    8

o23 : List

i24 : 
