-- -*- M2-comint -*- hash: 1376393827

i1 : P = hypercube 3

o1 = P

o1 : Polyhedron

i2 : A = vertices P

o2 = | -1 1  -1 1  -1 1  -1 1 |
     | -1 -1 1  1  -1 -1 1  1 |
     | -1 -1 -1 -1 1  1  1  1 |

              3        8
o2 : Matrix QQ  <--- QQ

i3 : T = topcomRegularFineTriangulation A

o3 = {{0, 1, 2, 4}, {1, 2, 3, 4}, {1, 3, 4, 5}, {2, 3, 4, 6}, {3, 4, 5, 6},
     ------------------------------------------------------------------------
     {3, 5, 6, 7}}

o3 : List

i4 : tri = triangulation(A, T)

o4 = triangulation {{0, 1, 2, 4}, {1, 2, 3, 4}, {1, 3, 4, 5}, {2, 3, 4, 6}, {3, 4, 5, 6}, {3, 5, 6, 7}}

o4 : Triangulation

i5 : matrix tri

o5 = | -1 1  -1 1  -1 1  -1 1 |
     | -1 -1 1  1  -1 -1 1  1 |
     | -1 -1 -1 -1 1  1  1  1 |
     | 1  1  1  1  1  1  1  1 |

              4        8
o5 : Matrix QQ  <--- QQ

i6 : vectors tri

o6 = {{-1, -1, -1, 1}, {1, -1, -1, 1}, {-1, 1, -1, 1}, {1, 1, -1, 1}, {-1,
     ------------------------------------------------------------------------
     -1, 1, 1}, {1, -1, 1, 1}, {-1, 1, 1, 1}, {1, 1, 1, 1}}

o6 : List

i7 : max tri

o7 = {{0, 1, 2, 4}, {1, 2, 3, 4}, {1, 3, 4, 5}, {2, 3, 4, 6}, {3, 4, 5, 6},
     ------------------------------------------------------------------------
     {3, 5, 6, 7}}

o7 : List

i8 : isWellDefined tri

o8 = true

i9 : netList affineCircuits tri

     +------+------+
o9 = |{1, 2}|{0, 3}|
     +------+------+
     |{3, 4}|{2, 5}|
     +------+------+
     |{3, 4}|{1, 6}|
     +------+------+
     |{5, 6}|{4, 7}|
     +------+------+

i10 : isFine tri

o10 = true

i11 : isStar tri

o11 = false

i12 : isRegularTriangulation tri

o12 = true

i13 : 
