-- -*- M2-comint -*- hash: -1117797896

i1 : R = RR[x,y]

o1 = R

o1 : PolynomialRing

i2 : detRep(x^2 - 3*y^2)
No determinantal representation

i3 : detRep(x^5+6*x^4*y-2*x^3*y^2-36*x^2*y^3+x*y^4+30*y^5)

o3 = {| x-1y 0    0    0    0   |}
      | 0    x-2y 0    0    0   |
      | 0    0    x+5y 0    0   |
      | 0    0    0    x+3y 0   |
      | 0    0    0    0    x+y |

o3 : List

i4 : R = RR[x1, x2]

o4 = R

o4 : PolynomialRing

i5 : f=(1/2)*(x1^4+x2^4-3*x1^2-3*x2^2+x1^2*x2^2)+1

         4       2  2       4        2        2
o5 = .5x1  + .5x1 x2  + .5x2  - 1.5x1  - 1.5x2  + 1

o5 : R

i6 : repList = detRep f;
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

i7 : #repList

o7 = 64

i8 : repList#0

o8 = | 1x1+1      -.442783x2  .691504x2    -.317837x2 |
     | -.442783x2 .707107x1+1 .224745x2    .691504x2  |
     | .691504x2  .224745x2   -.707107x1+1 .442783x2  |
     | -.317837x2 .691504x2   .442783x2    -x1+1      |

             4       4
o8 : Matrix R  <--- R

i9 : all(repList, A -> clean(1e-10, f - det A) == 0)

o9 = true

i10 : 
