-- -*- M2-comint -*- hash: 807877802

i1 : setPolynomialRing(GF 13, {x,y}, {2,3}); setQuotientRing(y^2-x^3-7*x)

o2 = QR

o2 : QuotientRing

i3 : J=ideal(x, y); K=ideal(x-2, y-3); add(J, K)

o3 : Ideal of QR

o4 : Ideal of QR

o5 = ideal (x + 3, y + 2)

o5 : Ideal of QR

i6 : L=J*K; reduced(L)

o6 : Ideal of QR

o7 = ideal (x + 3, y + 2)

o7 : Ideal of QR

i8 : setPolynomialRing(GF 5,{x,y,z},{4,6,5})

o8 = PR

o8 : PolynomialRing

i9 : setQuotientRing({y^2-x^3-1, z^2-x*y-1})

o9 = QR

o9 : QuotientRing

i10 : J=ideal(x-2,y-2,z)

o10 = ideal (x - 2, y - 2, z)

o10 : Ideal of QR

i11 : K=ideal(x-4,y,z-1)

o11 = ideal (x + 1, y, z - 1)

o11 : Ideal of QR

i12 : add(J, K)

                                     2
o12 = ideal (z + 2x + 1, y + x + 1, x  - x - 2)

o12 : Ideal of QR

i13 : 
