-- -*- M2-comint -*- hash: -256265540

i1 : setPolynomialRing({x,y},{2,3})

o1 = PR

o1 : PolynomialRing

i2 : setQuotientRing(y^2-x^3-7*x)

o2 = QR

o2 : QuotientRing

i3 : J=ideal(x,y); reduced(J)

o3 : Ideal of QR

o4 = ideal (x, y)

o4 : Ideal of QR

i5 : 
