-- -*- M2-comint -*- hash: -1039088104

i1 : setPolynomialRing(GF 13,{x,y},{2,3}); setQuotientRing(y^2-x^3-7*x)

o2 = QR

o2 : QuotientRing

i3 : J=ideal(x,y)

o3 = ideal (x, y)

o3 : Ideal of QR

i4 : scalarMultiplication(J,5)

o4 = ideal (x, y)

o4 : Ideal of QR

i5 : setPolynomialRing({x,y}, {2,3})

o5 = PR

o5 : PolynomialRing

i6 : setQuotientRing(y^2-x^3-7*x)

o6 = QR

o6 : QuotientRing

i7 : J=ideal(x,y)

o7 = ideal (x, y)

o7 : Ideal of QR

i8 : K=ideal(x-2,y-3)

o8 = ideal (x - 2, y - 3)

o8 : Ideal of QR

i9 : add(J,K)

o9 = ideal (x, y)

o9 : Ideal of QR

i10 : scalarMultiplication(K,5)

o10 = ideal 1

o10 : Ideal of QR

i11 : 
