-- -*- M2-comint -*- hash: -1075533855

i1 : nmzFilename="polytope";

i2 : setNmzOption("allf",true);

i3 : R=ZZ/37[x,y,z];

i4 : ehrhartRing {x^0,x^2,y^3,z^5};

i5 : extremeRays=readNmzData "ext"

o5 = | 0 0 0 1 |
     | 0 0 5 1 |
     | 0 3 0 1 |
     | 2 0 0 1 |

              4        4
o5 : Matrix ZZ  <--- ZZ

i6 : constraints=readMultipleNmzData "cst"

o6 = {| -15 -10 -6 30 |, | 0 |, | 0 |, | 0 0 0 1 |}
      | 0   0   1  0  |  | 4 |  | 5 |
      | 0   1   0  0  |
      | 1   0   0  0  |

o6 : List

i7 : nmzFilename="square";

i8 : nmzFilename=""; -- deletes the filename

i9 : nmzFilename="polytope";

i10 : rmNmzFiles();

i11 : nmzFilename

o11 = 

i12 : 
