-- -*- M2-comint -*- hash: 1824278901

i1 : R=ZZ/37[x_1..x_7];

i2 : I=ideal(x_1..x_6, x_1*x_2*x_3*x_7, x_1*x_2*x_4*x_7, x_1*x_3*x_5*x_7, x_1*x_4*x_6*x_7, x_1*x_5*x_6*x_7, x_2*x_3*x_6*x_7, x_2*x_4*x_5*x_7, x_2*x_5*x_6*x_7,x_3*x_4*x_5*x_7,x_3*x_4*x_6*x_7);

o2 : Ideal of R

i3 : (intcl,rees)=intclMonIdeal I;

i4 : intcl

o4 = ideal (x , x , x , x , x , x )
             6   5   4   3   2   1

              ZZ
o4 : Ideal of --[x ..x , a]
              37  1   7

i5 : rees

     ZZ
o5 = --[x , x , x a, x , x a, x , x a, x , x a, x , x a, x , x a]
     37  7   6   6    5   5    4   4    3   3    2   2    1   1

                            ZZ
o5 : monomial subalgebra of --[x ..x , a]
                            37  1   7

i6 : R=ZZ/37[x_1..x_8];

i7 : I=ideal(x_1..x_6, x_1*x_2*x_3*x_7, x_1*x_2*x_4*x_7, x_1*x_3*x_5*x_7, x_1*x_4*x_6*x_7, x_1*x_5*x_6*x_7, x_2*x_3*x_6*x_7, x_2*x_4*x_5*x_7, x_2*x_5*x_6*x_7,x_3*x_4*x_5*x_7,x_3*x_4*x_6*x_7);

o7 : Ideal of R

i8 : (intcl,rees)=intclMonIdeal(I,x_8);

i9 : intcl

o9 = ideal (x , x , x , x , x , x )
             6   5   4   3   2   1

o9 : Ideal of R

i10 : rees

      ZZ
o10 = --[x , x , x x , x , x x , x , x x , x , x x , x , x x , x , x x ]
      37  7   6   6 8   5   5 8   4   4 8   3   3 8   2   2 8   1   1 8

o10 : monomial subalgebra of R

i11 : 
