-- -*- M2-comint -*- hash: -899301111

i1 : R=ZZ/37[x,y,t];

i2 : I=ideal(x^3,x^2*y,y^3);

o2 : Ideal of R

i3 : nmzFilename="example";

i4 : setNmzOption("hilb",true);

i5 : intclMonIdeal I;

i6 : invs=getNumInvs()

o6 = HashTable{ => (1, 1, 1, 1)                    }
               degree 1 elements => 7
               dim max subspace => 0
               embedding dim => 4
               external index => 1
               graded => true
               grading denom => 1
               grading => (1, 1, 1, -2)
               hilbert basis elements => 7
               hilbert quasipolynomial denom => 6
               hilbert series denom => (1, 1, 1, 1)
               hilbert series num => (1, 3)
               inhomogeneous => false
               integrally closed => false
               internal index => 1
               multiplicity denom => 1
               multiplicity => 4
               number extreme rays => 5
               number support hyperplanes => 5
               primary => false
               rank => 4
               size triangulation => 3
               sum dets => 4

o6 : HashTable

i7 : hvector=invs#"hilbert series num"

o7 = (1, 3)

o7 : Sequence

i8 : invs#"hilbert series denom"

o8 = (1, 1, 1, 1)

o8 : Sequence

i9 : rmNmzFiles();

i10 : 
