-- -*- M2-comint -*- hash: -1026285318

i1 : R=ZZ/37[x,y,t];

i2 : L={x^3, x^2*y, y^3, x*y^2};

i3 : T=intclToricRing(allComputations=>true,L);

i4 : T.cache#"cone"#"inv"#"hilbert series num"

o4 = 1 : (1)

o4 : Sequence

i5 : T.cache#"cone"#"inv"#"hilbert series denom"

o5 = (1, 1)

o5 : Sequence

i6 : T=intclToricRing(allComputations=>true,grading=>{3,2,1},L);

i7 : T.cache#"cone"#"inv"#"hilbert series num"

o7 = (1, -1, 1)

o7 : Sequence

i8 : T.cache#"cone"#"inv"#"hilbert series denom"

o8 = (1, 6)

o8 : Sequence

i9 : 
