-- -*- M2-comint -*- hash: 314171386

i1 : hy=matrix {{-1,0,-1,0,3,0,0,0,0},{-1,0,1,0,1,0,0,0,0},{1,0,1,0,-1,0,0,0,0},{1,0,-1,0,1,0,0,0,0}};

              4        9
o1 : Matrix ZZ  <--- ZZ

i2 : eq=matrix {{1,1,1,-1,-1,-1,0,0,0},{1,1,1,0,0,0,-1,-1,-1},{0,1,1,-1,0, 0,-1,0,0},{1,0,1,0,-1,0,0,-1,0},{1,1,0,0,0,-1,0,0,-1},{0,1,1,0,-1,0,0,0,-1},{1,1,0,0,-1,0,-1,0,0}};

              7        9
o2 : Matrix ZZ  <--- ZZ

i3 : cg=matrix {{1,0,0,0,0,0,0,0,0,2},{0,0,1,0,0,0,0,0,0,2},{0,0,0,0,0,0,1,0,0,2},{0,0,0,0,0,0,0,0,1,2}};

              4        10
o3 : Matrix ZZ  <--- ZZ

i4 : rc=normaliz({(hy,"inequalities"),(eq,"equations"),(cg,"congruences")});

i5 : rc#"gen"

o5 = | 0 4 2 4 2 0 2 0 4 |
     | 2 0 4 4 2 0 0 4 2 |
     | 2 2 2 2 2 2 2 2 2 |
     | 2 3 4 5 3 1 2 3 4 |
     | 2 4 0 0 2 4 4 0 2 |
     | 2 5 2 3 3 3 4 1 4 |
     | 4 0 2 0 2 4 2 4 0 |
     | 4 1 4 3 3 3 2 5 2 |
     | 4 3 2 1 3 5 4 3 2 |

              9        9
o5 : Matrix ZZ  <--- ZZ

i6 : setNmzOption("allf",true);

i7 : arc=normaliz(allComputations=>true,{(hy,"inequalities"),(eq,"equations"),(cg,"congruences")});

i8 : arc#"gen"

o8 = | 0 4 2 4 2 0 2 0 4 |
     | 2 0 4 4 2 0 0 4 2 |
     | 2 2 2 2 2 2 2 2 2 |
     | 2 3 4 5 3 1 2 3 4 |
     | 2 4 0 0 2 4 4 0 2 |
     | 2 5 2 3 3 3 4 1 4 |
     | 4 0 2 0 2 4 2 4 0 |
     | 4 1 4 3 3 3 2 5 2 |
     | 4 3 2 1 3 5 4 3 2 |

              9        9
o8 : Matrix ZZ  <--- ZZ

i9 : arc#"ext"

o9 = | 0 4 2 4 2 0 2 0 4 |
     | 2 0 4 4 2 0 0 4 2 |
     | 2 4 0 0 2 4 4 0 2 |
     | 4 0 2 0 2 4 2 4 0 |

              4        9
o9 : Matrix ZZ  <--- ZZ

i10 : arc#"inv"

o10 = HashTable{class group => (1, 4, 4)       }
                dim max subspace => 0
                embedding dim => 9
                external index => 4
                graded => false
                hilbert basis elements => 9
                inhomogeneous => false
                number extreme rays => 4
                number support hyperplanes => 4
                rank => 3
                size triangulation => 2
                sum dets => 8

o10 : HashTable

i11 : 
