-- -*- M2-comint -*- hash: -536841110

i1 : setNmzOption("allf",true);

i2 : eq=matrix {{1, 1, 1, -1, -1, -1,  0,  0,  0}, {1, 1, 1,  0,  0,  0, -1, -1, -1}, {0, 1, 1, -1,  0,  0, -1,  0,  0}, {1, 0, 1,  0, -1,  0,  0, -1,  0}, {1, 1, 0,  0,  0, -1,  0,  0, -1}, {0, 1, 1,  0, -1,  0,  0,  0, -1}, {1, 1, 0,  0, -1,  0, -1,  0,  0}};

              7        9
o2 : Matrix ZZ  <--- ZZ

i3 : rc=normaliz(eq,"equations");

i4 : rc#"gen"

o4 = | 0 2 1 2 1 0 1 0 2 |
     | 1 0 2 2 1 0 0 2 1 |
     | 1 1 1 1 1 1 1 1 1 |
     | 1 2 0 0 1 2 2 0 1 |
     | 2 0 1 0 1 2 1 2 0 |

              5        9
o4 : Matrix ZZ  <--- ZZ

i5 : arc=normaliz(allComputations=>true,eq,"equations");

i6 : arc#"gen"

o6 = | 0 2 1 2 1 0 1 0 2 |
     | 1 0 2 2 1 0 0 2 1 |
     | 1 1 1 1 1 1 1 1 1 |
     | 1 2 0 0 1 2 2 0 1 |
     | 2 0 1 0 1 2 1 2 0 |

              5        9
o6 : Matrix ZZ  <--- ZZ

i7 : arc#"ext"

o7 = | 0 2 1 2 1 0 1 0 2 |
     | 1 0 2 2 1 0 0 2 1 |
     | 1 2 0 0 1 2 2 0 1 |
     | 2 0 1 0 1 2 1 2 0 |

              4        9
o7 : Matrix ZZ  <--- ZZ

i8 : arc#"inv"

o8 = HashTable{ => (1, 1, 1)                         }
               class group => (1, 2, 2)
               degree 1 elements => 5
               dim max subspace => 0
               embedding dim => 9
               external index => 1
               graded => true
               grading denom => 3
               grading => (1, 1, 1, 0, 0, 0, 0, 0, 0)
               hilbert basis elements => 5
               hilbert quasipolynomial denom => 1
               hilbert series denom => (1, 1, 1)
               hilbert series num => (1, 2, 1)
               inhomogeneous => false
               multiplicity denom => 1
               multiplicity => 4
               number extreme rays => 4
               number support hyperplanes => 4
               rank => 3
               size triangulation => 2
               sum dets => 4

o8 : HashTable

i9 : 
