-- -*- M2-comint -*- hash: 1901564837

i1 : setNmzOption("allf",true);

i2 : eq=matrix {{1, 1, 1, -1, -1, -1,  0,  0,  0}, {1, 1, 1,  0,  0,  0, -1, -1, -1}, {0, 1, 1, -1,  0,  0, -1,  0,  0}, {1, 0, 1,  0, -1,  0,  0, -1,  0}, {1, 1, 0,  0,  0, -1,  0,  0, -1}, {0, 1, 1,  0, -1,  0,  0,  0, -1}, {1, 1, 0,  0, -1,  0, -1,  0,  0}};

              7        9
o2 : Matrix ZZ  <--- ZZ

i3 : rc=normaliz(eq,"equations")

o3 = RationalCone{gen => | 0 2 1 2 1 0 1 0 2 |                            }
                         | 1 0 2 2 1 0 0 2 1 |
                         | 1 1 1 1 1 1 1 1 1 |
                         | 1 2 0 0 1 2 2 0 1 |
                         | 2 0 1 0 1 2 1 2 0 |
                  inv => HashTable{ => (1, 1, 1)                         }
                                   class group => (1, 2, 2)
                                   degree 1 elements => 5
                                   dim max subspace => 0
                                   embedding dim => 9
                                   external index => 1
                                   graded => true
                                   grading denom => 3
                                   grading => (1, 1, 1, 0, 0, 0, 0, 0, 0)
                                   hilbert basis elements => 5
                                   hilbert quasipolynomial denom => 1
                                   hilbert series denom => (1, 1, 1)
                                   hilbert series num => (1, 2, 1)
                                   inhomogeneous => false
                                   multiplicity denom => 1
                                   multiplicity => 4
                                   number extreme rays => 4
                                   number support hyperplanes => 4
                                   rank => 3
                                   size triangulation => 2
                                   sum dets => 4

o3 : RationalCone

i4 : arc=normaliz(allComputations=>true,eq,"equations");

i5 : arc#"gen"

o5 = | 0 2 1 2 1 0 1 0 2 |
     | 1 0 2 2 1 0 0 2 1 |
     | 1 1 1 1 1 1 1 1 1 |
     | 1 2 0 0 1 2 2 0 1 |
     | 2 0 1 0 1 2 1 2 0 |

              5        9
o5 : Matrix ZZ  <--- ZZ

i6 : arc#"ext"

o6 = | 0 2 1 2 1 0 1 0 2 |
     | 1 0 2 2 1 0 0 2 1 |
     | 1 2 0 0 1 2 2 0 1 |
     | 2 0 1 0 1 2 1 2 0 |

              4        9
o6 : Matrix ZZ  <--- ZZ

i7 : arc#"inv"

o7 = HashTable{ => (1, 1, 1)                         }
               class group => (1, 2, 2)
               degree 1 elements => 5
               dim max subspace => 0
               embedding dim => 9
               external index => 1
               graded => true
               grading denom => 3
               grading => (1, 1, 1, 0, 0, 0, 0, 0, 0)
               hilbert basis elements => 5
               hilbert quasipolynomial denom => 1
               hilbert series denom => (1, 1, 1)
               hilbert series num => (1, 2, 1)
               inhomogeneous => false
               multiplicity denom => 1
               multiplicity => 4
               number extreme rays => 4
               number support hyperplanes => 4
               rank => 3
               size triangulation => 2
               sum dets => 4

o7 : HashTable

i8 : 
