-- -*- M2-comint -*- hash: -1202778189

i1 : R=QQ[x,y,z];

i2 : vars(R)

o2 = | x y z |

             1       3
o2 : Matrix R  <--- R

i3 : M=matrix {{0},{2*y},{z}}

o3 = | 0  |
     | 2y |
     | z  |

             3       1
o3 : Matrix R  <--- R

i4 : commutator(M)

o4 = 0

             3
o4 : Matrix R  <--- 0

i5 : bracket(M,M)

o5 = 0

             3       1
o5 : Matrix R  <--- R

i6 : commutator(image M)

o6 = image | 0 0   0   |
           | 0 4y2 2yz |
           | 0 2yz z2  |

                             3
o6 : R-module, submodule of R

i7 : bracket(M,y*M)

o7 = | 0   |
     | 4y2 |
     | 2yz |

             3       1
o7 : Matrix R  <--- R

i8 : applyVectorField(M,x*y-z^2)

              2
o8 = 2x*y - 2z

o8 : R

i9 : applyVectorField(image M,x*y-z^2)

                    2
o9 = ideal(2x*y - 2z )

o9 : Ideal of R

i10 : D=derlog(ideal (x*y-z^2))

o10 = image | 2x 0  2z 0  |
            | 0  2y 0  2z |
            | z  z  y  x  |

                              3
o10 : R-module, submodule of R

i11 : isSubset(image M,D)

o11 = true

i12 : isVectorField(gens D)

o12 = true

i13 : isVectorField(D)

o13 = true

i14 : isLieAlgebra(D)

o14 = true

i15 : 
