-- -*- M2-comint -*- hash: -326227646

i1 : R=QQ[x,y,z];

i2 : A=matrix {{x},{y},{0}};

             3       1
o2 : Matrix R  <--- R

i3 : B=matrix {{0},{0},{z}};

             3       1
o3 : Matrix R  <--- R

i4 : f=x*y-z^2;

i5 : applyVectorField(A,f)

o5 = 2x*y

o5 : R

i6 : applyVectorField(A,{f,x*f})

              2       2
o6 = {2x*y, 3x y - x*z }

o6 : List

i7 : applyVectorField(A|B,{f,x*f})

               2    2       2       2
o7 = {2x*y, -2z , 3x y - x*z , -2x*z }

o7 : List

i8 : applyVectorField(image A,f)

o8 = ideal(2x*y)

o8 : Ideal of R

i9 : applyVectorField(image A,ideal (f))

                    2     2
o9 = ideal (x*y, y*z , x*z )

o9 : Ideal of R

i10 : trim(ideal(applyVectorField(A,f))+ideal(f)*minors(1,A))

                     2     2
o10 = ideal (x*y, y*z , x*z )

o10 : Ideal of R

i11 : 
