-- -*- M2-comint -*- hash: -43666813

i1 : R=QQ[x,y];

i2 : A=matrix {{0},{x}};

             2       1
o2 : Matrix R  <--- R

i3 : B=matrix {{x^2},{y}};

             2       1
o3 : Matrix R  <--- R

i4 : C=matrix {{1},{x}};

             2       1
o4 : Matrix R  <--- R

i5 : bracket(A,B)

o5 = | 0     |
     | -x2+x |

             2       1
o5 : Matrix R  <--- R

i6 : bracket(B,A)==-bracket(A,B)

o6 = true

i7 : bracket(A,C)

o7 = | 0  |
     | -1 |

             2       1
o7 : Matrix R  <--- R

i8 : bracket(A_0,C_0)

o8 = |  0 |
     | -1 |

      2
o8 : R

i9 : bracket(A,B|C)

o9 = | 0     0  |
     | -x2+x -1 |

             2       2
o9 : Matrix R  <--- R

i10 : bracket(A|C,B|C,{(0,0),(1,1)})===bracket(A,B)|bracket(C,C)

o10 = true

i11 : bracket(A|C,B|C,{{0,1}})===bracket(A,C)

o11 = true

i12 : trim bracket(image(A),image(B))

o12 = image | 0 0  0    x3 |
            | x xy x2-x 0  |

                              2
o12 : R-module, submodule of R

i13 : (2*x+1)*bracket(A,B)-bracket(x*A,B)

o13 = | 0 |
      | x |

              2       1
o13 : Matrix R  <--- R

i14 : R=QQ[a,b,c,d];

i15 : e=matrix {{c},{d},{0},{0}};

              4       1
o15 : Matrix R  <--- R

i16 : f=matrix {{0},{0},{a},{b}};

              4       1
o16 : Matrix R  <--- R

i17 : h=matrix {{-a},{-b},{c},{d}};

              4       1
o17 : Matrix R  <--- R

i18 : L=e|f|h;

              4       3
o18 : Matrix R  <--- R

i19 : bracket(e,f)-h==0

o19 = true

i20 : bracket(h,f)+2*f==0

o20 = true

i21 : bracket(h,e)-2*e==0

o21 = true

i22 : bracket(L,L)

o22 = | 0 -a -2c a  0 0  2c 0   0 |
      | 0 -b -2d b  0 0  2d 0   0 |
      | 0 c  0   -c 0 2a 0  -2a 0 |
      | 0 d  0   -d 0 2b 0  -2b 0 |

              4       9
o22 : Matrix R  <--- R

i23 : image bracket(L,L)==image L

o23 = true

i24 : 
