-- -*- M2-comint -*- hash: 625394390

i1 : R=QQ[x,y];

i2 : I=ideal (x*y);

o2 : Ideal of R

i3 : J=ideal (0_R);

o3 : Ideal of R

i4 : K=ideal (x,y);

o4 : Ideal of R

i5 : der(J,I)

      2
o5 = R

o5 : R-module, free

i6 : der(J,K)

      2
o6 = R

o6 : R-module, free

i7 : D=der(I,I)

o7 = image | x 0 |
           | 0 y |

                             2
o7 : R-module, submodule of R

i8 : applyVectorField(D,I)

o8 = ideal(x*y)

o8 : Ideal of R

i9 : D=der({x*y},J)

o9 = image | x  |
           | -y |

                             2
o9 : R-module, submodule of R

i10 : der(I,J)

o10 = image 0

                              2
o10 : R-module, submodule of R

i11 : applyVectorField(gens D,x^2*y)

       2
o11 = x y

o11 : R

i12 : der({x},ideal (y))

o12 = image | 0 y |
            | 1 0 |

                              2
o12 : R-module, submodule of R

i13 : der(ideal (x),ideal (y))

o13 = image | y 0 |
            | 0 y |

                              2
o13 : R-module, submodule of R

i14 : intersect(der(ideal (x),K),der(ideal (y),K))==der(K,K)

o14 = true

i15 : 
