-- -*- M2-comint -*- hash: -1743788115

i1 : R=QQ[a,b,c];

i2 : D=derlog(a*c-b^2)

o2 = image | 2b a  0  0  |
           | c  0  b  a  |
           | 0  -c 2c 2b |

                             3
o2 : R-module, submodule of R

i3 : ds=derivedSeries(3,gens D)

o3 = {| 2b a  0  0  |, | 2b -2b 0 -2a 0  0   |, | 0 0 0 -4b 4b 0 -2a 2a  0
      | c  0  b  a  |  | c  -c  0 0   a  -a  |  | 0 0 0 -2c 2c 0 0   0   0
      | 0  -c 2c 2b |  | 0  0   0 2c  2b -2b |  | 0 0 0 0   0  0 2c  -2c 0
     ------------------------------------------------------------------------
     0   2a  -2a 0 0  0 |, | 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 8b -8b 0 0 0
     -2a 0   0   0 2a 0 |  | 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 4c -4c 0 0 0
     -4b -2c 2c  0 4b 0 |  | 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0  0   0 0 0
     ------------------------------------------------------------------------
     0 -8b 8b 0 0 0 0 0 0 0 0 0 0 0 0 0 -8a 8a  0 0  0   0 0 0 0 -8b 8b 0 0 0
     0 -4c 4c 0 0 0 0 0 0 0 0 0 0 0 0 0 0   0   0 4a -4a 0 0 0 0 -4c 4c 0 0 0
     0 0   0  0 0 0 0 0 0 0 0 0 0 0 0 0 8c  -8c 0 8b -8b 0 0 0 0 0   0  0 0 0
     ------------------------------------------------------------------------
     0 0  0 0 0 8b -8b 0 0 0 0 0   0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 8a  -8a 0
     0 4a 0 0 0 4c -4c 0 0 0 0 -4a 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0   0   0
     0 8b 0 0 0 0  0   0 0 0 0 -8b 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -8c 8c  0
     ------------------------------------------------------------------------
     0   0  0 0 0  0   0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |}
     -4a 4a 0 0 4a -4a 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |
     -8b 8b 0 0 8b -8b 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |

o3 : List

i4 : apply(ds,f->gens trim image f)

o4 = {| 2b a  0  0  |, | 2b a  0  |, | 2b a  0  |, | 2b a  0  |}
      | c  0  b  a  |  | c  0  a  |  | c  0  a  |  | c  0  a  |
      | 0  -c 2c 2b |  | 0  -c 2b |  | 0  -c 2b |  | 0  -c 2b |

o4 : List

i5 : derivedSeries(3,D)

o5 = {image | 2b a  0  0  |, image | 2b a  0  0   0   0     |, image | 2b a 
            | c  0  b  a  |        | c  0  a  bc  b2  0     |        | c  0 
            | 0  -c 2c 2b |        | 0  -c 2b 2c2 2bc b2-ac |        | 0  -c
     ------------------------------------------------------------------------
     0  0   0   0     |, image | 2b a  0  0   0   0     |}
     a  bc  b2  0     |        | c  0  a  bc  b2  0     |
     2b 2c2 2bc b2-ac |        | 0  -c 2b 2c2 2bc b2-ac |

o5 : List

i6 : trim((image commutator(gens D))+(ideal (a,b,c))*D)

o6 = image | 2b a  0  0   0   0     |
           | c  0  a  bc  b2  0     |
           | 0  -c 2b 2c2 2bc b2-ac |

                             3
o6 : R-module, submodule of R

i7 : D=derlog(a*(a*c-b^2))

o7 = image | a  0  0  |
           | 0  b  a  |
           | -c 2c 2b |

                             3
o7 : R-module, submodule of R

i8 : derivedSeries(3,gens D)

o8 = {| a  0  0  |, | 0 0  0   |, 0, 0}
      | 0  b  a  |  | 0 a  -a  |
      | -c 2c 2b |  | 0 2b -2b |

o8 : List

i9 : derivedSeries(3,D)

o9 = {image | a  0  0  |, image | 0  ac  0   ab  0   a2  0     |, image |
            | 0  b  a  |        | a  0   bc  0   b2  0   0     |        |
            | -c 2c 2b |        | 2b -c2 2c2 -bc 2bc -ac b2-ac |        |
     ------------------------------------------------------------------------
     2ab  0      a2  0   0     0   2ac2 0    0   |, image | 2ab2+a2c  a2b 
     -ac  2b2+ac 0   ab  0     a2  bc2  ac2  bc3 |        | 0         0   
     -4bc 6bc    -ac 2ac b2-ac 2ab 0    2bc2 2c4 |        | -4b2c+ac2 -abc
     ------------------------------------------------------------------------
     0    0    a3   0    0      0       0    6abc2 0         a2c2 0    0   
     a2c  ab2  0    a2b  0      0       a3   ac3   2b2c2-ac3 0    abc2 b3c 
     2abc 2abc -a2c 2a2c b3-abc ab2-a2c 2a2b -4bc3 2bc3      -ac3 2ac3 2ac3
     ------------------------------------------------------------------------
     0        0     0    2ac5 0   |}
     0        b4    ac4  bc5  bc7 |
     b2c2-ac3 2abc2 2bc4 0    2c8 |

o9 : List

i10 : 
