-- -*- M2-comint -*- hash: -1797363240

i1 : R=QQ[a,b,c];

i2 : f=a*b*(a-b)*(a-c*b)

        2 2       3     3     2 2
o2 = - a b c + a*b c + a b - a b

o2 : R

i3 : D=derlog(ideal (f))

o3 = image | a 0    0     |
           | b 0    ab-b2 |
           | 0 bc-a -ac+a |

                             3
o3 : R-module, submodule of R

i4 : S=stratifyByRank(D);

i5 : S#1

o5 = ideal (a, b)

o5 : Ideal of R

i6 : isFiniteStratification(S)
isFiniteStratification: Component ideal(b,a) has dim 1 but should be of dim <1 to have a finite stratification.

o6 = false

i7 : D=derlog(ideal (a*b*c))

o7 = image | a 0 0 |
           | 0 b 0 |
           | 0 0 c |

                             3
o7 : R-module, submodule of R

i8 : isFiniteStratification(stratifyByRank(D))

o8 = true

i9 : 
