-- -*- M2-comint -*- hash: -2091486609

i1 : R=QQ[a,b,c,d];

i2 : e=matrix {{c},{d},{0},{0}};

             4       1
o2 : Matrix R  <--- R

i3 : f=matrix {{0},{0},{a},{b}};

             4       1
o3 : Matrix R  <--- R

i4 : h=matrix {{-a},{-b},{c},{d}};

             4       1
o4 : Matrix R  <--- R

i5 : bracket(e,f)-h==0

o5 = true

i6 : bracket(h,f)+2*f==0

o6 = true

i7 : bracket(h,e)-2*e==0

o7 = true

i8 : isLieAlgebra(image (e|f|h))

o8 = true

i9 : 
