-- -*- M2-comint -*- hash: 743803683

i1 : R=QQ[x,y,z];

i2 : f=x*y-z^2;

i3 : I=ideal (f);

o3 : Ideal of R

i4 : M=matrix {{x,2*z,2*z},{y,0,0},{z,y,x}};

             3       3
o4 : Matrix R  <--- R

i5 : applyVectorField(M,{f})

               2
o5 = {2x*y - 2z , 0, - 2x*z + 2y*z}

o5 : List

i6 : isLogarithmic(M,I)

o6 = false

i7 : isLogarithmic(M_{0,1},I)

o7 = true

i8 : isLogarithmic(derlog(I),I)

o8 = true

i9 : 
