-- -*- M2-comint -*- hash: 1985892043

i1 : R=QQ[a,b,c];

i2 : f=a*b*(a-b)*(a-c*b);

i3 : D=derlog(ideal (f))

o3 = image | a 0    0     |
           | b 0    ab-b2 |
           | 0 bc-a -ac+a |

                             3
o3 : R-module, submodule of R

i4 : isHolonomic(f)
isFiniteStratification: Component ideal(b,a) has dim 1 but should be of dim <1 to have a finite stratification.

o4 = false

i5 : f=a*c-b^2;

i6 : D=derlog(ideal (f))

o6 = image | 2b a  0  0  |
           | c  0  b  a  |
           | 0  -c 2c 2b |

                             3
o6 : R-module, submodule of R

i7 : isHolonomic(f)

o7 = true

i8 : S=stratifyByRank(D);

i9 : S#1

o9 = ideal (a, b, c)

o9 : Ideal of R

i10 : S#2

o10 = ideal (a, b, c)

o10 : Ideal of R

i11 : S#3

             2
o11 = ideal(b  - a*c)

o11 : Ideal of R

i12 : f=a^2-b^2*c;

i13 : D=derlog(ideal (f));

i14 : isHolonomic(f)

o14 = true

i15 : S=stratifyByRank(D);

i16 : S#1

o16 = ideal (a, b, c)

o16 : Ideal of R

i17 : S#2

o17 = ideal (a, b)

o17 : Ideal of R

i18 : S#3

             2     2
o18 = ideal(b c - a )

o18 : Ideal of R

i19 : 
