-- -*- M2-comint -*- hash: -2045410948

i1 : R=QQ[a,b,c];

i2 : f=a*b*(a-b)*(a-c*b);

i3 : derlog(ideal (f))

o3 = image | a 0    0     |
           | b 0    ab-b2 |
           | 0 bc-a -ac+a |

                             3
o3 : R-module, submodule of R

i4 : derlogH(f)

o4 = image | ab      a2          |
           | b2      -3ab+4b2    |
           | -4bc+4a 4ac-12bc+8a |

                             3
o4 : R-module, submodule of R

i5 : isHHolonomic(f)
isFiniteStratification: Component ideal(b,a) has dim 1 but should be of dim <1 to have a finite stratification.

o5 = false

i6 : isHolonomic(f)
isFiniteStratification: Component ideal(b,a) has dim 1 but should be of dim <1 to have a finite stratification.

o6 = false

i7 : f=a*c-b^2;

i8 : D=gens derlogH(f)

o8 = | 2b a  0  |
     | c  0  a  |
     | 0  -c 2b |

             3       3
o8 : Matrix R  <--- R

i9 : det(D)

o9 = 0

o9 : R

i10 : isHHolonomic(f)

o10 = true

i11 : S=stratifyByRank(D)

o11 = StratificationByRank{1 => ideal (a, b, c)}
                           2 => ideal (a, b, c)
                           3 => ideal ()

o11 : StratificationByRank

i12 : S#1

o12 = ideal (a, b, c)

o12 : Ideal of R

i13 : S#2

o13 = ideal (a, b, c)

o13 : Ideal of R

i14 : S#3

o14 = ideal ()

o14 : Ideal of R

i15 : f=a^2-b^2*c;

i16 : isHHolonomic(f)

o16 = true

i17 : 
