-- -*- M2-comint -*- hash: -479798784

i1 : R=QQ[a,b,c];

i2 : f=a*c-b^2;

i3 : M=derlog(ideal (f))

o3 = image | 2b a  0  0  |
           | c  0  b  a  |
           | 0  -c 2c 2b |

                             3
o3 : R-module, submodule of R

i4 : isFreeDivisor(gens M)

o4 = false

i5 : isFreeDivisor(M)

o5 = false

i6 : isFreeDivisor(f)

o6 = false

i7 : f=a*(a*c-b^2);

i8 : M=derlog(ideal (f))

o8 = image | a  0  0  |
           | 0  b  a  |
           | -c 2c 2b |

                             3
o8 : R-module, submodule of R

i9 : isFreeDivisor(gens M)

o9 = true

i10 : isFreeDivisor(M)

o10 = true

i11 : isFreeDivisor(f)

o11 = true

i12 : f=a;

i13 : D=derlog(ideal (f))

o13 = image | 0 0 a |
            | 1 0 0 |
            | 0 1 0 |

                              3
o13 : R-module, submodule of R

i14 : isFreeDivisor(f)

o14 = true

i15 : isFreeDivisor(D)

o15 = true

i16 : M=matrix {{a,0,0},{0,a,0},{0,0,1}};

              3       3
o16 : Matrix R  <--- R

i17 : isSubset(image M,D)

o17 = true

i18 : isFreeDivisor(M)

o18 = false

i19 : isFreeDivisor((gens D)|M)

o19 = false

i20 : isFreeDivisor(trim image ((gens D)|M))

o20 = true

i21 : 
