-- -*- M2-comint -*- hash: 360408062

i1 : R=QQ[a,b,c];

i2 : D=derlog(a*c-b^2)

o2 = image | 2b a  0  0  |
           | c  0  b  a  |
           | 0  -c 2c 2b |

                             3
o2 : R-module, submodule of R

i3 : lcs=lowerCentralSeries(2,gens D)

o3 = {| 2b a  0  0  |, | 0 2b -2b -2a -2b 0 0 0  2b 0 0 0   2a  0   0  0 |, |
      | c  0  b  a  |  | 0 c  -c  0   -c  0 0 a  c  0 0 -a  0   -a  a  0 |  |
      | 0  -c 2c 2b |  | 0 0  0   2c  0   0 0 2b 0  0 0 -2b -2c -2b 2b 0 |  |
     ------------------------------------------------------------------------
     0 0 0 -4b 0 0 0 -2a 0 0 0 2a  4b 2a  -2a 0 0 -2b 2b 0 2b 0 0 0  -2b 0 0
     0 0 0 -2c 0 0 0 0   0 0 0 0   2c 0   0   0 0 -c  c  0 c  0 0 a  -c  0 0
     0 0 0 0   0 0 0 2c  0 0 0 -2c 0  -2c 2c  0 0 0   0  0 0  0 0 2b 0   0 0
     ------------------------------------------------------------------------
     0   0 0   0  0 0 2b -2b 0 -2b 0 0 0   2b 0 0 0  0 0  0   0 0 2a  -2a 0 
     -a  0 -a  a  0 0 c  -c  0 -c  0 0 -a  c  0 0 a  0 a  -a  0 0 0   0   2a
     -2b 0 -2b 2b 0 0 0  0   0 0   0 0 -2b 0  0 0 2b 0 2b -2b 0 0 -2c 2c  4b
     ------------------------------------------------------------------------
     -2a 0 0 0 2a  0 0 0 0   0 0 0 |}
     0   0 0 0 0   0 0 0 -2a 0 0 0 |
     2c  0 0 0 -2c 0 0 0 -4b 0 0 0 |

o3 : List

i4 : apply(lcs,f->gens trim image f)

o4 = {| 2b a  0  0  |, | 2b a  0  |, | 2b a  0  |}
      | c  0  b  a  |  | c  0  a  |  | c  0  a  |
      | 0  -c 2c 2b |  | 0  -c 2b |  | 0  -c 2b |

o4 : List

i5 : lowerCentralSeries(2,D)

o5 = {image | 2b a  0  0  |, image | 2b a  0  0   0   0     |, image | 2b a 
            | c  0  b  a  |        | c  0  a  bc  b2  0     |        | c  0 
            | 0  -c 2c 2b |        | 0  -c 2b 2c2 2bc b2-ac |        | 0  -c
     ------------------------------------------------------------------------
     0  0   0   0     |}
     a  bc  b2  0     |
     2b 2c2 2bc b2-ac |

o5 : List

i6 : trim((image commutator(gens D))+(ideal (a,b,c))*D)

o6 = image | 2b a  0  0   0   0     |
           | c  0  a  bc  b2  0     |
           | 0  -c 2b 2c2 2bc b2-ac |

                             3
o6 : R-module, submodule of R

i7 : D=image matrix {{0},{a},{2*b}};

i8 : lowerCentralSeries(5,gens D)

o8 = {| 0  |, 0, 0, 0, 0, 0}
      | a  |
      | 2b |

o8 : List

i9 : lowerCentralSeries(5,D)

o9 = {image | 0  |, image | 0   0   |, image | 0   0   |, image | 0    0   
            | a  |        | ab  a2  |        | a2  ab2 |        | a2b  a3  
            | 2b |        | 2b2 2ab |        | 2ab 2b3 |        | 2ab2 2a2b
     ------------------------------------------------------------------------
     0   |, image | 0    0    0   |, image | 0     0    0    0   |}
     ab3 |        | a3   a2b2 ab4 |        | a3b   a4   a2b3 ab5 |
     2b4 |        | 2a2b 2ab3 2b5 |        | 2a2b2 2a3b 2ab4 2b6 |

o9 : List

i10 : 
