-- -*- M2-comint -*- hash: -1269796935

i1 : rationalCurve(1)

o1 = 2875

o1 : QQ

i2 : T = {{5},{4,2},{3,3},{3,2,2},{2,2,2,2}}

o2 = {{5}, {4, 2}, {3, 3}, {3, 2, 2}, {2, 2, 2, 2}}

o2 : List

i3 : for D in T list rationalCurve(1,D)

o3 = {2875, 1280, 1053, 720, 512}

o3 : List

i4 : rationalCurve(2)

     4876875
o4 = -------
        8

o4 : QQ

i5 : for D in T list rationalCurve(2,D)

      4876875         423549
o5 = {-------, 92448, ------, 22518, 9792}
         8               8

o5 : List

i6 : rationalCurve(2) - rationalCurve(1)/8

o6 = 609250

o6 : QQ

i7 : time for D in T list rationalCurve(2,D) - rationalCurve(1,D)/8
     -- used 0.371604 seconds

o7 = {609250, 92288, 52812, 22428, 9728}

o7 : List

i8 : time rationalCurve(3)
     -- used 0.223369 seconds

     8564575000
o8 = ----------
         27

o8 : QQ

i9 : time for D in T list rationalCurve(3,D)
     -- used 7.33112 seconds

      8564575000  422690816           4834592  11239424
o9 = {----------, ---------, 6424365, -------, --------}
          27          27                 3        27

o9 : List

i10 : time rationalCurve(3) - rationalCurve(1)/27
     -- used 0.2237 seconds

o10 = 317206375

o10 : QQ

i11 : time for D in T list rationalCurve(3,D) - rationalCurve(1,D)/27
     -- used 7.29084 seconds

o11 = {317206375, 15655168, 6424326, 1611504, 416256}

o11 : List

i12 : time rationalCurve(4)
     -- used 2.40343 seconds

      15517926796875
o12 = --------------
            64

o12 : QQ

i13 : time rationalCurve(4,{4,2})
     -- used 11.7828 seconds

o13 = 3883914084

o13 : QQ

i14 : time rationalCurve(4) - rationalCurve(2)/8
     -- used 2.40346 seconds

o14 = 242467530000

o14 : QQ

i15 : time rationalCurve(4,{4,2}) - rationalCurve(2,{4,2})/8
     -- used 11.6916 seconds

o15 = 3883902528

o15 : QQ

i16 : time rationalCurve(4,{3,3}) - rationalCurve(2,{3,3})/8
     -- used 12.1647 seconds

o16 = 1139448384

o16 : QQ

i17 : 
