-- -*- M2-comint -*- hash: -324001524

i1 : K = ZZ/333331; K[t_0..t_5];

i3 : X = projectiveVariety ideal(t_4^2-t_3*t_5,t_2*t_4-t_1*t_5,t_2*t_3-t_1*t_4,t_2^2-t_0*t_5,t_1*t_2-t_0*t_4,t_1^2-t_0*t_3);

o3 : ProjectiveVariety, surface in PP^5

i4 : X!
dim:.................. 2
codim:................ 3
degree:............... 4
sectional genus:...... 0
generators:........... 2^6 
degree associated map: 1
linear normality:..... true
connected components:. 1
purity:............... true
dim sing. l.:......... -1
*** This is the Veronese surface in P^5 ***
*** This is the base locus of a special Cremona transformation of PP^5 ***

i5 : K[x_0..x_7];

i6 : X = projectiveVariety ideal(x_5*x_6-x_4*x_7,x_4*x_6-x_3*x_7,x_2*x_6-x_1*x_7,x_1*x_6-x_0*x_7,x_4^2-x_3*x_5,x_2*x_4-x_1*x_5,x_1*x_4-x_0*x_5,x_2*x_3-x_0*x_5,x_1*x_3-x_0*x_4,x_1^2-x_0*x_2);

o6 : ProjectiveVariety, threefold in PP^7

i7 : X!
dim:.................. 3
codim:................ 4
degree:............... 5
sectional genus:...... 0
generators:........... 2^10 
degree associated map: 0
linear normality:..... true
connected components:. 1
purity:............... true
dim sing. l.:......... -1
*** This is a rational normal scroll of dimension 3 and degree 5 in PP^7 ***

i8 : (random({2},X))!
dim:.................. 6
codim:................ 1
degree:............... 2
sectional genus:...... 0
generators:........... 2^1 
linear normality:..... true
connected components:. 1
purity:............... true
dim sing. l.:......... -1
*** This is a smooth hypersurface of degree 2 in PP^7 ***

i9 : (random({{2},{2}},X))!
dim:.................. 5
codim:................ 2
degree:............... 4
sectional genus:...... 1
generators:........... 2^2 
linear normality:..... true
connected components:. 1
purity:............... true
dim sing. l.:......... 0
degree sing. l.:...... 4
gens. sing. l.:....... 1^4 2^6 
*** This is a factorial complete intersection of type (2,2) in PP^7 ***

i10 : 
