-- -*- M2-comint -*- hash: -1989894531

i1 : Phi = parametrize PP_(ZZ/65521)^({1,3},{2,1});

o1 : MultirationalMap (rational map from PP^4 to hypersurface in PP^2 x PP^3)

i2 : X = image Phi;

o2 : ProjectiveVariety, hypersurface in PP^2 x PP^3

i3 : describe X

o3 = ambient:.............. PP^2 x PP^3
     dim:.................. 4
     codim:................ 1
     degree:............... 8
     multidegree:.......... 2*T_0
     generators:........... (2,0)^1 
     purity:............... true
     dim sing. l.:......... -1
     Segre embedding:...... map to PP^11

i4 : Y = PP^{3,5};

o4 : ProjectiveVariety, PP^3 x PP^5

i5 : Psi = Phi << Y;

o5 : MultirationalMap (rational map from PP^4 to Y)

i6 : describe image Psi

o6 = ambient:.............. PP^3 x PP^5
     dim:.................. 4
     codim:................ 4
     degree:............... 8
     multidegree:.......... 2*T_0^2*T_1^2
     generators:........... (0,1)^2 (1,0)^1 (2,0)^1 
     purity:............... true
     dim sing. l.:......... -1
     Segre embedding:...... map to PP^11 âŠ‚ PP^23

i7 : j = X << Y;

o7 : MultirationalMap (rational map from X to Y)

i8 : assert(Phi * j == Psi and j == (1_X << Y))

i9 : 
