-- -*- M2-comint -*- hash: 175005479

i1 : ZZ/65521[x_0..x_4];

i2 : f = last graph rationalMap {x_2^2-x_1*x_3, x_1*x_2-x_0*x_3, x_1^2-x_0*x_2, x_0*x_4, x_1*x_4, x_2*x_4, x_3*x_4, x_4^2};

o2 : MultihomogeneousRationalMap (rational map from 4-dimensional subvariety of PP^4 x PP^7 to PP^7)

i3 : Phi = rationalMap {f,f};

o3 : MultirationalMap (rational map from 4-dimensional subvariety of PP^4 x PP^7 to PP^7 x PP^7)

i4 : Z = source Phi;

o4 : ProjectiveVariety, 4-dimensional subvariety of PP^4 x PP^7

i5 : time Phi Z;
     -- used 0.146694 seconds

o5 : ProjectiveVariety, 4-dimensional subvariety of PP^7 x PP^7

i6 : dim oo, degree oo, degrees oo

o6 = (4, 80, {({0, 2}, 5), ({1, 1}, 33), ({2, 0}, 5)})

o6 : Sequence

i7 : time Phi (point Z + point Z + point Z)
     -- used 1.76774 seconds

o7 = 0-dimensional subvariety of PP^7 x PP^7 cut out by 22 hypersurfaces of multi-degrees (0,1)^5 (0,2)^3 (1,0)^5 (1,1)^6 (2,0)^3 

o7 : ProjectiveVariety, 0-dimensional subvariety of PP^7 x PP^7

i8 : dim oo, degree oo, degrees oo

o8 = (0, 3, {({0, 1}, 5), ({0, 2}, 3), ({1, 0}, 5), ({1, 1}, 6), ({2, 0},
     ------------------------------------------------------------------------
     3)})

o8 : Sequence

i9 : 
