-- -*- M2-comint -*- hash: -454526220

i1 : Phi = rationalMap({veronese(1,2,ZZ/33331)},Dominant=>true);

o1 : MultirationalMap (dominant rational map from PP^1 to curve in PP^2)

i2 : Psi = rationalMap {veronese(1,3,ZZ/33331)};

o2 : MultirationalMap (rational map from PP^1 to PP^3)

i3 : (X,Y,Z) = (source Phi,target Phi,target Psi);

i4 : Eta = Phi | Psi;

o4 : MultirationalMap (rational map from X to Y x Z)

i5 : Eta | Phi;

o5 : MultirationalMap (rational map from X to Y x Z x Y)

i6 : Phi | Psi | Eta;

o6 : MultirationalMap (rational map from X to Y x Z x Y x Z)

i7 : super oo;

o7 : MultirationalMap (rational map from X to PP^2 x PP^3 x PP^2 x PP^3)

i8 : rationalMap(oo,image oo);

o8 : MultirationalMap (dominant rational map from X to curve in PP^2 x PP^3 x PP^2 x PP^3)

i9 : 
