-- -*- M2-comint -*- hash: 305188931

i1 : ZZ/65521[x_0..x_4];

i2 : f = rationalMap {x_2^2-x_1*x_3, x_1*x_2-x_0*x_3, x_1^2-x_0*x_2, x_0*x_4, x_1*x_4, x_2*x_4, x_3*x_4, x_4^2};

o2 : RationalMap (quadratic rational map from PP^4 to PP^7)

i3 : g = rationalMap {-x_3^2+x_2*x_4, 2*x_2*x_3-2*x_1*x_4, -3*x_2^2+2*x_1*x_3+x_0*x_4, 2*x_1*x_2-2*x_0*x_3, -x_1^2+x_0*x_2};

o3 : RationalMap (quadratic rational map from PP^4 to PP^4)

i4 : Phi = rationalMap {f,g};

o4 : MultirationalMap (rational map from PP^4 to PP^7 x PP^4)

i5 : time Z = image Phi;
     -- used 0.149689 seconds

o5 : ProjectiveVariety, 4-dimensional subvariety of PP^7 x PP^4

i6 : dim Z, degree Z, degrees Z

o6 = (4, 151, {({1, 1}, 4), ({1, 2}, 3), ({2, 0}, 5), ({2, 1}, 13)})

o6 : Sequence

i7 : time Z' = projectiveVariety (map segre target Phi) image(segre Phi,"F4");
     -- used 3.45777 seconds

o7 : ProjectiveVariety, 4-dimensional subvariety of PP^7 x PP^4

i8 : assert(Z == Z')

i9 : 
