-- -*- M2-comint -*- hash: 2079563397

i1 : -- map defined by the quadrics through a rational normal quartic curve
     Phi = rationalMap PP_(ZZ/65521)^(1,4);

o1 : MultirationalMap (rational map from PP^4 to PP^5)

i2 : -- we see Phi as a dominant map
     Phi = rationalMap(Phi,image Phi);

o2 : MultirationalMap (dominant rational map from PP^4 to hypersurface in PP^5)

i3 : time inverse Phi;
     -- used 0.113468 seconds

o3 : MultirationalMap (birational map from hypersurface in PP^5 to PP^4)

i4 : Psi = last graph Phi;

o4 : MultirationalMap (birational map from 4-dimensional subvariety of PP^4 x PP^5 to hypersurface in PP^5)

i5 : time inverse Psi;
     -- used 0.185833 seconds

o5 : MultirationalMap (birational map from hypersurface in PP^5 to 4-dimensional subvariety of PP^4 x PP^5)

i6 : Eta = first graph Psi;

o6 : MultirationalMap (birational map from 4-dimensional subvariety of PP^4 x PP^5 x PP^5 to 4-dimensional subvariety of PP^4 x PP^5)

i7 : time inverse Eta;
     -- used 0.544018 seconds

o7 : MultirationalMap (birational map from 4-dimensional subvariety of PP^4 x PP^5 to 4-dimensional subvariety of PP^4 x PP^5 x PP^5)

i8 : assert(Phi * Phi^-1 == 1 and Phi^-1 * Phi == 1)

i9 : assert(Psi * Psi^-1 == 1 and Psi^-1 * Psi == 1)

i10 : assert(Eta * Eta^-1 == 1 and Eta^-1 * Eta == 1)

i11 : 
