-- -*- M2-comint -*- hash: 2110854152

i1 : f = rationalMap ideal PP_(ZZ/65521)^(1,4);

o1 : RationalMap (quadratic rational map from PP^4 to PP^5)

i2 : Phi = rationalMap {f}

o2 = Phi

o2 : MultirationalMap (rational map from PP^4 to PP^5)

i3 : isWellDefined Phi

o3 = true

i4 : Y = image Phi

o4 = Y

o4 : ProjectiveVariety, hypersurface in PP^5

i5 : Psi = rationalMap({f},Y)

o5 = Psi

o5 : MultirationalMap (rational map from PP^4 to Y)

i6 : isWellDefined Psi

o6 = true

i7 : p = point Y;

o7 : ProjectiveVariety, a point in PP^5

i8 : Eta = rationalMap({f},p);

o8 : MultirationalMap (rational map from PP^4 to p)

i9 : isWellDefined Eta

o9 = false

i10 : 
