-- -*- M2-comint -*- hash: -1261413294

i1 : K = ZZ/65521;

i2 : X = PP_K^{2,4,1,3};

o2 : ProjectiveVariety, PP^2 x PP^4 x PP^1 x PP^3

i3 : f = parametrize X;

o3 : MultirationalMap (rational map from PP^10 to X)

i4 : Y = random({{1,0,0,0},{0,1,0,0},{0,1,0,0},{0,0,0,1}},0_X);

o4 : ProjectiveVariety, 6-dimensional subvariety of PP^2 x PP^4 x PP^1 x PP^3

i5 : g = parametrize Y;

o5 : MultirationalMap (rational map from PP^6 to Y)

i6 : Z = random({{1,1,0,0},{0,1,0,0},{0,0,1,0},{0,0,0,1},{0,0,0,1}},0_X);

o6 : ProjectiveVariety, 5-dimensional subvariety of PP^2 x PP^4 x PP^1 x PP^3

i7 : h = parametrize Z;

o7 : MultirationalMap (rational map from PP^5 to Z)

i8 : describe h

o8 = multi-rational map consisting of 4 rational maps
     source variety: PP^5
     target variety: 5-dimensional subvariety of PP^2 x PP^4 x PP^1 x PP^3 cut out by 5 hypersurfaces of multi-degrees (0,0,0,1)^2 (0,0,1,0)^1 (0,1,0,0)^1 (1,1,0,0)^1 
     base locus: threefold in PP^5 cut out by 6 hypersurfaces of degrees 2^1 4^5 
     dominance: true
     multidegree: {1, 6, 15, 31, 50, 50}
     degree: 1
     degree sequence (map 1/4): [2]
     degree sequence (map 2/4): [2]
     degree sequence (map 3/4): [0]
     degree sequence (map 4/4): [2]
     coefficient ring: K

i9 : describe inverse h

o9 = multi-rational map consisting of one single rational map
     source variety: 5-dimensional subvariety of PP^2 x PP^4 x PP^1 x PP^3 cut out by 5 hypersurfaces of multi-degrees (0,0,0,1)^2 (0,0,1,0)^1 (0,1,0,0)^1 (1,1,0,0)^1 
     target variety: PP^5
     base locus: threefold in PP^2 x PP^4 x PP^1 x PP^3 cut out by 23 hypersurfaces of multi-degrees (0,0,0,1)^2 (0,0,1,0)^1 (0,1,0,0)^1 (0,1,0,2)^1 (0,2,0,1)^3 (1,0,0,2)^1 (1,1,0,0)^1 (1,1,0,1)^6 (1,2,0,0)^3 (2,0,0,1)^2 (2,1,0,0)^2 
     dominance: true
     multidegree: {50, 50, 31, 15, 6, 1}
     degree: 1
     degree sequence (map 1/1): [(1,1,0,1)]
     coefficient ring: K

i10 : A = matrix pack(5,for i to 24 list random(1,ring PP_K^8)), A = A - transpose A;

i11 : W = projectiveVariety pfaffians(4,A);

o11 : ProjectiveVariety, 5-dimensional subvariety of PP^8

i12 : parametrize W

o12 = multi-rational map consisting of one single rational map
      source variety: PP^5
      target variety: 5-dimensional subvariety of PP^8 cut out by 5 hypersurfaces of degree 2
      dominance: true
      degree: 1

o12 : MultirationalMap (birational map from PP^5 to W)

i13 : parametrize (W ** (point W))

o13 = multi-rational map consisting of 2 rational maps
      source variety: PP^5
      target variety: 5-dimensional subvariety of PP^8 x PP^8 cut out by 13 hypersurfaces of multi-degrees (0,1)^8 (2,0)^5 

o13 : MultirationalMap (rational map from PP^5 to 5-dimensional subvariety of PP^8 x PP^8)

i14 : 
