-- -*- M2-comint -*- hash: 561897376

i1 : K = ZZ/33331;

i2 : A = randomMultidimensionalMatrix({2,2,3},CoefficientRing=>K)

o2 = {{{-456, -6898, 3783}, {-6635, 8570, 16659}}, {{8444, -9579, 5071},
     ------------------------------------------------------------------------
     {-7531, -10808, 5864}}}

o2 : 3-dimensional matrix of shape 2 x 2 x 3 over K

i3 : det A

o3 = -12772

o3 : K

i4 : X = projectiveVariety A;

o4 : ProjectiveVariety, hypersurface in PP^1 x PP^1 x PP^2

i5 : dim singularLocus X

o5 = -1

i6 : B = multidimensionalMatrix {{{9492_K, 13628, -9292}, {9311, -5201, -16439}}, {{11828, -16301, 8162}, {15287, 8345, -2094}}}

o6 = {{{9492, 13628, -9292}, {9311, -5201, -16439}}, {{11828, -16301, 8162},
     ------------------------------------------------------------------------
     {15287, 8345, -2094}}}

o6 : 3-dimensional matrix of shape 2 x 2 x 3 over K

i7 : det B

o7 = 0

o7 : K

i8 : Y = projectiveVariety B;

o8 : ProjectiveVariety, hypersurface in PP^1 x PP^1 x PP^2

i9 : dim singularLocus Y

o9 = 0

i10 : 
