-- -*- M2-comint -*- hash: 1518244587

i1 : K = ZZ/333331;

i2 : R = K[x_0..x_2,y_0..y_3,z_0,z_1,Degrees=>{3:{1,0,0},4:{0,1,0},2:{0,0,1}}];

i3 : I = ideal(random({2,1,0},R),random({1,0,1},R))

                    2                         2                  
o3 = ideal (- 34043x y  + 74106x x y  + 52821x y  - 47435x x y  +
                    0 0         0 1 0         1 0         0 2 0  
     ------------------------------------------------------------------------
                          2           2                          2    
     123091x x y  - 66080x y  + 91969x y  - 54528x x y  + 106535x y  -
            1 2 0         2 0         0 1         0 1 1          1 1  
     ------------------------------------------------------------------------
                                         2           2                  
     35766x x y  + 120182x x y  + 159079x y  + 69319x y  - 62743x x y  +
           0 2 1          1 2 1          2 1         0 2         0 1 2  
     ------------------------------------------------------------------------
            2                                      2           2    
     136098x y  - 66116x x y  - 96699x x y  + 9398x y  + 92232x y  +
            1 2         0 2 2         1 2 2        2 2         0 3  
     ------------------------------------------------------------------------
                          2                                       2
     54291x x y  + 155574x y  + 45133x x y  - 77273x x y  - 25242x y ,
           0 1 3          1 3         0 2 3         1 2 3         2 3 
     ------------------------------------------------------------------------
     86018x z  - 125857x z  + 130921x z  - 106029x z  + 5398x z  - 35792x z )
           0 0          1 0          2 0          0 1        1 1         2 1

o3 : Ideal of R

i4 : X = projectiveVariety I

o4 = X

o4 : ProjectiveVariety, 4-dimensional subvariety of PP^2 x PP^3 x PP^1

i5 : ? X -- short description

o5 = 4-dimensional subvariety of PP^2 x PP^3 x PP^1 cut out by 2
     hypersurfaces of multi-degrees (1,0,1)^1 (2,1,0)^1

i6 : describe X -- long description

o6 = ambient:.............. PP^2 x PP^3 x PP^1
     dim:.................. 4
     codim:................ 2
     degree:............... 34
     multidegree:.......... 2*T_0^2+T_0*T_1+2*T_0*T_2+T_1*T_2
     generators:........... (1,0,1)^1 (2,1,0)^1 
     purity:............... true
     dim sing. l.:......... -1
     Segre embedding:...... map to PP^19 âŠ‚ PP^23

i7 : s = segreEmbedding X;

o7 : MultirationalMap (rational map from X to PP^19)

i8 : X' = image s

o8 = X'

o8 : ProjectiveVariety, 4-dimensional subvariety of PP^19

i9 : (dim X', codim X', degree X')

o9 = (4, 15, 34)

o9 : Sequence

i10 : ? X'

o10 = 4-dimensional subvariety of PP^19 cut out by 102 hypersurfaces of
      degree 2

i11 : 
