-- -*- M2-comint -*- hash: 1313393505

i1 : X = PP_(ZZ/65521)^(1,3); -- twisted cubic curve

o1 : ProjectiveVariety, curve in PP^3

i2 : random({2},X);

o2 : ProjectiveVariety, surface in PP^3

i3 : ideal oo

            2                         2
o3 = ideal(t  - t t  - 68t t  - 20741t  + 68t t  + 20741t t )
            1    0 2      1 2         2      0 3         1 3

                ZZ
o3 : Ideal of -----[t ..t ]
              65521  0   3

i4 : random({{2},{2}},X);

o4 : ProjectiveVariety, curve in PP^3

i5 : ideal oo

                         2                      2                2
o5 = ideal (t t  + 21021t  - t t  - 21021t t , t  - t t  + 29086t  -
             1 2         2    0 3         1 3   1    0 2         2  
     ------------------------------------------------------------------------
     29086t t )
           1 3

                ZZ
o5 : Ideal of -----[t ..t ]
              65521  0   3

i6 : X = X^2;

o6 : ProjectiveVariety, X x X

i7 : random({1,2},X);

o7 : ProjectiveVariety, hypersurface in PP^3 x PP^3

i8 : ideal oo

                2             2             2            2              
o8 = ideal(x0 x1  + 29294x0 x1  + 16820x0 x1  + 1316x0 x1  - x0 x1 x1  -
             0  1          1  1          2  1         3  1     0  0  2  
     ------------------------------------------------------------------------
                                                                      
     29294x0 x1 x1  - 16820x0 x1 x1  - 1316x0 x1 x1  - 3472x0 x1 x1  -
            1  0  2          2  0  2         3  0  2         0  1  2  
     ------------------------------------------------------------------------
                                                                 2  
     29829x0 x1 x1  + 2976x0 x1 x1  - 23867x0 x1 x1  - 32075x0 x1  +
            1  1  2         2  1  2          3  1  2          0  2  
     ------------------------------------------------------------------------
               2            2             2
     17896x0 x1  - 7591x0 x1  - 19385x0 x1  + 3472x0 x1 x1  + 29829x0 x1 x1 
            1  2         2  2          3  2         0  0  3          1  0  3
     ------------------------------------------------------------------------
     - 2976x0 x1 x1  + 23867x0 x1 x1  + 32075x0 x1 x1  - 17896x0 x1 x1  +
             2  0  3          3  0  3          0  1  3          1  1  3  
     ------------------------------------------------------------------------
     7591x0 x1 x1  + 19385x0 x1 x1 )
           2  1  3          3  1  3

                ZZ
o8 : Ideal of -----[x0 ..x0 , x1 ..x1 ]
              65521   0    3    0    3

i9 : random({{1,2},{1,2},{2,0}},X);

o9 : ProjectiveVariety, threefold in PP^3 x PP^3

i10 : degrees oo

o10 = {({1, 2}, 2), ({2, 0}, 1)}

o10 : List

i11 : 
