-- -*- M2-comint -*- hash: 1920808999

i1 : X = PP_QQ^(1,3);

o1 : ProjectiveVariety, curve in PP^3

i2 : a = 4, b = 2;

i3 : phi = rationalMap X;

o3 : MultirationalMap (rational map from PP^3 to PP^2)

i4 : assert(phi <==> multirationalMap {rationalMap ideal X})

i5 : phi = rationalMap(X,a);

o5 : MultirationalMap (rational map from PP^3 to PP^21)

i6 : assert(phi <==> multirationalMap {rationalMap(ideal X,a)})

i7 : phi = rationalMap(X,a,b);

o7 : MultirationalMap (rational map from PP^3 to PP^5)

i8 : assert(phi <==> multirationalMap {rationalMap(ideal X,a,b)})

i9 : Y = random(3,X);

o9 : ProjectiveVariety, surface in PP^3

i10 : rationalMap(X_Y,a);

o10 : MultirationalMap (rational map from Y to PP^17)

i11 : rationalMap X_Y;

o11 : MultirationalMap (rational map from Y to PP^2)

i12 : 
