-- -*- M2-comint -*- hash: -490058817

i1 : K = ZZ/33331; C = PP_K^(1,4); -- rational normal quartic curve

o2 : ProjectiveVariety, curve in PP^4

i3 : Phi = rationalMap C; -- map defined by the quadrics through C

o3 : MultirationalMap (rational map from PP^4 to PP^5)

i4 : Q = random(2,C); -- random quadric hypersurface through C

o4 : ProjectiveVariety, hypersurface in PP^4

i5 : Phi = Phi|Q;

o5 : MultirationalMap (rational map from Q to PP^5)

i6 : image Phi

o6 = threefold in PP^5 cut out by 2 hypersurfaces of degrees 1^1 2^1 

o6 : ProjectiveVariety, threefold in PP^5

i7 : Psi = trim Phi;

o7 : MultirationalMap (rational map from Q to PP^4)

i8 : image Psi

o8 = hypersurface in PP^4 defined by a form of degree 2

o8 : ProjectiveVariety, hypersurface in PP^4

i9 : Phi || Phi || Psi;

o9 : MultirationalMap (rational map from Q x Q x Q to PP^5 x PP^5 x PP^4)

i10 : image oo

o10 = 9-dimensional subvariety of PP^5 x PP^5 x PP^4 cut out by 5 hypersurfaces of multi-degrees (0,0,2)^1 (0,1,0)^1 (0,2,0)^1 (1,0,0)^1 (2,0,0)^1 

o10 : ProjectiveVariety, 9-dimensional subvariety of PP^5 x PP^5 x PP^4

i11 : trim (Phi || Phi || Psi);

o11 : MultirationalMap (rational map from Q x Q x Q to PP^4 x PP^4 x PP^4)

i12 : image oo

o12 = 9-dimensional subvariety of PP^4 x PP^4 x PP^4 cut out by 3 hypersurfaces of multi-degrees (0,0,2)^1 (0,2,0)^1 (2,0,0)^1 

o12 : ProjectiveVariety, 9-dimensional subvariety of PP^4 x PP^4 x PP^4

i13 : 
