-- -*- M2-comint -*- hash: 1367648280

i1 : R = QQ[x,z];

i2 : f = x^4+x^2+z^6-3*x^2*z^2;

i3 : (bound,sol) = lowerBound (f,RoundTol=>4);

i4 : bound

        3
o4 = - --
       16

o4 : QQ

i5 : (bound,sol) = lowerBound (f,RoundTol=>12);

i6 : bound

        729
o6 = - ----
       4096

o6 : QQ

i7 : (bound,sol) = lowerBound (f,RoundTol=>infinity);

i8 : bound

o8 = -.177978516465986

o8 : RR (of precision 53)

i9 : 
