-- -*- M2-comint -*- hash: 73241422

i1 : R = QQ[x,y];

i2 : f = 2*x^4 + 2*x^3*y - 2*x^2*y^2 + 5*y^4;

i3 : sol = solveSOS f;

i4 : s = sosPoly sol

            83 2    2 2    43  20 2       2    231773   2 2
o4 = (5)(- ---x  + y )  + (--)(--x  + x*y)  + (------)(x )
           200             20  43              344000

o4 : SOSPoly

i5 : value(s)

       4     3      2 2     4
o5 = 2x  + 2x y - 2x y  + 5y

o5 : R

i6 : R = QQ[x,y];

i7 : S = R/ideal(x^2 + y^2 - 1);

i8 : f = 10-x^2-y;

i9 : sol = solveSOS (f, 2);

i10 : sosPoly sol

       79       4 2    71    2     63    2
o10 = (--)(y - --)  + (--)(x)  + (---)(1)
        8      79       8         632

o10 : SOSPoly

i11 : 
