-- -*- M2-comint -*- hash: -406247502

i1 : R = QQ[x,y];

i2 : f = 2*x^4+5*y^4-2*x^2*y^2+2*x^3*y;

i3 : sol = solveSOS f;

i4 : sosPoly sol

            83 2    2 2    43  20 2       2    231773   2 2
o4 = (5)(- ---x  + y )  + (--)(--x  + x*y)  + (------)(x )
           200             20  43              344000

o4 : SOSPoly

i5 : R = QQ[x,y];

i6 : s = sosPoly(R, {x+1,y}, {2,3} )

              2        2
o6 = 2*(x + 1)  + 3*(y)

o6 : SOSPoly

i7 : peek s

o7 = SOSPoly{coefficients => {2, 3}  }
             generators => {x + 1, y}
             ring => R

i8 : gens s

o8 = {x + 1, y}

o8 : List

i9 : ring s

o9 = R

o9 : PolynomialRing

i10 : coefficients s

o10 = {2, 3}

o10 : List

i11 : length s

o11 = 2

i12 : 2 * s

               2        2
o12 = 4*(x + 1)  + 6*(y)

o12 : SOSPoly

i13 : s + s

               2        2            2        2
o13 = 2*(x + 1)  + 3*(y)  + 2*(x + 1)  + 3*(y)

o13 : SOSPoly

i14 : s * s

          2          2              2              2       2 2
o14 = 4*(x  + 2x + 1)  + 6*(x*y + y)  + 6*(x*y + y)  + 9*(y )

o14 : SOSPoly

i15 : s == s

o15 = true

i16 : value s

        2     2
o16 = 2x  + 3y  + 4x + 2

o16 : R

i17 : expression s

               2        2
o17 = 2*(x + 1)  + 3*(y)

o17 : Expression of class Sum

i18 : S = QQ[x,y,z];

i19 : sub (s, S)

               2        2
o19 = 2*(x + 1)  + 3*(y)

o19 : SOSPoly

i20 : 
