-- -*- M2-comint -*- hash: 706664022

i1 : R=QQ[x];

i2 : f = (x-1)^2 + (x+3)^2;

i3 : (bound,sol) = lowerBound(f);

i4 : (bound, recoverSolution sol)

o4 = (8, {x => -.999805})

o4 : Sequence

i5 : f - bound == sosPoly sol

o5 = true

i6 : R = QQ[x,y]/ideal(x^2 - x, y^2 - y);

i7 : f = x - y;

i8 : (bound,sol) = lowerBound(f,2);

i9 : bound

o9 = -1

o9 : QQ

i10 : f - bound == sosPoly sol

o10 = true

i11 : R = QQ[x,y];

i12 : f = x - y;

i13 : h = matrix{{x^2 - x, y^2 - y}};

              1       2
o13 : Matrix R  <--- R

i14 : (bound,sol,mult) = lowerBound (f, h, 2);

i15 : bound

o15 = -1

o15 : QQ

i16 : f - bound + h*mult == sosPoly sol

o16 = true

i17 : R = QQ[x];

i18 : f = (x^2-x)/(x^2+1);

i19 : (bound,sol) = lowerBound (f);

i20 : (bound, recoverSolution sol)

         1
o20 = (- -, {x => .382683})
         4

o20 : Sequence

i21 : 
