-- -*- M2-comint -*- hash: -1076817507

i1 : R = QQ[x,y]/ideal(x^2 + y^2 - 1);

i2 : f = 10-x^2-y;

i3 : mon = matrix {{1}, {x}, {y}};

             3       1
o3 : Matrix R  <--- R

i4 : solveSOS (f, mon)

o4 = MomentMatrix   3x3 matrix over RR_53           
     GramMatrix     3x3 matrix over QQ              
     Monomials      3x1 matrix over R               
     Status         SDP solved, primal-dual feasible

o4 : SDPResult

i5 : solveSOS (f, 2)

o5 = MomentMatrix   3x3 matrix over RR_53           
     GramMatrix     3x3 matrix over QQ              
     Monomials      3x1 matrix over R               
     Status         SDP solved, primal-dual feasible

o5 : SDPResult

i6 : S = R[t];

i7 : solveSOS(f-t,-t,mon,RoundTol=>12)

o7 = MomentMatrix   3x3 matrix over RR_53           
     GramMatrix     3x3 matrix over QQ              
     Monomials      3x1 matrix over R               
     Parameters     1x1 matrix over QQ              
     Status         SDP solved, primal-dual feasible

o7 : SDPResult

i8 : R = QQ[x,y]/ideal(x^2 + y^2 - 1);

i9 : f = 10-x^2-y;

i10 : mon = matrix {{1}, {x}, {y}};

              3       1
o10 : Matrix R  <--- R

i11 : s = solveSOS (f, mon, RoundTol=>infinity);

i12 : ring sosPoly s

o12 = RR  [x..y]
        53

o12 : PolynomialRing

i13 : R' = ring sosPoly s;

i14 : S = R'/(sub (ideal (x^2 + y^2 - 1), R'))
-- warning: experimental computation over inexact field begun
--          results not reliable (one warning given per session)

o14 = S

o14 : QuotientRing

i15 : sub (f, S) == sub (sosPoly s, S)

o15 = false

i16 : 
