-- -*- M2-comint -*- hash: 1574575600

i1 : E = tangentBundle projectiveSpaceFan 2

o1 = {dimension of the variety => 2 }
      number of affine charts => 3
      number of rays => 3
      rank of the vector bundle => 2

o1 : ToricVectorBundleKlyachko

i2 : isNef E

o2 = true

i3 : isAmple E

o3 = true

i4 : isVeryAmple E

o4 = true

i5 : isGloballyGenerated E

o5 = true

i6 : separatesJets E

o6 = 1

i7 : toricChernCharacter E

o7 = HashTable{| -1 0 | => {| 1 |, | 1  |}}
               | -1 1 |     | 0 |  | -1 |
               | 1 -1 | => {| -1 |, | 0 |}
               | 0 -1 |     | 1  |  | 1 |
               | 1 0 | => {| -1 |, | 0  |}
               | 0 1 |     | 0  |  | -1 |

o7 : HashTable

i8 : restrictToInvCurves E

o8 = HashTable{| -1 | => {2, 1}}
               | -1 |
               | 0 | => {2, 1}
               | 1 |
               | 1 | => {1, 2}
               | 0 |

o8 : HashTable

i9 : 
