-- -*- M2-comint -*- hash: -1469701281

i1 : R=ZZ/2[x1,x2,x3,x4,x5]; 

i2 : I = ideal(x1*x2,x3*x4,x5);

o2 : Ideal of R

i3 : isSquarefreePseudomonomialIdeal(I) 

o3 = true

i4 : R=ZZ/2[x1,x2];

i5 : I = ideal(x1*(x2-1),(x1-1)*(x2-1),x1*x2,(x1-1)*x2);

o5 : Ideal of R

i6 : isSquarefreePseudomonomialIdeal(I) 

o6 = true

i7 : R=ZZ/3[x1,x2];

i8 : I = ideal(x1,x2-1);

o8 : Ideal of R

i9 : isSquarefreePseudomonomialIdeal(I) 

o9 = true

i10 : R=QQ[x1,x2,x3,x4,x5];

i11 : I = ideal(x1*(x1-1),(x3-1)*x4,x5);

o11 : Ideal of R

i12 : not isSquarefreePseudomonomialIdeal(I)

o12 = true

i13 : R=QQ[x1,x2,x3,x4,x5];

i14 : I = ideal(x1*(x5-1),(x3-1)*x4^2,x5);

o14 : Ideal of R

i15 : isSquarefreePseudomonomialIdeal(I) 

o15 = false

i16 : 
