-- -*- M2-comint -*- hash: -1871035670

i1 : S = QQ[x,y,z,t];

i2 : p = point {1,1,1,2};

i3 : q = point {1,-1,-1,-1};

i4 : idealOfProjectivePoints({p*q},S)

o4 = ideal (2z - t, 2y - t, 2x + t)

o4 : Ideal of S

i5 : IP = ideal(x-y,x-z,2*x-t)

o5 = ideal (x - y, x - z, 2x - t)

o5 : Ideal of S

i6 : IQ = ideal(x+y,x+z,x+t)

o6 = ideal (x + y, x + z, x + t)

o6 : Ideal of S

i7 : hadamardProduct(IP,IQ)

o7 = ideal (2z - t, 2y - t, 2x + t)

o7 : Ideal of S

i8 : I = ideal(random(1,S),random(1,S));

o8 : Ideal of S

i9 : J = ideal(random(1,S),random(1,S));

o9 : Ideal of S

i10 : hadamardProduct(I,J)

                     2                                             
o10 = ideal(97048224x  - 42121625x*y + 287249760x*z - 14791875y*z +
      -----------------------------------------------------------------------
               2
      88905600z  + 4761000x*t + 12420000z*t)

o10 : Ideal of S

i11 : 
