-- -*- M2-comint -*- hash: 810516374

i1 : S=QQ[x,y,z,w]

o1 = S

o1 : PolynomialRing

i2 : I=ideal(random(1,S),random(1,S),random(1,S))

            9    1    9    1       3    3    3   7    7     7    1
o2 = ideal (-x + -y + -z + -w, x + -y + -z + -w, -x + -y + --z + -w)
            2    2    4    2       4    2    4   4    9    10    2

o2 : Ideal of S

i3 : hadamardPower(I,3)

o3 = ideal (731189187729z + 12167000000w, 1003003001y + 217081801w,
     ------------------------------------------------------------------------
     27081081027x - 15625000w)

o3 : Ideal of S

i4 : 
