-- -*- M2-comint -*- hash: 55973272

i1 : A=QQ[t]/ideal(t^3)

o1 = A

o1 : QuotientRing

i2 : X=abstractVariety(2,A)

o2 = X

o2 : an abstract variety of dimension 2

i3 : OO_X

o3 = a sheaf

o3 : an abstract sheaf of rank 1 on X

i4 : chern OO_X

o4 = 1

o4 : A

i5 : X.TangentBundle  = abstractSheaf(X,Rank=>2, ChernClass=>(1+t)^3)

o5 = a sheaf

o5 : an abstract sheaf of rank 2 on X

i6 : todd X

         3     2
o6 = 1 + -t + t
         2

o6 : A

i7 : integral A := f -> coefficient(t^2,f);

i8 : chi OO_X(2*t)

o8 = 6

o8 : QQ

i9 : 
