-- -*- M2-comint -*- hash: -475593847

i1 : X = abstractProjectiveSpace' 4

o1 = X

o1 : a flag bundle with subquotient ranks {4, 1}

i2 : OO_X(3)

o2 = a sheaf

o2 : an abstract sheaf of rank 1 on X

i3 : chi oo

o3 = 35

i4 : pt = base n

o4 = pt

o4 : an abstract variety of dimension 0

i5 : Y = abstractProjectiveSpace'(4,pt)

o5 = Y

o5 : a flag bundle with subquotient ranks {4, 1}

i6 : OO_Y(n)

o6 = a sheaf

o6 : an abstract sheaf of rank 1 on Y

i7 : chi oo

      1 4    5 3   35 2   25
o7 = --n  + --n  + --n  + --n + 1
     24     12     24     12

o7 : QQ[n]

i8 : A = intersectionRing Y

o8 = A

o8 : QuotientRing

i9 : chern OO_Y(1)

o9 = 1 + h

o9 : A

i10 : OO(h)

o10 = a sheaf

o10 : an abstract sheaf of rank 1 on Y

i11 : chern oo

o11 = 1 + h

o11 : A

i12 : 
