-- -*- M2-comint -*- hash: 419577643

i1 : X = abstractProjectiveSpace 1

o1 = X

o1 : a flag bundle with subquotient ranks {2:1}

i2 : OO_X(1) + OO_X(2)

o2 = a sheaf

o2 : an abstract sheaf of rank 2 on X

i3 : chi oo

o3 = 5

i4 : 1 + OO_X(1)

o4 = a sheaf

o4 : an abstract sheaf of rank 2 on X

i5 : chi oo

o5 = 3

i6 : ch OO_X(1)

o6 = 1 + H
          2,1

         QQ[][h, H   ]
                  2,1
o6 : ---------------------
     (- h - H   , -h*H   )
             2,1      2,1

i7 : Y = abstractProjectiveSpace'(3,X,VariableName=>k)

o7 = Y

o7 : a flag bundle with subquotient ranks {3, 1}

i8 : ch OO_Y(2)

                2   4 3
o8 = 1 + 2k + 2k  + -k
                    3

                 QQ[][h, H   ]
                          2,1
             ---------------------[H   ..H   , k]
             (- h - H   , -h*H   )  1,1   1,3
                     2,1      2,1
o8 : ----------------------------------------------------
     (- H    - k, - H    - H   k, - H    - H   k, -H   k)
         1,1         1,2    1,1      1,3    1,2     1,3

i9 : OO_Y(2) ++ OO_X(1)

o9 = a sheaf

o9 : an abstract sheaf of rank 2 on Y

i10 : ch oo

                          2   4 3
o10 = 2 + (2k + H   ) + 2k  + -k
                 2,1          3

                  QQ[][h, H   ]
                           2,1
              ---------------------[H   ..H   , k]
              (- h - H   , -h*H   )  1,1   1,3
                      2,1      2,1
o10 : ----------------------------------------------------
      (- H    - k, - H    - H   k, - H    - H   k, -H   k)
          1,1         1,2    1,1      1,3    1,2     1,3

i11 : chi ooo

o11 = 12

i12 : 
