-- -*- M2-comint -*- hash: -1935360654

i1 : Gc = flagBundle({2,3}, VariableNames => {,c})

o1 = Gc

o1 : a flag bundle with subquotient ranks {2..3}

i2 : (Sc,Qc) = bundles Gc

o2 = (Sc, Qc)

o2 : Sequence

i3 : B = symmetricPower(2,Qc)

o3 = B

o3 : an abstract sheaf of rank 6 on Gc

i4 : X = projectiveBundle'(dual B, VariableNames => {,{z}})

o4 = X

o4 : a flag bundle with subquotient ranks {5, 1}

i5 : A = symmetricPower_5 Qc - symmetricPower_3 Qc ** OO(-z)

o5 = A

o5 : an abstract sheaf of rank 11 on X

i6 : c11 = chern(rank A, A)

            2 5
o6 = 609250c z
            3

                                                         QQ[][H   ..H   , c ..c ]
                                                               1,1   1,2   1   3
                         ---------------------------------------------------------------------------------------[H   ..H   , z]
                         (- H    - c , - H    - H   c  - c , - H   c  - H   c  - c , - H   c  - H   c , -H   c )  1,1   1,5
                             1,1    1     1,2    1,1 1    2     1,2 1    1,1 2    3     1,2 2    1,1 3    1,2 3
o6 : ----------------------------------------------------------------------------------------------------------------------------------------------
                                           2                                                           2
     (- H    - z - 4c , - H    - H   z + 5c  + 5c , - H    - H   z - 15c c  - 5c , - H    - H   z + 10c  + 20c c , - H    - H   z - 20c c , -H   z)
         1,1         1     1,2    1,1      1     2     1,3    1,2       1 2     3     1,4    1,3       2      1 3     1,5    1,4       2 3    1,5

i7 : X.StructureMap_* c11

            2
o7 = 609250c
            3

                                     QQ[][H   ..H   , c ..c ]
                                           1,1   1,2   1   3
o7 : ---------------------------------------------------------------------------------------
     (- H    - c , - H    - H   c  - c , - H   c  - H   c  - c , - H   c  - H   c , -H   c )
         1,1    1     1,2    1,1 1    2     1,2 1    1,1 2    3     1,2 2    1,1 3    1,2 3

i8 : integral oo

o8 = 609250

i9 : 
