-- -*- M2-comint -*- hash: -1530312995

i1 : pt = base(n)

o1 = pt

o1 : an abstract variety of dimension 0

i2 : X = abstractProjectiveSpace'_4 pt

o2 = X

o2 : a flag bundle with subquotient ranks {4, 1}

i3 : chern_1 OO_X(1)

o3 = h

                             QQ[n][H   ..H   , h]
                                    1,1   1,4
o3 : --------------------------------------------------------------------
     (- H    - h, - H    - H   h, - H    - H   h, - H    - H   h, -H   h)
         1,1         1,2    1,1      1,3    1,2      1,4    1,3     1,4

i4 : F = abstractSheaf(X, Rank => 2, ChernClass => 1 + 5*h + 10*h^2)

o4 = F

o4 : an abstract sheaf of rank 2 on X

i5 : F' = 2 * (exteriorPower_2 cotangentBundle X)(2) - 5 * OO_X(-1) - 5 * OO_X

o5 = F'

o5 : an abstract sheaf of rank 2 on X

i6 : chern F'

               2
o6 = 1 - h + 4h

                             QQ[n][H   ..H   , h]
                                    1,1   1,4
o6 : --------------------------------------------------------------------
     (- H    - h, - H    - H   h, - H    - H   h, - H    - H   h, -H   h)
         1,1         1,2    1,1      1,3    1,2      1,4    1,3     1,4

i7 : rank F'

o7 = 2

i8 : F === dual F'(-2)

o8 = true

i9 : chi F(n*h)

      1 4   5 3   125 2   125
o9 = --n  + -n  + ---n  + ---n + 2
     12     3      12      6

o9 : QQ[n]

i10 : 
