-- -*- M2-comint -*- hash: 167300698

i1 : P = abstractProjectiveSpace' 3

o1 = P

o1 : a flag bundle with subquotient ranks {3, 1}

i2 : tangentBundle P

o2 = a sheaf

o2 : an abstract sheaf of rank 3 on P

i3 : chern tangentBundle P

                2     3
o3 = 1 + 4h + 6h  + 4h

                      QQ[][H   ..H   , h]
                            1,1   1,3
o3 : ----------------------------------------------------
     (- H    - h, - H    - H   h, - H    - H   h, -H   h)
         1,1         1,2    1,1      1,3    1,2     1,3

i4 : todd P

              11 2    3
o4 = 1 + 2h + --h  + h
               6

                      QQ[][H   ..H   , h]
                            1,1   1,3
o4 : ----------------------------------------------------
     (- H    - h, - H    - H   h, - H    - H   h, -H   h)
         1,1         1,2    1,1      1,3    1,2     1,3

i5 : chi OO_P(3)

o5 = 20

i6 : pt = base n

o6 = pt

o6 : an abstract variety of dimension 0

i7 : Q = abstractProjectiveSpace'_4 pt

o7 = Q

o7 : a flag bundle with subquotient ranks {4, 1}

i8 : chi OO_Q(n)

      1 4    5 3   35 2   25
o8 = --n  + --n  + --n  + --n + 1
     24     12     24     12

o8 : QQ[n]

i9 : S = abstractProjectiveSpace'(4, VariableName => h)

o9 = S

o9 : a flag bundle with subquotient ranks {4, 1}

i10 : P = abstractProjectiveSpace'(3, S, VariableName => H)
warning: clearing value of symbol H to allow access to subscripted variables based on it
       : debug with expression   debug 204   or with command line option   --debug 204

o10 = P

o10 : a flag bundle with subquotient ranks {3, 1}

i11 : dim P

o11 = 7

i12 : todd P

                5      11 2          35 2      3   55   2   35 2    25 3   
o12 = 1 + (2H + -h) + (--H  + 5h*H + --h ) + (H  + --h*H  + --h H + --h ) +
                2       6            12            12        6      12     
      -----------------------------------------------------------------------
       5   3   385 2 2   25 3     4     35 2 3   275 3 2     4      25 3 3  
      (-h*H  + ---h H  + --h H + h ) + (--h H  + ---h H  + 2h H) + (--h H  +
       2        72        6             12        72                12      
      -----------------------------------------------------------------------
      11 4 2     4 3
      --h H ) + h H
       6

                               QQ[][H   ..H   , h]
                                     1,1   1,4
      --------------------------------------------------------------------[H   ..H   , H]
      (- H    - h, - H    - H   h, - H    - H   h, - H    - H   h, -H   h)  1,1   1,3
          1,1         1,2    1,1      1,3    1,2      1,4    1,3     1,4
o12 : -----------------------------------------------------------------------------------
                      (- H    - H, - H    - H   H, - H    - H   H, -H   H)
                          1,1         1,2    1,1      1,3    1,2     1,3

i13 : 
