-- -*- M2-comint -*- hash: -68660015

i1 : X = abstractVariety(3, QQ[c,d,e,Degrees=>{1,2,3}])

o1 = X

o1 : an abstract variety of dimension 3

i2 : F = abstractSheaf(X, ChernCharacter => 1 + c + d + e)

o2 = F

o2 : an abstract sheaf of rank 1 on X

i3 : adams_3 F

o3 = a sheaf

o3 : an abstract sheaf of rank 1 on X

i4 : ch oo

o4 = 1 + 3c + 9d + 27e

o4 : QQ[c..e]

i5 : 
