-- -*- M2-comint -*- hash: 1810624003

i1 : X = base(5, Bundle => (L,1,{l}), Bundle => (M,1,{m}), Bundle => (N,1,{n}))

o1 = X

o1 : an abstract variety of dimension 5

i2 : degeneracyLocus2(0,L+M+N,OO_X)

o2 = l*m*n

o2 : QQ[l..n]

i3 : degeneracyLocus2(1,L+M+N,2*OO_X)

o3 = l*m + l*n + m*n

o3 : QQ[l..n]

i4 : degeneracyLocus2(2,L+M+N,3*OO_X)

o4 = l + m + n

o4 : QQ[l..n]

i5 : X = base(5, Bundle => (A,3,a), Bundle => (B,3,b))

o5 = X

o5 : an abstract variety of dimension 5

i6 : degeneracyLocus2(0,B,OO_X)

o6 = b
      3

o6 : QQ[a ..b ]
         1   3

i7 : degeneracyLocus2(1,B,2*OO_X)

o7 = b
      2

o7 : QQ[a ..b ]
         1   3

i8 : degeneracyLocus2(2,B,3*OO_X)

o8 = b
      1

o8 : QQ[a ..b ]
         1   3

i9 : degeneracyLocus2(1,B,A)

      2                             2    2                       2
o9 = a  - a a  - a a b  + a b  + a b  + a b  - 2a b  - a b b  + b  + a b  -
      2    1 3    1 2 1    3 1    2 1    1 2     2 2    1 1 2    2    1 3  
     ------------------------------------------------------------------------
     b b
      1 3

o9 : QQ[a ..b ]
         1   3

i10 : degeneracyLocus2(2,B,A)

o10 = - a  + b
         1    1

o10 : QQ[a ..b ]
          1   3

i11 : degeneracyLocus2(3,B,A)

o11 = 1

o11 : QQ[a ..b ]
          1   3

i12 : 
