-- -*- M2-comint -*- hash: 1901676136

i1 : G = flagBundle {2,2}

o1 = G

o1 : a flag bundle with subquotient ranks {2:2}

i2 : dim G

o2 = 4

i3 : A = intersectionRing G

o3 = A

o3 : QuotientRing

i4 : f = (chern_1 OO_G(1))^4

       2
o4 = 2H
       2,2

o4 : A

i5 : integral f

o5 = 2

i6 : pt = base n

o6 = pt

o6 : an abstract variety of dimension 0

i7 : F = flagBundle_{2,2} pt

o7 = F

o7 : a flag bundle with subquotient ranks {2:2}

i8 : integral (chern_1 OO_F(n))^4

       4
o8 = 2n

o8 : QQ[n]

i9 : 
