-- -*- M2-comint -*- hash: 1787912217

i1 : X = base(5, Bundle => (A,3,a), Bundle => (B,3,b))

o1 = X

o1 : an abstract variety of dimension 5

i2 : E = kernelBundle(2,B,A)

o2 = E

o2 : an abstract sheaf of rank 1 on a variety

i3 : Z = variety E

o3 = Z

o3 : an abstract variety of dimension 4

i4 : i = Z/X

o4 = i

o4 : a map to X from Z

i5 : i_* 1

o5 = - a  + b
        1    1

o5 : QQ[a ..b ]
         1   3

i6 : i_* chern_1 E

        2
o6 = - a  + a  + a b  - b
        1    2    1 1    2

o6 : QQ[a ..b ]
         1   3

i7 : i_* (chern_1 E)^2

        3                 2
o7 = - a  + 2a a  - a  + a b  - a b  - a b  + b
        1     1 2    3    1 1    2 1    1 2    3

o7 : QQ[a ..b ]
         1   3

i8 : i_* (chern_1 E)^3

        4     2      2            3                       2
o8 = - a  + 3a a  - a  - 2a a  + a b  - 2a a b  + a b  - a b  + a b  + a b
        1     1 2    2     1 3    1 1     1 2 1    3 1    1 2    2 2    1 3

o8 : QQ[a ..b ]
         1   3

i9 : i_* E

o9 = a sheaf

o9 : an abstract sheaf of rank 0 on X

i10 : integral (chern_1 E)^4

                  5     3         2     2              4       2        2                3                       2
o10 = integral(- a  + 4a a  - 3a a  - 3a a  + 2a a  + a b  - 3a a b  + a b  + 2a a b  - a b  + 2a a b  - a b  + a b  - a b )
                  1     1 2     1 2     1 3     2 3    1 1     1 2 1    2 1     1 3 1    1 2     1 2 2    3 2    1 3    2 3

o10 : Expression of class Adjacent

i11 : integral ch E

                  1 5   1 3     1   2   1 2      1        1 4     1 2        1 2      1          1 3      1          1        1 2      1
o11 = integral(- --a  + -a a  - -a a  - -a a  + --a a  + --a b  - -a a b  + --a b  + --a a b  - --a b  + --a a b  - --a b  + --a b  - --a b )
                 24 1   6 1 2   8 1 2   8 1 3   12 2 3   24 1 1   8 1 2 1   24 2 1   12 1 3 1   24 1 2   12 1 2 2   24 3 2   24 1 3   24 2 3

o11 : Expression of class Adjacent

i12 : F = kernelBundle(1,B,A)

o12 = F

o12 : an abstract sheaf of rank 2 on a variety

i13 : W = variety F

o13 = W

o13 : an abstract variety of dimension 1

i14 : j = W/X

o14 = j

o14 : a map to X from W

i15 : j_* chern_1 F

         2    2             2                      2      2    3            
o15 = a a  - a a  - a a  - a a b  + 2a a b  + a a b  - a b  + a b  - 2a a b 
       1 2    1 3    2 3    1 2 1     1 3 1    1 2 1    3 1    1 2     1 2 2
      -----------------------------------------------------------------------
                2          2
      + a b  - a b b  + a b  + a b  - b b
         3 2    1 1 2    1 2    2 3    2 3

o15 : QQ[a ..b ]
          1   3

i16 : 
