-- -*- M2-comint -*- hash: 250368938

i1 : X = flagBundle({2,2}) --the Grassmannian GG(1,3)

o1 = X

o1 : a flag bundle with subquotient ranks {2:2}

i2 : (S,Q) = bundles X

o2 = (S, Q)

o2 : Sequence

i3 : L = exteriorPower(2,dual S)

o3 = L

o3 : an abstract sheaf of rank 1 on X

i4 : P = flagBundle({5,1}) --Grothendieck-style PP^5

o4 = P

o4 : a flag bundle with subquotient ranks {5, 1}

i5 : f = map(P,X,L) -- Pl√ºcker embedding of GG(1,3) in PP^5

o5 = f

o5 : a map to P from X

i6 : H = last bundles P

o6 = H

o6 : an abstract sheaf of rank 1 on P

i7 : f^* (chern(1,H)) -- hyperplane section, should be sigma_1

o7 = H
      2,1

                                   QQ[][H   ..H   ]
                                         1,1   2,2
o7 : ---------------------------------------------------------------------------
     (- H    - H   , - H    - H   H    - H   , - H   H    - H   H   , -H   H   )
         1,1    2,1     1,2    1,1 2,1    2,2     1,2 2,1    1,1 2,2    1,2 2,2

i8 : f_* chern(0,S) --expect 2 times hyperplane class since GG(1,3) has degree 2

o8 = 2H
       2,1

                                             QQ[][H   ..H   , H   ]
                                                   1,1   1,5   2,1
o8 : ------------------------------------------------------------------------------------------------------
     (- H    - H   , - H    - H   H   , - H    - H   H   , - H    - H   H   , - H    - H   H   , -H   H   )
         1,1    2,1     1,2    1,1 2,1     1,3    1,2 2,1     1,4    1,3 2,1     1,5    1,4 2,1    1,5 2,1

i9 : 
