-- -*- M2-comint -*- hash: -1092215366

i1 : X = abstractProjectiveSpace 4

o1 = X

o1 : a flag bundle with subquotient ranks {1, 4}

i2 : f = X.StructureMap

o2 = f

o2 : a map to point from X

i3 : sectionClass f

o3 = H
      2,4

                                QQ[][h, H   ..H   ]
                                         2,1   2,4
o3 : ------------------------------------------------------------------------
     (- h - H   , - h*H    - H   , - h*H    - H   , - h*H    - H   , -h*H   )
             2,1       2,1    2,2       2,2    2,3       2,3    2,4      2,4

i4 : integral oo

o4 = 1

i5 : G = flagBundle {2,2}

o5 = G

o5 : a flag bundle with subquotient ranks {2:2}

i6 : G.StructureMap

o6 = a variety map

o6 : a map to point from G

i7 : sectionClass oo

      2
o7 = H
      2,2

                                   QQ[][H   ..H   ]
                                         1,1   2,2
o7 : ---------------------------------------------------------------------------
     (- H    - H   , - H    - H   H    - H   , - H   H    - H   H   , -H   H   )
         1,1    2,1     1,2    1,1 2,1    2,2     1,2 2,1    1,1 2,2    1,2 2,2

i8 : integral oo

o8 = 1

i9 : 
