-- -*- M2-comint -*- hash: 1603372452

i1 : base(3, Bundle => (A,2,a), Bundle => (B,3,b))

o1 = a variety

o1 : an abstract variety of dimension 3

i2 : segre_3 B

      3
o2 = b  - 2b b  + b
      1     1 2    3

o2 : QQ[a ..a , b ..b ]
         1   2   1   3

i3 : segre(2,A**B)

       2                   2
o3 = 6a  - 3a  + 7a b  + 3b  - 2b
       1     2     1 1     1     2

o3 : QQ[a ..a , b ..b ]
         1   2   1   3

i4 : 
