-- -*- M2-comint -*- hash: 1482375215

i1 : tangentBundle abstractProjectiveSpace 4

o1 = a sheaf

o1 : an abstract sheaf of rank 4 on a flag bundle

i2 : symmetricPower_4 oo

o2 = a sheaf

o2 : an abstract sheaf of rank 35 on a flag bundle

i3 : chern oo

o3 = 1 + 175H    + 14910H    + 823970H    + 33198935H
             2,1         2,2          2,3            2,4

                                QQ[][h, H   ..H   ]
                                         2,1   2,4
o3 : ------------------------------------------------------------------------
     (- h - H   , - h*H    - H   , - h*H    - H   , - h*H    - H   , -h*H   )
             2,1       2,1    2,2       2,2    2,3       2,3    2,4      2,4

i4 : pt = base n

o4 = pt

o4 : an abstract variety of dimension 0

i5 : X = abstractProjectiveSpace'_2 pt

o5 = X

o5 : a flag bundle with subquotient ranks {2, 1}

i6 : tangentBundle X

o6 = a sheaf

o6 : an abstract sheaf of rank 2 on X

i7 : F = symmetricPower_n oo

o7 = F

o7 : an abstract sheaf of rank n + 1 on X

i8 : chern F

          3 2   3       9 4   5 3   3 2   1   2
o8 = 1 + (-n  + -n)h + (-n  + -n  + -n  + -n)h
          2     2       8     4     8     4

             QQ[n][H   ..H   , h]
                    1,1   1,2
o8 : ------------------------------------
     (- H    - h, - H    - H   h, -H   h)
         1,1         1,2    1,1     1,2

i9 : ch F

                3 2   3        3   3 2   1   2
o9 = (n + 1) + (-n  + -n)h + (n  + -n  - -n)h
                2     2            4     4

             QQ[n][H   ..H   , h]
                    1,1   1,2
o9 : ------------------------------------
     (- H    - h, - H    - H   h, -H   h)
         1,1         1,2    1,1     1,2

i10 : chi F

       3     2
o10 = n  + 3n  + 3n + 1

o10 : QQ[n]

i11 : 
