-- -*- M2-comint -*- hash: -1509819140

i1 : S = base(n, Bundle => (E,3,c))

o1 = S

o1 : an abstract variety of dimension 0

i2 : E

o2 = E

o2 : an abstract sheaf of rank 3 on S

i3 : n

o3 = n

o3 : QQ[n]

i4 : n = E = 4;

i5 : E

o5 = 4

i6 : n

o6 = 4

i7 : use S

o7 = S

o7 : an abstract variety of dimension 0

i8 : E

o8 = a sheaf

o8 : an abstract sheaf of rank 3 on S

i9 : n

o9 = n

o9 : QQ[n]

i10 : 
