-- -*- M2-comint -*- hash: 385197125

i1 : a=5,b=5

o1 = (5, 5)

o1 : Sequence

i2 : I = carpet(a,b);

                ZZ
o2 : Ideal of -----[x ..x , y ..y ]
              32003  0   5   0   5

i3 : F = res(I, FastNonminimal => true)

        ZZ                  1        ZZ                  36        ZZ                  187        ZZ                  491        ZZ                  793        ZZ                  833        ZZ                  573        ZZ                  250        ZZ                  63        ZZ                  7
o3 = (-----[x ..x , y ..y ])  <-- (-----[x ..x , y ..y ])   <-- (-----[x ..x , y ..y ])    <-- (-----[x ..x , y ..y ])    <-- (-----[x ..x , y ..y ])    <-- (-----[x ..x , y ..y ])    <-- (-----[x ..x , y ..y ])    <-- (-----[x ..x , y ..y ])    <-- (-----[x ..x , y ..y ])   <-- (-----[x ..x , y ..y ])  <-- 0
      32003  0   5   0   5         32003  0   5   0   5          32003  0   5   0   5           32003  0   5   0   5           32003  0   5   0   5           32003  0   5   0   5           32003  0   5   0   5           32003  0   5   0   5           32003  0   5   0   5          32003  0   5   0   5         
                                                                                                                                                                                                                                                                                                                     10
     0                            1                             2                              3                              4                              5                              6                              7                              8                             9

o3 : ChainComplex

i4 : L = analyzeStrand(F,a); #L
 -- 0.0586467 seconds elapsed

o5 = 350

i6 : betti F_a, betti F

               0         0  1   2   3   4   5   6   7  8 9
o6 = (total: 833, total: 1 36 187 491 793 833 573 250 63 7)
          6: 350      0: 1  .   .   .   .   .   .   .  . .
          7: 468      1: . 36 160 342 436 350 174  49  6 .
          8:  15      2: .  .  27 148 351 468 379 186 51 6
                      3: .  .   .   1   6  15  20  15  6 1

o6 : Sequence

i7 : factor product L

      266 15
o7 = 2   3

o7 : Expression of class Product

i8 : L3 = select(L,c->c%3==0); #L3

o9 = 14

i10 : carpetBettiTable(a,b,3)
 -- 0.00424371 seconds elapsed
 -- 0.0186188 seconds elapsed
 -- 0.0921189 seconds elapsed
 -- 0.0363294 seconds elapsed
 -- 0.0185966 seconds elapsed

             0  1   2   3   4   5   6   7  8 9
o10 = total: 1 36 160 315 302 302 315 160 36 1
          0: 1  .   .   .   .   .   .   .  . .
          1: . 36 160 315 288  14   .   .  . .
          2: .  .   .   .  14 288 315 160 36 .
          3: .  .   .   .   .   .   .   .  . 1

o10 : BettiTally

i11 : 
