-- -*- M2-comint -*- hash: -1776171243

i1 : L = {3,4}

o1 = {3, 4}

o1 : List

i2 : x = symbol x;

i3 : S = productOfProjectiveSpaces(#L,x) --creates the multi-graded ring of (P^1)^(#L)

o3 = S

o3 : PolynomialRing

i4 : Delta = smallDiagonal S -- the ideal of the small diagonal of (P^1)^(#L)

o4 = ideal(- x   x    + x   x   )
              1,0 0,1    0,0 1,1

o4 : Ideal of S

i5 : G = correspondenceScroll(Delta, L)

             2                                                        
o5 = ideal (y    - y   y   , y   y    - y   y   , y   y    - y   y   ,
             1,3    1,2 1,4   1,2 1,3    1,1 1,4   1,1 1,3    1,0 1,4 
     ------------------------------------------------------------------------
                                                                     2    
     y   y    - y   y   , y   y    - y   y   , y   y    - y   y   , y    -
      0,3 1,3    0,2 1,4   0,2 1,3    0,1 1,4   0,1 1,3    0,0 1,4   1,2  
     ------------------------------------------------------------------------
                                                                             
     y   y   , y   y    - y   y   , y   y    - y   y   , y   y    - y   y   ,
      1,0 1,4   1,1 1,2    1,0 1,3   0,3 1,2    0,1 1,4   0,2 1,2    0,0 1,4 
     ------------------------------------------------------------------------
                           2                                              
     y   y    - y   y   , y    - y   y   , y   y    - y   y   , y   y    -
      0,1 1,2    0,0 1,3   1,1    1,0 1,2   0,3 1,1    0,0 1,4   0,2 1,1  
     ------------------------------------------------------------------------
                                                                             
     y   y   , y   y    - y   y   , y   y    - y   y   , y   y    - y   y   ,
      0,0 1,3   0,1 1,1    0,0 1,2   0,3 1,0    0,0 1,3   0,2 1,0    0,0 1,2 
     ------------------------------------------------------------------------
                           2                                     2
     y   y    - y   y   , y    - y   y   , y   y    - y   y   , y    -
      0,1 1,0    0,0 1,1   0,2    0,1 0,3   0,1 0,2    0,0 0,3   0,1  
     ------------------------------------------------------------------------
     y   y   )
      0,0 0,2

                ZZ
o5 : Ideal of -----[y   ..y   , y   ..y   ]
              32003  0,0   0,3   1,0   1,4

i6 : minimalBetti G

            0  1  2   3  4  5 6
o6 = total: 1 21 70 105 84 35 6
         0: 1  .  .   .  .  . .
         1: . 21 70 105 84 35 6

o6 : BettiTally

i7 : G = correspondenceScroll(Delta^2, L)

             2                                                          2    
o7 = ideal (y    - y   y   , y   y    - y   y   , y   y    - y   y   , y    -
             1,3    1,2 1,4   1,2 1,3    1,1 1,4   1,1 1,3    1,0 1,4   1,2  
     ------------------------------------------------------------------------
                                                                             
     y   y   , y   y    - y   y   , y   y    - 2y   y    + y   y   , y   y   
      1,0 1,4   1,1 1,2    1,0 1,3   0,3 1,2     0,2 1,3    0,1 1,4   0,2 1,2
     ------------------------------------------------------------------------
                              2                                     
     - 2y   y    + y   y   , y    - y   y   , y   y    - 3y   y    +
         0,1 1,3    0,0 1,4   1,1    1,0 1,2   0,3 1,1     0,1 1,3  
     ------------------------------------------------------------------------
                                                                       
     2y   y   , y   y    - 2y   y    + y   y   , y   y    - 3y   y    +
       0,0 1,4   0,2 1,1     0,1 1,2    0,0 1,3   0,3 1,0     0,1 1,2  
     ------------------------------------------------------------------------
                                                  2                         
     2y   y   , y   y    - 2y   y    + y   y   , y    - y   y   , y   y    -
       0,0 1,3   0,2 1,0     0,1 1,1    0,0 1,2   0,2    0,1 0,3   0,1 0,2  
     ------------------------------------------------------------------------
                2
     y   y   , y    - y   y   )
      0,0 0,3   0,1    0,0 0,2

                ZZ
o7 : Ideal of -----[y   ..y   , y   ..y   ]
              32003  0,0   0,3   1,0   1,4

i8 : minimalBetti G

            0  1  2  3  4  5 6
o8 = total: 1 15 35 42 35 15 1
         0: 1  .  .  .  .  . .
         1: . 15 35 21  .  . .
         2: .  .  . 21 35 15 .
         3: .  .  .  .  .  . 1

o8 : BettiTally

i9 : T = ZZ/32003[y_0,y_1,y_2]

o9 = T

o9 : PolynomialRing

i10 : threepoints = gens intersect(ideal(y_0,y_1),ideal(y_0,y_2),ideal(y_1,y_2))

o10 = | y_1y_2 y_0y_2 y_0y_1 |

              1       3
o10 : Matrix T  <--- T

i11 : f = threepoints*random(source threepoints, T^{-3}); -- general cubic through the three points

              1       1
o11 : Matrix T  <--- T

i12 : L = {2,2,2}

o12 = {2, 2, 2}

o12 : List

i13 : x = symbol x;

i14 : S = productOfProjectiveSpaces(#L,x) --creates the multi-graded ring of (P^1)^(#L)

o14 = S

o14 : PolynomialRing

i15 : ST = (flattenRing(T**S))_0

o15 = ST

o15 : PolynomialRing

i16 : irrel = irrelevantIdeal ST;

o16 : Ideal of ST

i17 : ff = entries sub(transpose matrix {{y_0,y_1},{y_0,y_2},{y_1,y_2}}, ST) -- projections from the three points

o17 = {{y , y , y }, {y , y , y }}
         0   0   1     1   2   2

o17 : List

i18 : D1 = det matrix{{x_(0,0),ff_1_0},{x_(1,0),ff_0_0}}

o18 = y x    - y x
       0 0,0    1 1,0

o18 : ST

i19 : D2 = det matrix{{x_(0,1),ff_1_1},{x_(1,1),ff_0_1}}

o19 = y x    - y x
       0 0,1    2 1,1

o19 : ST

i20 : D3 = det matrix{{x_(0,2),ff_1_2},{x_(1,2),ff_0_2}}

o20 = y x    - y x
       1 0,2    2 1,2

o20 : ST

i21 : J = sub(ideal f, ST)+ideal(D1,D2,D3)

                  2             2        2                        2    
o21 = ideal (8570y y  - 15344y y  + 3187y y  + 12334y y y  + 4376y y  -
                  0 1         0 1        0 2         0 1 2        1 2  
      -----------------------------------------------------------------------
             2          2
      5307y y  - 5570y y , y x    - y x   , y x    - y x   , y x    - y x   )
           0 2        1 2   0 0,0    1 1,0   0 0,1    2 1,1   1 0,2    2 1,2

o21 : Ideal of ST

i22 : Js = saturate(J, irrel);

o22 : Ideal of ST

i23 : I = eliminate({y_0,y_1,y_2}, Js);

o23 : Ideal of ST

i24 : IS = (map(S,ST))I;

o24 : Ideal of S

i25 : codim I

o25 = 2

i26 : g = correspondenceScroll(IS, L);

                 ZZ
o26 : Ideal of -----[y   ..y   ]
               32003  0,0   2,2

i27 : minimalBetti g

             0  1   2   3   4  5  6
o27 = total: 1 30 120 196 160 66 11
          0: 1  .   .   .   .  .  .
          1: .  3   .   .   .  .  .
          2: .  9  27  24   7  .  .
          3: . 18  93 172 153 66 11

o27 : BettiTally

i28 : 
