-- -*- M2-comint -*- hash: -238055603

i1 : I=degenerateK3(5,5,{1,1});

                ZZ
o1 : Ideal of -----[y   ..y   ]
              32003  0,0   1,5

i2 : minimalBetti I

            0  1   2   3   4   5   6   7  8 9
o2 = total: 1 36 160 315 288 288 315 160 36 1
         0: 1  .   .   .   .   .   .   .  . .
         1: . 36 160 315 288   .   .   .  . .
         2: .  .   .   .   . 288 315 160 36 .
         3: .  .   .   .   .   .   .   .  . 1

o2 : BettiTally

i3 : I_10

o3 = y   y    - 2y   y    + y   y
      0,2 1,3     0,1 1,4    0,0 1,5

       ZZ
o3 : -----[y   ..y   ]
     32003  0,0   1,5

i4 : I=degenerateK3(5,5,(-1,1));

                ZZ
o4 : Ideal of -----[y   ..y   ]
              32003  0,0   1,5

i5 : I_10

o5 = y   y    + y   y    + y   y
      0,2 1,3    0,1 1,4    0,0 1,5

       ZZ
o5 : -----[y   ..y   ]
     32003  0,0   1,5

i6 : minimalBetti I

            0  1   2   3   4   5   6   7  8 9
o6 = total: 1 36 160 315 293 293 315 160 36 1
         0: 1  .   .   .   .   .   .   .  . .
         1: . 36 160 315 288   5   .   .  . .
         2: .  .   .   .   5 288 315 160 36 .
         3: .  .   .   .   .   .   .   .  . 1

o6 : BettiTally

i7 : I=degenerateK3(5,5,{1,1},Characteristic=>3);

              ZZ
o7 : Ideal of --[y   ..y   ]
               3  0,0   1,5

i8 : minimalBetti I

            0  1   2   3   4   5   6   7  8 9
o8 = total: 1 36 160 315 302 302 315 160 36 1
         0: 1  .   .   .   .   .   .   .  . .
         1: . 36 160 315 288  14   .   .  . .
         2: .  .   .   .  14 288 315 160 36 .
         3: .  .   .   .   .   .   .   .  . 1

o8 : BettiTally

i9 : 
