-- -*- M2-comint -*- hash: 573859440

i1 : S = ZZ/101[a,b]

o1 = S

o1 : PolynomialRing

i2 : I = ideal 0_S

o2 = ideal 0

o2 : Ideal of S

i3 : f0 = matrix"a,b"

o3 = | a b |

             1       2
o3 : Matrix S  <--- S

i4 : f1 = matrix"a,b"

o4 = | a b |

             1       2
o4 : Matrix S  <--- S

i5 : maps = {f0,f1}

o5 = {| a b |, | a b |}

o5 : List

i6 : schemeInProduct(I, maps, Y)
warning: clearing value of symbol X to allow access to subscripted variables based on it
       : debug with expression   debug 1308   or with command line option   --debug 1308

o6 = ideal(X   X    - X   X   )
            1,0 0,1    0,0 1,1

               ZZ
o6 : Ideal of ---[X   , X   , X   , X   , a..b]
              101  0,0   1,0   0,1   1,1

i7 : 
