-- -*- M2-comint -*- hash: -27225480

i1 : S = ZZ/101[a,b]

o1 = S

o1 : PolynomialRing

i2 : I = ideal 0_S

o2 = ideal 0

o2 : Ideal of S

i3 : f0 = matrix"a,b"

o3 = | a b |

             1       2
o3 : Matrix S  <--- S

i4 : f1 = matrix"a,b"

o4 = | a b |

             1       2
o4 : Matrix S  <--- S

i5 : maps = {f0,f1}

o5 = {| a b |, | a b |}

o5 : List

i6 : schemeInProduct(I, maps,VariableName =>"Y")

o6 = ideal(Y   Y    - Y   Y   )
            0,1 1,0    0,0 1,1

               ZZ
o6 : Ideal of ---[Y   ..Y   , a..b]
              101  0,0   1,1

i7 : 
