-- -*- M2-comint -*- hash: 250446331

i1 : E = matrix({{ -5,  0,  1,  0,  1},
                     {  0, -2,  1,  0,  0},
                     {  1,  1, -1,  0,  0},
                     {  0,  0,  0, -2,  1},
                     {  1,  0,  0,  1, -1}})

o1 = | -5 0  1  0  1  |
     | 0  -2 1  0  0  |
     | 1  1  -1 0  0  |
     | 0  0  0  -2 1  |
     | 1  0  0  1  -1 |

              5        5
o1 : Matrix ZZ  <--- ZZ

i2 : F = matrix({{4,5,10,5,10}})

o2 = | 4 5 10 5 10 |

              1        5
o2 : Matrix ZZ  <--- ZZ

i3 : MultiplierIdeals(F,E,BiggestJN => 1)

                      1
o3 =  Jumping number: -  Multiplicity: 1 Multiplier ideal: | 1 1 2 1 2 | Maximal jumping divisor: {| 1 0 1 0 1 |}
                      2                                                  Minimal jumping divisor: {| 1 0 1 0 1 |}
                       7
      Jumping number: --  Multiplicity: 2 Multiplier ideal: | 2 2 4 2 4 | Maximal jumping divisor: {| 0 0 1 0 1 |}
                      10                                                  Minimal jumping divisor: {| 0 0 1 0 1 |}
                       9
      Jumping number: --  Multiplicity: 2 Multiplier ideal: | 2 3 5 3 5 | Maximal jumping divisor: {| 0 0 1 0 1 |}
                      10                                                  Minimal jumping divisor: {| 0 0 1 0 1 |}
      Jumping number: 1  Multiplicity: 1 Multiplier ideal: | 3 3 6 3 6 | Maximal jumping divisor: {| 1 1 1 1 1 |}
                                                                         Minimal jumping divisor: {| 1 0 1 0 1 |}

o3 : Type of HashTable

i4 : 
