-- -*- M2-comint -*- hash: 171003294

i1 : E = matrix({{ -5,  0,  1,  0,  1},
                     {  0, -2,  1,  0,  0},
                     {  1,  1, -1,  0,  0},
                     {  0,  0,  0, -2,  1},
                     {  1,  0,  0,  1, -1}})

o1 = | -5 0  1  0  1  |
     | 0  -2 1  0  0  |
     | 1  1  -1 0  0  |
     | 0  0  0  -2 1  |
     | 1  0  0  1  -1 |

              5        5
o1 : Matrix ZZ  <--- ZZ

i2 : F = matrix({{4,5,10,5,10}})

o2 = | 4 5 10 5 10 |

              1        5
o2 : Matrix ZZ  <--- ZZ

i3 : MultIdeal(F,E,1 / 2)

o3 = | 1 1 2 1 2 |

o3 : MutableMatrix

i4 : 
