-- -*- M2-comint -*- hash: -1251334212

i1 : R = ZZ/101[a..d, Degrees => {1,2,3,4}];

i2 : truncate(4, ideal"a3,b3")

             4   3    3    3   3
o2 = ideal (a , a b, a c, b , a d)

o2 : Ideal of R

i3 : needsPackage "NormalToricVarieties";

i4 : dP6 = smoothFanoToricVariety(2, 4);

i5 : S = ring dP6;

i6 : M = S^{-{0,0,1,0}};

i7 : N = truncate({0,0,0,0}, M)

o7 = image {0, 0, 1, 0} | x_4 x_2 |

                             1
o7 : S-module, submodule of S

i8 : N == coker truncate({0,0,0,0}, presentation M)

o8 = true

i9 : R = ZZ/101[a..d, Degrees => {2:{1,0},{0,1},{-3,1}}];

i10 : M = R^1/ideal d

o10 = cokernel | d |

                             1
o10 : R-module, quotient of R

i11 : N = truncate({0,0}, M)

o11 = cokernel | b3d ab2d a2bd a3d |

                             1
o11 : R-module, quotient of R

i12 : isSubset(M, N)

o12 = false

i13 : 
