-- -*- M2-comint -*- hash: 1137579612

i1 : R = ZZ/5[x,y];

i2 : f = x^7*y^5*(x + y)^5*(x^2 + y^3)^4;

i3 : fpt(f, DepthOfSearch => 3, Attempts => 5)

       19   1
o3 = {---, --}
      250  13

o3 : List

i4 : fpt(f, DepthOfSearch => 3, Attempts => 5, Bounds => oo)

       45   1
o4 = {---, --}
      589  13

o4 : List

i5 : 
