-- -*- M2-comint -*- hash: 332352049

i1 : p = 131;

i2 : R = ZZ/p[x,y];

i3 : f = x^13 - y^5;

i4 : c = fpt(f)

     18
o4 = --
     65

o4 : QQ

i5 : compareFPT(c - 1/p^2, f)

o5 = -1

i6 : compareFPT(c, f)

o6 = 0

i7 : compareFPT(c + 1/p, f)

o7 = 1

i8 : isFJumpingExponent(36/65, f)

o8 = true

i9 : 
