-- -*- M2-comint -*- hash: -1706361394

i1 : R = ZZ/11[x,y];

i2 : f = 6*x^6*y^7 + 8*x^4*y^7 + 8*x^3*y^7 + 6*x^6*y^3 + 5*x^5*y^4 + 4*x^3*y^6 +4*x^3*y^5

         6 7     4 7     3 7     6 3     5 4     3 6     3 5
o2 = - 5x y  - 3x y  - 3x y  - 5x y  + 5x y  + 4x y  + 4x y

o2 : R

i3 : fpt(f, Attempts => 5, DepthOfSearch => 3)

       29   317
o3 = {---, ----}
      122  1331

o3 : List

i4 : fpt(f, Attempts => 5, DepthOfSearch => 3, GuessStrategy => {0, 1, 0})

      5
o4 = --
     21

o4 : QQ

i5 : R = ZZ/5[x,y];

i6 : f = x^3*y^11*(x + y)^8*(x^2 + y^3)^8;

i7 : fpt(f, DepthOfSearch => 3, Attempts => 7)

       5   4
o7 = {--, --}
      96  75

o7 : List

i8 : fpt(f, DepthOfSearch => 3, Attempts => 4, GuessStrategy => denominator)

      1
o8 = --
     19

o8 : QQ

i9 : 
