-- -*- M2-comint -*- hash: 2039009135

i1 : R = ZZ/7[x,y];

i2 : f =  x^3 - y^2;

i3 : compareFPT(1/2, f)

o3 = -1

i4 : compareFPT(5/6, f)

o4 = 0

i5 : compareFPT(6/7, f)

o5 = 1

i6 : R = ZZ/5[x,y,z]/(x*y - z^2);

i7 : compareFPT(1/3, x)

o7 = -1

i8 : compareFPT(1/2, x)

o8 = 0

i9 : compareFPT(13/25, x)

o9 = 1

i10 : T = ZZ/5[a,b];

i11 : S = ZZ/5[x,y,z,w];

i12 : f = map(T, S, {a^3, a^2*b, a*b^2, b^3});

o12 : RingMap T <--- S

i13 : R = S/ker f;

i14 : g = x^7 - w^3;

i15 : h = f(sub(g, S))

       21    9
o15 = a   - b

o15 : T

i16 : compareFPT(19/125, g)

o16 = 0

i17 : compareFPT(19/125, h)

o17 = 0

i18 : compareFPT(19/124, g)

o18 = 1

i19 : compareFPT(19/125 - 1/1000, g)

o19 = -1

i20 : R = ZZ/7[x,y];

i21 : f = (x + 1)^3 - (y + 3)^2;

i22 : compareFPT(5/6, f)

o22 = 0

i23 : compareFPT(5/6, f, AtOrigin => true)

o23 = -1

i24 : 
