-- -*- M2-comint -*- hash: 234990846

i1 : R = ZZ/11[x,y];

i2 : f = x^3 + y^2;

i3 : isFPT(9/11, f)

o3 = true

i4 : isFPT(9/12, f)

o4 = false

i5 : T = ZZ/7[a,b];

i6 : S = ZZ/7[x,y,z,w];

i7 : f = map(T, S, {a^3, a^2*b, a*b^2, b^3});

o7 : RingMap T <--- S

i8 : R = S/ker f;

i9 : isFPT(1/3, x)

o9 = true

i10 : isFPT(1/3 + 1/10000, x)

o10 = false

i11 : isFPT(1/3 - 1/10000, x)

o11 = false

i12 : R = ZZ/11[x,y,z]/(x^2 - y*(z - 1));

i13 : isFPT(1/2, z - 1)

o13 = true

i14 : isFPT(1/2, z - 1, AtOrigin => true)

o14 = false

i15 : 
