-- -*- M2-comint -*- hash: 323187893

i1 : R = ZZ/5[x,y];

i2 : f =  x^4 + y^3 + x^2*y^2;

i3 : isFJumpingExponent(7/12, f)

o3 = true

i4 : isFJumpingExponent(4/5, f)

o4 = true

i5 : isFJumpingExponent(5/6, f)

o5 = false

i6 : isFJumpingExponent(11/12, f)

o6 = true

i7 : R = ZZ/11[x,y,z]/(x*y - z^2);

i8 : f = x^2;

i9 : isFJumpingExponent(1/4, f)

o9 = true

i10 : isFJumpingExponent(3/8, f)

o10 = false

i11 : isFJumpingExponent(1/2, f)

o11 = true

i12 : isFJumpingExponent(2/3, f)

o12 = false

i13 : isFJumpingExponent(3/4, f)

o13 = true

i14 : R = ZZ/13[x,y];

i15 : f = y*((y + 1) - (x - 1)^2)*(x - 2)*(x + y - 2);

i16 : isFJumpingExponent(3/4, f)

o16 = true

i17 : isFJumpingExponent(3/4, f, AtOrigin => true)

o17 = false

i18 : 
