-- -*- M2-comint -*- hash: 1801753030

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : P2 = Proj(R)

o2 = P2

o2 : ProjectiveVariety

i3 : phi1 = rationalMapping(P2, P2, {y*z,x*z,x*y})

o3 = P2 - - - > P2   {y*z, x*z, x*y}

o3 : RationalMapping

i4 : phi2 = rationalMapping(R, R, matrix{{y*z,x*z,x*y}})

o4 = P2 - - - > P2   {y*z, x*z, x*y}

o4 : RationalMapping

i5 : phi3 = rationalMapping(map(R, R, {y*z,x*z,x*y}))

o5 = P2 - - - > P2   {y*z, x*z, x*y}

o5 : RationalMapping

i6 : S = QQ[x,y,z];

i7 : P2 = Proj S;

i8 : R = QQ[a,b];

i9 : P1 = Proj R;

i10 : phi = rationalMapping(P2, P1, {b*a*(a-b), a^2*(a-b), b^3})

                        2       2   3    2    3
o10 = P1 - - - > P2   {a b - a*b , a  - a b, b }

o10 : RationalMapping

i11 : h = map(R, S, {b*a*(a-b), a^2*(a-b), b^3})

                   2       2   3    2    3
o11 = map (R, S, {a b - a*b , a  - a b, b })

o11 : RingMap R <--- S

i12 : psi = rationalMapping h

                        2       2   3    2    3
o12 = P1 - - - > P2   {a b - a*b , a  - a b, b }

o12 : RationalMapping

i13 : phi == psi

o13 = true

i14 : 
