-- -*- M2-comint -*- hash: -1517019823

i1 : R = QQ[x,y,z];

i2 : S = QQ[a,b];

i3 : f = map(R, S, {x,y});

o3 : RingMap R <--- S

i4 : baseLocusOfMap(f)

o4 = ideal (y, x)

o4 : Ideal of R

i5 : R=QQ[x,y,z]/(y^2*z-x*(x-z)*(x+z));

i6 : S=QQ[a,b];

i7 : f=rationalMapping(R,S,{x,y});

i8 : baseLocusOfMap(f)

o8 = ideal 1

o8 : Ideal of R

i9 : R=QQ[x,y,z];

i10 : S=QQ[a,b,c];

i11 : f=map(R,S,{y*z,x*z,x*y});

o11 : RingMap R <--- S

i12 : J=baseLocusOfMap(f)

o12 = ideal (y*z, x*z, x*y)

o12 : Ideal of R

i13 : minimalPrimes J

o13 = {ideal (y, x), ideal (z, x), ideal (z, y)}

o13 : List

i14 : 
