-- -*- M2-comint -*- hash: 1213318811

i1 : S = QQ[x,y,z,w];

i2 : b = ideal(x*y-z*w);

o2 : Ideal of S

i3 : R = QQ[u,v];

i4 : a = ideal(sub(0,R));

o4 : Ideal of R

i5 : f = matrix {{u,0,v,0}};

             1       4
o5 : Matrix R  <--- R

i6 : phi = rationalMapping(R/a, S/b, f)

                             S
o6 = Proj R - - - > Proj(---------)   {u, 0, v, 0}
                         x*y - z*w

o6 : RationalMapping

i7 : idealOfImageOfMap(phi)

o7 = ideal (w, y)

                  S
o7 : Ideal of ---------
              x*y - z*w

i8 : psi = rationalMapping(Proj(S/b), Proj(R/a), f)

                             S
o8 = Proj R - - - > Proj(---------)   {u, 0, v, 0}
                         x*y - z*w

o8 : RationalMapping

i9 : idealOfImageOfMap(psi)

o9 = ideal (w, y)

                  S
o9 : Ideal of ---------
              x*y - z*w

i10 : 
