-- -*- M2-comint -*- hash: -42184691

i1 : R=QQ[x,y,z];

i2 : S=QQ[a,b,c];

i3 : f1=map(R, S, {y*z,x*z,x*y});

o3 : RingMap R <--- S

i4 : f2=map(R, S, {x*y*z,x^2*z,x^2*y});

o4 : RingMap R <--- S

i5 : isSameMap(f1,f2)

o5 = true

i6 : R = ZZ/7[x,y,z]

o6 = R

o6 : PolynomialRing

i7 : phi = rationalMapping(R, R, {y*z,x*z,x*y})

o7 = Proj R - - - > Proj R   {y*z, x*z, x*y}

o7 : RationalMapping

i8 : ident = rationalMapping(R, R, {x,y,z})

o8 = Proj R - - - > Proj R   {x, y, z}

o8 : RationalMapping

i9 : phi == ident

o9 = false

i10 : phi^2 == ident

o10 = true

i11 : 
