-- -*- M2-comint -*- hash: -81425482

i1 : R=QQ[x,y,z];

i2 : S=QQ[a,b,c];

i3 : Pi = map(R, S, {x*y, x*z, y*z});

o3 : RingMap R <--- S

i4 : isBirationalMap(Pi, Verbosity=>0, Strategy=>SimisStrategy )

o4 = true

i5 : R=QQ[x,y,z]/(x^3+y^3-z^3);

i6 : S=QQ[s,t];

i7 : Pi = map(R, S, {x, y-z});

o7 : RingMap R <--- S

i8 : isBirationalMap(Pi, Verbosity=>0)

o8 = false

i9 : R = ZZ/5[x,y,z]/(x^3+y^3-z^3);

i10 : S = ZZ/5[a,b,c]/(a^3+b^3-b^3);

i11 : h = map(R, S, {x^5, y^5, z^5});

o11 : RingMap R <--- S

i12 : isBirationalMap(h, Strategy=>SaturationStrategy)
isBirationalMap: About to find the image of the map.  If you know the image, 
        you may want to use the AssumeDominant option if this is slow.
isBirationalOntoImageRees:  About to compute the Jacobian Dual Matrix,
         if it is slow, run again and  set Strategy=>HybridStrategy or SimisStrategy.
isBirationalOntoImageRees: computed Jacobian dual matrix

o12 = false

i13 : 
