-- -*- M2-comint -*- hash: 1710583539

i1 : R = ZZ/7[x,y,z];

i2 : S = ZZ/7[a,b,c];

i3 : h = map(R, S, {y*z, x*z, x*y});

o3 : RingMap R <--- S

i4 : sourceInversionFactor h
sourceInversionFactor: About to find the image of the map.  If you know the image, 
        you may want to use the AssumeDominant option if this is slow.
inverseOfMapSimis: About to find the image of the map.  If you know the image, 
        you may want to use the AssumeDominant option if this is slow.
inverseOfMapSimis: About to check rank, if this is very slow, you may want to try turning QuickRank=>false.
inverseOfMapSimis: rank found, we computed enough of the Groebner basis.

o4 = x*y*z

o4 : R

i5 : S=QQ[a,b,c,d];

i6 : g=(b^2-a*c)*c*d;

i7 : phi=map(S,S,transpose jacobian ideal g);

o7 : RingMap S <--- S

i8 : sourceInversionFactor(phi, Verbosity=>0)

      2 4 2      5 2
o8 = b c d  - a*c d

o8 : S

i9 : 
