-- -*- M2-comint -*- hash: 1655655729

i1 : R = QQ[a,b];

i2 : S = QQ[x,y,z];

i3 : P2 = Proj R;

i4 : P3 = Proj S;

i5 : f = map(R, S, {a,b,0});

o5 : RingMap R <--- S

i6 : phi = rationalMapping f;

i7 : source phi

o7 = P2

o7 : ProjectiveVariety

i8 : target phi

o8 = P3

o8 : ProjectiveVariety

i9 : source f

o9 = S

o9 : PolynomialRing

i10 : target f

o10 = R

o10 : PolynomialRing

i11 : 
