-- -*- M2-comint -*- hash: -102465891

i1 : kk=ZZ/32003

o1 = kk

o1 : QuotientRing

i2 : S=kk[a..d]

o2 = S

o2 : PolynomialRing

i3 : i=ideal(a^2,b^2,c^2, d^2)

             2   2   2   2
o3 = ideal (a , b , c , d )

o3 : Ideal of S

i4 : betti (F=res i)

            0 1 2 3 4
o4 = total: 1 4 6 4 1
         0: 1 . . . .
         1: . 4 . . .
         2: . . 6 . .
         3: . . . 4 .
         4: . . . . 1

o4 : BettiTally

i5 : M = image F.dd_3

o5 = image {4} | c2  d2  0   0   |
           {4} | -b2 0   d2  0   |
           {4} | a2  0   0   d2  |
           {4} | 0   -b2 -c2 0   |
           {4} | 0   a2  0   -c2 |
           {4} | 0   0   a2  b2  |

                             6
o5 : S-module, submodule of S

i6 : j1 = bruns M

                  4          2 2    2 2        2 2        4         2 2
o6 = ideal (-9831d , - 15925b c  - a d  + 6174b d , 15925b  - 12753b d )

o6 : Ideal of S

i7 : betti res j1

            0 1 2 3 4
o7 = total: 1 3 5 4 1
         0: 1 . . . .
         1: . . . . .
         2: . . . . .
         3: . 3 . . .
         4: . . . . .
         5: . . . . .
         6: . . 5 . .
         7: . . . 4 .
         8: . . . . 1

o7 : BettiTally

i8 : j2=brunsIdeal i

                  4        2 2    2 2        2 2          4        2 2
o8 = ideal (-3490d , 11765b c  - a d  + 8771b d , - 11765b  - 5457b d )

o8 : Ideal of S

i9 : betti res j2

            0 1 2 3 4
o9 = total: 1 3 5 4 1
         0: 1 . . . .
         1: . . . . .
         2: . . . . .
         3: . 3 . . .
         4: . . . . .
         5: . . . . .
         6: . . 5 . .
         7: . . . 4 .
         8: . . . . 1

o9 : BettiTally

i10 : (betti res j1) == (betti res j2)

o10 = true

i11 : 
