-- -*- M2-comint -*- hash: 1850425498

i1 : R=QQ[x_(1,1)..x_(6,3)];

i2 : G=genericMatrix(R,3,6)

o2 = | x_(1,1) x_(2,1) x_(3,1) x_(4,1) x_(5,1) x_(6,1) |
     | x_(1,2) x_(2,2) x_(3,2) x_(4,2) x_(5,2) x_(6,2) |
     | x_(1,3) x_(2,3) x_(3,3) x_(4,3) x_(5,3) x_(6,3) |

             3       6
o2 : Matrix R  <--- R

i3 : M=coker G; BR=res M; betti BR

            0 1  2  3 4
o5 = total: 3 6 15 18 6
         0: 3 6  .  . .
         1: . .  .  . .
         2: . . 15 18 6

o5 : BettiTally

i6 : e={{1,0,0,0,0},{-1,1,0,0,0},{0,-1,1,0,0},{0,0,-1,1,0},{0,0,0,-1,1},{0,0,0,0,-1}};

i7 : f={{1,0},{-1,1},{0,-1}};

i8 : W=flatten table(e,f,(u,v)->u|v)

o8 = {{1, 0, 0, 0, 0, 1, 0}, {1, 0, 0, 0, 0, -1, 1}, {1, 0, 0, 0, 0, 0, -1},
     ------------------------------------------------------------------------
     {-1, 1, 0, 0, 0, 1, 0}, {-1, 1, 0, 0, 0, -1, 1}, {-1, 1, 0, 0, 0, 0,
     ------------------------------------------------------------------------
     -1}, {0, -1, 1, 0, 0, 1, 0}, {0, -1, 1, 0, 0, -1, 1}, {0, -1, 1, 0, 0,
     ------------------------------------------------------------------------
     0, -1}, {0, 0, -1, 1, 0, 1, 0}, {0, 0, -1, 1, 0, -1, 1}, {0, 0, -1, 1,
     ------------------------------------------------------------------------
     0, 0, -1}, {0, 0, 0, -1, 1, 1, 0}, {0, 0, 0, -1, 1, -1, 1}, {0, 0, 0,
     ------------------------------------------------------------------------
     -1, 1, 0, -1}, {0, 0, 0, 0, -1, 1, 0}, {0, 0, 0, 0, -1, -1, 1}, {0, 0,
     ------------------------------------------------------------------------
     0, 0, -1, 0, -1}}

o8 : List

i9 : D=dynkinType{{"A",5},{"A",2}}; setWeights(R,D,W)

o10 = Tally{{1, 0, 0, 0, 0, 1, 0} => 1}

o10 : Tally

i11 : U0={{0,0,0,0,0,-1,0},{0,0,0,0,0,1,-1},{0,0,0,0,0,0,1}};

i12 : H0=highestWeightsDecomposition(BR,0,U0)

o12 = HashTable{0 => HashTable{{0} => Tally{{0, 0, 0, 0, 0, 0, 1} => 1}}}
                1 => HashTable{{1} => Tally{{1, 0, 0, 0, 0, 0, 0} => 1}}
                2 => HashTable{{4} => Tally{{0, 0, 0, 1, 0, 0, 0} => 1}}
                3 => HashTable{{5} => Tally{{0, 0, 0, 0, 1, 1, 0} => 1}}
                4 => HashTable{{6} => Tally{{0, 0, 0, 0, 0, 2, 0} => 1}}

o12 : HashTable

i13 : U1={{1,0,0,0,0,0,0},{-1,1,0,0,0,0,0},{0,-1,1,0,0,0,0},{0,0,-1,1,0,0,0},{0,0,0,-1,1,0,0},{0,0,0,0,-1,0,0}};

i14 : H1=highestWeightsDecomposition(BR,1,U1); H0===H1

o15 = true

i16 : highestWeightsDecomposition(M,-1,2,U0)

o16 = HashTable{-1 => Tally{}                         }
                0 => Tally{{0, 0, 0, 0, 0, 0, 1} => 1}
                1 => Tally{{1, 0, 0, 0, 0, 1, 1} => 1}
                2 => Tally{{0, 1, 0, 0, 0, 0, 2} => 1}
                           {2, 0, 0, 0, 0, 2, 1} => 1

o16 : HashTable

i17 : 
