-- -*- M2-comint -*- hash: -273128212

i1 : R=QQ[x,y,z];

i2 : L={{1,0},{-1,1},{0,-1}};

i3 : D=dynkinType{{"A",2}};

i4 : setWeights(R,D,L)

o4 = Tally{{1, 0} => 1}

o4 : Tally

i5 : loadPackage "PieriMaps";

i6 : f=pureFree({0,2,3,6},R)

o6 = | 12x2 0    0    6xy 0   0   6xz   0    0   2y2 0   0   2yz  0    0  
     | 0    12x2 0    0   6xy 0   0     6xz  0   0   2y2 0   0    2yz  0  
     | 0    0    12x2 0   0   6xy 0     0    6xz 0   0   2y2 0    0    2yz
     | 0    0    0    0   6x2 0   -12x2 0    0   0   8xy 0   -8xy 4xz  0  
     | 0    0    0    0   0   6x2 0     -3x2 0   0   0   8xy 0    -2xy 4xz
     | 0    0    0    0   0   0   0     0    0   0   0   2x2 0    -x2  0  
     ------------------------------------------------------------------------
     2z2   0    0   0   0   0    0   0    0   0    0   0   |
     0     2z2  0   0   0   0    0   0    0   0    0   0   |
     0     0    2z2 0   0   0    0   0    0   0    0   0   |
     -16xz 0    0   6y2 0   4yz  0   2z2  0   0    0   0   |
     0     -4xz 0   0   6y2 -y2  4yz -2yz 2z2 0    0   0   |
     2x2   0    0   0   6xy -2xy 2xz -2xz 0   12y2 6yz 2z2 |

             6       27
o6 : Matrix R  <--- R

i7 : W=apply(apply(standardTableaux(3, {2,2}), flatten), i->sum(apply(i,j->L_j)))

o7 = {{0, 2}, {1, 0}, {2, -2}, {-1, 1}, {0, -1}, {-2, 0}}

o7 : List

i8 : EFW=res coker f; betti EFW

            0  1  2 3
o9 = total: 6 27 24 3
         0: 6  .  . .
         1: . 27 24 .
         2: .  .  . .
         3: .  .  . 3

o9 : BettiTally

i10 : highestWeightsDecomposition(EFW,0,W)

o10 = HashTable{0 => HashTable{{0} => Tally{{0, 2} => 1}}}
                1 => HashTable{{2} => Tally{{2, 2} => 1}}
                2 => HashTable{{3} => Tally{{1, 3} => 1}}
                3 => HashTable{{6} => Tally{{1, 0} => 1}}

o10 : HashTable

i11 : 
