-- -*- M2-comint -*- hash: 331616568

i1 : I=Grassmannian(1,5,CoefficientRing=>QQ); R=ring I;

o1 : Ideal of QQ[p   ..p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   ]
                  0,1   0,2   1,2   0,3   1,3   2,3   0,4   1,4   2,4   3,4   0,5   1,5   2,5   3,5   4,5

i3 : RI=res I; betti RI

            0  1  2  3  4  5 6
o4 = total: 1 15 35 42 35 15 1
         0: 1  .  .  .  .  . .
         1: . 15 35 21  .  . .
         2: .  .  . 21 35 15 .
         3: .  .  .  .  .  . 1

o4 : BettiTally

i5 : L={{1,0,0,0,0},{-1,1,0,0,0},{0,-1,1,0,0},{0,0,-1,1,0},{0,0,0,-1,1},{0,0,0,0,-1}}

o5 = {{1, 0, 0, 0, 0}, {-1, 1, 0, 0, 0}, {0, -1, 1, 0, 0}, {0, 0, -1, 1, 0},
     ------------------------------------------------------------------------
     {0, 0, 0, -1, 1}, {0, 0, 0, 0, -1}}

o5 : List

i6 : W=apply(subsets({0,1,2,3,4,5},2),s->L_(s_0)+L_(s_1))

o6 = {{0, 1, 0, 0, 0}, {1, -1, 1, 0, 0}, {-1, 0, 1, 0, 0}, {1, 0, -1, 1, 0},
     ------------------------------------------------------------------------
     {-1, 1, -1, 1, 0}, {0, -1, 0, 1, 0}, {1, 0, 0, -1, 1}, {-1, 1, 0, -1,
     ------------------------------------------------------------------------
     1}, {0, -1, 1, -1, 1}, {0, 0, -1, 0, 1}, {1, 0, 0, 0, -1}, {-1, 1, 0, 0,
     ------------------------------------------------------------------------
     -1}, {0, -1, 1, 0, -1}, {0, 0, -1, 1, -1}, {0, 0, 0, -1, 0}}

o6 : List

i7 : D=dynkinType{{"A",5}}; setWeights(R,D,W)

o8 = Tally{{0, 1, 0, 0, 0} => 1}

o8 : Tally

i9 : getWeights(p_(0,1)*p_(1,2))

o9 = {-1, 1, 1, 0, 0}

o9 : List

i10 : highestWeightsDecomposition(RI)

o10 = HashTable{0 => HashTable{{0} => Tally{{0, 0, 0, 0, 0} => 1}}}
                1 => HashTable{{2} => Tally{{0, 0, 0, 1, 0} => 1}}
                2 => HashTable{{3} => Tally{{1, 0, 0, 0, 1} => 1}}
                3 => HashTable{{4} => Tally{{2, 0, 0, 0, 0} => 1}}
                               {5} => Tally{{0, 0, 0, 0, 2} => 1}
                4 => HashTable{{6} => Tally{{1, 0, 0, 0, 1} => 1}}
                5 => HashTable{{7} => Tally{{0, 1, 0, 0, 0} => 1}}
                6 => HashTable{{9} => Tally{{0, 0, 0, 0, 0} => 1}}

o10 : HashTable

i11 : Q=R/I; highestWeightsDecomposition(Q,0,4)

o12 = HashTable{0 => Tally{{0, 0, 0, 0, 0} => 1}}
                1 => Tally{{0, 1, 0, 0, 0} => 1}
                2 => Tally{{0, 2, 0, 0, 0} => 1}
                3 => Tally{{0, 3, 0, 0, 0} => 1}
                4 => Tally{{0, 4, 0, 0, 0} => 1}

o12 : HashTable

i13 : highestWeightsDecomposition(R,2)

o13 = Tally{{0, 0, 0, 1, 0} => 1}
            {0, 2, 0, 0, 0} => 1

o13 : Tally

i14 : highestWeightsDecomposition(I,2)

o14 = Tally{{0, 0, 0, 1, 0} => 1}

o14 : Tally

i15 : 
