-- -*- M2-comint -*- hash: 579480957

i1 : R=QQ[x_{1,2,3},x_{1,2,4},x_{1,2,5},x_{1,2,6},x_{1,3,4},x_{1,3,5},x_{1,4,5},x_{1,4,6},x_{1,5,6},x_{2,3,4},x_{2,4,5},x_{2,4,6},x_{3,4,5},x_{4,5,6}]

o1 = R

o1 : PolynomialRing

i2 : X=matrix{{x_{2,3,4},-x_{1,3,4},x_{1,2,4}},{-x_{1,3,4},-x_{1,3,5},x_{1,2,5}},{x_{1,2,4},x_{1,2,5},x_{1,2,6}}}

o2 = | x_{2, 3, 4}  -x_{1, 3, 4} x_{1, 2, 4} |
     | -x_{1, 3, 4} -x_{1, 3, 5} x_{1, 2, 5} |
     | x_{1, 2, 4}  x_{1, 2, 5}  x_{1, 2, 6} |

             3       3
o2 : Matrix R  <--- R

i3 : Y=matrix{{x_{1,5,6},-x_{1,4,6},x_{1,4,5}},{-x_{1,4,6},-x_{2,4,6},x_{2,4,5}},{x_{1,4,5},x_{2,4,5},x_{3,4,5}}}

o3 = | x_{1, 5, 6}  -x_{1, 4, 6} x_{1, 4, 5} |
     | -x_{1, 4, 6} -x_{2, 4, 6} x_{2, 4, 5} |
     | x_{1, 4, 5}  x_{2, 4, 5}  x_{3, 4, 5} |

             3       3
o3 : Matrix R  <--- R

i4 : Delta=(x_{1,2,3}*x_{4,5,6}-trace(X*Y))^2+4*x_{1,2,3}*det(Y)+4*x_{4,5,6}*det(X)-4*sum(3,i->sum(3,j->det(submatrix'(X,{i},{j}))*det(submatrix'(Y,{i},{j}))));

i5 : I=ideal jacobian ideal Delta;

o5 : Ideal of R

i6 : RI=res I; betti RI

            0  1  2  3 4
o7 = total: 1 14 21 14 6
         0: 1  .  .  . .
         1: .  .  .  . .
         2: . 14 21  . .
         3: .  .  . 14 6

o7 : BettiTally

i8 : v_1={1,0,0}; v_2={0,1,0}; v_3={0,0,1}; v_4={-1,0,0}; v_5={0,-1,0}; v_6={0,0,-1};

i14 : ind = apply(gens R,g->(baseName g)#1)

o14 = {{1, 2, 3}, {1, 2, 4}, {1, 2, 5}, {1, 2, 6}, {1, 3, 4}, {1, 3, 5}, {1,
      -----------------------------------------------------------------------
      4, 5}, {1, 4, 6}, {1, 5, 6}, {2, 3, 4}, {2, 4, 5}, {2, 4, 6}, {3, 4,
      -----------------------------------------------------------------------
      5}, {4, 5, 6}}

o14 : List

i15 : W'=apply(ind,j->v_(j_0)+v_(j_1)+v_(j_2))

o15 = {{1, 1, 1}, {0, 1, 0}, {1, 0, 0}, {1, 1, -1}, {0, 0, 1}, {1, -1, 1},
      -----------------------------------------------------------------------
      {0, -1, 0}, {0, 0, -1}, {1, -1, -1}, {-1, 1, 1}, {-1, 0, 0}, {-1, 1,
      -----------------------------------------------------------------------
      -1}, {-1, -1, 1}, {-1, -1, -1}}

o15 : List

i16 : M=inverse promote(matrix{{1,0,0},{-1,1,0},{0,-1,2}},QQ)

o16 = | 1   0   0   |
      | 1   1   0   |
      | 1/2 1/2 1/2 |

               3        3
o16 : Matrix QQ  <--- QQ

i17 : D=dynkinType{{"C",3}}

o17 = DynkinType{{C, 3}}

o17 : DynkinType

i18 : N=transpose promote(cartanMatrix(rootSystem(D)),QQ)

o18 = | 2  -1 0  |
      | -1 2  -2 |
      | 0  -1 2  |

               3        3
o18 : Matrix QQ  <--- QQ

i19 : W=entries transpose lift(N*M*(transpose matrix W'),ZZ)

o19 = {{0, 0, 1}, {-1, 1, 0}, {1, 0, 0}, {0, 2, -1}, {0, -1, 1}, {2, -2, 1},
      -----------------------------------------------------------------------
      {1, -1, 0}, {0, 1, -1}, {2, 0, -1}, {-2, 0, 1}, {-1, 0, 0}, {-2, 2,
      -----------------------------------------------------------------------
      -1}, {0, -2, 1}, {0, 0, -1}}

o19 : List

i20 : setWeights(R,D,W)

o20 = Tally{{0, 0, 1} => 1}

o20 : Tally

i21 : highestWeightsDecomposition(RI)

o21 = HashTable{0 => HashTable{{0} => Tally{{0, 0, 0} => 1}}}
                1 => HashTable{{3} => Tally{{0, 0, 1} => 1}}
                2 => HashTable{{4} => Tally{{2, 0, 0} => 1}}
                3 => HashTable{{6} => Tally{{0, 1, 0} => 1}}
                4 => HashTable{{7} => Tally{{1, 0, 0} => 1}}

o21 : HashTable

i22 : highestWeightsDecomposition(R/I,0,4)

o22 = HashTable{0 => Tally{{0, 0, 0} => 1}}
                1 => Tally{{0, 0, 1} => 1}
                2 => Tally{{0, 0, 2} => 1}
                           {2, 0, 0} => 1
                3 => Tally{{0, 0, 3} => 1}
                           {2, 0, 1} => 1
                4 => Tally{{0, 0, 4} => 1}
                           {2, 0, 2} => 1
                           {4, 0, 0} => 1

o22 : HashTable

i23 : 
