-- -*- M2-comint -*- hash: 1229610852

i1 : R=QQ[x_(-2, 1),x_(-1, 0),x_(-1, 1),x_(0, 0),x_(1,-1),x_(1, 0),x_(2,-1)]

o1 = R

o1 : PolynomialRing

i2 : m=ideal vars R;

o2 : Ideal of R

i3 : K=koszul gens m; betti K

            0 1  2  3  4  5 6 7
o4 = total: 1 7 21 35 35 21 7 1
         0: 1 7 21 35 35 21 7 1

o4 : BettiTally

i5 : W={{-2, 1},{-1, 0},{-1, 1},{0, 0},{1,-1},{1, 0},{2,-1}}

o5 = {{-2, 1}, {-1, 0}, {-1, 1}, {0, 0}, {1, -1}, {1, 0}, {2, -1}}

o5 : List

i6 : D=dynkinType{{"G",2}}; setWeights(R,D,W)

o7 = Tally{{1, 0} => 1}

o7 : Tally

i8 : highestWeightsDecomposition(K,Range=>{0,3})

o8 = HashTable{0 => HashTable{{0} => Tally{{0, 0} => 1}}}
               1 => HashTable{{1} => Tally{{1, 0} => 1}}
               2 => HashTable{{2} => Tally{{0, 1} => 1}}
                                           {1, 0} => 1
               3 => HashTable{{3} => Tally{{0, 0} => 1}}
                                           {1, 0} => 1
                                           {2, 0} => 1

o8 : HashTable

i9 : highestWeightsDecomposition(m,0,4)

o9 = HashTable{0 => Tally{}           }
               1 => Tally{{1, 0} => 1}
               2 => Tally{{0, 0} => 1}
                          {2, 0} => 1
               3 => Tally{{1, 0} => 1}
                          {3, 0} => 1
               4 => Tally{{0, 0} => 1}
                          {2, 0} => 1
                          {4, 0} => 1

o9 : HashTable

i10 : highestWeightsDecomposition(R,0,4)

o10 = HashTable{0 => Tally{{0, 0} => 1}}
                1 => Tally{{1, 0} => 1}
                2 => Tally{{0, 0} => 1}
                           {2, 0} => 1
                3 => Tally{{1, 0} => 1}
                           {3, 0} => 1
                4 => Tally{{0, 0} => 1}
                           {2, 0} => 1
                           {4, 0} => 1

o10 : HashTable

i11 : 
