-- -*- M2-comint -*- hash: -2034803126

i1 : R=QQ[x_(1,1)..x_(3,2),y_(1,1)..y_(4,2),Degrees=>{6:{1,0},8:{0,1}}]

o1 = R

o1 : PolynomialRing

i2 : G=genericMatrix(R,2,3)|genericMatrix(R,y_(1,1),2,4)

o2 = | x_(1,1) x_(2,1) x_(3,1) y_(1,1) y_(2,1) y_(3,1) y_(4,1) |
     | x_(1,2) x_(2,2) x_(3,2) y_(1,2) y_(2,2) y_(3,2) y_(4,2) |

             2       7
o2 : Matrix R  <--- R

i3 : I=minors(2,G);

o3 : Ideal of R

i4 : EN=res I; betti EN

            0  1  2   3  4  5 6
o5 = total: 1 21 70 105 84 35 6
         0: 1  .  .   .  .  . .
         1: . 21 70 105 84 35 6

o5 : BettiTally

i6 : e={{1,0},{-1,1},{0,-1}}

o6 = {{1, 0}, {-1, 1}, {0, -1}}

o6 : List

i7 : f={{1,0,0},{-1,1,0},{0,-1,1},{0,0,-1}}

o7 = {{1, 0, 0}, {-1, 1, 0}, {0, -1, 1}, {0, 0, -1}}

o7 : List

i8 : h={{1},{-1}}

o8 = {{1}, {-1}}

o8 : List

i9 : W=(flatten table(e,h,(u,v)->u|{0,0,0}|v))|(flatten table(f,h,(u,v)->{0,0}|u|v))

o9 = {{1, 0, 0, 0, 0, 1}, {1, 0, 0, 0, 0, -1}, {-1, 1, 0, 0, 0, 1}, {-1, 1,
     ------------------------------------------------------------------------
     0, 0, 0, -1}, {0, -1, 0, 0, 0, 1}, {0, -1, 0, 0, 0, -1}, {0, 0, 1, 0, 0,
     ------------------------------------------------------------------------
     1}, {0, 0, 1, 0, 0, -1}, {0, 0, -1, 1, 0, 1}, {0, 0, -1, 1, 0, -1}, {0,
     ------------------------------------------------------------------------
     0, 0, -1, 1, 1}, {0, 0, 0, -1, 1, -1}, {0, 0, 0, 0, -1, 1}, {0, 0, 0, 0,
     ------------------------------------------------------------------------
     -1, -1}}

o9 : List

i10 : D=dynkinType{{"A",2},{"A",3},{"A",1}}; setWeights(R,D,W)

o11 = Tally{{0, 0, 1, 0, 0, 1} => 1}
            {1, 0, 0, 0, 0, 1} => 1

o11 : Tally

i12 : highestWeightsDecomposition(EN)

o12 = HashTable{0 => HashTable{{0, 0} => Tally{{0, 0, 0, 0, 0, 0} => 1}}}
                1 => HashTable{{0, 2} => Tally{{0, 0, 0, 1, 0, 0} => 1}}
                               {1, 1} => Tally{{1, 0, 1, 0, 0, 0} => 1}
                               {2, 0} => Tally{{0, 1, 0, 0, 0, 0} => 1}
                2 => HashTable{{0, 3} => Tally{{0, 0, 0, 0, 1, 1} => 1}}
                               {1, 2} => Tally{{1, 0, 0, 1, 0, 1} => 1}
                               {2, 1} => Tally{{0, 1, 1, 0, 0, 1} => 1}
                               {3, 0} => Tally{{0, 0, 0, 0, 0, 1} => 1}
                3 => HashTable{{0, 4} => Tally{{0, 0, 0, 0, 0, 2} => 1}}
                               {1, 3} => Tally{{1, 0, 0, 0, 1, 2} => 1}
                               {2, 2} => Tally{{0, 1, 0, 1, 0, 2} => 1}
                               {3, 1} => Tally{{0, 0, 1, 0, 0, 2} => 1}
                4 => HashTable{{1, 4} => Tally{{1, 0, 0, 0, 0, 3} => 1}}
                               {2, 3} => Tally{{0, 1, 0, 0, 1, 3} => 1}
                               {3, 2} => Tally{{0, 0, 0, 1, 0, 3} => 1}
                5 => HashTable{{2, 4} => Tally{{0, 1, 0, 0, 0, 4} => 1}}
                               {3, 3} => Tally{{0, 0, 0, 0, 1, 4} => 1}
                6 => HashTable{{3, 4} => Tally{{0, 0, 0, 0, 0, 5} => 1}}

o12 : HashTable

i13 : Q=R/I

o13 = Q

o13 : QuotientRing

i14 : highestWeightsDecomposition(Q,{2,0})

o14 = Tally{{2, 0, 0, 0, 0, 2} => 1}

o14 : Tally

i15 : highestWeightsDecomposition(Q,{1,1})

o15 = Tally{{1, 0, 1, 0, 0, 2} => 1}

o15 : Tally

i16 : highestWeightsDecomposition(Q,{0,2})

o16 = Tally{{0, 0, 2, 0, 0, 2} => 1}

o16 : Tally

i17 : 
