-- -*- M2-comint -*- hash: 1982528613

i1 : R=QQ[x_(1,1)..x_(3,4)];

i2 : G=genericMatrix(R,4,3)

o2 = | x_(1,1) x_(2,1) x_(3,1) |
     | x_(1,2) x_(2,2) x_(3,2) |
     | x_(1,3) x_(2,3) x_(3,3) |
     | x_(1,4) x_(2,4) x_(3,4) |

             4       3
o2 : Matrix R  <--- R

i3 : I=minors(2,G);

o3 : Ideal of R

i4 : D=dynkinType{{"A",2},{"A",3}};

i5 : U={{1,0,1,0,0},{1,0,-1,1,0},{1,0,0,-1,1},{1,0,0,0,-1},{-1,1,1,0,0},{-1,1,-1,1,0},{-1,1,0,-1,1},{-1,1,0,0,-1},{0,-1,1,0,0},{0,-1,-1,1,0},{0,-1,0,-1,1},{0,-1,0,0,-1}};

i6 : setWeights(R,D,U)

o6 = Tally{{1, 0, 1, 0, 0} => 1}

o6 : Tally

i7 : highestWeightsDecomposition(I,{2})

o7 = Tally{{0, 1, 0, 1, 0} => 1}

o7 : Tally

i8 : highestWeightsDecomposition(I,2)

o8 = Tally{{0, 1, 0, 1, 0} => 1}

o8 : Tally

i9 : highestWeightsDecomposition(I,0,4)

o9 = HashTable{0 => Tally{}                    }
               1 => Tally{}
               2 => Tally{{0, 1, 0, 1, 0} => 1}
               3 => Tally{{0, 0, 0, 0, 1} => 1}
                          {1, 1, 1, 1, 0} => 1
               4 => Tally{{0, 2, 0, 2, 0} => 1}
                          {1, 0, 1, 0, 1} => 1
                          {2, 1, 2, 1, 0} => 1

o9 : HashTable

i10 : 
