-- -*- M2-comint -*- hash: -653461845

i1 : R=QQ[x_(1,1)..x_(3,4)];

i2 : G=genericMatrix(R,4,3)

o2 = | x_(1,1) x_(2,1) x_(3,1) |
     | x_(1,2) x_(2,2) x_(3,2) |
     | x_(1,3) x_(2,3) x_(3,3) |
     | x_(1,4) x_(2,4) x_(3,4) |

             4       3
o2 : Matrix R  <--- R

i3 : I=minors(2,G);

o3 : Ideal of R

i4 : resI=res I

      1      18      52      60      34      12      3
o4 = R  <-- R   <-- R   <-- R   <-- R   <-- R   <-- R  <-- 0
                                                            
     0      1       2       3       4       5       6      7

o4 : ChainComplex

i5 : betti resI

            0  1  2  3  4  5 6
o5 = total: 1 18 52 60 34 12 3
         0: 1  .  .  .  .  . .
         1: . 18 52 60 24  . .
         2: .  .  .  . 10 12 3

o5 : BettiTally

i6 : D=dynkinType{{"A",2},{"A",3}};

i7 : U={{1,0,1,0,0},{1,0,-1,1,0},{1,0,0,-1,1},{1,0,0,0,-1},{-1,1,1,0,0},{-1,1,-1,1,0},{-1,1,0,-1,1},{-1,1,0,0,-1},{0,-1,1,0,0},{0,-1,-1,1,0},{0,-1,0,-1,1},{0,-1,0,0,-1}};

i8 : setWeights(R,D,U)

o8 = Tally{{1, 0, 1, 0, 0} => 1}

o8 : Tally

i9 : highestWeightsDecomposition(resI,0,{{0,0,0,0,0}})

o9 = HashTable{0 => HashTable{{0} => Tally{{0, 0, 0, 0, 0} => 1}}}
               1 => HashTable{{2} => Tally{{0, 1, 0, 1, 0} => 1}}
               2 => HashTable{{3} => Tally{{0, 0, 1, 1, 0} => 1}}
                                           {1, 1, 0, 0, 1} => 1
               3 => HashTable{{4} => Tally{{1, 0, 1, 0, 1} => 1}}
                                           {2, 1, 0, 0, 0} => 1
               4 => HashTable{{5} => Tally{{2, 0, 1, 0, 0} => 1}}
                              {6} => Tally{{0, 0, 0, 0, 2} => 1}
               5 => HashTable{{7} => Tally{{1, 0, 0, 0, 1} => 1}}
               6 => HashTable{{8} => Tally{{0, 1, 0, 0, 0} => 1}}

o9 : HashTable

i10 : highestWeightsDecomposition(resI,0,{{0,0,0,0,0}},Range=>{0,2})

o10 = HashTable{0 => HashTable{{0} => Tally{{0, 0, 0, 0, 0} => 1}}}
                1 => HashTable{{2} => Tally{{0, 1, 0, 1, 0} => 1}}
                2 => HashTable{{3} => Tally{{0, 0, 1, 1, 0} => 1}}
                                            {1, 1, 0, 0, 1} => 1

o10 : HashTable

i11 : highestWeightsDecomposition(resI)

o11 = HashTable{0 => HashTable{{0} => Tally{{0, 0, 0, 0, 0} => 1}}}
                1 => HashTable{{2} => Tally{{0, 1, 0, 1, 0} => 1}}
                2 => HashTable{{3} => Tally{{0, 0, 1, 1, 0} => 1}}
                                            {1, 1, 0, 0, 1} => 1
                3 => HashTable{{4} => Tally{{1, 0, 1, 0, 1} => 1}}
                                            {2, 1, 0, 0, 0} => 1
                4 => HashTable{{5} => Tally{{2, 0, 1, 0, 0} => 1}}
                               {6} => Tally{{0, 0, 0, 0, 2} => 1}
                5 => HashTable{{7} => Tally{{1, 0, 0, 0, 1} => 1}}
                6 => HashTable{{8} => Tally{{0, 1, 0, 0, 0} => 1}}

o11 : HashTable

i12 : 
