-- -*- M2-comint -*- hash: -1864435592

i1 : R=QQ[x_(1,1)..x_(3,4)];

i2 : G=genericMatrix(R,4,3)

o2 = | x_(1,1) x_(2,1) x_(3,1) |
     | x_(1,2) x_(2,2) x_(3,2) |
     | x_(1,3) x_(2,3) x_(3,3) |
     | x_(1,4) x_(2,4) x_(3,4) |

             4       3
o2 : Matrix R  <--- R

i3 : I=minors(2,G);

o3 : Ideal of R

i4 : Q=R/I;

i5 : D=dynkinType{{"A",2},{"A",3}};

i6 : U={{1,0,1,0,0},{1,0,-1,1,0},{1,0,0,-1,1},{1,0,0,0,-1},{-1,1,1,0,0},{-1,1,-1,1,0},{-1,1,0,-1,1},{-1,1,0,0,-1},{0,-1,1,0,0},{0,-1,-1,1,0},{0,-1,0,-1,1},{0,-1,0,0,-1}};

i7 : setWeights(R,D,U)

o7 = Tally{{1, 0, 1, 0, 0} => 1}

o7 : Tally

i8 : highestWeightsDecomposition(Q,{2})

o8 = Tally{{2, 0, 2, 0, 0} => 1}

o8 : Tally

i9 : highestWeightsDecomposition(Q,2)

o9 = Tally{{2, 0, 2, 0, 0} => 1}

o9 : Tally

i10 : highestWeightsDecomposition(Q,0,4)

o10 = HashTable{0 => Tally{{0, 0, 0, 0, 0} => 1}}
                1 => Tally{{1, 0, 1, 0, 0} => 1}
                2 => Tally{{2, 0, 2, 0, 0} => 1}
                3 => Tally{{3, 0, 3, 0, 0} => 1}
                4 => Tally{{4, 0, 4, 0, 0} => 1}

o10 : HashTable

i11 : 
