-- -*- M2-comint -*- hash: -2017118694

i1 : R=QQ[x_(1,1)..x_(4,2)];

i2 : D=dynkinType{{"A",1},{"A",3}};

i3 : U={{1,1,0,0},{-1,1,0,0},{1,-1,1,0},{-1,-1,1,0},{1,0,-1,1},{-1,0,-1,1},{1,0,0,-1},{-1,0,0,-1}};

i4 : setWeights(R,D,U);

i5 : G=genericMatrix(R,2,4);

             2       4
o5 : Matrix R  <--- R

i6 : M=coker G

o6 = cokernel | x_(1,1) x_(2,1) x_(3,1) x_(4,1) |
              | x_(1,2) x_(2,2) x_(3,2) x_(4,2) |

                            2
o6 : R-module, quotient of R

i7 : highestWeightsDecomposition(M,{2},{{-1,0,0,0},{1,0,0,0}})

o7 = Tally{{3, 2, 0, 0} => 1}

o7 : Tally

i8 : highestWeightsDecomposition(M,2,{{-1,0,0,0},{1,0,0,0}})

o8 = Tally{{3, 2, 0, 0} => 1}

o8 : Tally

i9 : highestWeightsDecomposition(M,0,4,{{-1,0,0,0},{1,0,0,0}})

o9 = HashTable{0 => Tally{{1, 0, 0, 0} => 1}}
               1 => Tally{{2, 1, 0, 0} => 1}
               2 => Tally{{3, 2, 0, 0} => 1}
               3 => Tally{{4, 3, 0, 0} => 1}
               4 => Tally{{5, 4, 0, 0} => 1}

o9 : HashTable

i10 : 
