-- -*- M2-comint -*- hash: 1448270117

i1 : R=QQ[x_(1,1)..x_(2,4)];

i2 : D=dynkinType{{"A",1},{"A",3}};

i3 : U={{1,1,0,0},{1,-1,1,0},{1,0,-1,1},{1,0,0,-1},{-1,1,0,0},{-1,-1,1,0},{-1,0,-1,1},{-1,0,0,-1}};

i4 : setWeights(R,D,U);

i5 : M=map(R^2,R^{4:-1},{{x_(1,1),x_(1,1)+x_(1,2),x_(1,3),x_(1,4)},{x_(2,1),x_(2,2)+x_(2,1),x_(2,3),x_(2,4)}})

o5 = | x_(1,1) x_(1,1)+x_(1,2) x_(1,3) x_(1,4) |
     | x_(2,1) x_(2,1)+x_(2,2) x_(2,3) x_(2,4) |

             2       4
o5 : Matrix R  <--- R

i6 : (V,C)=propagateWeights(M,{{-1,0,0,0},{1,0,0,0}});

i7 : V

o7 = {{0, 0, 0, -1}, {0, 0, -1, 1}, {0, -1, 1, 0}, {0, 1, 0, 0}}

o7 : List

i8 : C

o8 = {1} | 0 0 0 1 |
     {1} | 0 0 1 0 |
     {1} | 0 1 0 0 |
     {1} | 1 1 0 0 |

             4       4
o8 : Matrix R  <--- R

i9 : M*inverse(C)

o9 = | x_(1,4) x_(1,3) x_(1,2) x_(1,1) |
     | x_(2,4) x_(2,3) x_(2,2) x_(2,1) |

             2       4
o9 : Matrix R  <--- R

i10 : 
