-- -*- M2-comint -*- hash: -938473291

i1 : fout = openOut "curve_example0";

i2 : F = QQ;

i3 : d = 1;

i4 : P0 = F[a_{0,0}..a_{0,d}];

i5 : R0 = P0[x_{0,0}..x_{0,d},
     Weights=> entries negLexMatrix(d),Global=>false];

i6 : b0 = x_{0,0}^3+x_{0,0}*x_{0,1}+x_{0,1}^5;

i7 : n0 = {};

i8 : e0 = ideal(a_{0,0}^3+a_{0,0}*a_{0,1}+a_{0,1}^5);

o8 : Ideal of P0

i9 : tree = arcs(b0,e0,n0,fout);

i10 : b1 = x_{0,0}^3+x_{0,0}^2*x_{0,1}^4+x_{0,1}^5;

i11 : n1 = {};

i12 : e1 = ideal(a_{0,0},a_{0,1});

o12 : Ideal of P0

i13 : tree = arcs(b1,e1,n1,fout);     

i14 : fout << close;

i15 : 
