-- -*- M2-comint -*- hash: -863467687

i1 : QQ[x_1,x_0,x_3,x_5,x_4,x_2,MonomialOrder=>Lex]

o1 = QQ[x , x , x , x , x , x ]
         1   0   3   5   4   2

o1 : PolynomialRing

i2 : rnc = minors(2, matrix{{x_0..x_4},{x_1..x_5}})

               2                                2                       
o2 = ideal (- x  + x x , - x x  + x x , x x  - x , - x x  + x x , x x  -
               1    0 2     1 2    0 3   1 3    2     1 3    0 4   1 4  
     ------------------------------------------------------------------------
              2                                                            2
     x x , - x  + x x , - x x  + x x , x x  - x x , - x x  + x x , x x  - x )
      3 2     3    4 2     1 4    0 5   1 5    4 2     3 4    5 2   3 5    4

o2 : Ideal of QQ[x , x , x , x , x , x ]
                  1   0   3   5   4   2

i3 : allowableThreads  =  4

o3 = 4

i4 : g = tgb(rnc)

                                        3
o4 = LineageTable{(1, 2) => - x x x  + x   }
                               0 4 2    2
                                          2
                  (1, 4) => - x x x  + x x
                               0 5 2    3 2
                                 2      2
                  (1, 7) => - x x  + x x
                               0 4    4 2
                                    2
                  (2, 3) => x x  - x
                             0 4    2
                  (4, 6) => x x  - x x
                             0 5    3 2
                               2      3
                  (8, 9) => - x x  + x
                               5 2    4
                          2
                  0 => - x  + x x
                          1    0 2
                  1 => - x x  + x x
                          1 2    0 3
                               2
                  2 => x x  - x
                        1 3    2
                  3 => - x x  + x x
                          1 3    0 4
                  4 => x x  - x x
                        1 4    3 2
                          2
                  5 => - x  + x x
                          3    4 2
                  6 => - x x  + x x
                          1 4    0 5
                  7 => x x  - x x
                        1 5    4 2
                  8 => - x x  + x x
                          3 4    5 2
                               2
                  9 => x x  - x
                        3 5    4

o4 : LineageTable

i5 : g#1

o5 = - x x  + x x
        1 2    0 3

o5 : QQ[x , x , x , x , x , x ]
         1   0   3   5   4   2

i6 : g#2

             2
o6 = x x  - x
      1 3    2

o6 : QQ[x , x , x , x , x , x ]
         1   0   3   5   4   2

i7 : g#(1,2)

                 3
o7 = - x x x  + x
        0 4 2    2

o7 : QQ[x , x , x , x , x , x ]
         1   0   3   5   4   2

i8 : minimize g

o8 = LineageTable{(1, 2) => null       }
                  (1, 4) => null
                  (1, 7) => null
                                    2
                  (2, 3) => x x  - x
                             0 4    2
                  (4, 6) => x x  - x x
                             0 5    3 2
                             2      3
                  (8, 9) => x x  - x
                             5 2    4
                        2
                  0 => x  - x x
                        1    0 2
                  1 => x x  - x x
                        1 2    0 3
                  2 => null
                  3 => x x  - x x
                        1 3    0 4
                  4 => null
                        2
                  5 => x  - x x
                        3    4 2
                  6 => x x  - x x
                        1 4    0 5
                  7 => x x  - x x
                        1 5    4 2
                  8 => x x  - x x
                        3 4    5 2
                               2
                  9 => x x  - x
                        3 5    4

o8 : LineageTable

i9 : gRed = reduce g

o9 = LineageTable{(1, 2) => null       }
                  (1, 4) => null
                  (1, 7) => null
                                    2
                  (2, 3) => x x  - x
                             0 4    2
                  (4, 6) => x x  - x x
                             0 5    3 2
                             2      3
                  (8, 9) => x x  - x
                             5 2    4
                        2
                  0 => x  - x x
                        1    0 2
                  1 => x x  - x x
                        1 2    0 3
                  2 => null
                               2
                  3 => x x  - x
                        1 3    2
                  4 => null
                        2
                  5 => x  - x x
                        3    4 2
                  6 => x x  - x x
                        1 4    3 2
                  7 => x x  - x x
                        1 5    4 2
                  8 => x x  - x x
                        3 4    5 2
                               2
                  9 => x x  - x
                        3 5    4

o9 : LineageTable

i10 : matrix gRed

o10 = | x_1^2-x_0x_2 x_1x_2-x_0x_3 x_1x_3-x_2^2 x_0x_5-x_3x_2 x_3^2-x_4x_2
      -----------------------------------------------------------------------
      x_1x_4-x_3x_2 x_1x_5-x_4x_2 x_3x_4-x_5x_2 x_3x_5-x_4^2 x_5^2x_2-x_4^3
      -----------------------------------------------------------------------
      x_0x_4-x_2^2 |

                                         1                                  11
o10 : Matrix (QQ[x , x , x , x , x , x ])  <--- (QQ[x , x , x , x , x , x ])
                  1   0   3   5   4   2              1   0   3   5   4   2

i11 : QQ[a..d]

o11 = QQ[a..d]

o11 : PolynomialRing

i12 : I=ideal( -c^3+a^2+b*d, a*b*c-1,a*b*c)

                3    2
o12 = ideal (- c  + a  + b*d, a*b*c - 1, a*b*c)

o12 : Ideal of QQ[a..d]

i13 : allowableThreads =  2;

i14 : T = tgb(I,Verbose=>true)
Scheduling a task for lineage (0,1)
Scheduling a task for lineage (0,2)
Scheduling a task for lineage (1,2)
Scheduling task for lineage ((0,1),0)Sched
lig task for lineage Scheduling task for lineage ((0,2),0)
((0,1),1)
Scheduling task for lineage Scheduling task for lineage ((0,1),2)
Adding the following remainder to GB: ((0,2),1)
Adding the following remainder to GB: Scheduling task for lineage ((0,2),2)
Adding the following remainder to GB: -1 from lineage (1,2)
Found a unit in the Groebner basis; reducing now.
-a^3*b-a*b^2*d+c^2 from lineage -a^3*b-a*b^2*d from lineage (0,1)(0,2)


o14 = LineageTable{(0, 1) => null}
                   (0, 2) => null
                   (1, 2) => 1
                   0 => null
                   1 => null
                   2 => null

o14 : LineageTable

i15 : allowableThreads = 1;

i16 : 
