-- -*- M2-comint -*- hash: 635978407

i1 : R = ZZ/101[a,b,c];

i2 : allowableThreads= 2;

i3 : T = reduce tgb( ideal "abc+c2,ab2-b3c+ac,b2")

o3 = LineageTable{((0, 1), 0) => null}
                  ((0, 2), 0) => null
                                  2
                  ((1, 2), 0) => c
                  (0, 1) => null
                  (0, 2) => null
                  (1, 2) => a*c
                  0 => null
                  1 => null
                        2
                  2 => b

o3 : LineageTable

i4 : matrix T

o4 = | b2 c2 ac |

             1       3
o4 : Matrix R  <--- R

i5 : 
