-- -*- M2-comint -*- hash: 1723924520

i1 : R = ZZ/101[a,b,c];

i2 : allowableThreads= 2;

i3 : T = tgb( ideal "abc+c2,ab2-b3c+ac,b2")

                                        3
o3 = LineageTable{(((0, 1), 0), 0) => -c }
                                     2
                  ((0, 1), 0) => -a*c
                                   2
                  ((1, 2), 0) => -c
                             2
                  (0, 1) => a c
                               2
                  (0, 2) => b*c
                  (1, 2) => -a*c
                                2
                  0 => a*b*c + c
                          3       2
                  1 => - b c + a*b  + a*c
                        2
                  2 => b

o3 : LineageTable

i4 : minimize T

o4 = LineageTable{(((0, 1), 0), 0) => null}
                  ((0, 1), 0) => null
                                  2
                  ((1, 2), 0) => c
                  (0, 1) => null
                  (0, 2) => null
                  (1, 2) => a*c
                  0 => null
                  1 => null
                        2
                  2 => b

o4 : LineageTable

i5 : 
