-- -*- M2-comint -*- hash: 1220246903

i1 : R = ZZ/101[x,y,z, MonomialOrder=>Lex];

i2 : I = ideal {2*x + 10*y^2*z, 8*x^2*y + 10*x*y*z^3, 5*x*y^3*z^2 + 9*x*z^3, 9*x*y^3*z + 10*x*y^3};

o2 : Ideal of R

i3 : allowableThreads  = 4;

i4 : H = tgb I

                                             2 8
o4 = LineageTable{((((0, 1), 2), 1), 2) => 9y z  }
                                          3 6
                  (((0, 1), 2), 1) => -40y z
                                        2 9
                  (((0, 1), 3), 2) => 9y z
                                   4 4     3 7
                  ((0, 1), 2) => 9y z  - 6y z
                                     3 7      3 6
                  ((0, 1), 3) => - 6y z  + 27y z
                                              2 4
                  ((0, 2), ((0, 1), 2)) => 41y z
                                 5 2      3 4
                  (0, 1) => - 25y z  - 19y z
                                 3 5     2 4
                  (0, 2) => - 24y z  + 9y z
                               5       3 4
                  (0, 3) => 28y z - 24y z
                               2 5
                  (1, 2) => 31y z
                              3 4     2 4
                  (2, 3) => 7y z  - 9y z
                               2
                  0 => 2x + 10y z
                         2           3
                  1 => 8x y + 10x*y*z
                           3 2       3
                  2 => 5x*y z  + 9x*z
                           3         3
                  3 => 9x*y z + 10x*y

o4 : LineageTable

i5 : H#(0,1)

          5 2      3 4
o5 = - 25y z  - 19y z

o5 : R

i6 : QQ[a..d];

i7 : f0 = a*b-c^2;

i8 : f1 = b*c-d^2;

i9 : allowableThreads=2;

i10 : tgb({f0,f1},Verbose=>true)
Scheduling a task for lineage (0,1)
Scheduling task for lineage ((0,1),0)
Scheduling task for lineage ((0,1),1)
Adding the following remainder to GB: -c^3+a*d^2 from lineage (0,1)

                                3      2
o10 = LineageTable{(0, 1) => - c  + a*d }
                               2
                   0 => a*b - c
                               2
                   1 => b*c - d

o10 : LineageTable

i11 : 
