-- -*- M2-comint -*- hash: 1860905490

i1 : declareVariable X

o1 = X

o1 : InputGate

i2 : declareVariable Y

o2 = Y

o2 : InputGate

i3 : inputGate 3

o3 = 3

o3 : InputGate

i4 : X + 1

o4 = (X + 1)

o4 : SumGate

i5 : sumGate{X,Y}

o5 = (X + Y)

o5 : SumGate

i6 : 2*Y

o6 = (2 * Y)

o6 : ProductGate

i7 : productGate{X,-X,Y}

o7 = (X * (-1 * X) * Y)

o7 : ProductGate

i8 : X / Y

     X
o8 = -
     Y

o8 : DivideGate

i9 : detGate {{X, Y}, {-Y, X}}

o9 = det| X        Y |
        | (-1 * Y) X |

o9 : DetGate

i10 : det matrix{{Y, 1}, {-1, X}}

o10 = det| Y  1 |
         | -1 X |

o10 : DetGate

i11 : 
