-- -*- M2-comint -*- hash: 1814051019

i1 : declareVariable X

o1 = X

o1 : InputGate

i2 : declareVariable Y

o2 = Y

o2 : InputGate

i3 : h = valueHashTable({X,Y},{1,ii})

o3 = ValueHashTable{...2...}

o3 : ValueHashTable

i4 : peek h

o4 = ValueHashTable{X => 1 }
                    Y => ii

i5 : 
