-- -*- M2-comint -*- hash: 1265923663

i1 : PP3 = toricProjectiveSpace 3;

i2 : A0 = intersectionRing PP3

o2 = A0

o2 : QuotientRing

i3 : assert (# rays PP3 === numgens A0)

i4 : ideal A0

o4 = ideal (t t t t , - t  + t , - t  + t , - t  + t )
             0 1 2 3     0    1     0    2     0    3

o4 : Ideal of QQ[][t ..t ]
                    0   3

i5 : dual monomialIdeal PP3 + ideal ((vars ring PP3) * matrix rays PP3)

o5 = ideal (x x x x , - x  + x , - x  + x , - x  + x )
             0 1 2 3     0    1     0    2     0    3

o5 : Ideal of QQ[x ..x ]
                  0   3

i6 : minimalPresentation A0

     QQ[t ]
         3
o6 = ------
        4
       t
        3

o6 : QuotientRing

i7 : for i to dim PP3 list hilbertFunction (i, A0)

o7 = {1, 1, 1, 1}

o7 : List

i8 : X = toricProjectiveSpace (2) ** toricProjectiveSpace (3);

i9 : A1 = intersectionRing X

o9 = A1

o9 : QuotientRing

i10 : assert (# rays X === numgens A1)

i11 : ideal A1

o11 = ideal (t t t , t t t t , - t  + t , - t  + t , - t  + t , - t  + t , -
              0 1 2   3 4 5 6     0    1     0    2     3    4     3    5   
      -----------------------------------------------------------------------
      t  + t )
       3    6

o11 : Ideal of QQ[][t ..t ]
                     0   6

i12 : minimalPresentation A1

      QQ[t , t ]
          2   6
o12 = ----------
         3   4
       (t , t )
         2   6

o12 : QuotientRing

i13 : for i to dim X list hilbertFunction (i, A1)

o13 = {1, 2, 3, 3, 2, 1}

o13 : List

i14 : Y = time smoothFanoToricVariety(5,100);
     -- used 0.175903 seconds

i15 : A2 = intersectionRing Y;

i16 : assert (# rays Y === numgens A2)

i17 : ideal A2

o17 = ideal (t t , t t , t t , t t , t t , t t , t t , t t , t t t  ,
              2 3   2 5   4 5   3 6   4 6   1 7   7 9   8 9   0 1 10 
      -----------------------------------------------------------------------
      t t t  , - t  + t  , - t  - t  + t  , t  - t  - t  + t , t  - t  - t ,
       0 8 10     0    10     1    8    10   2    3    4    6   4    5    6 
      -----------------------------------------------------------------------
      t  + t  - t  - 2t  )
       7    8    9     10

o17 : Ideal of QQ[][t ..t  ]
                     0   10

i18 : minimalPresentation A2

                                                              QQ[t , t ..t , t ..t  ]
                                                                  3   5   6   8   10
o18 = ---------------------------------------------------------------------------------------------------------------------------------------
        2                 2   2                       2   2                             2             2                      2     3      2
      (t  + t t , t t  + t , t  + t t , t t , t t  + t , t  - t t  - 3t t   + t t   + 2t  , - t t  + t  + 2t t  , t t , - t t   + t  , t t  )
        3    3 5   3 5    5   5    5 6   3 6   5 6    6   8    8 9     8 10    9 10     10     8 9    9     9 10   8 9     8 10    10   8 10

o18 : QuotientRing

i19 : for i to dim Y list time hilbertFunction (i, A2)
     -- used 0.00184907 seconds
     -- used 0.000118991 seconds
     -- used 0.00009147 seconds
     -- used 0.000091049 seconds
     -- used 0.000092611 seconds
     -- used 0.000092104 seconds

o19 = {1, 6, 13, 13, 6, 1}

o19 : List

i20 : 
