-- -*- M2-comint -*- hash: -1620583573

i1 : tPP2 = toricProjectiveSpace 2;

i2 : aPP2 = abstractVariety tPP2

o2 = aPP2

o2 : an abstract variety of dimension 2

i3 : assert (dim tPP2 === dim aPP2)

i4 : intersectionRing aPP2

              QQ[][t ..t ]
                    0   2
o4 = ------------------------------
     (t t t , - t  + t , - t  + t )
       0 1 2     0    1     0    2

o4 : QuotientRing

i5 : intersectionRing tPP2

              QQ[][t ..t ]
                    0   2
o5 = ------------------------------
     (t t t , - t  + t , - t  + t )
       0 1 2     0    1     0    2

o5 : QuotientRing

i6 : intersectionRing abstractVariety (tPP2, base())

              QQ[][t ..t ]
                    0   2
o6 = ------------------------------
     (t t t , - t  + t , - t  + t )
       0 1 2     0    1     0    2

o6 : QuotientRing

i7 : intersectionRing abstractVariety (tPP2, base(a))

              QQ[a][t ..t ]
                     0   2
o7 = ------------------------------
     (t t t , - t  + t , - t  + t )
       0 1 2     0    1     0    2

o7 : QuotientRing

i8 : PP2 = toricProjectiveSpace 2

o8 = PP2

o8 : NormalToricVariety

i9 : intersectionRing PP2

              QQ[][t ..t ]
                    0   2
o9 = ------------------------------
     (t t t , - t  + t , - t  + t )
       0 1 2     0    1     0    2

o9 : QuotientRing

i10 : minimalPresentation intersectionRing PP2

      QQ[t ]
          2
o10 = ------
         3
        t
         2

o10 : QuotientRing

i11 : minimalPresentation intersectionRing tPP2

      QQ[t ]
          2
o11 = ------
         3
        t
         2

o11 : QuotientRing

i12 : 
