-- -*- M2-comint -*- hash: 554048383

i1 : PP3 = toricProjectiveSpace 3;

i2 : F1 = fan PP3

o2 = F1

o2 : Fan

i3 : rays F1

o3 = | 1 0 -1 0 |
     | 0 1 -1 0 |
     | 0 0 -1 1 |

              3        4
o3 : Matrix ZZ  <--- ZZ

i4 : maxCones F1

o4 = {{0, 1, 2}, {0, 2, 3}, {1, 2, 3}, {0, 1, 3}}

o4 : List

i5 : assert (set rays PP3 === set rays normalToricVariety F1 and max PP3 === max normalToricVariety F1)

i6 : F2 = fan hirzebruchSurface 3;

i7 : rays F2

o7 = | 1 0  0 -1 |
     | 0 -1 1 3  |

              2        4
o7 : Matrix ZZ  <--- ZZ

i8 : maxCones F2

o8 = {{0, 2}, {0, 1}, {2, 3}, {1, 3}}

o8 : List

i9 : 
