-- -*- M2-comint -*- hash: -1298740564

i1 : X = hirzebruchSurface 2;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map (Y, X, matrix {{1, 0}})

o3 = | 1 0 |

o3 : ToricMap Y <--- X

i4 : source f

o4 = X

o4 : NormalToricVariety

i5 : target f

o5 = Y

o5 : NormalToricVariety

i6 : matrix f

o6 = | 1 0 |

              1        2
o6 : Matrix ZZ  <--- ZZ

i7 : assert (isWellDefined f and source f === X and
         target f === Y and matrix f === matrix {{1, 0}})

i8 : debugLevel = 1;

i9 : Z = toricProjectiveSpace 2;

i10 : W = weightedProjectiveSpace {1, 1, 2};

i11 : g = map (W, Z, 1)

o11 = | 1 0 |
      | 0 1 |

o11 : ToricMap W <--- Z

i12 : assert not isWellDefined g
-- expected image of each maximal cone to be contained in some maximal cone
i13 : h = map (W, Z, matrix {{1, 0}, {0, 2}})

o13 = | 1 0 |
      | 0 2 |

o13 : ToricMap W <--- Z

i14 : assert isWellDefined h

i15 : 
