-- -*- M2-comint -*- hash: -695857473

i1 : X = hirzebruchSurface 1;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map(Y, X, matrix{{1 ,0}})

o3 = | 1 0 |

o3 : ToricMap Y <--- X

i4 : isFibration f

o4 = true

i5 : assert (isWellDefined f and isFibration f)

i6 : Z = weightedProjectiveSpace {1, 1, 2};

i7 : g = map(Z, X, matrix{{1, 0}, {0, -2}})

o7 = | 1 0  |
     | 0 -2 |

o7 : ToricMap Z <--- X

i8 : isFibration g

o8 = false

i9 : assert (isWellDefined g and isProper g and not isFibration g)

i10 : 
