-- -*- M2-comint -*- hash: -663243584

i1 : X = hirzebruchSurface 2;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map(Y, X, 0)

o3 = 0

o3 : ToricMap Y <--- X

i4 : assert (isWellDefined f and source f === X and
         target f === Y and matrix f === map(ZZ^(dim Y), ZZ^(dim X), 0))

i5 : Z = normalToricVariety ({{1,0},{-1,2},{0,-1}}, {{0,1},{0,2},{1,2}});

i6 : assert (isWellDefined Z and not isSmooth Z)

i7 : g = map(Z, X, 2)

o7 = | 2 0 |
     | 0 2 |

o7 : ToricMap Z <--- X

i8 : assert (isWellDefined g and source g === X and
         target g === Z and matrix g === 2*id_(ZZ^(dim X)))

i9 : A = affineSpace 2;

i10 : B = toricBlowup ({0, 1}, A);

i11 : h = map(A, B, 1)

o11 = | 1 0 |
      | 0 1 |

o11 : ToricMap A <--- B

i12 : assert (isWellDefined h and h == B^[])

i13 : i = map(A, A, 1)

o13 = | 1 0 |
      | 0 1 |

o13 : ToricMap A <--- A

i14 : i == id_A

o14 = true

i15 : assert (isWellDefined i and source i === A and
          target i === A and matrix i === id_(ZZ^2))

i16 : 
