-- -*- M2-comint -*- hash: 495657842

i1 : X = hirzebruchSurface 2;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map (Y, X, matrix {{1, 0}})

o3 = | 1 0 |

o3 : ToricMap Y <--- X

i4 : assert (isWellDefined f and source f === X and
         target f === Y and matrix f === matrix {{1, 0}})

i5 : A = affineSpace 2;

i6 : max A

o6 = {{0, 1}}

o6 : List

i7 : B = toricBlowup({0, 1}, A);

i8 : g = B^[]

o8 = | 1 0 |
     | 0 1 |

o8 : ToricMap A <--- B

i9 : isProper g

o9 = true

i10 : assert (isWellDefined g and g == map(A,B,1) and
          matrix g === id_(ZZ^2) and isProper g)

i11 : 
