-- -*- M2-comint -*- hash: -311896025

i1 : PP1 = toricProjectiveSpace 1;

i2 : # rays PP1

o2 = 2

i3 : max PP1

o3 = {{0}, {1}}

o3 : List

i4 : PP3 = toricProjectiveSpace 3;

i5 : # rays PP3

o5 = 4

i6 : max PP3

o6 = {{0, 1, 2}, {0, 1, 3}, {0, 2, 3}, {1, 2, 3}}

o6 : List

i7 : FF7 = hirzebruchSurface 7;

i8 : # rays FF7

o8 = 4

i9 : max FF7

o9 = {{0, 1}, {0, 3}, {1, 2}, {2, 3}}

o9 : List

i10 : X = weightedProjectiveSpace {1,2,3};

i11 : # rays X

o11 = 3

i12 : max X

o12 = {{0, 1}, {0, 2}, {1, 2}}

o12 : List

i13 : 
