-- -*- M2-comint -*- hash: 636740640

i1 : X = hirzebruchSurface 1;

i2 : Y = toricProjectiveSpace 1;

i3 : f = map(Y, X, matrix {{1, 0}})

o3 = | 1 0 |

o3 : ToricMap Y <--- X

i4 : f' = weilDivisorGroup f

o4 = | 0 1 |
     | 0 0 |
     | 1 0 |
     | 0 0 |

              4        2
o4 : Matrix ZZ  <--- ZZ

i5 : assert (isWellDefined f and source f' == weilDivisorGroup Y and
         target f' == weilDivisorGroup X)

i6 : Z = toricProjectiveSpace 2;

i7 : g = map(Z, X, matrix {{1, 0}, {0, -1}})

o7 = | 1 0  |
     | 0 -1 |

o7 : ToricMap Z <--- X

i8 : g' = weilDivisorGroup g

o8 = | 0 1 0 |
     | 1 1 0 |
     | 1 0 0 |
     | 0 0 1 |

              4        3
o8 : Matrix ZZ  <--- ZZ

i9 : assert (isWellDefined g and source g' == weilDivisorGroup Z and
         target g' == weilDivisorGroup X)

i10 : g'' = classGroup g

o10 = | 0 |
      | 1 |

               2        1
o10 : Matrix ZZ  <--- ZZ

i11 : assert(g'' * fromWDivToCl Z  == fromWDivToCl X  * g')

i12 : 
