-- -*- M2-comint -*- hash: 487995352

i1 : GF(5^7)[x_0..x_4]

o1 = GF 78125[x ..x ]
               0   4

o1 : PolynomialRing

i2 : C = minors(2,matrix{{x_0,x_1,x_2},{x_1,x_2,x_3}})

               2                           2
o2 = ideal (- x  + x x , - x x  + x x , - x  + x x )
               1    0 2     1 2    0 3     2    1 3

o2 : Ideal of GF 78125[x ..x ]
                        0   4

i3 : time ChernSchwartzMacPherson C
     -- used 1.77249 seconds

       4     3     2
o3 = 3H  + 5H  + 3H

     ZZ[H]
o3 : -----
        5
       H

i4 : time ChernSchwartzMacPherson(C,Certify=>true)
Certify: output certified!
     -- used 2.04986 seconds

       4     3     2
o4 = 3H  + 5H  + 3H

     ZZ[H]
o4 : -----
        5
       H

i5 : oo == ooo

o5 = true

i6 : ChernClass = method(Options=>{Certify=>false});

i7 : ChernClass (Ideal) := o -> (I) -> (
        s := SegreClass(I,Certify=>o.Certify);
        s*(1+first gens ring s)^(numgens ring I));

i8 : -- example: Chern class of G(1,4)
     G = Grassmannian(1,4,CoefficientRing=>ZZ/190181)

o8 = ideal (p   p    - p   p    + p   p   , p   p    - p   p    + p   p   ,
             2,3 1,4    1,3 2,4    1,2 3,4   2,3 0,4    0,3 2,4    0,2 3,4 
     ------------------------------------------------------------------------
     p   p    - p   p    + p   p   , p   p    - p   p    + p   p   , p   p   
      1,3 0,4    0,3 1,4    0,1 3,4   1,2 0,4    0,2 1,4    0,1 2,4   1,2 0,3
     ------------------------------------------------------------------------
     - p   p    + p   p   )
        0,2 1,3    0,1 2,3

                ZZ
o8 : Ideal of ------[p   ..p   , p   , p   , p   , p   , p   , p   , p   , p   ]
              190181  0,1   0,2   1,2   0,3   1,3   2,3   0,4   1,4   2,4   3,4

i9 : time ChernClass G
     -- used 0.205473 seconds

        9      8      7      6      5      4     3
o9 = 10H  + 30H  + 60H  + 75H  + 57H  + 25H  + 5H

     ZZ[H]
o9 : -----
       10
      H

i10 : time ChernClass(G,Certify=>true)
Certify: output certified!
     -- used 0.0170752 seconds

         9      8      7      6      5      4     3
o10 = 10H  + 30H  + 60H  + 75H  + 57H  + 25H  + 5H

      ZZ[H]
o10 : -----
        10
       H

i11 : 
