-- -*- M2-comint -*- hash: 205098768

i1 : I = Grassmannian(1,4,CoefficientRing=>ZZ/190181);

                ZZ
o1 : Ideal of ------[p   ..p   , p   , p   , p   , p   , p   , p   , p   , p   ]
              190181  0,1   0,2   1,2   0,3   1,3   2,3   0,4   1,4   2,4   3,4

i2 : time EulerCharacteristic I
     -- used 0.18137 seconds

o2 = 10

i3 : time EulerCharacteristic(I,Certify=>true)
Certify: output certified!
     -- used 0.0430098 seconds

o3 = 10

i4 : 
