-- -*- M2-comint -*- hash: -1634824181

i1 : P7 = ZZ/100003[x_0..x_7]

o1 = P7

o1 : PolynomialRing

i2 : Y = ideal(x_3^2*x_4^2-2*x_2*x_3*x_4*x_5+x_2^2*x_5^2-2*x_1*x_3*x_4*x_6-2*x_1*x_2*x_5*x_6+4*x_0*x_3*x_5*x_6+x_1^2*x_6^2+4*x_1*x_2*x_4*x_7-2*x_0*x_3*x_4*x_7-2*x_0*x_2*x_5*x_7-2*x_0*x_1*x_6*x_7+x_0^2*x_7^2)

            2 2                2 2                                        2 2
o2 = ideal(x x  - 2x x x x  + x x  - 2x x x x  - 2x x x x  + 4x x x x  + x x 
            3 4     2 3 4 5    2 5     1 3 4 6     1 2 5 6     0 3 5 6    1 6
     ------------------------------------------------------------------------
                                                        2 2
     + 4x x x x  - 2x x x x  - 2x x x x  - 2x x x x  + x x )
         1 2 4 7     0 3 4 7     0 2 5 7     0 1 6 7    0 7

o2 : Ideal of P7

i3 : X = sub(ideal jacobian Y,P7/Y)

                                                        2             
o3 = ideal (4x x x  - 2x x x  - 2x x x  - 2x x x  + 2x x , - 2x x x  -
              3 5 6     3 4 7     2 5 7     1 6 7     0 7      3 4 6  
     ------------------------------------------------------------------------
                   2                                      2            
     2x x x  + 2x x  + 4x x x  - 2x x x , - 2x x x  + 2x x  - 2x x x  +
       2 5 6     1 6     2 4 7     0 6 7      3 4 5     2 5     1 5 6  
     ------------------------------------------------------------------------
                            2                                            2  
     4x x x  - 2x x x , 2x x  - 2x x x  - 2x x x  + 4x x x  - 2x x x , 2x x 
       1 4 7     0 5 7    3 4     2 4 5     1 4 6     0 5 6     0 4 7    3 4
     ------------------------------------------------------------------------
                                                            2              
     - 2x x x  - 2x x x  + 4x x x  - 2x x x , - 2x x x  + 2x x  - 2x x x  +
         2 3 5     1 3 6     1 2 7     0 3 7      2 3 4     2 5     1 2 6  
     ------------------------------------------------------------------------
                                                          2             
     4x x x  - 2x x x , - 2x x x  - 2x x x  + 4x x x  + 2x x  - 2x x x ,
       0 3 6     0 2 7      1 3 4     1 2 5     0 3 5     1 6     0 1 7 
     ------------------------------------------------------------------------
                                               2
     4x x x  - 2x x x  - 2x x x  - 2x x x  + 2x x )
       1 2 4     0 3 4     0 2 5     0 1 6     0 7

                                                                          P7
o3 : Ideal of -------------------------------------------------------------------------------------------------------------------------
               2 2                2 2                                        2 2                                                    2 2
              x x  - 2x x x x  + x x  - 2x x x x  - 2x x x x  + 4x x x x  + x x  + 4x x x x  - 2x x x x  - 2x x x x  - 2x x x x  + x x
               3 4     2 3 4 5    2 5     1 3 4 6     1 2 5 6     0 3 5 6    1 6     1 2 4 7     0 3 4 7     0 2 5 7     0 1 6 7    0 7

i4 : time SegreClass X
     -- used 0.603923 seconds

          7        6       5       4      3
o4 = 3240H  - 1188H  + 396H  - 114H  + 24H

     ZZ[H]
o4 : -----
        8
       H

i5 : time SegreClass lift(X,P7)
     -- used 0.460314 seconds

          7        6       5      4      3
o5 = 2816H  - 1056H  + 324H  - 78H  + 12H

     ZZ[H]
o5 : -----
        8
       H

i6 : time SegreClass(X,Certify=>true)
Certify: output certified!
     -- used 0.0357792 seconds

          7        6       5       4      3
o6 = 3240H  - 1188H  + 396H  - 114H  + 24H

     ZZ[H]
o6 : -----
        8
       H

i7 : time SegreClass(lift(X,P7),Certify=>true)
Certify: output certified!
     -- used 0.148013 seconds

          7        6       5      4      3
o7 = 2816H  - 1056H  + 324H  - 78H  + 12H

     ZZ[H]
o7 : -----
        8
       H

i8 : o4 == o6 and o5 == o7

o8 = true

i9 : use ZZ/100003[x_0..x_6]

       ZZ
o9 = ------[x ..x ]
     100003  0   6

o9 : PolynomialRing

i10 : time phi = inverseMap toMap(minors(2,matrix{{x_0,x_1,x_3,x_4,x_5},{x_1,x_2,x_4,x_5,x_6}}),Dominant=>2)
     -- used 0.0904899 seconds

                                                        ZZ
                                                      ------[y ..y ]
                                                      100003  0   9                                                ZZ              2                              2
o10 = map (----------------------------------------------------------------------------------------------------, ------[x ..x ], {y  - y y  - y y , y y  - y y , y  - y y  - y y , y y  + y y  - y y , y y  - y y , y y  - y y  - y y , y y  - y y  - y y })
           (y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y )  100003  0   6     3    0 5    1 6   3 4    1 7   4    2 7    0 9   2 5    3 5    1 8   4 5    1 9   4 8    2 9    3 9   7 8    4 9    6 9
             5 7    4 8    2 9   5 6    3 8    1 9   4 6    3 7    0 9   2 6    1 7    0 8   2 3    1 4    0 5

                                                           ZZ
                                                         ------[y ..y ]
                                                         100003  0   9                                                    ZZ
o10 : RingMap ---------------------------------------------------------------------------------------------------- <--- ------[x ..x ]
              (y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y )      100003  0   6
                5 7    4 8    2 9   5 6    3 8    1 9   4 6    3 7    0 9   2 6    1 7    0 8   2 3    1 4    0 5

i11 : time SegreClass phi
     -- used 0.326876 seconds

         9      8      7      6     5
o11 = 23H  - 42H  + 36H  - 22H  + 9H

      ZZ[H]
o11 : -----
        10
       H

i12 : B = ideal matrix phi

              2                              2
o12 = ideal (y  - y y  - y y , y y  - y y , y  - y y  - y y , y y  + y y  -
              3    0 5    1 6   3 4    1 7   4    2 7    0 9   2 5    3 5  
      -----------------------------------------------------------------------
      y y , y y  - y y , y y  - y y  - y y , y y  - y y  - y y )
       1 8   4 5    1 9   4 8    2 9    3 9   7 8    4 9    6 9

                                                            ZZ
                                                          ------[y ..y ]
                                                          100003  0   9
o12 : Ideal of ----------------------------------------------------------------------------------------------------
               (y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y , y y  - y y  + y y )
                 5 7    4 8    2 9   5 6    3 8    1 9   4 6    3 7    0 9   2 6    1 7    0 8   2 3    1 4    0 5

i13 : -- Segre class of B in G(1,4)
      time SegreClass B
     -- used 0.385618 seconds

         9      8      7      6     5
o13 = 23H  - 42H  + 36H  - 22H  + 9H

      ZZ[H]
o13 : -----
        10
       H

i14 : -- Segre class of B in P^9
      time SegreClass lift(B,ambient ring B)
     -- used 1.15589 seconds

           9       8       7      6     5
o14 = 2764H  - 984H  + 294H  - 67H  + 9H

      ZZ[H]
o14 : -----
        10
       H

i15 : 
