-- -*- M2-comint -*- hash: 864301712

i1 : ZZ/33331[t_0..t_4];

i2 : phi = rationalMap minors(2,matrix{{t_0..t_3},{t_1..t_4}});

o2 : RationalMap (quadratic rational map from PP^4 to PP^5)

i3 : describe phi

o3 = rational map defined by forms of degree 2
     source variety: PP^4
     target variety: PP^5
     coefficient ring: ZZ/33331

i4 : I = image phi;

                ZZ
o4 : Ideal of -----[x ..x ]
              33331  0   5

i5 : describe phi

o5 = rational map defined by forms of degree 2
     source variety: PP^4
     target variety: PP^5
     image: smooth quadric hypersurface in PP^5
     dominance: false
     birationality: false
     coefficient ring: ZZ/33331

i6 : ? I

o6 = smooth quadric hypersurface in PP^5

i7 : phi!;

o7 : RationalMap (quadratic rational map from PP^4 to PP^5)

i8 : describe phi

o8 = rational map defined by forms of degree 2
     source variety: PP^4
     target variety: PP^5
     image: smooth quadric hypersurface in PP^5
     dominance: false
     birationality: false
     degree of map: 1
     projective degrees: {1, 2, 4, 4, 2}
     number of minimal representatives: 1
     dimension base locus: 1
     degree base locus: 4
     coefficient ring: ZZ/33331

i9 : 
