-- -*- M2-comint -*- hash: 1650184568

i1 : (ZZ/190181)[x_0..x_4]; phi = rationalMap(minors(2,matrix{{x_0..x_3},{x_1..x_4}}),Dominant=>true)

o2 = -- rational map --
                    ZZ
     source: Proj(------[x , x , x , x , x ])
                  190181  0   1   2   3   4
                                  ZZ
     target: subvariety of Proj(------[y , y , y , y , y , y ]) defined by
                                190181  0   1   2   3   4   5
             {
              y y  - y y  + y y
               2 3    1 4    0 5
             }
     defining forms: {
                         2
                      - x  + x x ,
                         1    0 2
                      
                      - x x  + x x ,
                         1 2    0 3
                      
                         2
                      - x  + x x ,
                         2    1 3
                      
                      - x x  + x x ,
                         1 3    0 4
                      
                      - x x  + x x ,
                         2 3    1 4
                      
                         2
                      - x  + x x
                         3    2 4
                     }

o2 : RationalMap (quadratic dominant rational map from PP^4 to hypersurface in PP^5)

i3 : time (p1,p2) = graph phi;
     -- used 0.0514884 seconds

i4 : p1

o4 = -- rational map --
                                  ZZ                                 ZZ
     source: subvariety of Proj(------[x , x , x , x , x ]) x Proj(------[y , y , y , y , y , y ]) defined by
                                190181  0   1   2   3   4          190181  0   1   2   3   4   5
             {
              y y  - y y  + y y ,
               2 3    1 4    0 5
              
              x y  - x y  + x y ,
               4 2    3 4    2 5
              
              x y  - x y  + x y ,
               3 2    2 4    1 5
              
              x y  - x y  + x y ,
               4 1    3 3    1 5
              
              x y  - x y  + x y ,
               3 1    2 3    0 5
              
              x y  - x y  - x y  + x y ,
               2 1    1 2    1 3    0 4
              
              x y  - x y  + x y ,
               4 0    2 3    1 4
              
              x y  - x y  + x y ,
               3 0    1 3    0 4
              
              x y  - x y  + x y
               2 0    1 1    0 2
             }
                    ZZ
     target: Proj(------[x , x , x , x , x ])
                  190181  0   1   2   3   4
     defining forms: {
                      x ,
                       0
                      
                      x ,
                       1
                      
                      x ,
                       2
                      
                      x ,
                       3
                      
                      x
                       4
                     }

o4 : MultihomogeneousRationalMap (birational map from 4-dimensional subvariety of PP^4 x PP^5 to PP^4)

i5 : p2

o5 = -- rational map --
                                  ZZ                                 ZZ
     source: subvariety of Proj(------[x , x , x , x , x ]) x Proj(------[y , y , y , y , y , y ]) defined by
                                190181  0   1   2   3   4          190181  0   1   2   3   4   5
             {
              y y  - y y  + y y ,
               2 3    1 4    0 5
              
              x y  - x y  + x y ,
               4 2    3 4    2 5
              
              x y  - x y  + x y ,
               3 2    2 4    1 5
              
              x y  - x y  + x y ,
               4 1    3 3    1 5
              
              x y  - x y  + x y ,
               3 1    2 3    0 5
              
              x y  - x y  - x y  + x y ,
               2 1    1 2    1 3    0 4
              
              x y  - x y  + x y ,
               4 0    2 3    1 4
              
              x y  - x y  + x y ,
               3 0    1 3    0 4
              
              x y  - x y  + x y
               2 0    1 1    0 2
             }
                                  ZZ
     target: subvariety of Proj(------[y , y , y , y , y , y ]) defined by
                                190181  0   1   2   3   4   5
             {
              y y  - y y  + y y
               2 3    1 4    0 5
             }
     defining forms: {
                      y ,
                       0
                      
                      y ,
                       1
                      
                      y ,
                       2
                      
                      y ,
                       3
                      
                      y ,
                       4
                      
                      y
                       5
                     }

o5 : MultihomogeneousRationalMap (dominant rational map from 4-dimensional subvariety of PP^4 x PP^5 to hypersurface in PP^5)

i6 : assert(p1 * phi == p2 and p2 * phi^-1 == p1)

i7 : describe p2

o7 = rational map defined by multiforms of degree {0, 1}
     source variety: 4-dimensional subvariety of PP^4 x PP^5 cut out by 9 hypersurfaces of degrees ({0, 2},{1, 1},{1, 1},{1, 1},{1, 1},{1, 1},{1, 1},{1, 1},{1, 1})
     target variety: smooth quadric hypersurface in PP^5
     dominance: true
     coefficient ring: ZZ/190181

i8 : projectiveDegrees p2

o8 = {51, 28, 14, 6, 2}

o8 : List

i9 : time g = graph p2;
     -- used 0.0678213 seconds

i10 : g_0;

o10 : MultihomogeneousRationalMap (rational map from 4-dimensional subvariety of PP^4 x PP^5 x PP^5 to PP^4)

i11 : g_1;

o11 : MultihomogeneousRationalMap (rational map from 4-dimensional subvariety of PP^4 x PP^5 x PP^5 to PP^5)

i12 : g_2;

o12 : MultihomogeneousRationalMap (dominant rational map from 4-dimensional subvariety of PP^4 x PP^5 x PP^5 to hypersurface in PP^5)

i13 : describe g_0

o13 = rational map defined by multiforms of degree {1, 0, 0}
      source variety: 4-dimensional subvariety of PP^4 x PP^5 x PP^5 cut out by 34 hypersurfaces of degrees ({0, 1, 1},{0, 0, 2},{0, 1, 1},{0, 1, 1},{0, 1, 1},{0, 1, 1},{0, 1, 1},{0, 1, 1},{1, 0, 1},{1, 0, 1},{0, 1, 1},{0, 1, 1},{0, 1, 1},{0, 1, 1},{1, 0, 1},{1, 0, 1},{1, 0, 1},{0, 1, 1},{0, 1, 1},{0, 1, 1},{0, 1, 1},{0, 1, 1},{1, 0, 1},{1, 0, 1},{1, 0, 1},{0, 2, 0},{1, 1, 0},{1, 1, 0},{1, 1, 0},{1, 1, 0},{1, 1, 0},{1, 1, 0},{1, 1, 0},{1, 1, 0})
      target variety: PP^4
      coefficient ring: ZZ/190181

i14 : 
