-- -*- M2-comint -*- hash: 1721340613

i1 : M = matrix{{1,2,3},{2,3,4},{3,4,6}}

o1 = | 1 2 3 |
     | 2 3 4 |
     | 3 4 6 |

              3        3
o1 : Matrix ZZ  <--- ZZ

i2 : M-1, M-2

o2 = (| 0 2 3 |, | -1 2 3 |)
      | 2 2 4 |  | 2  1 4 |
      | 3 4 5 |  | 3  4 4 |

o2 : Sequence

i3 : 2-interval(1,3)

o3 = [-1,1]

o3 : RRi (of precision 53)

i4 : interval(1,3)-interval(-1,2)

o4 = [-1,4]

o4 : RRi (of precision 53)

i5 : interval(-1,1)-interval(-1,1)

o5 = [-2,2]

o5 : RRi (of precision 53)

i6 : 
