-- -*- M2-comint -*- hash: 1609791027

i1 : {10..10}

o1 = {1 : (10)}

o1 : List

i2 : {10..8}

o2 = {()}

o2 : List

i3 : {3..5,8..10}

o3 = {(3, 4, 5), (8, 9, 10)}

o3 : List

i4 : splice {3..5,8..10}

o4 = {3, 4, 5, 8, 9, 10}

o4 : List

i5 : 0..5

o5 = (0, 1, 2, 3, 4, 5)

o5 : Sequence

i6 : toList (0..5)

o6 = {0, 1, 2, 3, 4, 5}

o6 : List

i7 : new Array from 0..5

o7 = [0, 1, 2, 3, 4, 5]

o7 : Array

i8 : new Sum from 0..5

o8 = 0 + 1 + 2 + 3 + 4 + 5

o8 : Expression of class Sum

i9 : (0,0)..(1,3)

o9 = ((0, 0), (0, 1), (0, 2), (0, 3), (1, 0), (1, 1), (1, 2), (1, 3))

o9 : Sequence

i10 : p_(0,a) .. p_(1,c)

o10 = (p   , p   , p   , p   , p   , p   )
        0,a   0,b   0,c   1,a   1,b   1,c

o10 : Sequence

i11 : p_(1,1) .. q_(2,2)

o11 = (p   , p   , p   , p   , q   , q   , q   , q   )
        1,1   1,2   2,1   2,2   1,1   1,2   2,1   2,2

o11 : Sequence

i12 : 
