-- -*- M2-comint -*- hash: 1941440005

i1 : {10..<11}

o1 = {1 : (10)}

o1 : List

i2 : {10..<8}

o2 = {()}

o2 : List

i3 : {3..<5,8..<10}

o3 = {(3, 4), (8, 9)}

o3 : List

i4 : splice {3..<5,8..<10}

o4 = {3, 4, 8, 9}

o4 : List

i5 : 0..<5

o5 = (0, 1, 2, 3, 4)

o5 : Sequence

i6 : toList (0..<5)

o6 = {0, 1, 2, 3, 4}

o6 : List

i7 : new Array from 0..<5

o7 = [0, 1, 2, 3, 4]

o7 : Array

i8 : new Sum from 0..<5

o8 = 0 + 1 + 2 + 3 + 4

o8 : Expression of class Sum

i9 : (0,0)..<(2,3)

o9 = ((0, 0), (0, 1), (0, 2), (1, 0), (1, 1), (1, 2))

o9 : Sequence

i10 : p_(0,a) ..< r_(2,c)

o10 = (p   , p   , p   , p   , q   , q   , q   , q   )
        0,a   0,b   1,a   1,b   0,a   0,b   1,a   1,b

o10 : Sequence

i11 : 
