-- -*- M2-comint -*- hash: -1025684038

i1 : L = {a, b, c, b, a};

i2 : L#2

o2 = c

o2 : Symbol

i3 : L#-2

o3 = b

o3 : Symbol

i4 : T = new HashTable from {a => 103, b => 89.4, c => 92};

i5 : T#a

o5 = 103

i6 : T#b

o6 = 89.4

o6 : RR (of precision 53)

i7 : s = "a perfectly adequate example of a string";

i8 : s#2

o8 = p

i9 : s#-2

o9 = n

i10 : V = new MutableHashTable from T;

i11 : V#a = 5;

i12 : V#d = 22.3;

i13 : peek V

o13 = MutableHashTable{a => 5   }
                       b => 89.4
                       c => 92
                       d => 22.3

i14 : 
