-- -*- M2-comint -*- hash: 611477997

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : x^2

      2
o2 = x

o2 : R

i3 : class x^2

o3 = R

o3 : PolynomialRing

i4 : r = 4.5 * ii

o4 = 4.5*ii

o4 : CC (of precision 53)

i5 : s = 4.3p300 * ii

o5 = 4.3*ii

o5 : CC (of precision 300)

i6 : precision r

o6 = 53

i7 : precision s

o7 = 300

i8 : ring r

o8 = CC
       53

o8 : ComplexField

i9 : ring s

o9 = CC
       300

o9 : ComplexField

i10 : CC'

o10 = CC
        *

o10 : Type

i11 : parent ring r     

o11 = CC
        *

o11 : Type

i12 : parent ring s

o12 = CC
        *

o12 : Type

i13 : parent ring s === CC'

o13 = true

i14 : 
