-- -*- M2-comint -*- hash: -744106520

i1 : (f = Command ( () -> 2^30 );)

i2 : f

o2 = 1073741824

i3 : (c = Command "date";)

i4 : c
Sun Feb  5 13:47:38 UTC 2023

o4 = 0

i5 : 
