-- -*- M2-comint -*- hash: -130021014

i1 : expression 4

o1 = 4

o1 : Expression of class Holder

i2 : peek oo

o2 = Holder{4}

i3 : d = expression (-4)

o3 = -4

o3 : Expression of class Minus

i4 : peek oo

o4 = Minus{4}

i5 : QQ[x];

i6 : f = (x+1)^5

      5     4      3      2
o6 = x  + 5x  + 10x  + 10x  + 5x + 1

o6 : QQ[x]

i7 : peek f

o7 = QQ[x]{x5+5x4+10x3+10x2+5x+1}

i8 : e = expression f

      5     4      3      2
o8 = x  + 5x  + 10x  + 10x  + 5x + 1

o8 : Expression of class Sum

i9 : peek e

          5    4     3     2
o9 = Sum{x , 5x , 10x , 10x , 5x, 1}

i10 : peek'_2 e

                                   4                3                2
o10 = Sum{Power{x, 5}, Product{5, x }, Product{10, x }, Product{10, x },
      -----------------------------------------------------------------------
      Product{5, x}, OneExpression{1}}

i11 : peek'_11 e

o11 = Sum{Power{x, 5}, Product{5, Power{x, 4}}, Product{10, Power{x, 3}},
      -----------------------------------------------------------------------
      Product{10, Power{x, 2}}, Product{5, x}, OneExpression{1}}

i12 : c = factor f

             5
o12 = (x + 1)

o12 : Expression of class Product

i13 : peek'_2 c

o13 = Product{Power{x + 1, 5}}

i14 : factor 240012

       2 2
o14 = 2 3 59*113

o14 : Expression of class Product

i15 : value e

       5     4      3      2
o15 = x  + 5x  + 10x  + 10x  + 5x + 1

o15 : QQ[x]

i16 : value e == f

o16 = true

i17 : value c

       5     4      3      2
o17 = x  + 5x  + 10x  + 10x  + 5x + 1

o17 : QQ[x]

i18 : d + e

             5     4      3      2
o18 = - 4 + x  + 5x  + 10x  + 10x  + 5x + 1

o18 : Expression of class Sum

i19 : d + 4

o19 = - 4 + 4

o19 : Expression of class Sum

i20 : d / 4

      -4
o20 = --
       4

o20 : Expression of class Divide

i21 : d / 1

o21 = -4

o21 : Expression of class Minus

i22 : d == e

             5     4      3      2
o22 = -4 == x  + 5x  + 10x  + 10x  + 5x + 1

o22 : Expression of class Equation

i23 : 
