-- -*- M2-comint -*- hash: -1223363299

i1 : R = QQ[x,y]/(x^3,y^2);

i2 : N = cokernel matrix {{x^2, x*y}}

o2 = cokernel | x2 xy |

                            1
o2 : R-module, quotient of R

i3 : H = Ext(N,N);

i4 : ring H

o4 = QQ[X ..X , x..y]
         1   2

o4 : PolynomialRing

i5 : S = ring H;

i6 : H

o6 = cokernel {0, 0}   | y2 xy x2 0 0 0 0 0 0 0 0 X_1y X_1x 0   0   0 0 |
              {-1, -1} | 0  0  0  y x 0 0 0 0 0 0 0    0    X_1 0   0 0 |
              {-1, -1} | 0  0  0  0 0 y x 0 0 0 0 0    0    0   X_1 0 0 |
              {-1, -1} | 0  0  0  0 0 0 0 y x 0 0 0    0    0   X_1 0 0 |
              {-1, -1} | 0  0  0  0 0 0 0 0 0 y x 0    0    0   0   0 0 |
              {-2, -2} | 0  0  0  0 0 0 0 0 0 0 0 0    0    0   0   y x |

                            6
o6 : S-module, quotient of S

i7 : isHomogeneous H

o7 = true

i8 : rank source basis( { -2,-3 }, H)

o8 = 1

i9 : rank source basis( { -3 }, Ext^2(N,N) )

o9 = 1

i10 : rank source basis( { -4,-5 }, H)

o10 = 4

i11 : rank source basis( { -5 }, Ext^4(N,N) )

o11 = 4

i12 : hilbertSeries H

            -1 -1     2     -1    -2 -2     3     -1       -2 -1     -3 -3     -2     -3 -2     -2       -3 -1
      1 + 4T  T   - 3T  - 8T   + T  T   + 2T  + 4T  T  - 4T  T   - 2T  T   + 5T   + 4T  T   - 2T  T  - 2T  T
            0  1      1     0     0  1      1     0  1     0  1      0  1      0      0  1      0  1     0  1
o12 = --------------------------------------------------------------------------------------------------------
                                                -2 -2       -2 -3         2
                                          (1 - T  T  )(1 - T  T  )(1 - T )
                                                0  1        0  1        1

o12 : Expression of class Divide

i13 : hilbertSeries(H,Order=>11)

                  -1 -1    -2 -3     -2 -2     -3 -4    -4 -6     -3 -3  
o13 = 1 + 2T  + 4T  T   + T  T   + 4T  T   + 4T  T   + T  T   + 2T  T   +
            1     0  1     0  1      0  1      0  1     0  1      0  1   
      -----------------------------------------------------------------------
        -4 -5     -5 -7    -6 -9     -4 -4     -5 -6     -6 -8     -7 -10  
      4T  T   + 4T  T   + T  T   + 2T  T   + 2T  T   + 4T  T   + 4T  T    +
        0  1      0  1     0  1      0  1      0  1      0  1      0  1    
      -----------------------------------------------------------------------
       -8 -12     -5 -5     -6 -7     -7 -9     -8 -11     -9 -13    -10 -15
      T  T    + 2T  T   + 2T  T   + 2T  T   + 4T  T    + 4T  T    + T   T   
       0  1       0  1      0  1      0  1      0  1       0  1      0   1  
      -----------------------------------------------------------------------
          -6 -6     -7 -8     -8 -10     -9 -12     -10 -14     -11 -16  
      + 2T  T   + 2T  T   + 2T  T    + 2T  T    + 4T   T    + 4T   T    +
          0  1      0  1      0  1       0  1       0   1       0   1    
      -----------------------------------------------------------------------
       -12 -18     -7 -7     -8 -9     -9 -11     -10 -13     -11 -15  
      T   T    + 2T  T   + 2T  T   + 2T  T    + 2T   T    + 2T   T    +
       0   1       0  1      0  1      0  1       0   1       0   1    
      -----------------------------------------------------------------------
        -12 -17     -13 -19    -14 -21     -8 -8     -9 -10     -10 -12  
      4T   T    + 4T   T    + T   T    + 2T  T   + 2T  T    + 2T   T    +
        0   1       0   1      0   1       0  1      0  1       0   1    
      -----------------------------------------------------------------------
        -11 -14     -12 -16     -13 -18     -14 -20     -15 -22    -16 -24  
      2T   T    + 2T   T    + 2T   T    + 4T   T    + 4T   T    + T   T    +
        0   1       0   1       0   1       0   1       0   1      0   1    
      -----------------------------------------------------------------------
        -9 -9     -10 -11     -11 -13     -12 -15     -13 -17     -14 -19  
      2T  T   + 2T   T    + 2T   T    + 2T   T    + 2T   T    + 2T   T    +
        0  1      0   1       0   1       0   1       0   1       0   1    
      -----------------------------------------------------------------------
        -15 -21     -16 -23     -17 -25    -18 -27     -10 -10     -11 -12  
      2T   T    + 4T   T    + 4T   T    + T   T    + 2T   T    + 2T   T    +
        0   1       0   1       0   1      0   1       0   1       0   1    
      -----------------------------------------------------------------------
        -12 -14     -13 -16     -14 -18     -15 -20     -16 -22     -17 -24  
      2T   T    + 2T   T    + 2T   T    + 2T   T    + 2T   T    + 2T   T    +
        0   1       0   1       0   1       0   1       0   1       0   1    
      -----------------------------------------------------------------------
        -18 -26     -19 -28    -20 -30
      4T   T    + 4T   T    + T   T
        0   1       0   1      0   1

o13 : ZZ[T ..T ]
          0   1

i14 : 
