-- -*- M2-comint -*- hash: -477901691

i1 : f = i -> i+1

o1 = f

o1 : FunctionClosure

i2 : g = i -> i^2

o2 = g

o2 : FunctionClosure

i3 : apply(0 .. 10, f @@ g)

o3 = (1, 2, 5, 10, 17, 26, 37, 50, 65, 82, 101)

o3 : Sequence

i4 : apply(0 .. 10, g @@ f)

o4 = (1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121)

o4 : Sequence

i5 : 
