-- -*- M2-comint -*- hash: 1291592353

i1 : R = QQ[a..d];

i2 : a^3 + b^2 + b*c

      3    2
o2 = a  + b  + b*c

o2 : R

i3 : S = QQ[a..d, MonomialOrder => GRevLex => {1,2,3,4}];

i4 : a^3 + b^2 + b*c

            2    3
o4 = b*c + b  + a

o4 : S

i5 : B1 = QQ[a..d,MonomialSize=>16,MonomialOrder=>GRevLex];

i6 : B = QQ[a..d,MonomialSize=>16];

i7 : a^(2^15-1)

      32767
o7 = a

o7 : B

i8 : C = QQ[a..d,MonomialSize=>8,MonomialOrder=>GRevLex];

i9 : try a^(2^15-1) else "failed"

o9 = failed

i10 : a^(2^7-1)

       127
o10 = a

o10 : C

i11 : 
