-- -*- M2-comint -*- hash: 1636263486

i1 : A = GF(3,2,Variable=>b);

i2 : ambient A

        ZZ
        --[b]
         3
o2 = ----------
      2
     b  - b - 1

o2 : QuotientRing

i3 : b^8

o3 = 1

o3 : A

i4 : b^4

o4 = -1

o4 : A

i5 : K = GF 8

o5 = K

o5 : GaloisField

i6 : x = K_0

o6 = a

o6 : K

i7 : x^3+x

o7 = 1

o7 : K

i8 : A = ZZ/5[a]/(a^3-a-2)

o8 = A

o8 : QuotientRing

i9 : B = GF A

o9 = B

o9 : GaloisField

i10 : C = ZZ/5[b]/(b^3+1+3*b^2+b)

o10 = C

o10 : QuotientRing

i11 : D = GF C

o11 = D

o11 : GaloisField

i12 : map(B,D,{a^2})

                   2
o12 = map (B, D, {a })

o12 : RingMap B <--- D

i13 : 
