-- -*- M2-comint -*- hash: 1564186082

i1 : R = ZZ/101[x,y]

o1 = R

o1 : PolynomialRing

i2 : C = chainComplex(matrix{{x,y}},matrix{{x*y},{-x^2}})

      1      2      1
o2 = R  <-- R  <-- R
                    
     0      1      2

o2 : ChainComplex

i3 : M = HH^1 C

o3 = 0

o3 : R-module

i4 : prune M

o4 = 0

o4 : R-module

i5 : needsPackage "SimplicialComplexes"

o5 = SimplicialComplexes

o5 : Package

i6 : R = QQ[a..d]

o6 = R

o6 : PolynomialRing

i7 : D = simplicialComplex {a*b*c,a*b*d,a*c*d,b*c*d}

o7 = simplicialComplex | bcd acd abd abc |

o7 : SimplicialComplex

i8 : C = chainComplex D

       1       4       6       4
o8 = QQ  <-- QQ  <-- QQ  <-- QQ
                              
     -1      0       1       2

o8 : ChainComplex

i9 : HH_2 C

o9 = image | -1 |
           | 1  |
           | -1 |
           | 1  |

                               4
o9 : QQ-module, submodule of QQ

i10 : prune oo

        1
o10 = QQ

o10 : QQ-module, free

i11 : 
