-- -*- M2-comint -*- hash: 406079798

i1 : R = QQ[a,b];

i2 : HH^2 (R^{-3})

o2 = cokernel | b a  0 |
              | 0 -b a |

                            2
o2 : R-module, quotient of R

i3 : HH^2 (R^{-4})

o3 = cokernel | b a  0  0 |
              | 0 -b a  0 |
              | 0 0  -b a |

                            3
o3 : R-module, quotient of R

i4 : R = ZZ/101[x_0..x_4];

i5 : I = ideal(x_1*x_4-x_2*x_3, x_1^2*x_3+x_1*x_2*x_0-x_2^2*x_0, x_3^3+x_3*x_4*x_0-x_4^2*x_0)

                                       2    2     3               2
o5 = ideal (- x x  + x x , x x x  - x x  + x x , x  + x x x  - x x )
               2 3    1 4   0 1 2    0 2    1 3   3    0 3 4    0 4

o5 : Ideal of R

i6 : M = R^1/module(I)

o6 = cokernel | -x_2x_3+x_1x_4 x_0x_1x_2-x_0x_2^2+x_1^2x_3 x_3^3+x_0x_3x_4-x_0x_4^2 |

                            1
o6 : R-module, quotient of R

i7 : HH^1(M)

o7 = cokernel | x_4 x_3 x_2 x_1 x_0^3 |

                            1
o7 : R-module, quotient of R

i8 : HH^2(M)

o8 = cokernel | x_4 x_3 x_2 x_1 x_0 |

                            1
o8 : R-module, quotient of R

i9 : 
