-- -*- M2-comint -*- hash: 1712410893

i1 : R = QQ[a..d];

i2 : I = ideal(a^2*b, a*b^2,c^3,d^5);

o2 : Ideal of R

i3 : I^[3]

             6 3   3 6   9   15
o3 = ideal (a b , a b , c , d  )

o3 : Ideal of R

i4 : I^[2,3,4,5]

             4 2   2 4   6   10
o4 = ideal (a b , a b , c , d  )

o4 : Ideal of R

i5 : S = QQ[x,y];

i6 : T = S[z,w];

i7 : I = ideal gens T;

o7 : Ideal of T

i8 : I^[3]

             3   3
o8 = ideal (z , w )

o8 : Ideal of T

i9 : I^[2,3]

             2   2
o9 = ideal (z , w )

o9 : Ideal of T

i10 : R = ZZ/5[a..d];

i11 : I = minors(2,matrix {{a,b,c},{b,c,d}});

o11 : Ideal of R

i12 : S = R/I;

i13 : J = ideal vars S

o13 = ideal (a, b, c, d)

o13 : Ideal of S

i14 : J^[5]

              5   3          3   5
o14 = ideal (a , a c*d, a*b*d , d )

o14 : Ideal of S

i15 : 
