-- -*- M2-comint -*- hash: -43509685

i1 : R = ZZ[a..d];

i2 : I = ideal"abc-d3,ab-d-1,a2+b2+c3-14d-3"

                     3                3    2    2
o2 = ideal (a*b*c - d , a*b - d - 1, c  + a  + b  - 14d - 3)

o2 : Ideal of R

i3 : I/size

o3 = {2, 3, 5}

o3 : List

i4 : (f->f+a*b-1)\I

               3                           3    2          2
o4 = {a*b*c - d  + a*b - 1, 2a*b - d - 2, c  + a  + a*b + b  - 14d - 4}

o4 : List

i5 : I/leadTerm/support/set//sum

o5 = set {a, b, c}

o5 : Set

i6 : 
