-- -*- M2-comint -*- hash: -1397766235

i1 : R = QQ[a..d];

i2 : I = ideal(a^2, b^2-c*d);

o2 : Ideal of R

i3 : I^3

             6   4 2    4      2 4     2 2       2 2 2   6     4        2 2 2
o3 = ideal (a , a b  - a c*d, a b  - 2a b c*d + a c d , b  - 3b c*d + 3b c d 
     ------------------------------------------------------------------------
        3 3
     - c d )

o3 : Ideal of R

i4 : trim I^3

             6     4        2 2 2    3 3   2 4     2 2       2 2 2   4 2  
o4 = ideal (b  - 3b c*d + 3b c d  - c d , a b  - 2a b c*d + a c d , a b  -
     ------------------------------------------------------------------------
      4      6
     a c*d, a )

o4 : Ideal of R

i5 : 
