-- -*- M2-comint -*- hash: -1969480400

i1 : R = QQ[a..d, MonomialOrder => Lex];

i2 : a^3 + a^2*b^2 + b*c

      3    2 2
o2 = a  + a b  + b*c

o2 : R

i3 : B = QQ[a..d,MonomialOrder=>Lex,MonomialSize=>16];

i4 : a^(2^15-1)

      32767
o4 = a

o4 : B

i5 : C = QQ[a..d,MonomialOrder=>Lex,MonomialSize=>8];

i6 : try a^(2^15-1) else "failed"

o6 = failed

i7 : a^(2^7-1)

      127
o7 = a

o7 : C

i8 : B = QQ[a..d,MonomialSize=>16,MonomialOrder=>{Weights => {1,2,3,4}, Lex}];

i9 : a^2 + b+ c + b*d

                2
o9 = b*d + c + a  + b

o9 : B

i10 : 
