-- -*- M2-comint -*- hash: 2063700229

i1 : R = QQ[a..d];

i2 : I = monomialIdeal(a*b*c,b*c*d,a^2*d,b^3*c)

                            3    2
o2 = monomialIdeal (a*b*c, b c, a d, b*c*d)

o2 : MonomialIdeal of R

i3 : I^2

                     2 2 2     4 2   6 2   3        2 3        2 2    4 2  
o3 = monomialIdeal (a b c , a*b c , b c , a b*c*d, a b c*d, a*b c d, b c d,
     ------------------------------------------------------------------------
      4 2   2     2   2 2 2
     a d , a b*c*d , b c d )

o3 : MonomialIdeal of R

i4 : I + monomialIdeal(b*c)

                          2
o4 = monomialIdeal (b*c, a d)

o4 : MonomialIdeal of R

i5 : I : monomialIdeal(b*c)

                        2
o5 = monomialIdeal (a, b , d)

o5 : MonomialIdeal of R

i6 : radical I

o6 = monomialIdeal (b*c, a*d)

o6 : MonomialIdeal of R

i7 : associatedPrimes I

o7 = {monomialIdeal (a, b), monomialIdeal (a, c), monomialIdeal (b, d),
     ------------------------------------------------------------------------
     monomialIdeal (c, d), monomialIdeal (a, b, d)}

o7 : List

i8 : primaryDecomposition I

                      2                      2                           
o8 = {monomialIdeal (a , b), monomialIdeal (a , c), monomialIdeal (b, d),
     ------------------------------------------------------------------------
                                              3
     monomialIdeal (c, d), monomialIdeal (a, b , d)}

o8 : List

i9 : borel I

                     3   2      2   3   2           2      2     2   2  
o9 = monomialIdeal (a , a b, a*b , b , a c, a*b*c, b c, a*c , b*c , a d,
     ------------------------------------------------------------------------
             2
     a*b*d, b d, a*c*d, b*c*d)

o9 : MonomialIdeal of R

i10 : isBorel I

o10 = false

i11 : I - monomialIdeal(b^3*c,b^4)

                             2
o11 = monomialIdeal (a*b*c, a d, b*c*d)

o11 : MonomialIdeal of R

i12 : standardPairs I

                                                                           
o12 = {{1, {c, d}}, {a, {c, d}}, {1, {d, b}}, {a, {d, b}}, {1, {c, a}}, {1,
      -----------------------------------------------------------------------
                           2
      {b, a}}, {b, {c}}, {b , {c}}}

o12 : List

i13 : independentSets I

o13 = {a*b, a*c, b*d, c*d}

o13 : List

i14 : dual I

                        3        2      3
o14 = monomialIdeal (a*b , a*c, a b*d, b d, c*d)

o14 : MonomialIdeal of R

i15 : 
