-- -*- M2-comint -*- hash: 1509975443

i1 : f = matrix "2,3,4;5,6,7"

o1 = | 2 3 4 |
     | 5 6 7 |

              2        3
o1 : Matrix ZZ  <--- ZZ

i2 : f ** 10

o2 = | 20 30 40 |
     | 50 60 70 |

              2        3
o2 : Matrix ZZ  <--- ZZ

i3 : QQ[x,y]

o3 = QQ[x..y]

o3 : PolynomialRing

i4 : f = matrix "x,y"

o4 = | x y |

                      1                2
o4 : Matrix (QQ[x..y])  <--- (QQ[x..y])

i5 : g = f ** y^7

o5 = | xy7 y8 |

                      1                2
o5 : Matrix (QQ[x..y])  <--- (QQ[x..y])

i6 : h = f * y^7

o6 = | xy7 y8 |

                      1                2
o6 : Matrix (QQ[x..y])  <--- (QQ[x..y])

i7 : degrees g

o7 = {{{0}}, {{8}, {8}}}

o7 : List

i8 : degrees h

o8 = {{{0}}, {{1}, {1}}}

o8 : List

i9 : 
