-- -*- M2-comint -*- hash: -946937060

i1 : MatrixExpression {{a,b,c},{a,bb,ccc}}

o1 = | a b  c   |
     | a bb ccc |

o1 : Expression of class MatrixExpression

i2 : R=QQ[x,y];

i3 : MatrixExpression append(applyTable({{x^2-y^2,x^3-y^3},{x^2-4*y^2,x^3+y^3}},factor),Degrees=>{{{-2},{-3}},{{0},{0}}})

o3 = {-2} | (x-y)(x+y)   (x-y)(x2+xy+y2) |
     {-3} | (x-2y)(x+2y) (x+y)(x2-xy+y2) |

o3 : Expression of class MatrixExpression

i4 : value oo

o4 = {-2} | x2-y2  x3-y3 |
     {-3} | x2-4y2 x3+y3 |

             2       2
o4 : Matrix R  <--- R

i5 : 
