-- -*- M2-comint -*- hash: -846476279

i1 : o = Limit => 5

o1 = Limit => 5

o1 : Option

i2 : peek o

o2 = Option{Limit, 5}

i3 : ht = new HashTable from {a => 5, b => 7}

o3 = HashTable{a => 5}
               b => 7

o3 : HashTable

i4 : keys ht

o4 = {a, b}

o4 : List

i5 : values ht

o5 = {5, 7}

o5 : List

i6 : pairs ht

o6 = {(a, 5), (b, 7)}

o6 : List

i7 : o#0

o7 = Limit

o7 : Symbol

i8 : o#1

o8 = 5

i9 : 
