-- -*- M2-comint -*- hash: 1049981117

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : x^2

      2
o2 = x

o2 : R

i3 : class x^2

o3 = R

o3 : PolynomialRing

i4 : r = 4.5

o4 = 4.5

o4 : RR (of precision 53)

i5 : s = 4.3p300

o5 = 4.3

o5 : RR (of precision 300)

i6 : precision r

o6 = 53

i7 : precision s

o7 = 300

i8 : ring r

o8 = RR
       53

o8 : RealField

i9 : ring s

o9 = RR
       300

o9 : RealField

i10 : RR'

o10 = RR
        *

o10 : Type

i11 : parent ring r     

o11 = RR
        *

o11 : Type

i12 : parent ring s

o12 = RR
        *

o12 : Type

i13 : parent ring s === RR'

o13 = true

i14 : 
