-- -*- M2-comint -*- hash: -591575826

i1 : S = QQ[x,y,z];

i2 : I = ideal(y*(x-1), z*(x-1));

o2 : Ideal of S

i3 : dim I

o3 = 2

i4 : gens gb I

o4 = | xz-z xy-y |

             1       2
o4 : Matrix S  <--- S

i5 : y % I

o5 = y

o5 : S

i6 : R = QQ[x,y,z,MonomialOrder=>{Weights=>{-1,-1,-1},RevLex},Global=>false];

i7 : J = substitute(I,R)

o7 = ideal (- y + x*y, - z + x*z)

o7 : Ideal of R

i8 : gens gb J

o8 = | y-xy z-xz |

             1       2
o8 : Matrix R  <--- R

i9 : dim J

o9 = 1

i10 : y % J

o10 = 0

o10 : R

i11 : J = substitute(J, {x=>x+1})

o11 = ideal (x*y, x*z)

o11 : Ideal of R

i12 : dim J

o12 = 2

i13 : use ring I

o13 = S

o13 : PolynomialRing

i14 : I1 = substitute(I, {x=>x+1})

o14 = ideal (x*y, x*z)

o14 : Ideal of S

i15 : dim I1

o15 = 2

i16 : 
