-- -*- M2-comint -*- hash: -1123774410

i1 : A = QQ[x,y,z];

i2 : M = image matrix{{x*y,x},{x*z,x}}

o2 = image | xy x |
           | xz x |

                             2
o2 : A-module, submodule of A

i3 : N = image matrix{{y^2,x},{z^2,x}}

o3 = image | y2 x |
           | z2 x |

                             2
o3 : A-module, submodule of A

i4 : M + N

o4 = image | xy x y2 x |
           | xz x z2 x |

                             2
o4 : A-module, submodule of A

i5 : intersect(M,N)

o5 = image | x xy2-xz2 |
           | x 0       |

                             2
o5 : A-module, submodule of A

i6 : M : N

o6 = ideal x

o6 : Ideal of A

i7 : N : M

o7 = ideal(y + z)

o7 : Ideal of A

i8 : Q = A/x^5;

i9 : M = substitute(M,Q)

o9 = image | xy x |
           | xz x |

                             2
o9 : Q-module, submodule of Q

i10 : ann M

             4
o10 = ideal x

o10 : Ideal of Q

i11 : M : x

o11 = image | 1 y-z x4 |
            | 1 0   0  |

                              2
o11 : Q-module, submodule of Q

i12 : 
