-- -*- M2-comint -*- hash: 359482608

i1 : A = QQ[x,y,z,MonomialOrder=>Lex];

i2 : f = y^4*z^3+2*x^2*y^2*z^2+3*x^5+4*z^4+5*y^2

       5     2 2 2    4 3     2     4
o2 = 3x  + 2x y z  + y z  + 5y  + 4z

o2 : A

i3 : leadMonomial f

      5
o3 = x

o3 : A

i4 : exponents leadMonomial f

o4 = {{5, 0, 0}}

o4 : List

i5 : leadTerm f

       5
o5 = 3x

o5 : A

i6 : leadCoefficient f

o6 = 3

o6 : QQ

i7 : someTerms(f,1,size f - 1)

       2 2 2    4 3     2     4
o7 = 2x y z  + y z  + 5y  + 4z

o7 : A

i8 : someTerms(f,1,-1)

       2 2 2    4 3     2     4
o8 = 2x y z  + y z  + 5y  + 4z

o8 : A

i9 : 
