-- -*- M2-comint -*- hash: 1710495522

i1 : A = QQ[x,y,z];

i2 : I1 = ideal(x,y);

o2 : Ideal of A

i3 : I2 = ideal(y^2,z);

o3 : Ideal of A

i4 : intersect(I1,I2)

                       2
o4 = ideal (y*z, x*z, y )

o4 : Ideal of A

i5 : B = QQ[t,x,y,z];

i6 : I1 = substitute(I1,B);

o6 : Ideal of B

i7 : I2 = substitute(I2,B);

o7 : Ideal of B

i8 : J = t*I1 + (1-t)*I2

                           2    2
o8 = ideal (t*x, t*y, - t*y  + y , - t*z + z)

o8 : Ideal of B

i9 : eliminate(J,t)

                       2
o9 = ideal (y*z, x*z, y )

o9 : Ideal of B

i10 : 
