-- -*- M2-comint -*- hash: 296359412

i1 : set {1,2} ** set {a,b,c}

o1 = set {(1, a), (1, b), (1, c), (2, a), (2, b), (2, c)}

o1 : Set

i2 : A = set{1,2}

o2 = set {1, 2}

o2 : Set

i3 : A ** A ** A

o3 = set {((1, 1), 1), ((1, 1), 2), ((1, 2), 1), ((1, 2), 2), ((2, 1), 1),
     ------------------------------------------------------------------------
     ((2, 1), 2), ((2, 2), 1), ((2, 2), 2)}

o3 : Set

i4 : (A ** A ** A)/splice

o4 = set {(1, 1, 1), (1, 1, 2), (1, 2, 1), (1, 2, 2), (2, 1, 1), (2, 1, 2),
     ------------------------------------------------------------------------
     (2, 2, 1), (2, 2, 2)}

o4 : Set

i5 : A^**3

o5 = set {((1, 1), 1), ((1, 1), 2), ((1, 2), 1), ((1, 2), 2), ((2, 1), 1),
     ------------------------------------------------------------------------
     ((2, 1), 2), ((2, 2), 1), ((2, 2), 2)}

o5 : Set

i6 : 
