-- -*- M2-comint -*- hash: -1703764256

i1 : R = ZZ[x,y,z];

i2 : use R;

i3 : S = ZZ[x,t];

i4 : x

o4 = x

o4 : S

i5 : R_0

o5 = x

o5 : R

i6 : R_"x"

o6 = x

o6 : R

i7 : use R;

i8 : x

o8 = x

o8 : R

i9 : 
