-- -*- M2-comint -*- hash: -2050610830

i1 : {1,2,3} === {1,2,3}

o1 = true

i2 : {1,2,3} === {2,1,3}

o2 = false

i3 : R = QQ[a..d];

i4 : a^2+b === b+a^2

o4 = true

i5 : ideal(a^2+b,c*d) === ideal(b+a^2,c*d+b+a^2)

o5 = false

i6 : matrix{{a,b,c}} === matrix{{a,b,c}}

o6 = true

i7 : matrix{{a,b,c}} === transpose matrix{{a},{b},{c}}

o7 = false

i8 : A = QQ[x]; B = QQ[x];

i10 : A === B

o10 = false

i11 : 
