-- -*- M2-comint -*- hash: 128668123

i1 : R = (ZZ[x,y,z])^3;

i2 : v = vector {1,x,x*y,x*z,x*y*z}

o2 = |  1  |
     |  x  |
     |  xy |
     |  xz |
     | xyz |

               5
o2 : (ZZ[x..z])

i3 : w = vector {z*x,z^2,3}

o3 = | xz |
     | z2 |
     |  3 |

               3
o3 : (ZZ[x..z])

i4 : v || w

o4 = |  1  |
     |  x  |
     |  xy |
     |  xz |
     | xyz |
     |  xz |
     |  z2 |
     |  3  |

               8
o4 : (ZZ[x..z])

i5 : 
