-- -*- M2-comint -*- hash: 215482166

i1 : R = QQ[x,y,dx,dy,t,WeylAlgebra => {x=>dx, y=>dy}]

o1 = R

o1 : PolynomialRing, 2 differential variables

i2 : dx*dy*x*y

o2 = x*y*dx*dy + x*dx + y*dy + 1

o2 : R

i3 : dx*x^5

      5       4
o3 = x dx + 5x

o3 : R

i4 : dx*x

o4 = x*dx + 1

o4 : R

i5 : matrix{{dx}} * matrix{{x}}

o5 = | xdx |

             1       1
o5 : Matrix R  <--- R

i6 : isWeylAlgebra R

o6 = true

i7 : S = QQ[x,y]

o7 = S

o7 : PolynomialRing

i8 : isWeylAlgebra S

o8 = false

i9 : 
