-- -*- M2-comint -*- hash: -2080627726

i1 : 0 ..< 10

o1 = (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

o1 : Sequence

i2 : x = {a,c,e,f}

o2 = {a, c, e, f}

o2 : List

i3 : 0 ..< #x

o3 = (0, 1, 2, 3)

o3 : Sequence

i4 : apply(0 ..< #x, i -> x#i)

o4 = (a, c, e, f)

o4 : Sequence

i5 : 
