-- -*- M2-comint -*- hash: 1005907374

i1 : x

o1 = x

o1 : Symbol

i2 : x := 4

o2 = 4

i3 : x

o3 = 4

i4 : g = () -> ( p := 444; p )

o4 = g

o4 : FunctionClosure

i5 : g()

o5 = 444

i6 : p

o6 = p

o6 : Symbol

i7 : i="a b c";

i8 : for i to 3 list j := i+1

o8 = {1, 2, 3, 4}

o8 : List

i9 : i

o9 = a b c

i10 : j

o10 = j

o10 : Symbol

i11 : g = () -> ( p := 444; () -> p )

o11 = g

o11 : FunctionClosure

i12 : g()

o12 = -*Function[stdio:11:26-11:29]*-

o12 : FunctionClosure

i13 : oo ()

o13 = 444

i14 : g = () -> ( p := 444; (() -> p, i -> p = i))

o14 = g

o14 : FunctionClosure

i15 : (b,c) = g()

o15 = (b, c)

o15 : Sequence

i16 : b()

o16 = 444

i17 : c 555

o17 = 555

i18 : b()

o18 = 555

i19 : a := b := 44

o19 = 44

i20 : a

o20 = 44

i21 : b

o21 = 44

i22 : g = () -> (
           x := local x;
           R := QQ[x];
           (x+2)^10);

i23 : g()

       10      9       8       7        6        5         4         3  
o23 = x   + 20x  + 180x  + 960x  + 3360x  + 8064x  + 13440x  + 15360x  +
      -----------------------------------------------------------------------
            2
      11520x  + 5120x + 1024

o23 : QQ[x]

i24 : f = i -> (i,i^2)

o24 = f

o24 : FunctionClosure

i25 : (r,s) := f 9

o25 = (9, 81)

o25 : Sequence

i26 : r

o26 = 9

i27 : s

o27 = 81

i28 : 
      String * String := peek;

i29 : "left" * "right"

o29 = ("left", "right")

i30 : String * Number := peek;

i31 : "left" * 33

o31 = ("left", 33)

i32 : "left" * 3.3

o32 = ("left", 3.3)

i33 : ZZ + ZZ := (x,y) -> x+y+100

o33 = -*Function[stdio:37:18-37:25]*-

o33 : FunctionClosure

i34 : 3 + 4

o34 = 7

i35 : QQ // QQ := (w,z) -> (numerator w + numerator z)/(denominator w + denominator z)

o35 = -*Function[stdio:39:19-39:79]*-

o35 : FunctionClosure

i36 : (3/5) // (6/7)

      3
o36 = -
      4

o36 : QQ

i37 : - String := peek;

i38 : - "foo"

o38 = "foo"

i39 : - String := peek;

i40 : - "foo"

o40 = "foo"

i41 : String ~ := peek;

i42 : "foo" ~

o42 = "foo"

i43 : String ~ := peek;

i44 : "foo" ~

o44 = "foo"

i45 : source String := peek;

i46 : source "foo"

o46 = "foo"

i47 : source String := peek;

i48 : source "foo"

o48 = "foo"

i49 : source(String,Number) := peek;

i50 : source("foo",33)

o50 = ("foo", 33)

i51 : source("foo",3.3)

o51 = ("foo", 3.3)

i52 : source(String,String) := peek;

i53 : source("foo","bar")

o53 = ("foo", "bar")

i54 : 
