-- -*- M2-comint -*- hash: -213547874

i1 : x

o1 = x

o1 : Symbol

i2 : x = 4

o2 = 4

i3 : x

o3 = 4

i4 : x = y = 44

o4 = 44

i5 : x

o5 = 44

i6 : y

o6 = 44

i7 : x = 444

o7 = 444

i8 : y = foo

o8 = foo

o8 : Symbol

i9 : (y,x) = (x,y)

o9 = (444, foo)

o9 : Sequence

i10 : x

o10 = foo

o10 : Symbol

i11 : y

o11 = 444

i12 : f = i -> (i,i^2)

o12 = f

o12 : FunctionClosure

i13 : (x,y) = f 9

o13 = (9, 81)

o13 : Sequence

i14 : x

o14 = 9

i15 : y

o15 = 81

i16 : x = new MutableList from a .. e

o16 = MutableList{...5...}

o16 : MutableList

i17 : peek x

o17 = MutableList{a, b, c, d, e}

i18 : x#3

o18 = d

o18 : Symbol

i19 : x#3 = "foo"

o19 = foo

i20 : x#3

o20 = foo

i21 : peek x

o21 = MutableList{a, b, c, foo, e}

i22 : x = new MutableHashTable from { "a" => 2, "b" => 3 }

o22 = MutableHashTable{...2...}

o22 : MutableHashTable

i23 : peek x

o23 = MutableHashTable{a => 2}
                       b => 3

i24 : x#?"foo"

o24 = false

i25 : x#"foo" = "bar"

o25 = bar

i26 : x#?"foo"

o26 = true

i27 : x#"foo"

o27 = bar

i28 : peek x

o28 = MutableHashTable{a => 2    }
                       b => 3
                       foo => bar

i29 : 
      String * String = peek;

i30 : "left" * "right" = "value"

o30 = ("left", "right", "value")

i31 : String * String = peek;

i32 : "left" * "right" = "value"

o32 = ("left", "right", "value")

i33 : s

o33 = s

o33 : Symbol

i34 : s_2

o34 = s
       2

o34 : IndexedVariable

i35 : s_2 = 44

o35 = 44

i36 : s_2

o36 = 44

i37 : s_(i,j)

o37 = s
       i,j

o37 : IndexedVariable

i38 : symbol s_2

o38 = s
       2

o38 : IndexedVariable

i39 : value oo

o39 = 44

i40 : - String = peek;

i41 : - "foo" = "value"

o41 = ("foo", "value")

i42 : - String = peek;

i43 : - "foo" = "value"

o43 = ("foo", "value")

i44 : String ~ = peek;

i45 : "foo" ~ = "value"

o45 = ("foo", "value")

i46 : String ~ = peek;

i47 : "foo" ~ = "value"

o47 = ("foo", "value")

i48 : 
