-- -*- M2-comint -*- hash: 193507616

i1 : R = QQ[a,b,c];

i2 : ideal(a^2-b,a^3) == ideal(b^2, a*b, a^2-b)

o2 = true

i3 : L = ideal(a^2-a-1,a^3+a+3)

             2           3
o3 = ideal (a  - a - 1, a  + a + 3)

o3 : Ideal of R

i4 : L == 1

o4 = true

i5 : L == 0

o5 = false

i6 : m = matrix{{a,b},{c,a}}

o6 = | a b |
     | c a |

             2       2
o6 : Matrix R  <--- R

i7 : n = map(R^2,R^2,m)

o7 = | a b |
     | c a |

             2       2
o7 : Matrix R  <--- R

i8 : m == n

o8 = false

i9 : source m == source n

o9 = false

i10 : m-n == 0

o10 = true

i11 : image matrix {{2,a},{1,5}} == R^2

o11 = false

i12 : image matrix {{2,a},{0,5}} == R^2

o12 = true

i13 : interval(1,3) == interval(1,3)

o13 = true

i14 : interval(1/2) == 1/2

o14 = true

i15 : interval(1/3) == 1/3

o15 = false

i16 : 
