-- -*- M2-comint -*- hash: 920497639

i1 : L = {a, b, c, b, a};

i2 : L#?2

o2 = true

i3 : L#?12

o3 = false

i4 : T = new HashTable from {a => 103, b => 89.4, c => 92};

i5 : T#?a

o5 = true

i6 : T#?A

o6 = false

i7 : s = "a perfectly adequate example of a string";

i8 : s#?2

o8 = true

i9 : s#?52

o9 = false

i10 : 
