-- -*- M2-comint -*- hash: 68593483

i1 : L = {1, 2, 3, 2, 1};

i2 : #L

o2 = 5

i3 : S = new Set from L

o3 = set {1, 2, 3}

o3 : Set

i4 : #S

o4 = 3

i5 : T = new HashTable from {a => 1, b => 2}

o5 = HashTable{a => 1}
               b => 2

o5 : HashTable

i6 : #T

o6 = 2

i7 : s = "a perfectly adequate example of a string";

i8 : #s

o8 = 40

i9 : 
