-- -*- M2-comint -*- hash: -1050597415

i1 : append({1, 7, 8, 3}, 3)

o1 = {1, 7, 8, 3, 3}

o1 : List

i2 : L = {"old", "old", "old"};

i3 : append(L, "new")

o3 = {old, old, old, new}

o3 : List

i4 : K = (a, b, c);

i5 : append(K, z)

o5 = (a, b, c, z)

o5 : Sequence

i6 : join(K, (x, y, z))

o6 = (a, b, c, x, y, z)

o6 : Sequence

i7 : prepend(z, K)

o7 = (z, a, b, c)

o7 : Sequence

i8 : insert(1, z, K)

o8 = (a, z, b, c)

o8 : Sequence

i9 : L = new MutableList from {2,3,5};

i10 : peek append(L, 7)

o10 = MutableList{2, 3, 5, 7}

i11 : peek L

o11 = MutableList{2, 3, 5}

i12 : 
