-- -*- M2-comint -*- hash: 17856308

i1 : apply({1,3,5,7}, i -> i^2)

o1 = {1, 9, 25, 49}

o1 : List

i2 : apply([1,3,5,7], i -> i^2)

o2 = [1, 9, 25, 49]

o2 : Array

i3 : apply((1,3,5,7), i -> i^2)

o3 = (1, 9, 25, 49)

o3 : Sequence

i4 : apply("foo", identity)

o4 = (f, o, o)

o4 : Sequence

i5 : 
