-- -*- M2-comint -*- hash: 323234572

i1 : H = new HashTable from {1 => 10, 2 => 15, 3 => 20}

o1 = HashTable{1 => 10}
               2 => 15
               3 => 20

o1 : HashTable

i2 : applyValues(H, v -> v + 100)

o2 = HashTable{1 => 110}
               2 => 115
               3 => 120

o2 : HashTable

i3 : applyValues(H, v -> 1)

o3 = HashTable{1 => 1}
               2 => 1
               3 => 1

o3 : HashTable

i4 : 
