-- -*- M2-comint -*- hash: 1968972089

i1 : apply({1,2,3}, {100,200,300}, (i,j) -> i+j)

o1 = {101, 202, 303}

o1 : List

i2 : apply([1,2,3], [100,200,300], (i,j) -> i+j)

o2 = [101, 202, 303]

o2 : Array

i3 : apply((1,2,3), (100,200,300), (i,j) -> i+j)

o3 = (101, 202, 303)

o3 : Sequence

i4 : apply("foo", "bar", concatenate)

o4 = (fb, oa, or)

o4 : Sequence

i5 : 
