-- -*- M2-comint -*- hash: -1718364441

i1 : 1234

o1 = 1234

i2 : 123/4

     123
o2 = ---
      4

o2 : QQ

i3 : 123.4

o3 = 123.4

o3 : RR (of precision 53)

i4 : 1.234e-20

o4 = 1.234e-20

o4 : RR (of precision 53)

i5 : 123+4*ii

o5 = 123+4*ii

o5 : CC (of precision 53)

i6 : 0b10011010010 -- binary

o6 = 1234

i7 : 0o2322 -- octal

o7 = 1234

i8 : 0x4d2 -- hexadecimal

o8 = 1234

i9 : 4/5 + 2/3

     22
o9 = --
     15

o9 : QQ

i10 : 10^20

o10 = 100000000000000000000

i11 : 3*5*7

o11 = 105

i12 : 3.1^2.1

o12 = 10.7611716060997

o12 : RR (of precision 53)

i13 : sqrt 3.

o13 = 1.73205080756888

o13 : RR (of precision 53)

i14 : 1234//100

o14 = 12

i15 : 1234%100

o15 = 34

i16 : 1_QQ

o16 = 1

o16 : QQ

i17 : (2/3)_CC

o17 = .666666666666667

o17 : CC (of precision 53)

i18 : 1p300

o18 = 1

o18 : RR (of precision 300)

i19 : 1p300e-30

o19 = 1e-30

o19 : RR (of precision 300)

i20 : x = 2/3*ii/ii

o20 = .666666666666667

o20 : CC (of precision 53)

i21 : lift(x,RR)

o21 = .666666666666667

o21 : RR (of precision 53)

i22 : lift(x,QQ)

      2
o22 = -
      3

o22 : QQ

i23 : 
