-- -*- M2-comint -*- hash: 1885578732

i1 : baseRing QQ

o1 = ZZ

o1 : Ring

i2 : R = QQ[x,y]

o2 = R

o2 : PolynomialRing

i3 : S = R / (x^2 + y^3 - 1)

o3 = S

o3 : QuotientRing

i4 : T = frac S

o4 = T

o4 : FractionField

i5 : baseRing T

o5 = S

o5 : QuotientRing

i6 : baseRing S

o6 = R

o6 : PolynomialRing

i7 : baseRing R

o7 = QQ

o7 : Ring

i8 : T.baseRings

o8 = {ZZ, QQ, R, S}

o8 : List

i9 : 
