-- -*- M2-comint -*- hash: 1669778186

i1 : for i from 1 to 10 do if i == 7 then break 12345

o1 = 12345

i2 : table(3,3,(i,j) -> if i == 1 then break 3 else "hi")

o2 = {{hi, hi, hi}, 3, {hi, hi, hi}}

o2 : List

i3 : table(3,3,(i,j) -> if j == 1 then break 3 else "hi")

o3 = {3, 3, 3}

o3 : List

i4 : load "Macaulay2Doc/demo1.m2"

i5 : g 2
../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Macaulay2Doc/demo1.m2:8:12:(3):[2]: error: division by zero
../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Macaulay2Doc/demo1.m2:8:12:(3):[2]: --entering debugger (type help to see debugger commands)
../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Macaulay2Doc/demo1.m2:8:11-8:13: --source code:
     b := 1/x;

ii6 : x

oo6 = 0

ii7 : break

i8 : g 3

     7
o8 = -
     2

o8 : QQ

i9 : 
