-- -*- M2-comint -*- hash: 1125661120

i1 : F = ZZ^3

       3
o1 = ZZ

o1 : ZZ-module, free

i2 : peek F

o2 = Module of Vector{cache => CacheTable{...2...}                     }
                      numgens => 3
                      RawFreeModule => free(rank 3 degrees = {1, 1, 1})
                      ring => ZZ

i3 : F.cache#Foo = Bar

o3 = Bar

o3 : Symbol

i4 : peek F

o4 = Module of Vector{cache => CacheTable{...3...}                     }
                      numgens => 3
                      RawFreeModule => free(rank 3 degrees = {1, 1, 1})
                      ring => ZZ

i5 : peek F.cache

o5 = CacheTable{cache => MutableHashTable{}}
                Foo => Bar
                rank => 3

i6 : F === ZZ^3

o6 = true

i7 : 
