-- -*- M2-comint -*- hash: 86955367

i1 : run "uname -a"
Darwin Mac-1675602938682.local 21.6.0 Darwin Kernel Version 21.6.0: Mon Dec 19 20:44:01 PST 2022; root:xnu-8020.240.18~2/RELEASE_X86_64 x86_64

o1 = 0

i2 : "!grep a" << " ba \n bc \n ad \n ef \n" << close
 ba 
 ad 

o2 = !grep a

o2 : File

i3 : peek get "!uname -a"

o3 = "Darwin Mac-1675602938682.local 21.6.0 Darwin Kernel Version 21.6.0: Mon
     "
     Dec 19 20:44:01 PST 2022; root:xnu-8020.240.18~2/RELEASE_X86_64 x86_64

i4 : f = openInOut "!egrep '^in'"

o4 = !egrep '^in'

o4 : File

i5 : scan(keys Core.Dictionary, key -> f << key << endl)

i6 : f << closeOut

o6 = !egrep '^in'

o6 : File

i7 : get f

o7 = interpreterDepth
     infoHelp
     integrate
     inducedMap
     installPackage
     installMethod
     insert
     instance
     info
     interval
     intersect
     inversePermutation
     installedPackages
     input
     inverseErf
     index
     indexComponents
     installAssignmentMethod
     infinity
     intersection
     inducesWellDefinedMap
     inverseRegularizedGamma
     inverse
     indices
     incomparable
     installHilbertFunction
     indeterminate
     in
     inverseRegularizedBeta
     instances
     independentSets


i8 : f = openIn "!sleep 5; echo -n the answer is 4"

o8 = !sleep 5; echo -n the answer is 4

o8 : File

i9 : isReady f

o9 = false

i10 : while not isReady f do (sleep 1; << "." << flush)
.....
i11 : read f

o11 = -n the answer is 4


i12 : isReady f

o12 = true

i13 : atEndOfFile f

o13 = true

i14 : close f

o14 = !sleep 5; echo -n the answer is 4

o14 : File

i15 : 
