-- -*- M2-comint -*- hash: 638983327

i1 : K3 = Proj(QQ[x_0..x_3]/(x_0^4+x_1^4+x_2^4+x_3^4-11*x_0*x_1*x_2*x_3))

o1 = K3

o1 : ProjectiveVariety

i2 : omega1 = cotangentSheaf(1,K3);

i3 : HH^1(omega1)

       20
o3 = QQ

o3 : QQ-module, free

i4 : FermatQuintic = Proj(QQ[x_0..x_4]/(x_0^5+x_1^5+x_2^5+x_3^5+x_4^5))

o4 = FermatQuintic

o4 : ProjectiveVariety

i5 : omega1 = cotangentSheaf(1,FermatQuintic);

i6 : HH^1(omega1)

       1
o6 = QQ

o6 : QQ-module, free

i7 : omega2 = cotangentSheaf(2,FermatQuintic);

i8 : HH^1(omega2)

       101
o8 = QQ

o8 : QQ-module, free

i9 : HH^2(omega1)

       101
o9 = QQ

o9 : QQ-module, free

i10 : 
