-- -*- M2-comint -*- hash: 1944153207

i1 : load "Macaulay2Doc/demo1.m2"

i2 : code g

o2 = ../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Macaulay2Doc/demo1.m2:11:7-14:8: --source code:
     g = y -> (
          c := f(y-1);
          d := f(y-2);
          c+d)

i3 : g 2
../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Macaulay2Doc/demo1.m2:8:12:(3):[2]: error: division by zero
../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Macaulay2Doc/demo1.m2:8:12:(3):[2]: --entering debugger (type help to see debugger commands)
../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Macaulay2Doc/demo1.m2:8:11-8:13: --source code:
     b := 1/x;

ii4 : code current

oo4 = ../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/
           b := 1/x;
      -----------------------------------------------------------------------
      packages/Macaulay2Doc/demo1.m2:8:11-8:13: --source code:

ii5 : disassemble current

oo5 = (2-OP / 1 (fetch 0 0))

ii6 : value current
../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Macaulay2Doc/demo1.m2:8:12:(3): error: division by zero

ii7 : x = 11

oo7 = 11

ii8 : value current

       1
oo8 = --
      11

oo8 : QQ

ii9 : continue

     34
o9 = --
     11

o9 : QQ

i10 : 
