-- -*- M2-comint -*- hash: 974777312

i1 : X = {(), (0, (1, 2, (3, 4))), (5, (6, 7)), 8, 9};

i2 : splice X

o2 = {0, (1, 2, (3, 4)), 5, (6, 7), 8, 9}

o2 : List

i3 : deepSplice X

o3 = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9}

o3 : List

i4 : Z = {(), {0, {1, 2, (3, 4)}}, [5, [6, 7]], 8, 9};

i5 : deepSplice Z

o5 = {{0, {1, 2, (3, 4)}}, [5, [6, 7]], 8, 9}

o5 : List

i6 : deepSplice ((), (0, (1, 2, (3, 4))), (5, (6, 7)), 8, 9)

o6 = (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

o6 : Sequence

i7 : M = new MutableList from X

o7 = MutableList{...5...}

o7 : MutableList

i8 : deepSplice M

o8 = MutableList{...10...}

o8 : MutableList

i9 : M

o9 = MutableList{...5...}

o9 : MutableList

i10 : 
