-- -*- M2-comint -*- hash: -2080456324

i1 : R = ZZ/101[x,y,z];

i2 : degrees R

o2 = {{1}, {1}, {1}}

o2 : List

i3 : S = ZZ/101[x,y,z,Degrees => {{2,3},{1,2},{2,0}}];

i4 : degrees S

o4 = {{2, 3}, {1, 2}, {2, 0}}

o4 : List

i5 : I = ideal"xy2,xyz,y3"

               2          3
o5 = ideal (x*y , x*y*z, y )

o5 : Ideal of S

i6 : degrees I

o6 = {{4, 7}, {5, 5}, {3, 6}}

o6 : List

i7 : degrees R^5

o7 = {{0}, {0}, {0}, {0}, {0}}

o7 : List

i8 : degrees R^{1,2,3,4}

o8 = {{-1}, {-2}, {-3}, {-4}}

o8 : List

i9 : 
