-- -*- M2-comint -*- hash: -933383054

i1 : degreesMonoid {1,2,3}

o1 = monoid[T ..T , Degrees => {1..3}, MonomialOrder => {MonomialSize => 32     }, Inverses => true, Global => false]
             0   2                                      {Weights => {-1, -2, -3}}
                                                        {GroupLex => 3          }
                                                        {Position => Up         }

o1 : GeneralOrderedMonoid

i2 : degreesMonoid 3

o2 = monoid[T ..T , Degrees => {3:{}}, MonomialOrder => {MonomialSize => 32}, Inverses => true, Global => false]
             0   2                                      {Weights => {3:-1} }
                                                        {GroupLex => 3     }
                                                        {Position => Up    }

o2 : GeneralOrderedMonoid

i3 : assert instance(T_0, IndexedVariable)

i4 : use degreesMonoid 3

o4 = monoid[T ..T , Degrees => {3:{}}, MonomialOrder => {MonomialSize => 32}, Inverses => true, Global => false]
             0   2                                      {Weights => {3:-1} }
                                                        {GroupLex => 3     }
                                                        {Position => Up    }

o4 : GeneralOrderedMonoid

i5 : assert instance(T_0, degreesMonoid 3)

i6 : A = degreesRing 4

o6 = A

o6 : PolynomialRing

i7 : assert instance(T_0, degreesRing 4)

i8 : 
