-- -*- M2-comint -*- hash: -284212226

i1 : R = ZZ/101[a,b,c_1,c_2];

i2 : R

o2 = R

o2 : PolynomialRing

i3 : describe R

      ZZ
o3 = ---[a..b, c ..c , Degrees => {4:1}, Heft => {1}]
     101        1   2

i4 : toString describe R

o4 = (ZZ/101)[a..b, c_1..c_2, Degrees => {4:1}, Heft => {1}]

i5 : toExternalString R

o5 = (ZZ/101)[a..b, c_1..c_2, Degrees => {4:1}, Heft => {1}]

i6 : QQ[x, dx, WeylAlgebra => { x => dx }]

o6 = QQ[x, dx]

o6 : PolynomialRing, 1 differential variables

i7 : describe oo

o7 = QQ[x, dx, Degrees => {2:1}, Heft => {1}, WeylAlgebra => {{x, dx}}]

i8 : 
