-- -*- M2-comint -*- hash: 34841363

i1 : newPackage "PKG"

o1 = PKG

o1 : Package

i2 : export "x1"

o2 = {x1}

o2 : List

i3 : x1=3

o3 = 3

i4 : endPackage "PKG"

o4 = PKG

o4 : Package

i5 : dictionaryPath

o5 = {PKG.Dictionary, Isomorphism.Dictionary, OnlineLookup.Dictionary,
     ------------------------------------------------------------------------
     SimpleDoc.Dictionary, InverseSystems.Dictionary,
     ------------------------------------------------------------------------
     ConwayPolynomials.Dictionary, ReesAlgebra.Dictionary,
     ------------------------------------------------------------------------
     TangentCone.Dictionary, Classic.Dictionary, Saturation.Dictionary,
     ------------------------------------------------------------------------
     Elimination.Dictionary, MinimalPrimes.Dictionary,
     ------------------------------------------------------------------------
     PrimaryDecomposition.Dictionary, IntegralClosure.Dictionary,
     ------------------------------------------------------------------------
     LLLBases.Dictionary, User#"private dictionary", User.Dictionary,
     ------------------------------------------------------------------------
     Core.Dictionary, OutputDictionary, PackageDictionary}

o5 : List

i6 : x1

o6 = 3

i7 : dismiss PKG

o7 = PKG

o7 : Package

i8 : dictionaryPath

o8 = {Isomorphism.Dictionary, OnlineLookup.Dictionary, SimpleDoc.Dictionary,
     ------------------------------------------------------------------------
     InverseSystems.Dictionary, ConwayPolynomials.Dictionary,
     ------------------------------------------------------------------------
     ReesAlgebra.Dictionary, TangentCone.Dictionary, Classic.Dictionary,
     ------------------------------------------------------------------------
     Saturation.Dictionary, Elimination.Dictionary, MinimalPrimes.Dictionary,
     ------------------------------------------------------------------------
     PrimaryDecomposition.Dictionary, IntegralClosure.Dictionary,
     ------------------------------------------------------------------------
     LLLBases.Dictionary, User#"private dictionary", User.Dictionary,
     ------------------------------------------------------------------------
     Core.Dictionary, OutputDictionary, PackageDictionary}

o8 : List

i9 : x1

o9 = x1

o9 : Symbol

i10 : values PackageDictionary

o10 = {PrimaryDecomposition, SimpleDoc, PrimaryDecomposition, SimpleDoc,
      -----------------------------------------------------------------------
      OnlineLookup, Text, OnlineLookup, Text, IntegralClosure, Parsing,
      -----------------------------------------------------------------------
      IntegralClosure, ConwayPolynomials, Parsing, ConwayPolynomials,
      -----------------------------------------------------------------------
      LLLBases, LLLBases, Isomorphism, Isomorphism, Elimination, ReesAlgebra,
      -----------------------------------------------------------------------
      Elimination, TangentCone, ReesAlgebra, TangentCone, User, PKG, PKG,
      -----------------------------------------------------------------------
      Saturation, InverseSystems, Classic, Saturation, InverseSystems,
      -----------------------------------------------------------------------
      Classic, MinimalPrimes, MinimalPrimes, Core, Core}

o10 : List

i11 : use PKG

o11 = PKG

o11 : Package

i12 : x1

o12 = 3

i13 : 
