-- -*- M2-comint -*- hash: 1486616916

i1 : R = ZZ[x,y,z];

i2 : S = ZZ/101[x,y,z,Degrees => {{1,2},{1,3},{1,3}}]/ideal(x+z^3);

i3 : F = map(S,R,{x,y^2,z^3})

                     2
o3 = map (S, R, {x, y , -x})

o3 : RingMap S <--- R

i4 : use R; F(107*x+y+z)

      2
o5 = y  + 5x

o5 : S

i6 : T = ZZ/5[x,y];

i7 : G = map(T,S);

o7 : RingMap T <--- S

i8 : G*F

                     2
o8 = map (T, R, {x, y , -x})

o8 : RingMap T <--- R

i9 : use R; G(F(107*x+y+z))

       2
o10 = y

o10 : T

i11 : 
