-- -*- M2-comint -*- hash: -454742809

i1 : R = QQ[x,y,z, SkewCommutative => true]

o1 = R

o1 : PolynomialRing, 3 skew commutative variables

i2 : y*x

o2 = -x*y

o2 : R

i3 : (x+y+z)^2

o3 = 0

o3 : R

i4 : basis R

o4 = | 1 x xy xyz xz y yz z |

             1       8
o4 : Matrix R  <--- R

i5 : basis(2,R)

o5 = | xy xz yz |

             1       3
o5 : Matrix R  <--- R

i6 : S = QQ[a,b,r,s,t, SkewCommutative=>true, Degrees=>{2,2,1,1,1}];

i7 : r*a == a*r

o7 = false

i8 : a*a

o8 = 0

o8 : S

i9 : f = a*r+b*s; f^2

o10 = -2a*b*r*s

o10 : S

i11 : basis(2,S)

o11 = | a b rs rt st |

              1       5
o11 : Matrix S  <--- S

i12 : x*y

o12 = x*y

o12 : R

i13 : matrix{{x}} * matrix{{y}}

o13 = | -xy |

              1       1
o13 : Matrix R  <--- R

i14 : 
