-- -*- M2-comint -*- hash: -485872436

i1 : R = ZZ[w,x,y,z];

i2 : I = ideal(z*w-2*x*y, 3*w^3-z^3,w*x^2-4*y*z^2,x);

o2 : Ideal of R

i3 : I_0

o3 = - 2x*y + w*z

o3 : R

i4 : I_3

o4 = x

o4 : R

i5 : gens I

o5 = | -2xy+wz 3w3-z3 wx2-4yz2 x |

             1       4
o5 : Matrix R  <--- R

i6 : first entries gens I

                      3    3     2       2
o6 = {- 2x*y + w*z, 3w  - z , w*x  - 4y*z , x}

o6 : List

i7 : numgens I

o7 = 4

i8 : mingens I

o8 = | x wz 4yz2 3w3-z3 |

             1       4
o8 : Matrix R  <--- R

i9 : trim I

                        2    3    3
o9 = ideal (x, w*z, 4y*z , 3w  - z )

o9 : Ideal of R

i10 : R = QQ[a..d];

i11 : I = monomialCurveIdeal(R,{1,2,3});

o11 : Ideal of R

i12 : toString I

o12 = ideal(c^2-b*d,b*c-a*d,b^2-a*c)

i13 : 
