-- -*- M2-comint -*- hash: 995787538

i1 : fn = temporaryFileName()

o1 = /private/tmp/M2-55783-0/0

i2 : f = fn << "hi there"

o2 = /private/tmp/M2-55783-0/0

o2 : File

i3 : m = 7 + 7*8 + 7*64

o3 = 511

i4 : fileMode(m,f)

i5 : fileMode f

o5 = 511

i6 : close f

o6 = /private/tmp/M2-55783-0/0

o6 : File

i7 : fileMode fn

o7 = 511

i8 : removeFile fn

i9 : 
