-- -*- M2-comint -*- hash: 434650730

i1 : f = temporaryFileName() << "hi there"

o1 = /private/tmp/M2-67137-0/0

o1 : File

i2 : fileLength f

o2 = 8

i3 : close f

o3 = /private/tmp/M2-67137-0/0

o3 : File

i4 : filename = toString f

o4 = /private/tmp/M2-67137-0/0

i5 : fileLength filename

o5 = 8

i6 : get filename

o6 = hi there

i7 : length oo

o7 = 8

i8 : removeFile filename

i9 : 
