-- -*- M2-comint -*- hash: 1235519143

i1 : A = ZZ[x] / (x^2-3);  R = A[y,z] / (x*y^2-z^2, y^3);

i3 : describe R

         A[y..z]
o3 = ---------------
         2    2   3
     (x*y  - z , y )

i4 : flattenRing R

            ZZ[y..z, x]                  ZZ[y..z, x]
o4 = (----------------------, map (----------------------, R, {y, z, x}))
        2       2     2   3          2       2     2   3
      (x  - 3, y x - z , y )       (x  - 3, y x - z , y )

o4 : Sequence

i5 : I = ideal(y^2 - 3*x*z)

            2
o5 = ideal(y  - 3x*z)

o5 : Ideal of R

i6 : (S, F) = flattenRing R;

i7 : F(I)

            2
o7 = ideal(y  - 3z*x)

o7 : Ideal of S

i8 : A = ZZ[x] / (x^2-3);  R = A[y,z] / (x*y^2-z^2, y^3);

i10 : I = ideal(y^2 - 3*x*z);

o10 : Ideal of R

i11 : (J, F) = flattenRing I

               2       2     2   3   2
o11 = (ideal (x  - 3, y x - z , y , y  - 3z*x), map (ZZ[y..z, x], R, {y, z,
      -----------------------------------------------------------------------
      x}))

o11 : Sequence

i12 : K = GF(5^3)

o12 = K

o12 : GaloisField

i13 : flattenRing K

          ZZ                ZZ
          --[a]             --[a]
           5                 5
o13 = (-----------, map (-----------, K, {a}))
        3                 3
       a  - 2a - 2       a  - 2a - 2

o13 : Sequence

i14 : L = GF(7, 5, Variable => z);

i15 : flattenRing L

          ZZ               ZZ
          --[z]            --[z]
           7                7
o15 = (----------, map (----------, L, {z}))
        5                5
       z  + z - 3       z  + z - 3

o15 : Sequence

i16 : flattenRing(R, Result => 1)

            ZZ[y..z, x]
o16 = ----------------------
        2       2     2   3
      (x  - 3, y x - z , y )

o16 : QuotientRing

i17 : flattenRing(R, Result => 2)

             ZZ[y..z, x]                  ZZ[y..z, x]
o17 = (----------------------, map (----------------------, R, {y, z, x}))
         2       2     2   3          2       2     2   3
       (x  - 3, y x - z , y )       (x  - 3, y x - z , y )

o17 : Sequence

i18 : flattenRing(R, Result => 3)

             ZZ[y..z, x]                  ZZ[y..z, x]                     
o18 = (----------------------, map (----------------------, R, {y, z, x}),
         2       2     2   3          2       2     2   3                 
       (x  - 3, y x - z , y )       (x  - 3, y x - z , y )                
      -----------------------------------------------------------------------
                    ZZ[y..z, x]
      map (R, ----------------------, {y, z, x}))
                2       2     2   3
              (x  - 3, y x - z , y )

o18 : Sequence

i19 : flattenRing(R, Result => (Nothing, RingMap))

o19 = (, map (ZZ[y..z, x], R, {y, z, x}))

o19 : Sequence

i20 : flattenRing(R, Result => (Ring, Nothing, RingMap))

             ZZ[y..z, x]                       ZZ[y..z, x]
o20 = (----------------------, , map (R, ----------------------, {y, z, x}))
         2       2     2   3               2       2     2   3
       (x  - 3, y x - z , y )            (x  - 3, y x - z , y )

o20 : Sequence

i21 : flattenRing(R, Result => (Nothing, ))

o21 = (, map (ZZ[y..z, x], R, {y, z, x}))

o21 : Sequence

i22 : flattenRing(R, Result => ( , Nothing, ) )

             ZZ[y..z, x]                       ZZ[y..z, x]
o22 = (----------------------, , map (R, ----------------------, {y, z, x}))
         2       2     2   3               2       2     2   3
       (x  - 3, y x - z , y )            (x  - 3, y x - z , y )

o22 : Sequence

i23 : flattenRing(I, Result => 1)

              2       2     2   3   2
o23 = ideal (x  - 3, y x - z , y , y  - 3z*x)

o23 : Ideal of ZZ[y..z, x]

i24 : flattenRing(I, Result => 3)

               2       2     2   3   2
o24 = (ideal (x  - 3, y x - z , y , y  - 3z*x), map (ZZ[y..z, x], R, {y, z,
      -----------------------------------------------------------------------
      x}), map (R, ZZ[y..z, x], {y, z, x}))

o24 : Sequence

i25 : flattenRing(R, Result => ( , Nothing, ) )

             ZZ[y..z, x]                       ZZ[y..z, x]
o25 = (----------------------, , map (R, ----------------------, {y, z, x}))
         2       2     2   3               2       2     2   3
       (x  - 3, y x - z , y )            (x  - 3, y x - z , y )

o25 : Sequence

i26 : flattenRing(I, Result => (Ring, Nothing, RingMap))

                  ZZ[y..z, x]                      
o26 = (---------------------------------, , map (R,
         2       2     2   3   2                   
       (x  - 3, y x - z , y , y  - 3z*x)           
      -----------------------------------------------------------------------
                 ZZ[y..z, x]
      ---------------------------------, {y, z, x}))
        2       2     2   3   2
      (x  - 3, y x - z , y , y  - 3z*x)

o26 : Sequence

i27 : flattenRing(I, Result => (Ring, RingMap))

                  ZZ[y..z, x]                
o27 = (---------------------------------, map
         2       2     2   3   2             
       (x  - 3, y x - z , y , y  - 3z*x)     
      -----------------------------------------------------------------------
                  ZZ[y..z, x]
      (---------------------------------, R, {y, z, x}))
         2       2     2   3   2
       (x  - 3, y x - z , y , y  - 3z*x)

o27 : Sequence

i28 : flattenRing(I, Result => Ideal)

              2       2     2   3   2
o28 = ideal (x  - 3, y x - z , y , y  - 3z*x)

o28 : Ideal of ZZ[y..z, x]

i29 : K = frac(ZZ[a])

o29 = K

o29 : FractionField

i30 : B = K[x,y,z]/(a*x^2-y^2-z^2, y^3, z^3)

o30 = B

o30 : QuotientRing

i31 : (D, F) = flattenRing B

o31 = (B, map (B, B, {x, y, z, a}))

o31 : Sequence

i32 : describe D

               K[x..z]
o32 = ------------------------
          2    2    2   3   3
      (a*x  - y  - z , y , z )

i33 : A = QQ[a]/(a^2-3);

i34 : L = toField A

o34 = L

o34 : PolynomialRing

i35 : B = L[x,y,z]/(a*x^2-y^2-z^2, y^3, z^3)

o35 = B

o35 : QuotientRing

i36 : (D, F) = flattenRing(B[s,t])

o36 = (D, map (D, B[s..t], {s, t, x, y, z, a}))

o36 : Sequence

i37 : describe D

            L[s..t, x..z]
o37 = ------------------------
          2    2    2   3   3
      (a*x  - y  - z , y , z )

i38 : (D, F) = flattenRing(B[s,t], CoefficientRing => QQ)

o38 = (D, map (D, B[s..t], {s, t, x, y, z, a}))

o38 : Sequence

i39 : describe D

             QQ[s..t, x..z, a]
o39 = -------------------------------
        2       2     2    2   3   3
      (a  - 3, x a - y  - z , y , z )

i40 : use L

o40 = L

o40 : PolynomialRing

i41 : C1 = L[s,t];

i42 : C2 = C1/(a*s-t^2);

i43 : C3 = C2[p_0..p_4]/(a*s*p_0)[q]/(q^2-a*p_1);

i44 : (D, F) = flattenRing(C3, CoefficientRing=>C2)

o44 = (D, map (D, C3, {q, p , p , p , p , p , s, t, a}))
                           0   1   2   3   4

o44 : Sequence

i45 : describe D

         C2[q, p ..p ]
                0   4
o45 = -------------------
                2
      (a*s*p , q  - a*p )
            0          1

i46 : (D, F) = flattenRing(C3, CoefficientRing=>QQ)

o46 = (D, map (D, C3, {q, p , p , p , p , p , s, t, a}))
                           0   1   2   3   4

o46 : Sequence

i47 : describe D

              QQ[q, p ..p , s..t, a]
                     0   4
o47 = -------------------------------------
        2         2                2
      (a  - 3, - t  + s*a, p s*a, q  - p a)
                            0           1

i48 : flattenRing(B[s,t]) === flattenRing(B[s,t])

o48 = false

i49 : 
