-- -*- M2-comint -*- hash: 1900305986

i1 : fold(plus, {0,1,2,3,4,5})

o1 = 15

i2 : fold(identity, {a,b,c,d,e})

o2 = ((((a, b), c), d), e)

o2 : Sequence

i3 : fold((i,j) -> i|j|i, {"a","b","c","d","e"})

o3 = abacabadabacabaeabacabadabacaba

i4 : fold(plus, 0, {1,2,3,4,5})

o4 = 15

i5 : fold((x, y) -> x^y, 2, {3,2,1,2})

o5 = 4096

i6 : fold({a,b,c,d,e}, identity)

o6 = (a, (b, (c, (d, e))))

o6 : Sequence

i7 : fold({a,b,c,d}, e, identity)

o7 = (a, (b, (c, (d, e))))

o7 : Sequence

i8 : fold({2,3,2,1}, 2, (x, y) -> x^y)

o8 = 512

i9 : fold(identity, "abcde")

o9 = ((((a, b), c), d), e)

o9 : Sequence

i10 : fold(identity, "a", "bcde")

o10 = ((((a, b), c), d), e)

o10 : Sequence

i11 : accumulate({2,3,2,1}, 2, (x, y) -> x^y)

o11 = {512, 9, 2, 1}

o11 : List

i12 : 
