-- -*- M2-comint -*- hash: -875053030

i1 : QQ[x,y];

i2 : f = matrix{{x^2, x*y},{x*y, y^2}}

o2 = | x2 xy |
     | xy y2 |

                      2                2
o2 : Matrix (QQ[x..y])  <--- (QQ[x..y])

i3 : dual f

o3 = {-2} | x2 xy |
     {-2} | xy y2 |

                      2                2
o3 : Matrix (QQ[x..y])  <--- (QQ[x..y])

i4 : source f

               2
o4 = (QQ[x..y])

o4 : QQ[x..y]-module, free, degrees {2:2}

i5 : target dual f

               2
o5 = (QQ[x..y])

o5 : QQ[x..y]-module, free, degrees {2:-2}

i6 : compactMatrixForm = false

o6 = false

i7 : matrix{{x^2 + 3, x^4 + 1},{x^13 - 5, x^7 - 1}}

     |    2       4      |
o7 = |   x  + 3  x  + 1  |
     |                   |
     |   13       7      |
     |  x   - 5  x  - 1  |

                      2                2
o7 : Matrix (QQ[x..y])  <--- (QQ[x..y])

i8 : compactMatrixForm = true

o8 = true

i9 : matrix{{x^2 + 3, x^4 + 1},{x^13 - 5, x^7 - 1}}

o9 = | x2+3  x4+1 |
     | x13-5 x7-1 |

                      2                2
o9 : Matrix (QQ[x..y])  <--- (QQ[x..y])

i10 : 
