-- -*- M2-comint -*- hash: -1495116004

i1 : R = ZZ/101[x,y];

i2 : m = ideal vars R

o2 = ideal (x, y)

o2 : Ideal of R

i3 : M = m/m^3

o3 = subquotient (| x y |, | x3 x2y xy2 y3 |)

                               1
o3 : R-module, subquotient of R

i4 : C = resolution M

      2      5      3
o4 = R  <-- R  <-- R  <-- 0
                           
     0      1      2      3

o4 : ChainComplex

i5 : h = resolution inducedMap(M, m^2/m^4)

          2                     3
o5 = 0 : R  <----------------- R  : 0
               {1} | x y 0 |
               {1} | 0 0 y |

          5                             7
     1 : R  <------------------------- R  : 1
               {2} | 0 y 0 0 0 0 0 |
               {3} | 0 0 x y 0 0 0 |
               {3} | 0 0 0 0 0 0 0 |
               {3} | 0 0 0 0 x y 0 |
               {3} | 0 0 0 0 0 0 y |

          3                       4
     2 : R  <------------------- R  : 2
               {4} | 0 y 0 0 |
               {4} | 0 x 0 0 |
               {4} | 0 0 0 y |

     3 : 0 <----- 0 : 3
              0

o5 : ChainComplexMap

i6 : 
