-- -*- M2-comint -*- hash: 475147946

i1 : R = ZZ/101[a..d]

o1 = R

o1 : PolynomialRing

i2 : I = intersect((ideal(a,b,c^3-d^3))^2,ideal(a^2-c^2,b^2-d^2))

             2 2    2 2   2         3    3       3   3       3      2   
o2 = ideal (b c  - a d , a b*c - b*c  - b d + b*d , a c - a*c  - a*b d +
     ------------------------------------------------------------------------
        3   4    2 2     3        2   2 2    2 2   3         2   4    2 2 
     a*d , b  - b d , a*b  - a*b*d , a b  - a d , a b - a*b*c , a  - a c ,
     ------------------------------------------------------------------------
      2 4    6     2   3     3 3    2 4    6
     a c  - c  - 2a c*d  + 2c d  + b d  - d )

o2 : Ideal of R

i3 : gb(I, BasisElementLimit=>5)

o3 = GroebnerBasis[status: BasisElementLimit; all S-pairs handled up to degree 5]

o3 : GroebnerBasis

i4 : gbSnapshot I

o4 = | b2c2-a2d2 a2bc-bc3-b3d+bd3 a3c-ac3-ab2d+ad3 b4-b2d2 ab3-abd2 a2b2-a2d2
     ------------------------------------------------------------------------
     a3b-abc2 a4-a2c2 a2c4-c6-2a2cd3+2c3d3+b2d4-d6 |

             1       9
o4 : Matrix R  <--- R

i5 : gb(I, BasisElementLimit=>10)

o5 = GroebnerBasis[status: done; S-pairs encountered up to degree 6]

o5 : GroebnerBasis

i6 : gbSnapshot I

o6 = | b2c2-a2d2 a2bc-bc3-b3d+bd3 a3c-ac3-ab2d+ad3 b4-b2d2 ab3-abd2 a2b2-a2d2
     ------------------------------------------------------------------------
     a3b-abc2 a4-a2c2 a2c4-c6-2a2cd3+2c3d3+b2d4-d6 |

             1       9
o6 : Matrix R  <--- R

i7 : gens gb I

o7 = | b2c2-a2d2 a2bc-bc3-b3d+bd3 a3c-ac3-ab2d+ad3 b4-b2d2 ab3-abd2 a2b2-a2d2
     ------------------------------------------------------------------------
     a3b-abc2 a4-a2c2 a2c4-c6-2a2cd3+2c3d3+b2d4-d6 |

             1       9
o7 : Matrix R  <--- R

i8 : 
