-- -*- M2-comint -*- hash: -2039020858

i1 : R = ZZ/101[a,b,c];

i2 : I = ideal(a^2,a*b-2,c^4,a*c-1,a*c-1)

             2            4
o2 = ideal (a , a*b - 2, c , a*c - 1, a*c - 1)

o2 : Ideal of R

i3 : generators I

o3 = | a2 ab-2 c4 ac-1 ac-1 |

             1       5
o3 : Matrix R  <--- R

i4 : first entries generators I

       2            4
o4 = {a , a*b - 2, c , a*c - 1, a*c - 1}

o4 : List

i5 : I = trim I

                               2
o5 = ideal (a*c - 1, a*b - 2, a )

o5 : Ideal of R

i6 : gens I

o6 = | ac-1 ab-2 a2 |

             1       3
o6 : Matrix R  <--- R

i7 : 
