-- -*- M2-comint -*- hash: -1410315811

i1 : X = new Type of MutableHashTable

o1 = X

o1 : Type

i2 : x = new X

o2 = X{}

o2 : X

i3 : X.GlobalAssignHook = globalAssignFunction

o3 = globalAssignFunction

o3 : FunctionClosure

i4 : X.GlobalReleaseHook = globalReleaseFunction

o4 = globalReleaseFunction

o4 : FunctionClosure

i5 : x' = new X

o5 = x'

o5 : X

i6 : t = {x,x'}

o6 = {X{}, x'}

o6 : List

i7 : x = x' = 44

o7 = 44

i8 : t

o8 = {X{}, X{}}

o8 : List

i9 : code globalAssignFunction

o9 = /tmp/macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/m2/startup.m2.in:235:35-239:15: --source code:
          globalAssignFunction = (X,x) -> (
               if not instance(X,Symbol) then error("globalAssignFunction: expected a symbol: ", toString X);
               if not hasAttribute(x,ReverseDictionary) then setAttribute(x,ReverseDictionary,X);
               use x;
               );

i10 : 
