-- -*- M2-comint -*- hash: 1967847457

i1 : book = new HashTable from {
          "Joe" => "344-5567",
          "Sarah" => "567-4223",
          "John" => "322-1456"}

o1 = HashTable{Joe => 344-5567  }
               John => 322-1456
               Sarah => 567-4223

o1 : HashTable

i2 : book#"Sarah"

o2 = 567-4223

i3 : book#?"Mary"

o3 = false

i4 : x = set {a,b,c,r,t}

o4 = set {a, b, c, r, t}

o4 : Set

i5 : peek x

o5 = Set{a => 1}
         b => 1
         c => 1
         r => 1
         t => 1

i6 : x#?a

o6 = true

i7 : x#?4

o7 = false

i8 : x = new MutableHashTable;

i9 : x#"Joe" = "344-5567";

i10 : x#3 = {a,b,c};

i11 : x#{1,2} = 44;

i12 : x#3

o12 = {a, b, c}

o12 : List

i13 : x#?4

o13 = false

i14 : x

o14 = MutableHashTable{...3...}

o14 : MutableHashTable

i15 : peek x

o15 = MutableHashTable{{1, 2} => 44   }
                       3 => {a, b, c}
                       Joe => 344-5567

i16 : p=4;

i17 : x.p = 444;

i18 : x.p

o18 = 444

i19 : x#?4

o19 = false

i20 : 
