-- -*- M2-comint -*- hash: -117653629

i1 : x = hashTable {a=>b, c=>d, }

o1 = HashTable{a => b}
               c => d

o1 : HashTable

i2 : x#a

o2 = b

o2 : Symbol

i3 : hashTable(plus, {(a,3),(b,4),(a,10)})

o3 = HashTable{a => 13}
               b => 4

o3 : HashTable

i4 : 
