-- -*- M2-comint -*- hash: 1412909623

i1 : R = ZZ/101[x,y];

i2 : hilbertSeries(R/x^3)

           3
      1 - T
o2 = --------
            2
     (1 - T)

o2 : Expression of class Divide

i3 : hilbertSeries(R/x^3, Order =>5)

                2     3     4
o3 = 1 + 2T + 3T  + 3T  + 3T

o3 : ZZ[T]

i4 : R = ZZ/101[x,y, Degrees=>{{1,2},{2,3}}];

i5 : hilbertSeries(R/x^3, Order =>5)

            2    2 4    2 3    3 5    4 7    4 6
o5 = 1 + T T  + T T  + T T  + T T  + T T  + T T
          0 1    0 1    0 1    0 1    0 1    0 1

o5 : ZZ[T ..T ]
         0   1

i6 : R = QQ[a..d,Degrees=>{{-2,-1},{-1,0},{0,1},{1,2}}]

o6 = R

o6 : PolynomialRing

i7 : hilbertSeries(R, Order =>3)

            2         -1    -2 -1    2 4      3     2     -1       -2  
o7 = 1 + T T  + T  + T   + T  T   + T T  + T T  + 2T  + 2T  T  + 2T   +
          0 1    1    0     0  1     0 1    0 1     1     0  1     0   
     ------------------------------------------------------------------------
      -3 -1    -4 -2
     T  T   + T  T
      0  1     0  1

o7 : ZZ[T ..T ]
         0   1

i8 : degrees ring oo

o8 = {{-1}, {1}}

o8 : List

i9 : heft R

o9 = {-1, 1}

o9 : List

i10 : 
