-- -*- M2-comint -*- hash: -587097607

i1 : R = QQ[x,y,z];

i2 : hilbertSeries ideal (x,y)

               2
     1 - 2T + T
o2 = -----------
              3
       (1 - T)

o2 : Expression of class Divide

i3 : hilbertSeries(ideal (x,y), Reduce => true)

        1
o3 = -------
     (1 - T)

o3 : Expression of class Divide

i4 : 
