-- -*- M2-comint -*- hash: -1017382438

i1 : R = ZZ/32003[x,y,z];

i2 : I = ideal(x^2,y*z-x);

o2 : Ideal of R

i3 : module I

o3 = image | x2 yz-x |

                             1
o3 : R-module, submodule of R

i4 : A = matrix{{x*y-z,z^3}};

             1       2
o4 : Matrix R  <--- R

i5 : M = image A

o5 = image | xy-z z3 |

                             1
o5 : R-module, submodule of R

i6 : ideal M

                      3
o6 = ideal (x*y - z, z )

o6 : Ideal of R

i7 : coker generators I

o7 = cokernel | x2 yz-x |

                            1
o7 : R-module, quotient of R

i8 : R^1/I

o8 = cokernel | x2 yz-x |

                            1
o8 : R-module, quotient of R

i9 : resolution I

      1      2      1
o9 = R  <-- R  <-- R  <-- 0
                           
     0      1      2      3

o9 : ChainComplex

i10 : 
