-- -*- M2-comint -*- hash: -810740126

i1 : ideal 7

o1 = ideal 7

o1 : Ideal of ZZ

i2 : R = ZZ/2[x,y];

i3 : f = x^2+y^2;

i4 : ideal f

            2    2
o4 = ideal(x  + y )

o4 : Ideal of R

i5 : ideal 0_R

o5 = ideal 0

o5 : Ideal of R

i6 : ideal id_(R^0)

o6 = ideal ()

o6 : Ideal of R

i7 : promote(ideal(), R)

o7 = ideal ()

o7 : Ideal of R

i8 : 
