-- -*- M2-comint -*- hash: 319062396

i1 : R = QQ[a..h];

i2 : I = minors(2,genericMatrix(R,a,2,4))

o2 = ideal (- b*c + a*d, - b*e + a*f, - d*e + c*f, - b*g + a*h, - d*g + c*h,
     ------------------------------------------------------------------------
     - f*g + e*h)

o2 : Ideal of R

i3 : inI = ideal leadTerm I

o3 = ideal (f*g, d*g, b*g, d*e, b*e, b*c)

o3 : Ideal of R

i4 : independentSets I

o4 = {a*b*d*f*h, a*c*d*f*h, a*c*e*f*h, a*c*e*g*h}

o4 : List

i5 : independentSets inI

o5 = {a*b*d*f*h, a*c*d*f*h, a*c*e*f*h, a*c*e*g*h}

o5 : List

i6 : I = ideal"abc,bcd,cde,adf,cgh,b3f,a3g"

                                                3    3
o6 = ideal (a*b*c, b*c*d, c*d*e, a*d*f, c*g*h, b f, a g)

o6 : Ideal of R

i7 : minimalPrimes I

o7 = {ideal (c, b, a), ideal (f, c, a), ideal (g, d, b), ideal (g, e, b, a),
     ------------------------------------------------------------------------
     ideal (g, f, c), ideal (g, f, d, a), ideal (g, f, e, b), ideal (h, d, b,
     ------------------------------------------------------------------------
     a), ideal (h, e, b, a), ideal (h, f, d, a)}

o7 : List

i8 : independentSets I

o8 = {a*b*d*e*h, a*c*e*f*h, b*d*e*g*h, d*e*f*g*h}

o8 : List

i9 : L = independentSets(I, Limit=>1)

o9 = {a*b*d*e*h}

o9 : List

i10 : support L_0

o10 = {a, b, d, e, h}

o10 : List

i11 : rsort toList(set gens R - set support L_0)

o11 = {c, f, g}

o11 : List

i12 : 
