-- -*- M2-comint -*- hash: 688252655

i1 : R = ZZ/101[a..d,t]

o1 = R

o1 : PolynomialRing

i2 : index a

o2 = 0

i3 : index t

o3 = 4

i4 : A = ZZ[a..d]; B = A[r,s,t]; C = B[x,y,z]

o6 = C

o6 : PolynomialRing

i7 : index x

o7 = 0

i8 : index z

o8 = 2

i9 : index r

o9 = 0

i10 : index(r*1_C)

o10 = 3

i11 : index(b*1_C)

o11 = 7

i12 : 
