-- -*- M2-comint -*- hash: -510221130

i1 : "test-file" << "hi there" << close

o1 = test-file

o1 : File

i2 : isInputFile oo

o2 = false

i3 : f = openIn "test-file"

o3 = test-file

o3 : File

i4 : isInputFile f

o4 = true

i5 : isOpen f

o5 = true

i6 : get f

o6 = hi there

i7 : isInputFile f

o7 = false

i8 : isOpen f

o8 = false

i9 : removeFile "test-file"

i10 : 
