-- -*- M2-comint -*- hash: -109683550

i1 : isAffineRing (ZZ[a,b,c,d])

o1 = false

i2 : isAffineRing (ZZ/101[a,b,c,d])

o2 = true

i3 : isAffineRing (ZZ/2[x,y,z]/(x^2-y*z))

o3 = true

i4 : isAffineRing (QQ[x,dx, WeylAlgebra => {x => dx}])

o4 = false

i5 : 
