-- -*- M2-comint -*- hash: -218076205

i1 : isCommutative(QQ[x,y])

o1 = true

i2 : isCommutative(QQ[x,y, SkewCommutative => true])

o2 = false

i3 : isCommutative(QQ[x,dx, WeylAlgebra => {x => dx}])

o3 = false

i4 : 
