-- -*- M2-comint -*- hash: 1286681466

i1 : R = QQ[a..d];

i2 : f = map(R^1,coker vars R,{{1_R}})

o2 = | 1 |

o2 : Matrix

i3 : isWellDefined f

o3 = false

i4 : isWellDefined map(coker vars R, R^1, {{1_R}})

o4 = true

i5 : A = ZZ/5[a]

o5 = A

o5 : PolynomialRing

i6 : factor(a^3-a-2)

       3
o6 = (a  - a - 2)

o6 : Expression of class Product

i7 : B = A/(a^3-a-2);

i8 : isWellDefined map(A,B)

o8 = false

i9 : isWellDefined map(B,A)

o9 = true

i10 : 
