-- -*- M2-comint -*- hash: 1129941792

i1 : isField QQ

o1 = true

i2 : isField CC_53

o2 = true

i3 : isField GF(2,3)

o3 = true

i4 : isField(frac(QQ[x,y]))

o4 = true

i5 : R = QQ[x]/(x^2+1)

o5 = R

o5 : QuotientRing

i6 : isUnit x

o6 = true

i7 : isField R

o7 = false

i8 : F = toField R

o8 = F

o8 : PolynomialRing

i9 : isField F

o9 = true

i10 : 
