-- -*- M2-comint -*- hash: 1764884716

i1 : R = QQ[a..d,MonomialOrder=>ProductOrder{1,3}];

i2 : I = ideal(a*b-c*d, a*c-b*d)

o2 = ideal (a*b - c*d, a*c - b*d)

o2 : Ideal of R

i3 : leadTerm(1,I)

o3 = | b2d-c2d ac ab |

             1       3
o3 : Matrix R  <--- R

i4 : 
