-- -*- M2-comint -*- hash: 1960415966

i1 : lines "a\nb\nc\n"

o1 = {a, b, c}

o1 : List

i2 : peek oo

o2 = {"a", "b", "c"}

i3 : lines "a\nb\nc\nd"

o3 = {a, b, c, d}

o3 : List

i4 : peek oo

o4 = {"a", "b", "c", "d"}

i5 : lines( "\\.", "a.b.c." )

o5 = {a, b, c}

o5 : List

i6 : peek oo

o6 = {"a", "b", "c"}

i7 : lines( "\\.", "a.b.c.d" )

o7 = {a, b, c, d}

o7 : List

i8 : peek oo

o8 = {"a", "b", "c", "d"}

i9 : 
