-- -*- M2-comint -*- hash: 1731367871

i1 : ff := 5

o1 = 5

i2 : ff

o2 = 5

i3 : j

o3 = j

o3 : Symbol

i4 : h = () -> j

o4 = h

o4 : FunctionClosure

i5 : h()

o5 = j

o5 : Symbol

i6 : j = 444

o6 = 444

i7 : h()

o7 = 444

i8 : j := 555

o8 = 555

i9 : h()

o9 = 444

i10 : j

o10 = 555

i11 : 
