-- -*- M2-comint -*- hash: 455793540

i1 : i = 22;

i2 : f = () -> (i := 0; while i<9 do (<< i << " "; i=i+1); <<endl;)

o2 = f

o2 : FunctionClosure

i3 : f()
0 1 2 3 4 5 6 7 8 

i4 : i

o4 = 22

i5 : f = () -> (i := 0; () -> i = i+1)

o5 = f

o5 : FunctionClosure

i6 : p = f()

o6 = p

o6 : FunctionClosure

i7 : q = f()

o7 = q

o7 : FunctionClosure

i8 : p(),p(),p(),p(),q(),p(),p(),q(),p(),p()

o8 = (1, 2, 3, 4, 1, 5, 6, 2, 7, 8)

o8 : Sequence

i9 : 
