-- -*- M2-comint -*- hash: 716653413

i1 : sq = i -> i^2

o1 = sq

o1 : FunctionClosure

i2 : sq 10

o2 = 100

i3 : sq(5+5)

o3 = 100

i4 : tm = (i,j) -> i*j

o4 = tm

o4 : FunctionClosure

i5 : tm(5,7)

o5 = 35

i6 : (i -> i^2) 7

o6 = 49

i7 : sincos = sin @@ cos

o7 = sincos

o7 : FunctionClosure

i8 : sincos 2.2

o8 = -.555114915759425

o8 : RR (of precision 53)

i9 : sin(cos(2.2))

o9 = -.555114915759425

o9 : RR (of precision 53)

i10 : comp = (f,g) -> x -> f(g x)

o10 = comp

o10 : FunctionClosure

i11 : sincos = comp(sin,cos)

o11 = sincos

o11 : FunctionClosure

i12 : cossin = comp(cos,sin)

o12 = cossin

o12 : FunctionClosure

i13 : sincos 2.2

o13 = -.555114915759425

o13 : RR (of precision 53)

i14 : cossin 2.2

o14 = .690586688560911

o14 : RR (of precision 53)

i15 : 
