-- -*- M2-comint -*- hash: 1678792387

i1 : R = ZZ/101[a..c];

i2 : f = vars R

o2 = | a b c |

             1       3
o2 : Matrix R  <--- R

i3 : ker f

o3 = image {1} | -b 0  -c |
           {1} | a  -c 0  |
           {1} | 0  b  a  |

                             3
o3 : R-module, submodule of R

i4 : coker f

o4 = cokernel | a b c |

                            1
o4 : R-module, quotient of R

i5 : image f

o5 = image | a b c |

                             1
o5 : R-module, submodule of R

i6 : image f ++ coker f

o6 = subquotient (| a b c 0 |, | 0 0 0 |)
                  | 0 0 0 1 |  | a b c |

                               2
o6 : R-module, subquotient of R

i7 : M = subquotient(f, matrix {{a}})

o7 = subquotient (| a b c |, | a |)

                               1
o7 : R-module, subquotient of R

i8 : prune M

o8 = cokernel {1} | a -c 0 |
              {1} | 0 b  a |

                            2
o8 : R-module, quotient of R

i9 : 
