-- -*- M2-comint -*- hash: -988090737

i1 : f = i -> (i, i^2, i^3);

i2 : (x,y,z) = f 3

o2 = (3, 9, 27)

o2 : Sequence

i3 : x

o3 = 3

i4 : y

o4 = 9

i5 : z

o5 = 27

i6 : s = f 4

o6 = (4, 16, 64)

o6 : Sequence

i7 : #s

o7 = 3

i8 : s_0

o8 = 4

i9 : s_1

o9 = 16

i10 : s_2

o10 = 64

i11 : 
