-- -*- M2-comint -*- hash: -464978617

i1 : R = ZZ/101[x,y,z];

i2 : p = map(R^2,R^{-2,-2,0},{{x^2,0,3},{0,y^2,5}})

o2 = | x2 0  3 |
     | 0  y2 5 |

             2       3
o2 : Matrix R  <--- R

i3 : isHomogeneous p

o3 = true

i4 : p = map(R^2,R^3,{(0,0) => x+y, (1,1) => x^2, (0,2) => x-1, (0,0) => x-y})

o4 = | x-y 0  x-1 |
     | 0   x2 0   |

             2       3
o4 : Matrix R  <--- R

i5 : 
