-- -*- M2-comint -*- hash: 1707356376

i1 : member(c,{a,b,c,d,e})

o1 = true

i2 : member(f,(a,b,c,d,e))

o2 = false

i3 : member(3,set{1,2,5,6})

o3 = false

i4 : 
