-- -*- M2-comint -*- hash: -1497760259

i1 : R = ZZ[a..f];

i2 : M = matrix{{a,b,c},{d,e,f}}

o2 = | a b c |
     | d e f |

             2       3
o2 : Matrix R  <--- R

i3 : minors(2,M)

o3 = ideal (- b*d + a*e, - c*d + a*f, - c*e + b*f)

o3 : Ideal of R

i4 : minors(2,M,Limit=>1)

o4 = ideal(- b*d + a*e)

o4 : Ideal of R

i5 : minors(1,M)

o5 = ideal (a, d, b, e, c, f)

o5 : Ideal of R

i6 : minors(0,M)

o6 = ideal 1

o6 : Ideal of R

i7 : minors(-1,M)

o7 = ideal 1

o7 : Ideal of R

i8 : 
