-- -*- M2-comint -*- hash: 1151856982

i1 : C = ZZ/101[x,y,z,u,w];

i2 : I = ideal(x-x^2-y,z+x*y,w^2-u^2);

o2 : Ideal of C

i3 : minPres I

              2    2
o3 = ideal(- u  + w )

               ZZ
o3 : Ideal of ---[x, u, w]
              101

i4 : I.cache.minimalPresentationMap

           ZZ                     2       3    2
o4 = map (---[x, u, w], C, {x, - x  + x, x  - x , u, w})
          101

              ZZ
o4 : RingMap ---[x, u, w] <--- C
             101

i5 : I.cache.minimalPresentationMapInv

              ZZ
o5 = map (C, ---[x, u, w], {x, u, w})
             101

                     ZZ
o5 : RingMap C <--- ---[x, u, w]
                    101

i6 : R = ZZ/101[x,y,z,u,w];

i7 : I = ideal(x-x^2-y,z+x*y,w^2-u^2);

o7 : Ideal of R

i8 : minimalPresentation(I, Exclude=>{1})

               2             2    2
o8 = ideal (- x  + x - y, - u  + w )

               ZZ
o8 : Ideal of ---[x..y, u, w]
              101

i9 : 
