-- -*- M2-comint -*- hash: -1340470335

i1 : I = Grassmannian(1,6, CoefficientRing => ZZ/101);

               ZZ
o1 : Ideal of ---[p   ..p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   , p   ]
              101  0,1   0,2   1,2   0,3   1,3   2,3   0,4   1,4   2,4   3,4   0,5   1,5   2,5   3,5   4,5   0,6   1,6   2,6   3,6   4,6   5,6

i2 : S = ring I

o2 = S

o2 : PolynomialRing

i3 : elapsedTime C = minimalBetti I
 -- 0.816633 seconds elapsed

            0  1   2   3   4    5   6   7   8  9 10
o3 = total: 1 35 140 385 819 1080 819 385 140 35  1
         0: 1  .   .   .   .    .   .   .   .  .  .
         1: . 35 140 189  84    .   .   .   .  .  .
         2: .  .   . 196 735 1080 735 196   .  .  .
         3: .  .   .   .   .    .  84 189 140 35  .
         4: .  .   .   .   .    .   .   .   .  .  1

o3 : BettiTally

i4 : I = ideal I_*;

o4 : Ideal of S

i5 : elapsedTime C = minimalBetti(I, DegreeLimit=>2)
 -- 0.43452 seconds elapsed

            0  1   2   3   4    5   6   7
o5 = total: 1 35 140 385 819 1080 735 196
         0: 1  .   .   .   .    .   .   .
         1: . 35 140 189  84    .   .   .
         2: .  .   . 196 735 1080 735 196

o5 : BettiTally

i6 : I = ideal I_*;

o6 : Ideal of S

i7 : elapsedTime C = minimalBetti(I, DegreeLimit=>1, LengthLimit=>5)
 -- 0.148877 seconds elapsed

            0  1   2   3  4
o7 = total: 1 35 140 189 84
         0: 1  .   .   .  .
         1: . 35 140 189 84

o7 : BettiTally

i8 : I = ideal I_*;

o8 : Ideal of S

i9 : elapsedTime C = minimalBetti(I, LengthLimit=>5)
 -- 0.573169 seconds elapsed

            0  1   2   3   4    5
o9 = total: 1 35 140 385 819 1080
         0: 1  .   .   .   .    .
         1: . 35 140 189  84    .
         2: .  .   . 196 735 1080

o9 : BettiTally

i10 : 
