-- -*- M2-comint -*- hash: -1307422606

i1 : A = QQ[x];

i2 : B = A[y,
         Join => false,
         DegreeMap => x -> 7*x]

o2 = B

o2 : PolynomialRing

i3 : B.FlatMonoid

o3 = monoid[y, x, Degrees => {1, 7}, Heft => {1}, Join => false, MonomialOrder => {MonomialSize => 32}]
                                                                                  {GRevLex => {1}    }
                                                                                  {Position => Up    }
                                                                                  {GRevLex => {1}    }

o3 : GeneralOrderedMonoid

i4 : degrees A^{-1,-2}

o4 = {{1}, {2}}

o4 : List

i5 : degrees(A^{-1,-2} ** B)

o5 = {{7}, {14}}

o5 : List

i6 : B = A[y,
         Join => false,
         DegreeMap => x -> 7*x,
         DegreeLift => x -> apply(x, d -> d // 7)]

o6 = B

o6 : PolynomialRing

i7 : m = matrix {{x_B}}

o7 = | x |

             1       1
o7 : Matrix B  <--- B

i8 : degrees m

o8 = {{{0}}, {{7}}}

o8 : List

i9 : lift(m, A)

o9 = | x |

             1       1
o9 : Matrix A  <--- A

i10 : degrees oo

o10 = {{{0}}, {{1}}}

o10 : List

i11 : 
