-- -*- M2-comint -*- hash: 1795668125

i1 : QQ[x,y, Weights => {-1,1}, Global => false]

o1 = QQ[x..y]

o1 : PolynomialRing

i2 : 1 > x

o2 = true

i3 : 1 < y

o3 = true

i4 : leadTerm matrix{{x+x^2, y+y^2}}

o4 = | x y2 |

                      1                2
o4 : Matrix (QQ[x..y])  <--- (QQ[x..y])

i5 : QQ[x,y, Local => true]

o5 = QQ {x..y}

o5 : PolynomialRing

i6 : 1 > x

o6 = true

i7 : 1 > y

o7 = true

i8 : QQ{x,y}

o8 = QQ {x..y}

o8 : PolynomialRing

i9 : leadTerm matrix{{x+x^2, y+y^2}}

o9 = | x y |

                       1                 2
o9 : Matrix (QQ {x..y})  <--- (QQ {x..y})

i10 : 
