-- -*- M2-comint -*- hash: 1795767703

i1 : R = ZZ/101[x,dx,y,dy, WeylAlgebra => {x => dx, y => dy}]

o1 = R

o1 : PolynomialRing, 2 differential variables

i2 : dx*x

o2 = x*dx + 1

o2 : R

i3 : dx*x^10

      10        9
o3 = x  dx + 10x

o3 : R

i4 : dx*y^10

         10
o4 = dx*y

o4 : R

i5 : QQ[a,b,x,dx,y,dy, WeylAlgebra => {  x => dx,  y => dy }]

o5 = QQ[a..b, x, dx, y, dy]

o5 : PolynomialRing, 2 differential variables

i6 : QQ[a,b,x,dx,y,dy, WeylAlgebra => { (x, y) => (dx, dy) }]

o6 = QQ[a..b, x, dx, y, dy]

o6 : PolynomialRing, 1 differential variables

i7 : QQ[x,dx,y,dy,h, WeylAlgebra => { x => dx, y => dy, h }]

o7 = QQ[x, dx, y, dy, h]

o7 : PolynomialRing, 3 differential variables

i8 : dx*x^2

      2         2
o8 = x dx + 2x*h

o8 : QQ[x, dx, y, dy, h]

i9 : dx*x*y

                 2
o9 = x*dx*y + y*h

o9 : QQ[x, dx, y, dy, h]

i10 : dx*h^2

          2
o10 = dx*h

o10 : QQ[x, dx, y, dy, h]

i11 : isHomogeneous(dx*(x^2+x*y+h^2))

o11 = true

i12 : 
