-- -*- M2-comint -*- hash: -1112046535

i1 : R = ZZ[a..d,x,y];

i2 : m = matrix{{a*x^2+b*x*y+c*y^2, a*x^3+b*x^2*y+c*x*y^2+d*y^3+a*x^2}}

o2 = | ax2+bxy+cy2 ax3+bx2y+cxy2+dy3+ax2 |

             1       2
o2 : Matrix R  <--- R

i3 : monomials m

o3 = | ax3 bx2y cxy2 dy3 ax2 bxy cy2 |

             1       7
o3 : Matrix R  <--- R

i4 : monomials(m, Variables=>{x,y})

o4 = | x3 x2y xy2 y3 x2 xy y2 |

             1       7
o4 : Matrix R  <--- R

i5 : 
