-- -*- M2-comint -*- hash: 1334997350

i1 : R = ZZ/101[a,b,c];

i2 : I = ideal(a^3,b^3,c^3, a^2-b^2)

             3   3   3   2    2
o2 = ideal (a , b , c , a  - b )

o2 : Ideal of R

i3 : monomialIdeal I	  

                     2     2   3   3
o3 = monomialIdeal (a , a*b , b , c )

o3 : MonomialIdeal of R

i4 : monomialSubideal I

                     3   2      2   3   3
o4 = monomialIdeal (a , a b, a*b , b , c )

o4 : MonomialIdeal of R

i5 : R = ZZ[x,y]

o5 = R

o5 : PolynomialRing

i6 : monomialIdeal ideal(2*x,3*y)

o6 = monomialIdeal (x, y)

o6 : MonomialIdeal of R

i7 : 
