-- -*- M2-comint -*- hash: -1818459290

i1 : R = ZZ[a..d];

i2 : F = R^3

      3
o2 = R

o2 : R-module, free

i3 : f = b*F_0 + a*F_1

o3 = | b |
     | a |
     | 0 |

      3
o3 : R

i4 : leadTerm f

o4 = | 0 |
     | a |
     | 0 |

      3
o4 : R

i5 : R = ZZ[a..d, MonomialOrder => {GRevLex => 4, Position => Up}];

i6 : F = R^3

      3
o6 = R

o6 : R-module, free

i7 : leadTerm(a*F_0 + a*F_1)

o7 = | 0 |
     | a |
     | 0 |

      3
o7 : R

i8 : R = ZZ[a..d, MonomialOrder => {GRevLex => 4, Position => Down}];

i9 : F = R^3

      3
o9 = R

o9 : R-module, free

i10 : leadTerm(a*F_0 + a*F_1)

o10 = | a |
      | 0 |
      | 0 |

       3
o10 : R

i11 : R = ZZ[a..d, MonomialOrder => {GRevLex => 2, Position => Down, GRevLex => 2}];

i12 : F = R^3

       3
o12 = R

o12 : R-module, free

i13 : leadTerm(a*F_0 + a*F_1)

o13 = | a |
      | 0 |
      | 0 |

       3
o13 : R

i14 : leadTerm(b*F_0 + c^4*F_1)

o14 = | b |
      | 0 |
      | 0 |

       3
o14 : R

i15 : leadTerm(c*F_0 + d^2*F_1)

o15 = | c |
      | 0 |
      | 0 |

       3
o15 : R

i16 : R = ZZ[a..d, MonomialOrder => {Position => Down}];

i17 : F = R^3

       3
o17 = R

o17 : R-module, free

i18 : leadTerm(a*F_0 + a*F_1)

o18 = | a |
      | 0 |
      | 0 |

       3
o18 : R

i19 : leadTerm(b*F_0 + c^4*F_1)

o19 = | b |
      | 0 |
      | 0 |

       3
o19 : R

i20 : leadTerm(c*F_0 + d^2*F_1)

o20 = | c |
      | 0 |
      | 0 |

       3
o20 : R

i21 : 
