-- -*- M2-comint -*- hash: 1865145806

i1 : f = {{"hi there","foo"},{-3, 2^40}}

o1 = {{hi there, foo}, {-3, 1099511627776}}

o1 : List

i2 : netList f

     +--------+-------------+
o2 = |hi there|foo          |
     +--------+-------------+
     |-3      |1099511627776|
     +--------+-------------+

i3 : netList(f,Boxes=>false)

o3 = hi therefoo          
     -3      1099511627776

i4 : netList(f,Boxes=>true,HorizontalSpace=>1,VerticalSpace=>1)

     +----------+---------------+
     |          |               |
o4 = | hi there | foo           |
     |          |               |
     +----------+---------------+
     |          |               |
     | -3       | 1099511627776 |
     |          |               |
     +----------+---------------+

i5 : netList(f,Boxes=>true,Alignment=>Center)

     +--------+-------------+
o5 = |hi there|     foo     |
     +--------+-------------+
     |   -3   |1099511627776|
     +--------+-------------+

i6 : netList(f,Boxes=>true,BaseRow=>1)

     +--------+-------------+
     |hi there|foo          |
     +--------+-------------+
o6 = |-3      |1099511627776|
     +--------+-------------+

i7 : netList(f,Boxes=>{{1},{1}})

o7 = hi there|foo          
     --------+-------------
     -3      |1099511627776

i8 : netList apply(5,i->apply(i+1,j->(i,j)))

     +------+------+------+------+------+
o8 = |(0, 0)|      |      |      |      |
     +------+------+------+------+------+
     |(1, 0)|(1, 1)|      |      |      |
     +------+------+------+------+------+
     |(2, 0)|(2, 1)|(2, 2)|      |      |
     +------+------+------+------+------+
     |(3, 0)|(3, 1)|(3, 2)|(3, 3)|      |
     +------+------+------+------+------+
     |(4, 0)|(4, 1)|(4, 2)|(4, 3)|(4, 4)|
     +------+------+------+------+------+

i9 : netList(apply(5,i->apply(i+1,j->(i,j))),Boxes=>{true,false})

     ------------------------------
o9 = (0, 0)                        
     ------------------------------
     (1, 0)(1, 1)                  
     ------------------------------
     (2, 0)(2, 1)(2, 2)            
     ------------------------------
     (3, 0)(3, 1)(3, 2)(3, 3)      
     ------------------------------
     (4, 0)(4, 1)(4, 2)(4, 3)(4, 4)
     ------------------------------

i10 : 
