-- -*- M2-comint -*- hash: 1944020817

i1 : t = 1..4

o1 = (1, 2, 3, 4)

o1 : Sequence

i2 : newClass(Array,t)

o2 = [1, 2, 3, 4]

o2 : Array

i3 : x = new HashTable from { a => 1, b => 2 }

o3 = HashTable{a => 1}
               b => 2

o3 : HashTable

i4 : z = newClass(ImmutableType,Vector,x)

o4 = ImmutableType{a => 1}
                   b => 2

o4 : ImmutableType

i5 : parent z

o5 = Vector

o5 : Type

i6 : new Thing of Thing from Thing := (A,B,c) -> ( 
            << "-- new " << A << " of " << B
            << " from " << toString c << endl;
            c);

i7 : new ImmutableType of Vector from x
-- new ImmutableType of Vector from new HashTable from {a => 1, b => 2}

o7 = ImmutableType{a => 1}
                   b => 2

o7 : ImmutableType

i8 : newClass(ImmutableType,Vector,x)

o8 = ImmutableType{a => 1}
                   b => 2

o8 : ImmutableType

i9 : 
