-- -*- M2-comint -*- hash: -1276589354

i1 : printingPrecision = 2

o1 = 2

i2 : R = RR_100

o2 = RR
       100

o2 : RealField

i3 : M = 10*random(R^3,R^10)

o3 = | 2   5.6 1.9 4.1 3.5 2.6 6.1 5.3 .83 .44 |
     | 2   3.7 4.1 6.1 4.7 1.2 9   7.4 .95 1.5 |
     | 7.4 1.5 4.3 3.4 6.9 6   9.5 10  4.8 8   |

                 3           10
o3 : Matrix RR     <--- RR
              100         100

i4 : norm M

o4 = 9.95221975867289428755563283455

o4 : RR (of precision 100)

i5 : norm_(numeric_20 infinity) M

o5 = 9.95222

o5 : RR (of precision 20)

i6 : norm {3/2,4,-5}

o6 = 5

i7 : RR[x]

o7 = RR  [x]
       53

o7 : PolynomialRing

i8 : (1+x)^5

      5     4      3      2
o8 = x  + 5x  + 10x  + 10x  + 5x + 1

o8 : RR  [x]
       53

i9 : norm oo

o9 = 10

o9 : RR (of precision 53)

i10 : 
