-- -*- M2-comint -*- hash: -262633672

i1 : A = ZZ/101[x,y];

i2 : M = cokernel random(A^3, A^{-2,-2})

o2 = cokernel | 24x2-36xy-30y2  -22x2-29xy-24y2 |
              | -29x2+19xy+19y2 -38x2-16xy+39y2 |
              | -10x2-29xy-8y2  21x2+34xy+19y2  |

                            3
o2 : A-module, quotient of A

i3 : R = cokernel matrix {{x^3,y^4}}

o3 = cokernel | x3 y4 |

                            1
o3 : A-module, quotient of A

i4 : N = prune (M**R)

o4 = cokernel | -49x2-45xy-27y2 -32x2+23xy-50y2 x3 x2y-44xy2-44y3 20xy2-33y3 y4 0  0  |
              | x2+21xy-49y2    18xy+19y2       0  38xy2-30y3     -9xy2+44y3 0  y4 0  |
              | -8xy-23y2       x2+16xy+17y2    0  -22y3          xy2+y3     0  0  y4 |

                            3
o4 : A-module, quotient of A

i5 : C = resolution N

      3      8      5
o5 = A  <-- A  <-- A  <-- 0
                           
     0      1      2      3

o5 : ChainComplex

i6 : d = C.dd

          3                                                                                 8
o6 = 0 : A  <----------------------------------------------------------------------------- A  : 1
               | -49x2-45xy-27y2 -32x2+23xy-50y2 x3 x2y-44xy2-44y3 20xy2-33y3 y4 0  0  |
               | x2+21xy-49y2    18xy+19y2       0  38xy2-30y3     -9xy2+44y3 0  y4 0  |
               | -8xy-23y2       x2+16xy+17y2    0  -22y3          xy2+y3     0  0  y4 |

          8                                                                                5
     1 : A  <---------------------------------------------------------------------------- A  : 2
               {2} | -38xy2+32y3     -9xy2+23y3      38y3       21y3       35y3       |
               {2} | 43xy2+2y3       36y3            -43y3      13y3       -33y3      |
               {3} | -36xy-4y2       29xy-44y2       36y2       -7y2       25y2       |
               {3} | 36x2+43xy+29y2  -29x2+44xy-19y2 -36xy-39y2 7xy-7y2    -25xy+10y2 |
               {3} | -43x2+43xy+27y2 -39xy+4y2       43xy-45y2  -13xy+26y2 33xy+22y2  |
               {4} | 0               0               x+18y      50y        -44y       |
               {4} | 0               0               -46y       x+34y      -43y       |
               {4} | 0               0               -16y       -19y       x+49y      |

          5
     2 : A  <----- 0 : 3
               0

o6 : ChainComplexMap

i7 : s = nullhomotopy (x^3 * id_C)

          8                             3
o7 = 1 : A  <------------------------- A  : 0
               {2} | 0 x-21y -18y  |
               {2} | 0 8y    x-16y |
               {3} | 1 49    32    |
               {3} | 0 -21   -3    |
               {3} | 0 30    -6    |
               {4} | 0 0     0     |
               {4} | 0 0     0     |
               {4} | 0 0     0     |

          5                                                                                8
     2 : A  <---------------------------------------------------------------------------- A  : 1
               {5} | -4  21 0 4y      -47x-46y xy+32y2      -5xy-14y2    36xy+10y2    |
               {5} | -44 19 0 -7x-37y -27x-18y -38y2        xy+7y2       9xy+36y2     |
               {5} | 0   0  0 0       0        x2-18xy+41y2 -50xy+2y2    44xy-48y2    |
               {5} | 0   0  0 0       0        46xy+13y2    x2-34xy-24y2 43xy-30y2    |
               {5} | 0   0  0 0       0        16xy+4y2     19xy+47y2    x2-49xy-17y2 |

                   5
     3 : 0 <----- A  : 2
              0

o7 : ChainComplexMap

i8 : s*d + d*s

          3                    3
o8 = 0 : A  <---------------- A  : 0
               | x3 0  0  |
               | 0  x3 0  |
               | 0  0  x3 |

          8                                       8
     1 : A  <----------------------------------- A  : 1
               {2} | x3 0  0  0  0  0  0  0  |
               {2} | 0  x3 0  0  0  0  0  0  |
               {3} | 0  0  x3 0  0  0  0  0  |
               {3} | 0  0  0  x3 0  0  0  0  |
               {3} | 0  0  0  0  x3 0  0  0  |
               {4} | 0  0  0  0  0  x3 0  0  |
               {4} | 0  0  0  0  0  0  x3 0  |
               {4} | 0  0  0  0  0  0  0  x3 |

          5                              5
     2 : A  <-------------------------- A  : 2
               {5} | x3 0  0  0  0  |
               {5} | 0  x3 0  0  0  |
               {5} | 0  0  x3 0  0  |
               {5} | 0  0  0  x3 0  |
               {5} | 0  0  0  0  x3 |

     3 : 0 <----- 0 : 3
              0

o8 : ChainComplexMap

i9 : s^2

          5         3
o9 = 2 : A  <----- A  : 0
               0

                   8
     3 : 0 <----- A  : 1
              0

o9 : ChainComplexMap

i10 : 
