-- -*- M2-comint -*- hash: -2028435467

i1 : numgens ZZ

o1 = 0

i2 : A = ZZ[a,b,c];

i3 : numgens A

o3 = 3

i4 : KA = frac A

o4 = KA

o4 : FractionField

i5 : numgens KA

o5 = 3

i6 : B = A[x,y];

i7 : numgens B

o7 = 2

i8 : C = KA[x,y];

i9 : numgens C

o9 = 2

i10 : g = generators(B, CoefficientRing=>ZZ)

o10 = {x, y, a, b, c}

o10 : List

i11 : #g

o11 = 5

i12 : K = GF(9,Variable=>a)

o12 = K

o12 : GaloisField

i13 : numgens K

o13 = 1

i14 : R = ambient K

o14 = R

o14 : QuotientRing

i15 : numgens R

o15 = 1

i16 : 
