-- -*- M2-comint -*- hash: 908037565

i1 : x = new HashTable from {a => 1, b => 2, c => 3}

o1 = HashTable{a => 1}
               b => 2
               c => 3

o1 : HashTable

i2 : pairs x

o2 = {(c, 3), (a, 1), (b, 2)}

o2 : List

i3 : d = new Dictionary

o3 = d

o3 : GlobalDictionary

i4 : getGlobalSymbol (d, "foo")

o4 = foo

o4 : Symbol

i5 : getGlobalSymbol (d, "bar")

o5 = bar

o5 : Symbol

i6 : pairs d

o6 = {(bar, bar), (foo, foo)}

o6 : List

i7 : first oo

o7 = (bar, bar)

o7 : Sequence

i8 : class \ oo

o8 = (String, Symbol)

o8 : Sequence

i9 : L = {3, 5, 7};

i10 : pairs L

o10 = ((0, 3), (1, 5), (2, 7))

o10 : Sequence

i11 : pairs {apple, banana, carrot}

o11 = ((0, apple), (1, banana), (2, carrot))

o11 : Sequence

i12 : 
