-- -*- M2-comint -*- hash: 757763435

i1 : R = QQ[x,y];

i2 : f = (x + y + 1)^2

      2           2
o2 = x  + 2x*y + y  + 2x + 2y + 1

o2 : R

i3 : parts f

                         2           2
o3 = (1) + (2x + 2y) + (x  + 2x*y + y )

o3 : Expression of class Sum

i4 : R = QQ[x,y, MonomialOrder => Lex];

i5 : f = (x + y + 1)^2

      2                2
o5 = x  + 2x*y + 2x + y  + 2y + 1

o5 : R

i6 : parts f

                         2           2
o6 = (1) + (2x + 2y) + (x  + 2x*y + y )

o6 : Expression of class Sum

i7 : part(2, f)

      2           2
o7 = x  + 2x*y + y

o7 : R

i8 : part(0, 1, f)

o8 = 2x + 2y + 1

o8 : R

i9 : 
