-- -*- M2-comint -*- hash: -2103800142

i1 : set {1, 2, 3}

o1 = set {1, 2, 3}

o1 : Set

i2 : peek oo

o2 = Set{1 => 1}
         2 => 1
         3 => 1

i3 : new MutableHashTable from { a => 3, b => 44}

o3 = MutableHashTable{...2...}

o3 : MutableHashTable

i4 : peek oo

o4 = MutableHashTable{a => 3 }
                      b => 44

i5 : 
