-- -*- M2-comint -*- hash: -1687019575

i1 : s = factor 112

      4
o1 = 2 7

o1 : Expression of class Product

i2 : peek s

              4
o2 = Product{2 , 7}

i3 : peek'_2 s

o3 = Product{Power{2, 4}, Power{7, 1}}

i4 : 
