-- -*- M2-comint -*- hash: -1767332623

i1 : R = ZZ[a..f];

i2 : M = genericMatrix(R,a,2,3)

o2 = | a c e |
     | b d f |

             2       3
o2 : Matrix R  <--- R

i3 : permanents(2,M)

o3 = ideal (b*c + a*d, b*e + a*f, d*e + c*f)

o3 : Ideal of R

i4 : 
