-- -*- M2-comint -*- hash: -159953328

i1 : R = ZZ/32003[a..h];

i2 : C = res ideal(a*b, c*d, e*f)

      1      3      3      1
o2 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o2 : ChainComplex

i3 : poincare C

           2     4    6
o3 = 1 - 3T  + 3T  - T

o3 : ZZ[T]

i4 : b = betti C

            0 1 2 3
o4 = total: 1 3 3 1
         0: 1 . . .
         1: . 3 . .
         2: . . 3 .
         3: . . . 1

o4 : BettiTally

i5 : poincare b

           2     4    6
o5 = 1 - 3T  + 3T  - T

o5 : ZZ[T]

i6 : 
