-- -*- M2-comint -*- hash: -1460821377

i1 : R = QQ[x,y,z];

i2 : I = monomialIdeal(x^2,y^3,x*y^2*z,y*z^4);

o2 : MonomialIdeal of R

i3 : J = polarize(I)

o3 = monomialIdeal (z      z      , z      z      z      , z      z      z   
                     {0, 0} {0, 1}   {1, 0} {1, 1} {1, 2}   {0, 0} {1, 0} {1,
     ------------------------------------------------------------------------
       z      , z      z      z      z      z      )
     1} {2, 0}   {1, 0} {2, 0} {2, 1} {2, 2} {2, 3}

o3 : MonomialIdeal of QQ[z      , z      , z      , z      , z      , z      , z      , z      , z      ]
                          {0, 0}   {0, 1}   {1, 0}   {1, 1}   {1, 2}   {2, 0}   {2, 1}   {2, 2}   {2, 3}

i4 : R = QQ[a,b,c];

i5 : I = monomialIdeal(a^2*b^2,b^2*c^2,a*b*c^4);

o5 : MonomialIdeal of R

i6 : J = polarize(I, VariableBaseName => "x")

o6 = monomialIdeal (x      x      x      x      , x      x      x      x   
                     {0, 0} {0, 1} {1, 0} {1, 1}   {1, 0} {1, 1} {2, 0} {2,
     ------------------------------------------------------------------------
       , x      x      x      x      x      x      )
     1}   {0, 0} {1, 0} {2, 0} {2, 1} {2, 2} {2, 3}

o6 : MonomialIdeal of QQ[x      , x      , x      , x      , x      , x      , x      , x      ]
                          {0, 0}   {0, 1}   {1, 0}   {1, 1}   {2, 0}   {2, 1}   {2, 2}   {2, 3}

i7 : J = polarize(I, VariableBaseName => "foo")

o7 = monomialIdeal (foo      foo      foo      foo      , foo      foo   
                       {0, 0}   {0, 1}   {1, 0}   {1, 1}     {1, 0}   {1,
     ------------------------------------------------------------------------
       foo      foo      , foo      foo      foo      foo      foo   
     1}   {2, 0}   {2, 1}     {0, 0}   {1, 0}   {2, 0}   {2, 1}   {2,
     ------------------------------------------------------------------------
       foo      )
     2}   {2, 3}

o7 : MonomialIdeal of QQ[foo      , foo      , foo      , foo      , foo      , foo      , foo      , foo      ]
                            {0, 0}     {0, 1}     {1, 0}     {1, 1}     {2, 0}     {2, 1}     {2, 2}     {2, 3}

i8 : S = ring J;

i9 : T = QQ[a..h];

i10 : F = map(T, S, first entries vars T);

o10 : RingMap T <--- S

i11 : F(J)

o11 = ideal (a*b*c*d, c*d*e*f, a*c*e*f*g*h)

o11 : Ideal of T

i12 : 
