-- -*- M2-comint -*- hash: -1350939868

i1 : position((10,20,43,105,6,93), odd)

o1 = 2

i2 : position((10,20,43,105,6,93), i -> i<0)

i3 : position((10,20,43,105,6,93),(18,82,12,7,35,92), (a,b) -> a>b)

o3 = 2

i4 : position((10,20,43,105,6,93), odd, Reverse => true)

o4 = 5

i5 : position((10,20,43,105,6,93),(18,82,12,7,35,92), (a,b) -> a>b, Reverse => true)

o5 = 5

i6 : positions((10,20,43,105,6,93), odd)

o6 = {2, 3, 5}

o6 : List

i7 : select((10,20,43,105,6,93), odd)

o7 = (43, 105, 93)

o7 : Sequence

i8 : number((10,20,43,105,6,93), odd)

o8 = 3

i9 : 
