-- -*- M2-comint -*- hash: -268247053

i1 : positions((10,20,43,105,6,93), odd)

o1 = {2, 3, 5}

o1 : List

i2 : positions((10,20,43,105,6,93), i -> i<0)

o2 = {}

o2 : List

i3 : positions(100..110, isPrime)

o3 = {1, 3, 7, 9}

o3 : List

i4 : position((10,20,43,105,6), odd)

o4 = 2

i5 : position((10,20,43,105,6), odd, Reverse => true)

o5 = 3

i6 : select((10,20,43,105,6), odd)

o6 = (43, 105)

o6 : Sequence

i7 : number((10,20,43,105,6), odd)

o7 = 2

i8 : 
