-- -*- M2-comint -*- hash: -1280699071

i1 : prepend(3, {1, 7, 8, 3})

o1 = {3, 1, 7, 8, 3}

o1 : List

i2 : L = {"old", "old", "old"};

i3 : prepend("new", L)

o3 = {new, old, old, old}

o3 : List

i4 : K = (a, b, c);

i5 : prepend(z, K)

o5 = (z, a, b, c)

o5 : Sequence

i6 : join((x, y, z), K)

o6 = (x, y, z, a, b, c)

o6 : Sequence

i7 : append(K, z)

o7 = (a, b, c, z)

o7 : Sequence

i8 : insert(1, z, K)

o8 = (a, z, b, c)

o8 : Sequence

i9 : L = new MutableList from {2,3,5};

i10 : peek prepend(7, L)

o10 = MutableList{7, 2, 3, 5}

i11 : peek L

o11 = MutableList{2, 3, 5}

i12 : 
