-- -*- M2-comint -*- hash: -1106702772

i1 : R4 = ZZ/32003[a..d];

i2 : R5 = ZZ/32003[a..e];

i3 : R6 = ZZ/32003[a..f];

i4 : M = coker genericMatrix(R6,a,2,3)

o4 = cokernel | a c e |
              | b d f |

                              2
o4 : R6-module, quotient of R6

i5 : pdim M

o5 = 2

i6 : G = map(R6,R5,{a+b+c+d+e+f,b,c,d,e})

o6 = map (R6, R5, {a + b + c + d + e + f, b, c, d, e})

o6 : RingMap R6 <--- R5

i7 : F = map(R5,R4,random(R5^1, R5^{4:-1}))

o7 = map (R5, R4, {107a + 4376b - 5570c + 3187d + 3783e, - 5307a + 8570b - 15344c + 8444d - 10480e, 10359a - 7464b - 8251c + 2653d + 5071e, - 6203a + 12365b - 13508c - 9480d - 11950e})

o7 : RingMap R5 <--- R4

i8 : P = pushForward(G,M)

o8 = cokernel | c -de               |
              | d bc-ad+bd+cd+d2+de |

                              2
o8 : R5-module, quotient of R5

i9 : pdim P

o9 = 1

i10 : Q = pushForward(F,P)

        3
o10 = R4

o10 : R4-module, free, degrees {0..1, 0}

i11 : pdim Q

o11 = 0

i12 : P3 = QQ[a..d];

i13 : M = comodule monomialCurveIdeal(P3,{1,2,3})

o13 = cokernel | c2-bd bc-ad b2-ac |

                               1
o13 : P3-module, quotient of P3

i14 : P2 = QQ[a,b,c];

i15 : F = map(P3,P2,random(P3^1, P3^{-1,-1,-1}))

                    8         4    4   9    5    8    10   3    1     7    2
o15 = map (P3, P2, {-a + 2b + -c + -d, -a + -b + -c + --d, -a + -b + --c + -d})
                    9         7    7   7    2    7     7   7    3    10    3

o15 : RingMap P3 <--- P2

i16 : N = pushForward(F,M)

o16 = cokernel {0} | 2746576531440ab-2534266045640b2-24211900548045ac+23443561995420bc-14394825893700c2 41713631071245a2-35589962516920b2-617284418550345ac+601115991475020bc-382187702981700c2 3911698210192282843849600b3-66754622794389240566784600b2c-3649526991392070087758253375ac2+3478861359062826352315326900bc2-2372019008234318457722851500c3                                   0                                                                                                                                                                       |
               {1} | -1917669755925a+2274660185954b-8894633060340c                                      -41832913217265a+52275870074434b-238856615455140c                                       -1498815844682001881230562400a2+2547688606736205330917173872ab-1049823644956341399785147872b2-3147838871484802066664262615ac+2570016678191191391969780310bc-2690990325409766765255811900c2 3104325504225a3-8141096469258a2b+7037566250256ab2-1999589995808b3+7766700637860a2c-13411647220680abc+5703323436000b2c+6283781809200ac2-5281643577600bc2+1508835384000c3 |

                               2
o16 : P2-module, quotient of P2

i17 : hilbertPolynomial M

o17 = - 2*P  + 3*P
           0      1

o17 : ProjectiveHilbertPolynomial

i18 : hilbertPolynomial N

o18 = - 2*P  + 3*P
           0      1

o18 : ProjectiveHilbertPolynomial

i19 : ann N

                          3                 2                    2  
o19 = ideal(3104325504225a  - 8141096469258a b + 7037566250256a*b  -
      -----------------------------------------------------------------------
                    3                 2                         
      1999589995808b  + 7766700637860a c - 13411647220680a*b*c +
      -----------------------------------------------------------------------
                    2                    2                   2  
      5703323436000b c + 6283781809200a*c  - 5281643577600b*c  +
      -----------------------------------------------------------------------
                    3
      1508835384000c )

o19 : Ideal of P2

i20 : 
