-- -*- M2-comint -*- hash: 1854598341

i1 : R = GF(3^2,Variable => a);

i2 : random(R^3,R^4)

o2 = | a  1   -a-1 a-1  |
     | -a a+1 -a-1 a-1  |
     | 0  a   -a   -a-1 |

             3       4
o2 : Matrix R  <--- R

i3 : T = R[x,y];

i4 : random(T^3,T^{4:-1})

o4 = | -x+(-a-1)y    -ax+y          (a-1)x+(-a-1)y -ax+y          |
     | (a+1)x+(a-1)y -x+y           (-a-1)x+(a-1)y ax+y           |
     | (a-1)x+(a-1)y (a-1)x+(-a+1)y -x+ay          (-a-1)x+(a+1)y |

             3       4
o4 : Matrix T  <--- T

i5 : S = R[p..z];

i6 : genericMatrix(S,t,3,2)

o6 = | t w |
     | u x |
     | v y |

             3       2
o6 : Matrix S  <--- S

i7 : genericSymmetricMatrix(S,s,3)

o7 = | s t u |
     | t v w |
     | u w x |

             3       3
o7 : Matrix S  <--- S

i8 : genericSkewMatrix(S,u,3)

o8 = | 0  u  v |
     | -u 0  w |
     | -v -w 0 |

             3       3
o8 : Matrix S  <--- S

i9 : 
