-- -*- M2-comint -*- hash: 1911356455

i1 : p=nextPrime(random(2*10^4))

o1 = 107

i2 : kk=ZZ/p;R=kk[x_0..x_3];

i4 : I=minors(4,random(R^5,R^{4:-1}));

o4 : Ideal of R

i5 : codim I, degree I

o5 = (2, 10)

o5 : Sequence

i6 : time randomKRationalPoint(I)
     -- used 0.215619 seconds

o6 = ideal (x  - 53x , x  + 8x , x  - 4x )
             2      3   1     3   0     3

o6 : Ideal of R

i7 : R=kk[x_0..x_5];

i8 : I=minors(3,random(R^5,R^{3:-1}));

o8 : Ideal of R

i9 : codim I, degree I

o9 = (3, 10)

o9 : Sequence

i10 : time randomKRationalPoint(I)
     -- used 0.393333 seconds

o10 = ideal (x  - 27x , x  - 16x , x  - 9x , x  + 44x , x  - 52x )
              4      5   3      5   2     5   1      5   0      5

o10 : Ideal of R

i11 : p=10007,kk=ZZ/p,R=kk[x_0..x_2]

o11 = (10007, kk, R)

o11 : Sequence

i12 : n=5; sum(1..n,j->(-1)^(j-1)*binomial(n,j)*(n-j)!/n!)+0.0

o13 = .633333333333333

o13 : RR (of precision 53)

i14 : I=ideal random(n,R);

o14 : Ideal of R

i15 : time (#select(apply(100,i->(degs=apply(decompose(I+ideal random(1,R)),c->degree c);
                     #select(degs,d->d==1))),f->f>0))
     -- used 4.73832 seconds

o15 = 58

i16 : 
