-- -*- M2-comint -*- hash: 824957648

i1 : realpath "."

o1 = /private/tmp/M2-50880-0/76-rundir/

i2 : p = temporaryFileName()

o2 = /private/tmp/M2-65030-0/0

i3 : q = temporaryFileName()

o3 = /private/tmp/M2-65030-0/1

i4 : symlinkFile(p,q)

i5 : p << close

o5 = /private/tmp/M2-65030-0/0

o5 : File

i6 : readlink q

o6 = /private/tmp/M2-65030-0/0

i7 : realpath q

o7 = /private/tmp/M2-65030-0/0

i8 : removeFile p

i9 : removeFile q

i10 : realpath ""

o10 = /private/tmp/M2-50880-0/76-rundir/

i11 : 
