-- -*- M2-comint -*- hash: -158307172

i1 : fn = temporaryFileName()

o1 = /private/tmp/M2-58222-0/0

i2 : fn << "z^6+3*x*z^4+6*y*z^4+3*x^2*z^2+12*x*y*z^2+12*y^2*z^2+x^3+6*x^2*y+12*x*y^2+8*y^3" << endl << close

o2 = /private/tmp/M2-58222-0/0

o2 : File

i3 : get fn

o3 = z^6+3*x*z^4+6*y*z^4+3*x^2*z^2+12*x*y*z^2+12*y^2*z^2+x^3+6*x^2*y+12*x*y^2
     +8*y^3

i4 : R = ZZ/101[x,y,z]

o4 = R

o4 : PolynomialRing

i5 : f = value get fn

      6       4       4     2 2          2      2 2    3     2         2  
o5 = z  + 3x*z  + 6y*z  + 3x z  + 12x*y*z  + 12y z  + x  + 6x y + 12x*y  +
     ------------------------------------------------------------------------
       3
     8y

o5 : R

i6 : factor f

       2          3
o6 = (z  + x + 2y)

o6 : Expression of class Product

i7 : fn << "sample = 2^100
     print sample
     " << close

o7 = /private/tmp/M2-58222-0/0

o7 : File

i8 : get fn

o8 = sample = 2^100
     print sample


i9 : load fn
1267650600228229401496703205376

i10 : needs fn

i11 : peek get fn

o11 = "sample = 2^100
      print sample
      "

i12 : lines get fn

o12 = {sample = 2^100, print sample}

o12 : List

i13 : peek lines get fn

o13 = {"sample = 2^100", "print sample"}

i14 : stack lines get fn

o14 = sample = 2^100
      print sample

i15 : removeFile fn

i16 : 
