-- -*- M2-comint -*- hash: -294991353

i1 : match("2+2", "2+2")

o1 = false

i2 : regexQuote "2+2"

o2 = 2\+2

i3 : match(oo, "2+2")

o3 = true

i4 : 
