-- -*- M2-comint -*- hash: 823390627

i1 : R = ZZ/32003[a..d];

i2 : I = ideal(a^20, b^20, a*c^19-b*d^19);

o2 : Ideal of R

i3 : C = resolution I

      1      3      23      40      19
o3 = R  <-- R  <-- R   <-- R   <-- R   <-- 0
                                            
     0      1      2       3       4       5

o3 : ChainComplex

i4 : regularity C

o4 = 398

i5 : regularity comodule I

o5 = 398

i6 : regularity I

o6 = 399

i7 : regularity module I

o7 = 399

i8 : C = resolution ideal(a^3, a^2*b, a*b^6, a^2*c);

i9 : betti C

            0 1 2 3
o9 = total: 1 4 4 1
         0: 1 . . .
         1: . . . .
         2: . 3 3 1
         3: . . . .
         4: . . . .
         5: . . . .
         6: . 1 1 .

o9 : BettiTally

i10 : regularity C

o10 = 6

i11 : betti(C, Weights => {2})

             0 1 2 3
o11 = total: 1 4 4 1
          0: 1 . . .
          1: . . . .
          2: . . . .
          3: . . . .
          4: . . . .
          5: . 3 . .
          6: . . 3 .
          7: . . . 1
          8: . . . .
          9: . . . .
         10: . . . .
         11: . . . .
         12: . . . .
         13: . 1 . .
         14: . . 1 .

o11 : BettiTally

i12 : regularity(C, Weights => {2})

o12 = 14

i13 : 
