-- -*- M2-comint -*- hash: -1643116039

i1 : R = QQ[x,dx,WeylAlgebra=>{x=>dx}]

o1 = R

o1 : PolynomialRing, 1 differential variables

i2 : x*dx

o2 = x*dx

o2 : R

i3 : dx*x

o3 = x*dx + 1

o3 : R

i4 : M = R^2

      2
o4 = R

o4 : R-module, free

i5 : v = M_0

o5 = | 1 |
     | 0 |

      2
o5 : R

i6 : dx*v

o6 = | dx |
     |  0 |

      2
o6 : R

i7 : x*(dx*v)

o7 = | xdx |
     |  0  |

      2
o7 : R

i8 : (x*dx)*v

o8 = | xdx |
     |  0  |

      2
o8 : R

i9 : x*(dx*v) == (x*dx)*v

o9 = true

i10 : f = dx * id_M

o10 = | dx 0  |
      | 0  dx |

              2       2
o10 : Matrix R  <--- R

i11 : f*(x*v)

o11 = | xdx |
      |  0  |

       2
o11 : R

i12 : x*(f*v)

o12 = | xdx |
      |  0  |

       2
o12 : R

i13 : f*(x*v) == x*(f*v)

o13 = true

i14 : g = x * id_M

o14 = | x 0 |
      | 0 x |

              2       2
o14 : Matrix R  <--- R

i15 : f*g

o15 = | xdx 0   |
      | 0   xdx |

              2       2
o15 : Matrix R  <--- R

i16 : f*g == (x*dx) * id_M

o16 = true

i17 : (dx * id_M)*(x * id_M) == (x*dx) * id_M

o17 = true

i18 : x * ( (dx * id_M) * v )

o18 = | xdx |
      |  0  |

       2
o18 : R

i19 : (x *  (dx * id_M) ) * v

o19 = | xdx |
      |  0  |

       2
o19 : R

i20 : (x *  (dx * id_M) ) * v == x * ( (dx * id_M) * v )	  

o20 = true

i21 : x * ( id_M * ( dx * id_M ) )

o21 = | xdx 0   |
      | 0   xdx |

              2       2
o21 : Matrix R  <--- R

i22 : (x * id_M) * ( dx * id_M )

o22 = | xdx+1 0     |
      | 0     xdx+1 |

              2       2
o22 : Matrix R  <--- R

i23 : x * ( id_M * ( dx * id_M ) ) == (x * id_M) * ( dx * id_M )

o23 = false

i24 : 
