-- -*- M2-comint -*- hash: -1586912383

i1 : scan({a, 4, "George", 2^100}, print)
a
4
George
1267650600228229401496703205376

i2 : scan("foo", print)
f
o
o

i3 : scan(4, print)
0
1
2
3

i4 : v = {a,b,c}; scan(#v, i -> print(i,v#i))
(0, a)
(1, b)
(2, c)

i6 : scan({3,5,7,11,44,55,77}, i -> if even i then break i)

o6 = 44

i7 : scan("foo", print)
f
o
o

i8 : 
