-- -*- M2-comint -*- hash: 626475573

i1 : t = hashTable {{1,8},{2,20},{3,4},{4,20}}

o1 = HashTable{1 => 8 }
               2 => 20
               3 => 4
               4 => 20

o1 : HashTable

i2 : scanValues(t, print)
8
20
4
20

i3 : scanValues(t, v -> if v>10 then print v)
20
20

i4 : 
