-- -*- M2-comint -*- hash: 118798994

i1 : t = hashTable {{1,8},{2,20},{3,4},{4,20}}

o1 = HashTable{1 => 8 }
               2 => 20
               3 => 4
               4 => 20

o1 : HashTable

i2 : scanKeys(t, print)
1
2
3
4

i3 : scanKeys(t, k -> if k>2 then print t#k)
4
20

i4 : 
