-- -*- M2-comint -*- hash: -412160791

i1 : t = hashTable {{1,8},{2,20},{3,4},{4,20}}

o1 = HashTable{1 => 8 }
               2 => 20
               3 => 4
               4 => 20

o1 : HashTable

i2 : scanPairs(t, (k,v) -> print (k+v))
9
22
7
24

i3 : scanPairs(t, (k,v) -> if v==20 then print k)
2
4

i4 : 
