-- -*- M2-comint -*- hash: 1251787681

i1 : (S,f) = selectVariables({2,4}, QQ[a..h,Weights=>1..8]);

i2 : describe S

o2 = QQ[c, e, Degrees => {2:1}, Heft => {1}, MonomialOrder => {MonomialSize => 32}]
                                                              {Weights => {3, 5} }
                                                              {GRevLex => {2:1}  }
                                                              {Position => Up    }

i3 : options S

o3 = OptionTable{Constants => false                   }
                                  1
                 DegreeGroup => ZZ
                 DegreeLift => null
                 DegreeMap => null
                 DegreeRank => 1
                 Degrees => {{1}, {1}}
                 Global => true
                 Heft => {1}
                 Inverses => false
                 Join => null
                 Local => false
                 MonomialOrder => {MonomialSize => 32}
                                  {Weights => {3, 5} }
                                  {GRevLex => {1, 1} }
                                  {Position => Up    }
                 SkewCommutative => {}
                 Variables => {c, e}
                 WeylAlgebra => {}

o3 : OptionTable

i4 : f

o4 = map (QQ[a..h], S, {c, e})

o4 : RingMap QQ[a..h] <--- S

i5 : 
