-- -*- M2-comint -*- hash: -1546753075

i1 : selectiter = select("foo", i -> i == "o")

o1 = iterator "foo"

o1 : Iterator

i2 : next selectiter

o2 = o

i3 : next selectiter

o3 = o

i4 : next selectiter

o4 = StopIteration

o4 : Symbol

i5 : 
