-- -*- M2-comint -*- hash: -236737715

i1 : select("[[:alpha:]]+", "Dog, cat, and deer.")

o1 = {Dog, cat, and, deer}

o1 : List

i2 : select("^.*$", "ABC\nDEF\r\nGHI")

o2 = {ABC, DEF, GHI}

o2 : List

i3 : select("([a-zA-Z]+);", "$1", "Dog; cat, deer;")

o3 = {Dog, deer}

o3 : List

i4 : select("([a-zA-Z]+);", "\\L$1", "Dog; cat, deer;")

o4 = {dog, deer}

o4 : List

i5 : s = "catfish cats dogs";

i6 : select("cat(?!fish)s?", s)

o6 = {cats}

o6 : List

i7 : select("\\w+(?=s\\b)", s)

o7 = {cat, dog}

o7 : List

i8 : s = "goldfish swordfish catfish catdog";

i9 : select("\\w+(?=fish)", s)

o9 = {gold, sword, cat}

o9 : List

i10 : select("(?<=cat)\\w+", s)

o10 = {fish, dog}

o10 : List

i11 : 
