-- -*- M2-comint -*- hash: -1880817633

i1 : s = "A string with both Unix-style\nand Windows-style\r\nnew line characters."

o1 = A string with both Unix-style
     and Windows-style
     new line characters.

i2 : separate s

o2 = {A string with both Unix-style, and Windows-style, new line characters.}

o2 : List

i3 : lines s

o3 = {A string with both Unix-style, and Windows-style, new line characters.}

o3 : List

i4 : separate("[,.;]", "Example: a string. That, is punctuated, weirdly; for demonstration purposes.")

o4 = {Example: a string,  That,  is punctuated,  weirdly,  for demonstration
     ------------------------------------------------------------------------
     purposes, }

o4 : List

i5 : t = separate("[ ]+", "this    string has   different   lengths of    spacing  between     words")

o5 = {this, string, has, different, lengths, of, spacing, between, words}

o5 : List

i6 : replace("has", "does not have", demark(" ", t))

o6 = this string does not have different lengths of spacing between words

i7 : s = "algng xjfr kfjxse xhgfj xooi xwj kvexr anvi endj xkfi";

i8 : concatenate separate(" x[A-Za-z]*", s)

o8 = algng kfjxse kvexr anvi endj

i9 : concatenate separate(" (x)[A-Za-z]*", 1, s)

o9 = algng jfr kfjxse hgfj ooi wj kvexr anvi endj kfi

i10 : 
