-- -*- M2-comint -*- hash: -1193203022

i1 : setRandomSeed()

i2 : random 2^100

o2 = 278091837517481385900793178228

i3 : random 2^100

o3 = 1096904973926824930696315518408

i4 : setRandomSeed()

i5 : random 2^100

o5 = 278091837517481385900793178228

i6 : random 2^100

o6 = 1096904973926824930696315518408

i7 : setRandomSeed 123456

o7 = 123456

i8 : for i to 10 list random 100

o8 = {8, 29, 5, 22, 4, 32, 35, 57, 3, 95, 36}

o8 : List

i9 : setRandomSeed 123456

o9 = 123456

i10 : for i to 10 list random 100

o10 = {8, 29, 5, 22, 4, 32, 35, 57, 3, 95, 36}

o10 : List

i11 : setRandomSeed "thrkwjsxz"

o11 = 1267386136561992923

i12 : for i to 10 list random 100

o12 = {28, 70, 67, 31, 68, 14, 42, 24, 16, 14, 51}

o12 : List

i13 : setRandomSeed "thrkwjsxz"

o13 = 1267386136561992923

i14 : for i to 10 list random 100

o14 = {28, 70, 67, 31, 68, 14, 42, 24, 16, 14, 51}

o14 : List

i15 : 
