-- -*- M2-comint -*- hash: 621394205

i1 : X = {(), (0, (1, 2, (3, 4))), (5, (6, 7)), 8, 9};

i2 : splice X

o2 = {0, (1, 2, (3, 4)), 5, (6, 7), 8, 9}

o2 : List

i3 : deepSplice X

o3 = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9}

o3 : List

i4 : Z = {(), {0, {1, 2, (3, 4)}}, [5, [6, 7]], 8, 9};

i5 : splice Z

o5 = {{0, {1, 2, (3, 4)}}, [5, [6, 7]], 8, 9}

o5 : List

i6 : splice ((), (0, (1, 2, (3, 4))), (5, (6, 7)), 8, 9)

o6 = (0, (1, 2, (3, 4)), 5, (6, 7), 8, 9)

o6 : Sequence

i7 : splice [(), (0, (1, 2, (3, 4))), (5, (6, 7)), 8, 9]

o7 = [0, (1, 2, (3, 4)), 5, (6, 7), 8, 9]

o7 : Array

i8 : M = new MutableList from X

o8 = MutableList{...5...}

o8 : MutableList

i9 : splice M

o9 = MutableList{...6...}

o9 : MutableList

i10 : M

o10 = MutableList{...5...}

o10 : MutableList

i11 : 
