-- -*- M2-comint -*- hash: -759075409

i1 : R = QQ[x,y,z];

i2 : I = monomialIdeal(x*y^3*z, x*y^2*z^2, y^3*z^2, y^2*z^3)

                       3      2 2   3 2   2 3
o2 = monomialIdeal (x*y z, x*y z , y z , y z )

o2 : MonomialIdeal of R

i3 : standardPairs I

                                                         2           2 2
o3 = {{1, {x, z}}, {y, {x, z}}, {1, {x, y}}, {z, {y}}, {y z, {x}}, {y z ,
     ------------------------------------------------------------------------
     {}}}

o3 : List

i4 : 
