-- -*- M2-comint -*- hash: -1258267427

i1 : L = {1,2,3,5,7,8,10,12,13,17,18,20,21};

i2 : sublists(L, odd, toList, minus)

o2 = {{1}, -2, {3, 5, 7}, -8, -10, -12, {13, 17}, -18, -20, {21}}

o2 : List

i3 : sublists(L, odd, toList)

o3 = {{1}, 2, {3, 5, 7}, 8, 10, 12, {13, 17}, 18, 20, {21}}

o3 : List

i4 : sublists(L, odd)

o4 = {{1}, 2, {3, 5, 7}, 8, 10, 12, {13, 17}, 18, 20, {21}}

o4 : List

i5 : L = (1,2,3,5,7,8,10,12,13,17,18,20,21);

i6 : sublists(L, isPrime, , e -> 0)

o6 = {0, (2, 3, 5, 7), 0, 0, 0, (13, 17), 0, 0, 0}

o6 : List

i7 : sublists(L, isPrime, plus, e -> 0)

o7 = {0, 17, 0, 0, 0, 30, 0, 0, 0}

o7 : List

i8 : a = for l in L list if isPrime l then l else -10*l

o8 = {-10, 2, 3, 5, 7, -80, -100, -120, 13, 17, -180, -200, -210}

o8 : List

i9 : b = apply(L, l -> if isPrime l then l else -10*l)

o9 = (-10, 2, 3, 5, 7, -80, -100, -120, 13, 17, -180, -200, -210)

o9 : Sequence

i10 : X = {1, 3, 5, 2, 4, 7, 1, 3, 4, 4, 5, 4, 7, 9, 13};

i11 : sublists(sublists(X, odd), i -> not instance(i, List))

o11 = {{1, 3, 5}, {2, 4}, {7, 1, 3}, {4, 4}, {5}, {4}, {7, 9, 13}}

o11 : List

i12 : 
