-- -*- M2-comint -*- hash: 1256112686

i1 : A = QQ[a..f]; B = QQ[a..d]; C = ZZ/101[x,y];

i4 : F = 3*a^2-b-d+101*c

       2
o4 = 3a  - b + 101c - d

o4 : B

i5 : sub(F, {a=>1, b=>b^4})

        4
o5 = - b  + 101c - d + 3

o5 : B

i6 : sub(F, matrix{{x,y,1,0}})

       2
o6 = 3x  - y

o6 : C

i7 : sub(F, A)

       2
o7 = 3a  - b + 101c - d

o7 : A

i8 : D = B/(a*b*c*d);

i9 : sub(F,D)

       2
o9 = 3a  - b + 101c - d

o9 : D

i10 : use ring F;

i11 : sub(F, {a=>1, b=>3, c=> 1, d=>13})

o11 = 88

o11 : QQ

i12 : use B;

i13 : M = image(vars B ++ vars B)

o13 = image | a b c d 0 0 0 0 |
            | 0 0 0 0 a b c d |

                              2
o13 : B-module, submodule of B

i14 : N = substitute(M, {a=>b+c,c=>1})

o14 = image | b+c b 1 d 0   0 0 0 |
            | 0   0 0 0 b+c b 1 d |

                              2
o14 : B-module, submodule of B

i15 : M' = prune M

o15 = cokernel {1} | -b 0  -c 0  0  -d 0  0  0  0  0  0  |
               {1} | a  -c 0  0  -d 0  0  0  0  0  0  0  |
               {1} | 0  b  a  -d 0  0  0  0  0  0  0  0  |
               {1} | 0  0  0  c  b  a  0  0  0  0  0  0  |
               {1} | 0  0  0  0  0  0  -b 0  -c 0  0  -d |
               {1} | 0  0  0  0  0  0  a  -c 0  0  -d 0  |
               {1} | 0  0  0  0  0  0  0  b  a  -d 0  0  |
               {1} | 0  0  0  0  0  0  0  0  0  c  b  a  |

                             8
o15 : B-module, quotient of B

i16 : N' = coker substitute(presentation M', {a=>b+c,c=>1})

o16 = cokernel {1} | -b  0  -1  0  0  -d  0   0  0   0  0  0   |
               {1} | b+c -1 0   0  -d 0   0   0  0   0  0  0   |
               {1} | 0   b  b+c -d 0  0   0   0  0   0  0  0   |
               {1} | 0   0  0   1  b  b+c 0   0  0   0  0  0   |
               {1} | 0   0  0   0  0  0   -b  0  -1  0  0  -d  |
               {1} | 0   0  0   0  0  0   b+c -1 0   0  -d 0   |
               {1} | 0   0  0   0  0  0   0   b  b+c -d 0  0   |
               {1} | 0   0  0   0  0  0   0   0  0   1  b  b+c |

                             8
o16 : B-module, quotient of B

i17 : hf = hilbertSeries coker matrix{{a,b^3,d^5}}

               3    4    5    6    8    9
      1 - T - T  + T  - T  + T  + T  - T
o17 = -----------------------------------
                           4
                    (1 - T)

o17 : Expression of class Divide

i18 : hf1 = reduceHilbert hf

                 2     3     4     5    6
      1 + 2T + 3T  + 3T  + 3T  + 2T  + T
o18 = -----------------------------------
                    (1 - T)

o18 : Expression of class Divide

i19 : use ring numerator hf;

i20 : sub(hf1, T => -1)

      1
o20 = -
      2

o20 : Expression of class Divide

i21 : sub(hf, T => a)

         9    8    6    5    4    3
      - a  + a  + a  - a  + a  - a  - a + 1
o21 = -------------------------------------
                             4
                    (- a + 1)

o21 : Expression of class Divide

i22 : value oo

         6     5     4     3     2
      - a  - 2a  - 3a  - 3a  - 3a  - 2a - 1
o22 = -------------------------------------
                      a - 1

o22 : frac B

i23 : oo == value sub(hf1, T=>a)

o23 = true

i24 : use B;

i25 : G = map(B,B,{a=>1, b=>b^4})

                      4
o25 = map (B, B, {1, b , c, d})

o25 : RingMap B <--- B

i26 : G F

         4
o26 = - b  + 101c - d + 3

o26 : B

i27 : 
