-- -*- M2-comint -*- hash: -522107074

i1 : sum {1,2,3,4,5}

o1 = 15

i2 : sum {}

o2 = 0

i3 : class oo

o3 = ZZ

o3 : Ring

i4 : R = QQ[x_1 .. x_10];

i5 : f = n -> sum for i from 1 to n list x_i;

i6 : f 4

o6 = x  + x  + x  + x
      1    2    3    4

o6 : R

i7 : f 0

o7 = 0

i8 : class oo

o8 = ZZ

o8 : Ring

i9 : g = n -> promote(sum for i from 1 to n list x_i, R);

i10 : g 10

o10 = x  + x  + x  + x  + x  + x  + x  + x  + x  + x
       1    2    3    4    5    6    7    8    9    10

o10 : R

i11 : g 0

o11 = 0

o11 : R

i12 : class oo

o12 = R

o12 : PolynomialRing

i13 : 
