-- -*- M2-comint -*- hash: -557223473

i1 : f = x -> symbol x

o1 = f

o1 : FunctionClosure

i2 : s = f 1

o2 = x

o2 : Symbol

i3 : t = f 2

o3 = x

o3 : Symbol

i4 : value s

o4 = 1

i5 : value t

o5 = 2

i6 : symbolBody s

o6 = x

o6 : SymbolBody

i7 : symbolBody t

o7 = x

o7 : SymbolBody

i8 : symbolBody s === symbolBody t

o8 = true

i9 : class symbolBody s

o9 = SymbolBody

o9 : Type

i10 : 
