-- -*- M2-comint -*- hash: -1262586892

i1 : take({a,b,c,d,e,f,g}, 3)

o1 = {a, b, c}

o1 : List

i2 : take({a,b,c,d,e,f,g}, -3)

o2 = {e, f, g}

o2 : List

i3 : take({a,b,c,d,e,f,g}, {1,3})

o3 = {b, c, d}

o3 : List

i4 : take({a,b,c,d,e,f,g}, {2,2})

o4 = {c}

o4 : List

i5 : take({a,b,c,d,e,f,g}, {3,1})

o5 = {}

o5 : List

i6 : take({a,b,c,d,e,f,g}, {4,-1})

o6 = {}

o6 : List

i7 : take("Hello, world!", 5)

o7 = {H, e, l, l, o}

o7 : List

i8 : take("Hello, world!", 20)

o8 = {H, e, l, l, o, ,,  , w, o, r, l, d, !}

o8 : List

i9 : 
