-- -*- M2-comint -*- hash: 1963754843

i1 : toList "foo"

o1 = {f, o, o}

o1 : List

i2 : A = set(3,7,9,6)

o2 = set {3, 6, 7, 9}

o2 : Set

i3 : toList A

o3 = {9, 3, 6, 7}

o3 : List

i4 : toList (1..9)

o4 = {1, 2, 3, 4, 5, 6, 7, 8, 9}

o4 : List

i5 : toList set {4,5,13}

o5 = {4, 13, 5}

o5 : List

i6 : 
