-- -*- M2-comint -*- hash: 2104099383

i1 : toSequence {1, 2, 3}

o1 = (1, 2, 3)

o1 : Sequence

i2 : toSequence "foo"

o2 = (f, o, o)

o2 : Sequence

i3 : toSequence iterator {1, 2, 3}

o3 = (1, 2, 3)

o3 : Sequence

i4 : toSequence (1, 2, 3)

o4 = (1, 2, 3)

o4 : Sequence

i5 : 
