-- -*- M2-comint -*- hash: -2039187500

i1 : S = ZZ/10007[x,y,z];

i2 : f = matrix{{x^3,x*y^2},{y*x^2,y^3}}

o2 = | x3  xy2 |
     | x2y y3  |

             2       2
o2 : Matrix S  <--- S

i3 : g = transpose f

o3 = {-3} | x3  x2y |
     {-3} | xy2 y3  |

             2       2
o3 : Matrix S  <--- S

i4 : degrees f

o4 = {{{0}, {0}}, {{3}, {3}}}

o4 : List

i5 : degrees g

o5 = {{{-3}, {-3}}, {{0}, {0}}}

o5 : List

i6 : 
