-- -*- M2-comint -*- hash: -2031502559

i1 : R = ZZ/101[x,y,z];

i2 : f = random(R^1,R^{5:-3})

o2 = | 24x3-36x2y-29xy2-10y3-30x2z+19xyz-29y2z+19xz2-8yz2-22z3
     ------------------------------------------------------------------------
     -29x3-24x2y-16xy2+34y3-38x2z+39xyz+19y2z+21xz2-47yz2-39z3
     ------------------------------------------------------------------------
     -18x3-13x2y-15xy2+38y3-43x2z-28xyz+2y2z-47xz2+16yz2+22z3
     ------------------------------------------------------------------------
     45x3-34x2y-47xy2-16y3-48x2z+47xyz+7y2z+19xz2+15yz2-23z3
     ------------------------------------------------------------------------
     39x3+43x2y-11xy2+35y3-17x2z+48xyz+11y2z+36xz2-38yz2+33z3 |

             1       5
o2 : Matrix R  <--- R

i3 : C = resolution cokernel f

      1      5      9      5
o3 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o3 : ChainComplex

i4 : be = betti C

            0 1 2 3
o4 = total: 1 5 9 5
         0: 1 . . .
         1: . . . .
         2: . 5 . .
         3: . . 9 5

o4 : BettiTally

i5 : "Betti numbers of " | net C | " are " | (net be)^2

                                                               0 1 2 3
                                                        total: 1 5 9 5
                       1      5      9      5               0: 1 . . .
o5 = Betti numbers of R  <-- R  <-- R  <-- R  <-- 0 are     1: . . . .
                                                            2: . 5 . .
                      0      1      2      3      4         3: . . 9 5

i6 : "x" | "2"^1

      2
o6 = x

i7 : Divide(Minus a,b)

     -a
o7 = --
      b

o7 : Expression of class Divide

i8 : Power(Sum(3,4,5),7)

                7
o8 = (3 + 4 + 5)

o8 : Expression of class Power

i9 : Sum(1,2, Minus 3, 4,5)

o9 = 1 + 2 - 3 + 4 + 5

o9 : Expression of class Sum

i10 : Minus a / b

      -a
o10 = --
       b

o10 : Expression of class Divide

i11 : (Sum(3,4,5))^7

                 7
o11 = (3 + 4 + 5)

o11 : Expression of class Power

i12 : 1 + 2 + Minus 3 + 4 + 5

o12 = 3 - 3 + 4 + 5

o12 : Expression of class Sum

i13 : g = (x+y)^2

       2           2
o13 = x  + 2x*y + y

o13 : R

i14 : e = expression g

       2           2
o14 = x  + 2x*y + y

o14 : Expression of class Sum

i15 : peek e

           2         2
o15 = Sum{x , 2x*y, y }

i16 : peek'(2,e)

o16 = Sum{Power{x, 2}, Product{2, x, y}, Power{y, 2}}

i17 : Table{{1,2,3},{a,bb,ccc}}

o17 = 1   2   3 
             
      a  bb  ccc

o17 : Expression of class Table

i18 : MatrixExpression{{1,2,3},{a,bb,ccc}}

o18 = | 1 2  3   |
      | a bb ccc |

o18 : Expression of class MatrixExpression

i19 : Table{{"Example 1","Example 2"},
            {Table{{1,2},{3,4}},Table{{11,22},{3,444}}}}

o19 = Example 1  Example 2
                 
         1  2     11   22 
                      
         3  4      3  444

o19 : Expression of class Table

i20 : 
