-- -*- M2-comint -*- hash: -34088425

i1 : sin 1.2

o1 = .932039085967226

o1 : RR (of precision 53)

i2 : sin(1.2)

o2 = .932039085967226

o2 : RR (of precision 53)

i3 : sin(1.0+0.2)

o3 = .932039085967226

o3 : RR (of precision 53)

i4 : print(10 + 1)^2
121

i5 : append

o5 = append

o5 : CompiledFunction

i6 : append({a,b,c},d)

o6 = {a, b, c, d}

o6 : List

i7 : join

o7 = join

o7 : CompiledFunction

i8 : join({a,b},{c,d},{e,f},{g,h,i})

o8 = {a, b, c, d, e, f, g, h, i}

o8 : List

i9 : ap = append;

i10 : ap({a,b,c},d)

o10 = {a, b, c, d}

o10 : List

i11 : 
