-- -*- M2-comint -*- hash: -765967558

i1 : needsPackage "NormalToricVarieties"

o1 = NormalToricVarieties

o1 : Package

i2 : X = toricProjectiveSpace 1

o2 = X

o2 : NormalToricVariety

i3 : S = ring X
warning: clearing value of symbol x to allow access to subscripted variables based on it
       : debug with expression   debug 9868   or with command line option   --debug 9868

o3 = S

o3 : PolynomialRing

i4 : X === variety S

o4 = true

i5 : needsPackage "Schubert2"

o5 = Schubert2

o5 : Package

i6 : Y = abstractProjectiveSpace 1

o6 = Y

o6 : a flag bundle with subquotient ranks {2:1}

i7 : IY = intersectionRing Y

o7 = IY

o7 : QuotientRing

i8 : Y === variety IY

o8 = true

i9 : variety S_0

o9 = X

o9 : NormalToricVariety

i10 : variety IY_0

o10 = Y

o10 : a flag bundle with subquotient ranks {2:1}

i11 : 
