-- -*- M2-comint -*- hash: -1265487701

i1 : R = ZZ/101[x,y,z]/ideal"x3,y3,z3"

o1 = R

o1 : QuotientRing

i2 : E = eagon(R,5);

i3 : eagonBeta(E,3)

     +-------+--------+
o3 = |       |(1, {1})|
     +-------+--------+
     |(2, {})|    *   |
     +-------+--------+

i4 : eagonBeta(E,3,Display =>"DisplayBlocks")

     +-------+----------------------------------+
o4 = |       |             (1, {1})             |
     +-------+----------------------------------+
     |(2, {})|{2} | 0 -y2 0   x2 0 0   0  0  0 ||
     |       |{2} | 0 0   -z2 0  0 0   x2 0  0 ||
     |       |{2} | 0 0   0   0  0 -z2 0  y2 0 ||
     +-------+----------------------------------+

i5 : 
