-- -*- M2-comint -*- hash: -1274395947

i1 : R = ZZ/101[x,y]/ideal"x2,xy,y2"

o1 = R

o1 : QuotientRing

i2 : E = eagon(R,3)

o2 = EagonData in <ring>.cache computed to length 3

o2 : EagonData

i3 : E === R.cache.EagonData

o3 = true

i4 : 
