-- -*- M2-comint -*- hash: -612611882

i1 : S = ZZ/101[a,b,c]

o1 = S

o1 : PolynomialRing

i2 : I = ideal(a,b,c)*ideal(b,c)

                       2             2
o2 = ideal (a*b, a*c, b , b*c, b*c, c )

o2 : Ideal of S

i3 : R = S/I

o3 = R

o3 : QuotientRing

i4 : E = eagon(R,5)

o4 = EagonData in <ring>.cache computed to length 5

o4 : EagonData

i5 : F = eagonResolution E

      1      3      8      22      60      164
o5 = R  <-- R  <-- R  <-- R   <-- R   <-- R
                                           
     0      1      2      3       4       5

o5 : ChainComplex

i6 : assert(F == res E)

i7 : F.dd_3

o7 = {2} | c  c b 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |
     {2} | -b 0 0 c b 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |
     {2} | a  0 0 0 0 c b 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 |
     {2} | 0  0 0 0 0 0 0 a 0 0 0 0 b 0 0 0 0 c 0 0 0 0 |
     {2} | 0  0 0 0 0 0 0 0 a 0 0 0 0 b 0 0 0 0 c 0 0 0 |
     {2} | 0  0 0 0 0 0 0 0 0 a 0 0 0 0 b 0 0 0 0 c 0 0 |
     {2} | 0  0 0 0 0 0 0 0 0 0 a 0 0 0 0 b 0 0 0 0 c 0 |
     {2} | 0  0 0 0 0 0 0 0 0 0 0 a 0 0 0 0 b 0 0 0 0 c |

             8       22
o7 : Matrix R  <--- R

i8 : picture(F.dd_3, Display => "DisplayBlocks")

     +--------+----------+-------------------+-------------------------------------+
o8 = |        |  (3, {}) |      (0, {2})     |               (1, {1})              |
     +--------+----------+-------------------+-------------------------------------+
     | (2, {})|{2} | c  ||{2} | c b 0 0 0 0 ||                  .                  |
     |        |{2} | -b ||{2} | 0 0 c b 0 0 ||                                     |
     |        |{2} | a  ||{2} | 0 0 0 0 c b ||                                     |
     +--------+----------+-------------------+-------------------------------------+
     |(0, {1})|     .    |         .         |{2} | a 0 0 0 0 b 0 0 0 0 c 0 0 0 0 ||
     |        |          |                   |{2} | 0 a 0 0 0 0 b 0 0 0 0 c 0 0 0 ||
     |        |          |                   |{2} | 0 0 a 0 0 0 0 b 0 0 0 0 c 0 0 ||
     |        |          |                   |{2} | 0 0 0 a 0 0 0 0 b 0 0 0 0 c 0 ||
     |        |          |                   |{2} | 0 0 0 0 a 0 0 0 0 b 0 0 0 0 c ||
     +--------+----------+-------------------+-------------------------------------+

i9 : picture F.dd_3

     +--------+-------+--------+--------+
o9 = |        |(3, {})|(0, {2})|(1, {1})|
     +--------+-------+--------+--------+
     | (2, {})|   *   |    *   |    .   |
     +--------+-------+--------+--------+
     |(0, {1})|   .   |    .   |    *   |
     +--------+-------+--------+--------+

i10 : picture (F, Verbose => true)

      +-----------------------------------------------------------------------------+
      |+-------+-------+                                                            |
o10 = ||       |(1, {})|                                                            |
      |+-------+-------+                                                            |
      ||(0, {})|   *   |                                                            |
      |+-------+-------+                                                            |
      +-----------------------------------------------------------------------------+
      |+-------+-------+--------+                                                   |
      ||       |(2, {})|(0, {1})|                                                   |
      |+-------+-------+--------+                                                   |
      ||(1, {})|   *   |    *   |                                                   |
      |+-------+-------+--------+                                                   |
      +-----------------------------------------------------------------------------+
      |+--------+-------+--------+--------+                                         |
      ||        |(3, {})|(0, {2})|(1, {1})|                                         |
      |+--------+-------+--------+--------+                                         |
      || (2, {})|   *   |    *   |(3,15) .|                                         |
      |+--------+-------+--------+--------+                                         |
      ||(0, {1})|(5,1) .| (5,6) .|    *   |                                         |
      |+--------+-------+--------+--------+                                         |
      +-----------------------------------------------------------------------------+
      |+--------+--------+---------+--------+-----------+                           |
      ||        |(0, {3})| (1, {2})|(2, {1})|(0, {1, 1})|                           |
      |+--------+--------+---------+--------+-----------+                           |
      || (3, {})|    *   | (1,18) .|(1,15) .|  (1,25) . |                           |
      |+--------+--------+---------+--------+-----------+                           |
      ||(0, {2})| (6,2) .|    *    |(6,15) .|  (6,25) . |                           |
      |+--------+--------+---------+--------+-----------+                           |
      ||(1, {1})|(15,2) .|(15,18) .|    *   |     *     |                           |
      |+--------+--------+---------+--------+-----------+                           |
      +-----------------------------------------------------------------------------+
      |+-----------+--------+---------+-----------+--------+-----------+-----------+|
      ||           |(1, {3})| (2, {2})|(0, {1, 2})|(3, {1})|(0, {2, 1})|(1, {1, 1})||
      |+-----------+--------+---------+-----------+--------+-----------+-----------+|
      ||  (0, {3}) |    *   | (2,18) .|  (2,30) . | (2,5) .|  (2,30) . |  (2,75) . ||
      |+-----------+--------+---------+-----------+--------+-----------+-----------+|
      ||  (1, {2}) |(18,6) .|    *    |     *     |(18,5) .| (18,30) . | (18,75) . ||
      |+-----------+--------+---------+-----------+--------+-----------+-----------+|
      ||  (2, {1}) |(15,6) .|(15,18) .| (15,30) . |    *   |     *     | (15,75) . ||
      |+-----------+--------+---------+-----------+--------+-----------+-----------+|
      ||(0, {1, 1})|(25,6) .|(25,18) .| (25,30) . |(25,5) .| (25,30) . |     *     ||
      |+-----------+--------+---------+-----------+--------+-----------+-----------+|
      +-----------------------------------------------------------------------------+

i11 : picture (F, Verbose => true, Transpose => true)

      +------------------------------------------------------+
      |+-------+-------+                                     |
o11 = ||       |(0, {})|                                     |
      |+-------+-------+                                     |
      ||(1, {})|   *   |                                     |
      |+-------+-------+                                     |
      +------------------------------------------------------+
      |+--------+-------+                                    |
      ||        |(1, {})|                                    |
      |+--------+-------+                                    |
      || (2, {})|   *   |                                    |
      |+--------+-------+                                    |
      ||(0, {1})|   *   |                                    |
      |+--------+-------+                                    |
      +------------------------------------------------------+
      |+--------+--------+--------+                          |
      ||        | (2, {})|(0, {1})|                          |
      |+--------+--------+--------+                          |
      || (3, {})|    *   | (5,1) .|                          |
      |+--------+--------+--------+                          |
      ||(0, {2})|    *   | (5,6) .|                          |
      |+--------+--------+--------+                          |
      ||(1, {1})|(3,15) .|    *   |                          |
      |+--------+--------+--------+                          |
      +------------------------------------------------------+
      |+-----------+--------+--------+---------+             |
      ||           | (3, {})|(0, {2})| (1, {1})|             |
      |+-----------+--------+--------+---------+             |
      ||  (0, {3}) |    *   | (6,2) .| (15,2) .|             |
      |+-----------+--------+--------+---------+             |
      ||  (1, {2}) |(1,18) .|    *   |(15,18) .|             |
      |+-----------+--------+--------+---------+             |
      ||  (2, {1}) |(1,15) .|(6,15) .|    *    |             |
      |+-----------+--------+--------+---------+             |
      ||(0, {1, 1})|(1,25) .|(6,25) .|    *    |             |
      |+-----------+--------+--------+---------+             |
      +------------------------------------------------------+
      |+-----------+--------+---------+---------+-----------+|
      ||           |(0, {3})| (1, {2})| (2, {1})|(0, {1, 1})||
      |+-----------+--------+---------+---------+-----------+|
      ||  (1, {3}) |    *   | (18,6) .| (15,6) .|  (25,6) . ||
      |+-----------+--------+---------+---------+-----------+|
      ||  (2, {2}) |(2,18) .|    *    |(15,18) .| (25,18) . ||
      |+-----------+--------+---------+---------+-----------+|
      ||(0, {1, 2})|(2,30) .|    *    |(15,30) .| (25,30) . ||
      |+-----------+--------+---------+---------+-----------+|
      ||  (3, {1}) | (2,5) .| (18,5) .|    *    |  (25,5) . ||
      |+-----------+--------+---------+---------+-----------+|
      ||(0, {2, 1})|(2,30) .|(18,30) .|    *    | (25,30) . ||
      |+-----------+--------+---------+---------+-----------+|
      ||(1, {1, 1})|(2,75) .|(18,75) .|(15,75) .|     *     ||
      |+-----------+--------+---------+---------+-----------+|
      +------------------------------------------------------+

i12 : 
