-- -*- M2-comint -*- hash: 15937724

i1 : S = ZZ/101[a,b,c,d]

o1 = S

o1 : PolynomialRing

i2 : I = ideal(a,b,c)*ideal(a,b,c,d)

             2                       2                       2
o2 = ideal (a , a*b, a*c, a*d, a*b, b , b*c, b*d, a*c, b*c, c , c*d)

o2 : Ideal of S

i3 : I = ideal"a3,b3,c3"

             3   3   3
o3 = ideal (a , b , c )

o3 : Ideal of S

i4 : R = S/I

o4 = R

o4 : QuotientRing

i5 : E = eagon(R,4);

i6 : eagonBeta(E,4)

     +--------+--------+-----------+
o6 = |        |(2, {1})|(0, {1, 1})|
     +--------+--------+-----------+
     | (3, {})|    *   |     .     |
     +--------+--------+-----------+
     |(0, {2})|    .   |    3,3    |
     +--------+--------+-----------+

i7 : eagonBeta(E,4,Display => "DisplayBlocks")

     +--------+--------------------------------------------------------+----------------------------+
o7 = |        |                        (2, {1})                        |         (0, {1, 1})        |
     +--------+--------------------------------------------------------+----------------------------+
     | (3, {})|{3} | 0 0 c2 0 -b2 0 a2 0 0 0 0   0   0  0 0   0  0  0 ||              .             |
     |        |{3} | 0 0 0  0 0   0 0  0 0 0 -b2 0   a2 0 0   0  0  0 ||                            |
     |        |{3} | 0 0 0  0 0   0 0  0 0 0 0   -c2 0  0 0   a2 0  0 ||                            |
     |        |{3} | 0 0 0  0 0   0 0  0 0 0 0   0   0  0 -c2 0  b2 0 ||                            |
     +--------+--------------------------------------------------------+----------------------------+
     |(0, {2})|                            .                           |{6} | 0 1 0 -1 0 0 0  0  0 ||
     |        |                                                        |{6} | 0 0 1 0  0 0 -1 0  0 ||
     |        |                                                        |{6} | 0 0 0 0  0 1 0  -1 0 ||
     +--------+--------------------------------------------------------+----------------------------+

i8 : eagonBeta(E,4,Display => "")

o8 = {3} | 0 0 c2 0 -b2 0 a2 0 0 0 0   0   0  0 0   0  0  0 0 0 0 0  0 0 0 
     {3} | 0 0 0  0 0   0 0  0 0 0 -b2 0   a2 0 0   0  0  0 0 0 0 0  0 0 0 
     {3} | 0 0 0  0 0   0 0  0 0 0 0   -c2 0  0 0   a2 0  0 0 0 0 0  0 0 0 
     {3} | 0 0 0  0 0   0 0  0 0 0 0   0   0  0 -c2 0  b2 0 0 0 0 0  0 0 0 
     {6} | 0 0 0  0 0   0 0  0 0 0 0   0   0  0 0   0  0  0 0 1 0 -1 0 0 0 
     {6} | 0 0 0  0 0   0 0  0 0 0 0   0   0  0 0   0  0  0 0 0 1 0  0 0 -1
     {6} | 0 0 0  0 0   0 0  0 0 0 0   0   0  0 0   0  0  0 0 0 0 0  0 1 0 
     ------------------------------------------------------------------------
     0  0 |
     0  0 |
     0  0 |
     0  0 |
     0  0 |
     0  0 |
     -1 0 |

             7       27
o8 : Matrix R  <--- R

i9 : eagonBeta E

     +-------------------------------+
     |+-------+--------+             |
o9 = ||       |(0, {1})|             |
     |+-------+--------+             |
     ||(1, {})|    *   |             |
     |+-------+--------+             |
     +-------------------------------+
     |+-------+--------+             |
     ||       |(1, {1})|             |
     |+-------+--------+             |
     ||(2, {})|    *   |             |
     |+-------+--------+             |
     +-------------------------------+
     |+--------+--------+-----------+|
     ||        |(2, {1})|(0, {1, 1})||
     |+--------+--------+-----------+|
     || (3, {})|    *   |     .     ||
     |+--------+--------+-----------+|
     ||(0, {2})|    .   |    3,3    ||
     |+--------+--------+-----------+|
     +-------------------------------+

i10 : 
