-- -*- M2-comint -*- hash: 1225022343

i1 : S = ZZ/101[a,b,c]

o1 = S

o1 : PolynomialRing

i2 : I = ideal(a,b)*ideal"a3,b3,c3"

             4     3     3   3    4     3
o2 = ideal (a , a*b , a*c , a b, b , b*c )

o2 : Ideal of S

i3 : R = S/I

o3 = R

o3 : QuotientRing

i4 : needsPackage "DGAlgebras"; isGolod R

o5 = true

i6 : E = eagon(R,6)

o6 = EagonData in <ring>.cache computed to length 6

o6 : EagonData

i7 : verticalStrand(E,3)

      27      81      81      27
o7 = R   <-- R   <-- R   <-- R
                              
     0       1       2       3

o7 : ChainComplex

i8 : horizontalStrand(E,2)

      3      9      27      81      243      729
o8 = R  <-- R  <-- R   <-- R   <-- R    <-- R
                                             
     0      1      2       3       4        5

o8 : ChainComplex

i9 : horizontalStrand (E,0)

      1      3      9      27      81      243
o9 = R  <-- R  <-- R  <-- R   <-- R   <-- R
                                           
     0      1      2      3       4       5

o9 : ChainComplex

i10 : F = eagonResolution E

       1      3      9      27      81      243      729
o10 = R  <-- R  <-- R  <-- R   <-- R   <-- R    <-- R
                                                     
      0      1      2      3       4       5        6

o10 : ChainComplex

i11 : eagonBeta E

      +----------------------------------------------------------------+
      |+-------+--------+                                              |
o11 = ||       |(0, {1})|                                              |
      |+-------+--------+                                              |
      ||(1, {})|    *   |                                              |
      |+-------+--------+                                              |
      +----------------------------------------------------------------+
      |+-------+--------+                                              |
      ||       |(1, {1})|                                              |
      |+-------+--------+                                              |
      ||(2, {})|    *   |                                              |
      |+-------+--------+                                              |
      +----------------------------------------------------------------+
      |+--------+--------+-----------+                                 |
      ||        |(2, {1})|(0, {1, 1})|                                 |
      |+--------+--------+-----------+                                 |
      || (3, {})|    *   |     .     |                                 |
      |+--------+--------+-----------+                                 |
      ||(0, {2})|    .   |     .     |                                 |
      |+--------+--------+-----------+                                 |
      +----------------------------------------------------------------+
      |+--------+--------+-----------+-----------+                     |
      ||        |(3, {1})|(0, {2, 1})|(1, {1, 1})|                     |
      |+--------+--------+-----------+-----------+                     |
      ||(0, {3})|    .   |     .     |     .     |                     |
      |+--------+--------+-----------+-----------+                     |
      ||(1, {2})|    .   |     .     |     .     |                     |
      |+--------+--------+-----------+-----------+                     |
      +----------------------------------------------------------------+
      |+-----------+-----------+-----------+-----------+--------------+|
      ||           |(0, {3, 1})|(1, {2, 1})|(2, {1, 1})|(0, {1, 1, 1})||
      |+-----------+-----------+-----------+-----------+--------------+|
      ||  (1, {3}) |     .     |     .     |     .     |       .      ||
      |+-----------+-----------+-----------+-----------+--------------+|
      ||  (2, {2}) |     .     |     .     |     .     |       .      ||
      |+-----------+-----------+-----------+-----------+--------------+|
      ||(0, {1, 2})|     .     |     .     |     .     |       .      ||
      |+-----------+-----------+-----------+-----------+--------------+|
      +----------------------------------------------------------------+

i12 : eagon(R,-1)
EagonData removed from R.cache

i13 : E = eagon(R,6, Verbose =>true)
Used 1 of 1 blocks of eagonBeta (2, 1)
Used 1 of 1 blocks of eagonBeta (2, 2)
Used 1 of 1 blocks of eagonBeta (2, 3)
Used 1 of 1 blocks of eagonBeta (2, 4)
Used 1 of 2 blocks of eagonBeta (3, 1)
Used 1 of 2 blocks of eagonBeta (3, 2)
Used 1 of 2 blocks of eagonBeta (3, 3)
Used 1 of 1 blocks of eagonBeta (3, 4)
Used 1 of 3 blocks of eagonBeta (4, 1)
Used 1 of 3 blocks of eagonBeta (4, 2)
Used 1 of 2 blocks of eagonBeta (4, 3)
Used 1 of 1 blocks of eagonBeta (4, 4)
Used 1 of 5 blocks of eagonBeta (5, 1)
Used 1 of 4 blocks of eagonBeta (5, 2)
Used 1 of 2 blocks of eagonBeta (5, 3)
Used 1 of 1 blocks of eagonBeta (5, 4)
Used 1 of 7 blocks of eagonBeta (6, 1)
Used 1 of 5 blocks of eagonBeta (6, 2)
Used 1 of 2 blocks of eagonBeta (6, 3)
Used 1 of 1 blocks of eagonBeta (6, 4)

o13 = EagonData in <ring>.cache computed to length 6

o13 : EagonData

i14 : eagon(R,-1)
EagonData removed from R.cache

i15 : En = eagon(R,6,CompressBeta => false)

o15 = EagonData in <ring>.cache computed to length 6

o15 : EagonData

i16 : eagonBeta (E,4), eagonBeta(E,5)

       +--------+--------+-----------+ 
o16 = (|        |(2, {1})|(0, {1, 1})|,
       +--------+--------+-----------+ 
       | (3, {})|    *   |     .     | 
       +--------+--------+-----------+ 
       |(0, {2})|    .   |     .     | 
       +--------+--------+-----------+ 
      -----------------------------------------------------------------------
      +--------+--------+-----------+-----------+
      |        |(3, {1})|(0, {2, 1})|(1, {1, 1})|)
      +--------+--------+-----------+-----------+
      |(0, {3})|    .   |     .     |     .     |
      +--------+--------+-----------+-----------+
      |(1, {2})|    .   |     .     |     .     |
      +--------+--------+-----------+-----------+

o16 : Sequence

i17 : eagonBeta (En,4), eagonBeta(En,5)

       +--------+--------+-----------+ 
o17 = (|        |(2, {1})|(0, {1, 1})|,
       +--------+--------+-----------+ 
       | (3, {})|    *   |     .     | 
       +--------+--------+-----------+ 
       |(0, {2})|    *   |     .     | 
       +--------+--------+-----------+ 
      -----------------------------------------------------------------------
      +--------+--------+-----------+-----------+
      |        |(3, {1})|(0, {2, 1})|(1, {1, 1})|)
      +--------+--------+-----------+-----------+
      |(0, {3})|    .   |     .     |     *     |
      +--------+--------+-----------+-----------+
      |(1, {2})|    *   |     .     |     *     |
      +--------+--------+-----------+-----------+

o17 : Sequence

i18 : 
