-- -*- M2-comint -*- hash: 25483116

i1 : S = ZZ/101[a,b,c]

o1 = S

o1 : PolynomialRing

i2 : I = (ideal(a,b,c^2))^2

             2          2   2     2   4
o2 = ideal (a , a*b, a*c , b , b*c , c )

o2 : Ideal of S

i3 : F = res(S^1/I)

      1      6      8      3
o3 = S  <-- S  <-- S  <-- S  <-- 0
                                  
     0      1      2      3      4

o3 : ChainComplex

i4 : K = res coker vars S

      1      3      3      1
o4 = S  <-- S  <-- S  <-- S  <-- 0
                                  
     0      1      2      3      4

o4 : ChainComplex

i5 : R = S/I

o5 = R

o5 : QuotientRing

i6 : E = eagon(R,6);

i7 : golodBetti(F,K,6)

            0 1 2  3  4   5   6
o7 = total: 1 3 9 27 81 243 729
         0: 1 3 6 12 24  48  96
         1: . . 2 10 32  88 224
         2: . . 1  5 20  72 232
         3: . . .  .  4  28 128
         4: . . .  .  1   7  42
         5: . . .  .  .   .   6
         6: . . .  .  .   .   1

o7 : BettiTally

i8 : betti res (coker vars R, LengthLimit => 6)

            0 1 2  3  4   5   6
o8 = total: 1 3 9 27 81 243 729
         0: 1 3 6 12 24  48  96
         1: . . 2 10 32  88 224
         2: . . 1  5 20  72 232
         3: . . .  .  4  28 128
         4: . . .  .  1   7  42
         5: . . .  .  .   .   6
         6: . . .  .  .   .   1

o8 : BettiTally

i9 : betti eagonResolution E

            0 1 2  3  4   5   6
o9 = total: 1 3 9 27 81 243 729
         0: 1 3 6 12 24  48  96
         1: . . 2 10 32  88 224
         2: . . 1  5 20  72 232
         3: . . .  .  4  28 128
         4: . . .  .  1   7  42
         5: . . .  .  .   .   6
         6: . . .  .  .   .   1

o9 : BettiTally

i10 : 
