-- -*- M2-comint -*- hash: -471963213

i1 : R = ZZ/101[a,b]/ideal"a2,b2"

o1 = R

o1 : QuotientRing

i2 : E = eagon(R,4)

o2 = EagonData in <ring>.cache computed to length 4

o2 : EagonData

i3 : net E

o3 = EagonData in <ring>.cache computed to length 4

i4 : 
