-- -*- M2-comint -*- hash: -841645122

i1 : S = ZZ/101[a,b,c]

o1 = S

o1 : PolynomialRing

i2 : I = ideal(a,b)*ideal(a,b,c)

             2                  2
o2 = ideal (a , a*b, a*c, a*b, b , b*c)

o2 : Ideal of S

i3 : R = S/I

o3 = R

o3 : QuotientRing

i4 : E = eagon(R,4);

i5 : picture E

     +-------------------------------------------------+
     |+-------+-------+                                |
o5 = ||       |(1, {})|                                |
     |+-------+-------+                                |
     ||(0, {})|   *   |                                |
     |+-------+-------+                                |
     +-------------------------------------------------+
     |+-------+-------+--------+                       |
     ||       |(2, {})|(0, {1})|                       |
     |+-------+-------+--------+                       |
     ||(1, {})|   *   |    *   |                       |
     |+-------+-------+--------+                       |
     +-------------------------------------------------+
     |+--------+-------+--------+--------+             |
     ||        |(3, {})|(0, {2})|(1, {1})|             |
     |+--------+-------+--------+--------+             |
     || (2, {})|   *   |    *   |    *   |             |
     |+--------+-------+--------+--------+             |
     ||(0, {1})|   .   |    .   |    *   |             |
     |+--------+-------+--------+--------+             |
     +-------------------------------------------------+
     |+--------+--------+--------+--------+-----------+|
     ||        |(0, {3})|(1, {2})|(2, {1})|(0, {1, 1})||
     |+--------+--------+--------+--------+-----------+|
     || (3, {})|    *   |    *   |    .   |     .     ||
     |+--------+--------+--------+--------+-----------+|
     ||(0, {2})|    .   |    *   |    .   |     .     ||
     |+--------+--------+--------+--------+-----------+|
     ||(1, {1})|    .   |    .   |    *   |     *     ||
     |+--------+--------+--------+--------+-----------+|
     +-------------------------------------------------+

i6 : picture E#{"eagonBeta",3,0}

     +-------+--------+
o6 = |       |(1, {1})|
     +-------+--------+
     |(2, {})|    *   |
     +-------+--------+

i7 : picture E

     +-------------------------------------------------+
     |+-------+-------+                                |
o7 = ||       |(1, {})|                                |
     |+-------+-------+                                |
     ||(0, {})|   *   |                                |
     |+-------+-------+                                |
     +-------------------------------------------------+
     |+-------+-------+--------+                       |
     ||       |(2, {})|(0, {1})|                       |
     |+-------+-------+--------+                       |
     ||(1, {})|   *   |    *   |                       |
     |+-------+-------+--------+                       |
     +-------------------------------------------------+
     |+--------+-------+--------+--------+             |
     ||        |(3, {})|(0, {2})|(1, {1})|             |
     |+--------+-------+--------+--------+             |
     || (2, {})|   *   |    *   |    *   |             |
     |+--------+-------+--------+--------+             |
     ||(0, {1})|   .   |    .   |    *   |             |
     |+--------+-------+--------+--------+             |
     +-------------------------------------------------+
     |+--------+--------+--------+--------+-----------+|
     ||        |(0, {3})|(1, {2})|(2, {1})|(0, {1, 1})||
     |+--------+--------+--------+--------+-----------+|
     || (3, {})|    *   |    *   |    .   |     .     ||
     |+--------+--------+--------+--------+-----------+|
     ||(0, {2})|    .   |    *   |    .   |     .     ||
     |+--------+--------+--------+--------+-----------+|
     ||(1, {1})|    .   |    .   |    *   |     *     ||
     |+--------+--------+--------+--------+-----------+|
     +-------------------------------------------------+

i8 : picture verticalStrand(E,1)

     +---------------------------+
     |+-------+-------+--------+ |
o8 = ||       |(2, {})|(0, {1})| |
     |+-------+-------+--------+ |
     ||(1, {})|   *   |    *   | |
     |+-------+-------+--------+ |
     +---------------------------+
     |+--------+-------+--------+|
     ||        |(3, {})|(0, {2})||
     |+--------+-------+--------+|
     || (2, {})|   *   |    *   ||
     |+--------+-------+--------+|
     ||(0, {1})|   .   |    .   ||
     |+--------+-------+--------+|
     +---------------------------+
     |+--------+--------+        |
     ||        |(0, {3})|        |
     |+--------+--------+        |
     || (3, {})|    *   |        |
     |+--------+--------+        |
     ||(0, {2})|    .   |        |
     |+--------+--------+        |
     +---------------------------+

i9 : 
