-- -*- M2-comint -*- hash: -558417361

i1 : topes = kreuzerSkarke(5,Limit=>1);
using offline data file: ks5-n50.txt

i2 : A = matrix topes_0

o2 = | 1 0 0 0 1 0 0  2  -2 -1 |
     | 0 1 0 0 0 1 -2 -1 2  0  |
     | 0 0 1 0 0 1 -1 -2 0  2  |
     | 0 0 0 1 1 0 2  0  -1 -2 |

              4        10
o2 : Matrix ZZ  <--- ZZ

i3 : header = description topes_0

o3 = 4 10  M:25 10 N:10 9 H:5,20 [-30] id:0

i4 : needsPackage "Polyhedra";

i5 : P = convexHull A

o5 = P

o5 : Polyhedron

i6 : LP = latticePoints P

o6 = {| -1 |, | 1 |, | 2  |, | 0 |, | 1 |, | -2 |, | 0  |, | 1  |, | 0 |, |
      | 0  |  | 0 |  | -1 |  | 1 |  | 0 |  | 2  |  | -2 |  | 0  |  | 1 |  |
      | 2  |  | 0 |  | -2 |  | 1 |  | 0 |  | 0  |  | -1 |  | -1 |  | 0 |  |
      | -2 |  | 0 |  | 0  |  | 0 |  | 1 |  | -1 |  | 2  |  | 0  |  | 0 |  |
     ------------------------------------------------------------------------
     0  |, | -1 |, | 0  |, | 0 |, | 0 |, | 0  |, | 0  |, | 0  |, | -1 |, 0, |
     -1 |  | 1  |  | -1 |  | 0 |  | 0 |  | 0  |  | -1 |  | 0  |  | 1  |     |
     -1 |  | 0  |  | 0  |  | 1 |  | 0 |  | 1  |  | 0  |  | -1 |  | 1  |     |
     1  |  | 0  |  | 1  |  | 0 |  | 1 |  | -1 |  | 0  |  | 0  |  | -1 |     |
     ------------------------------------------------------------------------
     1  |, | 1  |, | -1 |, | -1 |, | -1 |, | 0  |}
     -1 |  | -1 |  | 0  |  | 0  |  | 1  |  | 0  |
     -1 |  | -1 |  | 0  |  | 1  |  | 0  |  | 0  |
     1  |  | 0  |  | 0  |  | -1 |  | -1 |  | -1 |

o6 : List

i7 : #LP

o7 = 25

i8 : vertices P

o8 = | 1 0 2  0 0 -1 -2 0 1 0  |
     | 0 1 -1 0 1 0  2  0 0 -2 |
     | 0 0 -2 1 1 2  0  0 0 -1 |
     | 0 0 0  0 0 -2 -1 1 1 2  |

              4        10
o8 : Matrix QQ  <--- QQ

i9 : numColumns vertices P

o9 = 10

i10 : P2 = polar P

o10 = P2

o10 : Polyhedron

i11 : LP2 = latticePoints P2

o11 = {| 0  |, | -1 |, | 1  |, | -1 |, | 0  |, | -1 |, | 0  |, | 1 |, | -1 |,
       | 0  |  | 0  |  | 0  |  | 1  |  | -1 |  | -1 |  | -1 |  | 1 |  | -1 |
       | -1 |  | -1 |  | -1 |  | -1 |  | 0  |  | 0  |  | 1  |  | 1 |  | 0  |
       | -1 |  | 0  |  | -1 |  | 0  |  | -1 |  | 0  |  | -1 |  | 1 |  | 1  |
      -----------------------------------------------------------------------
      0}

o11 : List

i12 : #LP2

o12 = 10

i13 : vertices P2

o13 = | -1 -1 -1 -1 1 0  0  0  1  |
      | -1 0  1  -1 1 -1 -1 0  0  |
      | 0  -1 -1 0  1 0  1  -1 -1 |
      | 0  0  0  1  1 -1 -1 -1 -1 |

               4        9
o13 : Matrix QQ  <--- QQ

i14 : numColumns vertices P2

o14 = 9

i15 : 
