-- -*- M2-comint -*- hash: -1769733117

i1 : topes = kreuzerSkarke(9, 21);
using offline data file: ks9+21-n10.txt

i2 : topes_1

o2 = 4 7  M:26 7 N:12 6 H:9,21 [-24] id:1
        1   1   0   0  -4   0   2
        0   3   0   0  -6   3   6
        0   0   1   1  -1  -2  -1
        0   0   0   2  -2  -1   1

o2 : KSEntry

i3 : A = matrix topes_1

o3 = | 1 1 0 0 -4 0  2  |
     | 0 3 0 0 -6 3  6  |
     | 0 0 1 1 -1 -2 -1 |
     | 0 0 0 2 -2 -1 1  |

              4        7
o3 : Matrix ZZ  <--- ZZ

i4 : description topes_1

o4 = 4 7  M:26 7 N:12 6 H:9,21 [-24] id:1

i5 : needsPackage "Polyhedra"

o5 = Polyhedra

o5 : Package

i6 : P = convexHull A

o6 = P

o6 : Polyhedron

i7 : assert isReflexive P

i8 : P2 = polar P

o8 = P2

o8 : Polyhedron

i9 : (numColumns vertices P, numColumns vertices P2)

o9 = (7, 6)

o9 : Sequence

i10 : (# latticePoints P, # latticePoints P2)

o10 = (26, 12)

o10 : Sequence

i11 : L = topes/matrix;

i12 : netList L

      +-----------------------------+
o12 = || 1 0 0 2 -4 |               |
      || 0 1 1 5 -7 |               |
      || 0 0 3 0 -3 |               |
      || 0 0 0 6 -6 |               |
      +-----------------------------+
      || 1 1 0 0 -4 0  2  |         |
      || 0 3 0 0 -6 3  6  |         |
      || 0 0 1 1 -1 -2 -1 |         |
      || 0 0 0 2 -2 -1 1  |         |
      +-----------------------------+
      || 1 0 0 -1 1 -1 |            |
      || 0 1 1 2  0 -4 |            |
      || 0 0 3 3  0 -6 |            |
      || 0 0 0 0  3 -3 |            |
      +-----------------------------+
      || 1 0 0 0 -3 -3 3  |         |
      || 0 1 1 0 2  0  -4 |         |
      || 0 0 3 0 3  0  -6 |         |
      || 0 0 0 1 -1 -2 2  |         |
      +-----------------------------+
      || 1 0 0 0 -2 -4 4  -4 |      |
      || 0 1 0 0 -2 -2 2  -3 |      |
      || 0 0 1 1 1  3  -5 2  |      |
      || 0 0 0 2 2  4  -6 3  |      |
      +-----------------------------+
      || 1 0 0 1 -2 -1 1  -1 -1 3  ||
      || 0 1 0 0 0  2  -2 0  0  -3 ||
      || 0 0 1 0 0  -1 1  1  -1 1  ||
      || 0 0 0 2 -1 -1 -1 -1 1  0  ||
      +-----------------------------+
      || 1 0 0 0 2  0  0  -1 -3 |   |
      || 0 1 1 0 -1 -1 -1 -1 3  |   |
      || 0 0 2 0 -1 -1 1  -2 0  |   |
      || 0 0 0 1 -1 1  -1 1  1  |   |
      +-----------------------------+
      || 1 0 1 0 -2 -1 -1 1  -1 3  ||
      || 0 1 0 0 1  2  0  -2 0  -3 ||
      || 0 0 2 0 -2 -1 -1 -1 1  0  ||
      || 0 0 0 1 0  -1 1  1  -1 1  ||
      +-----------------------------+
      || 1 0 0 -1 0 0 1  -4 3  -6 | |
      || 0 1 0 1  0 1 1  0  -1 -2 | |
      || 0 0 1 1  0 1 -2 4  -2 4  | |
      || 0 0 0 0  1 0 -1 1  -1 1  | |
      +-----------------------------+
      || 1 0 0 1  1  0 -2 4  -2 0  ||
      || 0 1 0 0  -1 0 3  -4 1  -2 ||
      || 0 0 1 -1 0  0 1  -4 3  -2 ||
      || 0 0 0 0  0  1 -1 1  -1 1  ||
      +-----------------------------+

i13 : 
