-- -*- M2-comint -*- hash: 693462546

i1 : topes = kreuzerSkarke(5, 53, Limit=>4)
using offline data file: ks5+53-n204.txt

o1 = {4 5  M:51 5 N:11 5 H:5,53 [-96] id:0, 4 5  M:61 5 N:9 5 H:5,53 [-96]
         1   0   1   1  -8                     1   0   0   4  -8          
         0   1   0   0  -3                     0   1   1   9 -15          
         0   0   3   3 -12                     0   0   2   0  -6          
         0   0   0   6 -12                     0   0   0  12 -12          
     ------------------------------------------------------------------------
     id:1, 4 9  M:60 9 N:10 6 H:5,53 [-96] id:2, 4 9  M:59 9 N:10 6 H:5,53
              1   1   1   1   0  -1  -1  -2  -4     1   1   1   0   0   0 
              0   3   0   1   0  -1  -4   0  -4     0   2   0   0   4   0 
              0   0   2   2   0   2   2  -6  -4     0   0   2   0   0   4 
              0   0   0   0   1  -2  -2   3   1     0   0   0   1   1   1 
     ------------------------------------------------------------------------
     [-96] id:3}
     -2  -2  -2
     -4  -6  -6
     -6  -6  -4
     -3  -3  -3

o1 : List

i2 : assert(#topes == 4)

i3 : tope = topes_3

o3 = 4 9  M:59 9 N:10 6 H:5,53 [-96] id:3
        1   1   1   0   0   0  -2  -2  -2
        0   2   0   0   4   0  -4  -6  -6
        0   0   2   0   0   4  -6  -6  -4
        0   0   0   1   1   1  -3  -3  -3

o3 : KSEntry

i4 : header = description tope

o4 = 4 9  M:59 9 N:10 6 H:5,53 [-96] id:3

i5 : A = matrix tope

o5 = | 1 1 1 0 0 0 -2 -2 -2 |
     | 0 2 0 0 4 0 -4 -6 -6 |
     | 0 0 2 0 0 4 -6 -6 -4 |
     | 0 0 0 1 1 1 -3 -3 -3 |

              4        9
o5 : Matrix ZZ  <--- ZZ

i6 : availableOffline()

o6 = HashTable{kreuzerSkarke(1) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks1-n5.txt                  }
               kreuzerSkarke(2) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks2-n36.txt
               kreuzerSkarke(3) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks3-n244.txt
               kreuzerSkarke(5, Limit => 50) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks5-n50.txt
               kreuzerSkarke(5,53) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks5+53-n204.txt
               kreuzerSkarke(9,21) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks9+21-n10.txt
               kreuzerSkarke(11,24) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks11+24-n200.txt
               kreuzerSkarke(21, Limit => 100) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks21-n100.txt
               kreuzerSkarke(300) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks300-n20.txt
               kreuzerSkarke(491) => ${prefix}/share/Macaulay2/ReflexivePolytopesDB/ks491-n1.txt

o6 : HashTable

i7 : str = "4 12  M:34 12 N:17 8 H:17,30 [-26] id:0
       1   1   1   1   0   0   0  -3  -3  -1  -1  -3
       0   3   0   1   0   1   0  -3  -5   0  -1  -3
       0   0   2   2   0   0   1  -2  -2  -1  -1  -2
       0   0   0   0   1   1   1  -1  -1   1   1   1"

o7 = 4 12  M:34 12 N:17 8 H:17,30 [-26] id:0
       1   1   1   1   0   0   0  -3  -3  -1  -1  -3
       0   3   0   1   0   1   0  -3  -5   0  -1  -3
       0   0   2   2   0   0   1  -2  -2  -1  -1  -2
       0   0   0   0   1   1   1  -1  -1   1   1   1

i8 : L = kreuzerSkarke str

o8 = {4 12  M:34 12 N:17 8 H:17,30 [-26] id:0 id:0   }
        1   1   1   1   0   0   0  -3  -3  -1  -1  -3
        0   3   0   1   0   1   0  -3  -5   0  -1  -3
        0   0   2   2   0   0   1  -2  -2  -1  -1  -2
        0   0   0   0   1   1   1  -1  -1   1   1   1

o8 : List

i9 : matrix first L

o9 = | 1 1 1 1 0 0 0 -3 -3 -1 -1 -3 |
     | 0 3 0 1 0 1 0 -3 -5 0  -1 -3 |
     | 0 0 2 2 0 0 1 -2 -2 -1 -1 -2 |
     | 0 0 0 0 1 1 1 -1 -1 1  1  1  |

              4        12
o9 : Matrix ZZ  <--- ZZ

i10 : 
