-- -*- M2-comint -*- hash: -593811146

i1 : A = (-matrix{{0,1,0},{1,0,0},{0,0,1}}, matrix{{0,0,1},{0,0,0},{1,0,0}}, -matrix{{0,0,0},{0,0,1},{0,1,0}});

i2 : (C, b) = (matrix{{1/1,0,3},{0,5,0},{3,0,9}}, matrix{{-1},{-1},{-1}});

i3 : P = sdp(C,A,b);

i4 : (I,X,y,Z) = criticalIdeal P;

i5 : degree I

o5 = 6

i6 : rk = 1;

i7 : (J,X,y,Z) = criticalIdeal(P, rk);

i8 : degree J

o8 = 4

i9 : 
