-- -*- M2-comint -*- hash: 1449819931

i1 : R = QQ[x,y];

i2 : I = monomialIdeal(y^2,x^3);

o2 : MonomialIdeal of R

i3 : jumpingNumbers(I) -- default: interval [5/6, 2]

       5  7  4  3  5  11                                             2     
o3 = {{-, -, -, -, -, --, 2}, {monomialIdeal (x, y), monomialIdeal (x , y),
       6  6  3  2  3   6
     ------------------------------------------------------------------------
                     2        2                   3        2                
     monomialIdeal (x , x*y, y ), monomialIdeal (x , x*y, y ), monomialIdeal
     ------------------------------------------------------------------------
       3   2    2                   4   2      2   3                   4 
     (x , x y, y ), monomialIdeal (x , x y, x*y , y ), monomialIdeal (x ,
     ------------------------------------------------------------------------
      3      2   3
     x y, x*y , y )}}

o3 : List

i4 : jumpingNumbers(I,Interval=>{1,3/2}) -- [1,3/2]

       7  4  3                    2                      2        2  
o4 = {{-, -, -}, {monomialIdeal (x , y), monomialIdeal (x , x*y, y ),
       6  3  2
     ------------------------------------------------------------------------
                     3        2
     monomialIdeal (x , x*y, y )}}

o4 : List

i5 : jumpingNumbers(I,IntervalType=>"Open") -- (5/6,2)

       7  4  3  5  11                    2                      2        2  
o5 = {{-, -, -, -, --}, {monomialIdeal (x , y), monomialIdeal (x , x*y, y ),
       6  3  2  3   6
     ------------------------------------------------------------------------
                     3        2                   3   2    2                
     monomialIdeal (x , x*y, y ), monomialIdeal (x , x y, y ), monomialIdeal
     ------------------------------------------------------------------------
       4   2      2   3
     (x , x y, x*y , y )}}

o5 : List

i6 : jumpingNumbers(I,Interval=>{1,3/2},IntervalType=>"ClosedOpen") -- [1,3/2)

       7  4                    2                      2        2
o6 = {{-, -}, {monomialIdeal (x , y), monomialIdeal (x , x*y, y )}}
       6  3

o6 : List

i7 : 
