-- -*- M2-comint -*- hash: 667486237

i1 : R = hodgeRing (3, 3);

i2 : integral (1, 1, lambda_1)
warning: clearing value of symbol tempCh to allow access to subscripted variables based on it
       : debug with expression   debug 1257   or with command line option   --debug 1257

      1
o2 = --
     24

o2 : R

i3 : integral (2, 2, psi_1 * psi_2^2 * lambda_2)
warning: clearing value of symbol tempCh to allow access to subscripted variables based on it
       : debug with expression   debug 1257   or with command line option   --debug 1257

       7
o3 = ----
     1920

o3 : R

i4 : integral (3, 3, psi_1 * psi_2^2 * psi_3^3 * lambda_3)
warning: clearing value of symbol tempCh to allow access to subscripted variables based on it
       : debug with expression   debug 1257   or with command line option   --debug 1257

       31
o4 = -----
     16128

o4 : R

i5 : R = hodgeRing (4, 0);

i6 : integral (2, 0, lambda_1^3)
warning: clearing value of symbol tempCh to allow access to subscripted variables based on it
       : debug with expression   debug 1257   or with command line option   --debug 1257
warning: clearing value of symbol tempCh to allow access to subscripted variables based on it
       : debug with expression   debug 1257   or with command line option   --debug 1257

       1
o6 = ----
     2880

o6 : R

i7 : integral (3, 0, lambda_1^6)
warning: clearing value of symbol tempCh to allow access to subscripted variables based on it
       : debug with expression   debug 1257   or with command line option   --debug 1257

       1
o7 = -----
     90720

o7 : R

i8 : integral (4, 0, lambda_1^9)
warning: clearing value of symbol tempCh to allow access to subscripted variables based on it
       : debug with expression   debug 1257   or with command line option   --debug 1257

        1
o8 = ------
     113400

o8 : R

i9 : 
