-- -*- M2-comint -*- hash: 1398228905

i1 : R = QQ[u,v,x,y,z];

i2 : H = hyperGraph({{u,v},{x}});

i3 : isolatedVertices H

o3 = {y, z}

o3 : List

i4 : R = QQ[u,v,x,y,z];

i5 : G = graph({{x,y},{y,z}});

i6 : isolatedVertices G

o6 = {u, v}

o6 : List

i7 : connectedGraphComponents G

o7 = {{u}, {v}, {x, y, z}}

o7 : List

i8 : numConnectedGraphComponents G

o8 = 3

i9 : isConnectedGraph G

o9 = false

i10 : connectedComponents G

o10 = {{x, y, z}}

o10 : List

i11 : numConnectedComponents G

o11 = 1

i12 : isConnected G

o12 = true

i13 : 
