-- -*- M2-comint -*- hash: -520910480

i1 : R = QQ[x,y,z,w];

i2 : G = graph(R, {{x,y},{x,z},{y,z},{x,w}})

o2 = Graph{edges => {{x, y}, {x, z}, {y, z}, {x, w}}}
           ring => R
           vertices => {x, y, z, w}

o2 : Graph

i3 : H = hyperGraph(R, {{x,y,z},{x,w}})

o3 = HyperGraph{edges => {{x, y, z}, {x, w}}}
                ring => R
                vertices => {x, y, z, w}

o3 : HyperGraph

i4 : R = QQ[x,y,z,w];

i5 : G = graph {x*y, x*z, y*z, x*w}

o5 = Graph{edges => {{x, y}, {x, z}, {y, z}, {x, w}}}
           ring => R
           vertices => {x, y, z, w}

o5 : Graph

i6 : H = hyperGraph {x*y*z, x*w}

o6 = HyperGraph{edges => {{x, y, z}, {x, w}}}
                ring => R
                vertices => {x, y, z, w}

o6 : HyperGraph

i7 : G = graph ideal(x*y, x*z, y*z, x*w)

o7 = Graph{edges => {{x, y}, {x, z}, {y, z}, {x, w}}}
           ring => R
           vertices => {x, y, z, w}

o7 : Graph

i8 : R = QQ[x,y,z,w];

i9 : H = hyperGraph {x*y*z,x*w};

i10 : D = hyperGraphToSimplicialComplex H

o10 = simplicialComplex | xw xyz |

o10 : SimplicialComplex

i11 : simplicialComplexToHyperGraph D

o11 = HyperGraph{edges => {{x, y, z}, {x, w}}}
                 ring => R
                 vertices => {x, y, z, w}

o11 : HyperGraph

i12 : R = QQ[x,y,z,w];

i13 : G = graph {x*y, x*z, y*z, x*w};

i14 : H = hyperGraph G

o14 = HyperGraph{edges => {{x, y}, {x, z}, {y, z}, {x, w}}}
                 ring => R
                 vertices => {x, y, z, w}

o14 : HyperGraph

i15 : graph H

o15 = Graph{edges => {{x, y}, {x, z}, {y, z}, {x, w}}}
            ring => R
            vertices => {x, y, z, w}

o15 : Graph

i16 : R = QQ[x,y,z,w];

i17 : D = simplicialComplex {x*y, x*z, y*z, x*w};

i18 : H = simplicialComplexToHyperGraph D

o18 = HyperGraph{edges => {{x, y}, {x, z}, {y, z}, {x, w}}}
                 ring => R
                 vertices => {x, y, z, w}

o18 : HyperGraph

i19 : G = graph H

o19 = Graph{edges => {{x, y}, {x, z}, {y, z}, {x, w}}}
            ring => R
            vertices => {x, y, z, w}

o19 : Graph

i20 : isChordal G 

o20 = true

i21 : R = QQ[x,y,z,w];

i22 : cycle R

o22 = Graph{edges => {{x, y}, {y, z}, {z, w}, {x, w}}}
            ring => R
            vertices => {x, y, z, w}

o22 : Graph

i23 : cycle(R,3)

o23 = Graph{edges => {{x, y}, {y, z}, {x, z}}}
            ring => R
            vertices => {x, y, z, w}

o23 : Graph

i24 : cycle {x,y,w} 

o24 = Graph{edges => {{x, y}, {y, w}, {x, w}}}
            ring => R
            vertices => {x, y, z, w}

o24 : Graph

i25 : R = QQ[x,y,z,w];

i26 : antiCycle R

o26 = Graph{edges => {{x, z}, {y, w}}}
            ring => R
            vertices => {x, y, z, w}

o26 : Graph

i27 : R = QQ[x,y,z,w];

i28 : completeGraph R

o28 = Graph{edges => {{x, y}, {x, z}, {x, w}, {y, z}, {y, w}, {z, w}}}
            ring => R
            vertices => {x, y, z, w}

o28 : Graph

i29 : completeGraph(R,3)

o29 = Graph{edges => {{x, y}, {x, z}, {y, z}}}
            ring => R
            vertices => {x, y, z, w}

o29 : Graph

i30 : completeGraph {x,y,w} 

o30 = Graph{edges => {{x, y}, {x, w}, {y, w}}}
            ring => R
            vertices => {x, y, z, w}

o30 : Graph

i31 : R = QQ[a,b,x,y];

i32 : completeMultiPartite(R,2,2)

o32 = Graph{edges => {{a, x}, {a, y}, {b, x}, {b, y}}}
            ring => R
            vertices => {a, b, x, y}

o32 : Graph

i33 : R = QQ[x,y,z,u,v];

i34 : randomGraph(R,3)

o34 = Graph{edges => {{z, u}, {x, u}, {x, v}}}
            ring => R
            vertices => {x, y, z, u, v}

o34 : Graph

i35 : randomUniformHyperGraph(R,2,3)

o35 = HyperGraph{edges => {{y, u}, {x, u}, {x, y}}}
                 ring => R
                 vertices => {x, y, z, u, v}

o35 : HyperGraph

i36 : randomHyperGraph(R,{3,2,1})

o36 = HyperGraph{edges => {{x, y, z}, {z, u}, {v}}}
                 ring => R
                 vertices => {x, y, z, u, v}

o36 : HyperGraph

i37 : 
