-- -*- M2-comint -*- hash: 1610825880

i1 : R = QQ[x_1..x_3,y_1..y_3];

i2 : G = graph(R,{x_1*y_1,x_2*y_2,x_3*y_3, x_1*y_2,x_1*y_3,x_2*y_3})

o2 = Graph{edges => {{x , y }, {x , y }, {x , y }, {x , y }, {x , y }, {x , y }}}
                       1   1     2   2     3   3     1   2     1   3     2   3
           ring => R
           vertices => {x , x , x , y , y , y }
                         1   2   3   1   2   3

o2 : Graph

i3 : isCM G and isBipartite G

o3 = true

i4 : L = getGoodLeaf(G)

o4 = {x , y }
       1   1

o4 : List

i5 : degreeVertex(G,y_1)

o5 = 1

i6 : H = inducedHyperGraph(G, vertices(G) - set(L))

o6 = HyperGraph{edges => {{x , y }, {x , y }, {x , y }}}
                            2   2     3   3     2   3
                ring => QQ[x ..y ]
                            2   3
                vertices => {x , x , y , y }
                              2   3   2   3

o6 : HyperGraph

i7 : K = simplicialComplexToHyperGraph independenceComplex H;

i8 : edges K

o8 = {{x , x }, {x , y }, {y , y }}
        2   3     3   2     2   3

o8 : List

i9 : use ring K;

i10 : A = apply(edges(K), e->append(e, y_1));

i11 : B = apply(edges inducedHyperGraph(K, {x_2,x_3}), e-> append(e, x_1));

i12 : shelling = join(A,B)

o12 = {{x , x , y }, {x , y , y }, {y , y , y }, {x , x , x }}
         2   3   1     3   2   1     2   3   1     2   3   1

o12 : List

i13 : independenceComplex(G)

o13 = simplicialComplex | y_1y_2y_3 x_3y_1y_2 x_2x_3y_1 x_1x_2x_3 |

o13 : SimplicialComplex

i14 : 
