-- -*- M2-comint -*- hash: -1415415179

i1 : P = QQ[a,b,c];

i2 : H = hyperGraph({a*b,b*c});

i3 : S = QQ[x,y,z,w];

i4 : changeRing(H,S,{x,z,y})

o4 = HyperGraph{edges => {{y, z}, {x, z}}}
                ring => S
                vertices => {x, y, z, w}

o4 : HyperGraph

i5 : P = QQ[a,b,c];

i6 : H = hyperGraph({a*b*c});

i7 : G = hyperGraph({a*b,b*c});

i8 : S = QQ[x,y,z,w];

i9 : changeRing(H,S,{x,y,x})

o9 = HyperGraph{edges => {{x, y}}       }
                ring => S
                vertices => {x, y, z, w}

o9 : HyperGraph

i10 : changeRing(G,S,{x,y,x})

o10 = HyperGraph{edges => {{x, y}}       }
                 ring => S
                 vertices => {x, y, z, w}

o10 : HyperGraph

i11 : P = QQ[a,b,c];

i12 : H = hyperGraph({a*b,b*c});

i13 : S = QQ[x,y];

i14 : changeRing(H,S,{x,y,y})

o14 = HyperGraph{edges => {{y}}    }
                 ring => S
                 vertices => {x, y}

o14 : HyperGraph

i15 : changeRing(H,S,{x,y,y},MaximalEdges=>true)

o15 = HyperGraph{edges => {{x, y}} }
                 ring => S
                 vertices => {x, y}

o15 : HyperGraph

i16 : 
