-- -*- M2-comint -*- hash: 437605532

i1 : R = QQ[a..d];

i2 : cliqueNumber completeGraph R

o2 = 4

i3 : G = graph({a*b,b*c,a*c,a*d})

o3 = Graph{edges => {{a, b}, {a, c}, {b, c}, {a, d}}}
           ring => R
           vertices => {a, b, c, d}

o3 : Graph

i4 : cliqueNumber G

o4 = 3

i5 : dim cliqueComplex G + 1 == cliqueNumber G

o5 = true

i6 : 
