-- -*- M2-comint -*- hash: -1649167283

i1 : R = QQ[a..l];

i2 : H = hyperGraph {a*b*c, c*d, d*e*f, h*i, i*j, l}

o2 = HyperGraph{edges => {{a, b, c}, {c, d}, {d, e, f}, {h, i}, {i, j}, {l}}}
                ring => R
                vertices => {a, b, c, d, e, f, g, h, i, j, k, l}

o2 : HyperGraph

i3 : L = connectedComponents H

o3 = {{a, b, c, d, e, f}, {h, i, j}, {l}}

o3 : List

i4 : apply(L, C -> inducedHyperGraph(H,C))

o4 = {HyperGraph{edges => {{a, b, c}, {c, d}, {d, e, f}}},
                 ring => QQ[a..f]                         
                 vertices => {a, b, c, d, e, f}           
     ------------------------------------------------------------------------
     HyperGraph{edges => {{h, i}, {i, j}}}, HyperGraph{edges => {{l}} }}
                ring => QQ[h..j]                       ring => QQ[l]
                vertices => {h, i, j}                  vertices => {l}

o4 : List

i5 : R = QQ[a,b,c,d];

i6 : H = hyperGraph {a*b, c}

o6 = HyperGraph{edges => {{a, b}, {c}}  }
                ring => R
                vertices => {a, b, c, d}

o6 : HyperGraph

i7 : connectedComponents H

o7 = {{a, b}, {c}}

o7 : List

i8 : isolatedVertices H

o8 = {d}

o8 : List

i9 : 
