-- -*- M2-comint -*- hash: 113552450

i1 : R = QQ[a,b,c,d,e];

i2 : G = graph {a*b,b*c,c*d,d*e,e*a} -- graph of the 5-cycle

o2 = Graph{edges => {{a, b}, {b, c}, {c, d}, {a, e}, {d, e}}}
           ring => R
           vertices => {a, b, c, d, e}

o2 : Graph

i3 : H1 = inducedGraph(G,{b,c,d,e})

o3 = Graph{edges => {{b, c}, {c, d}, {d, e}}}
           ring => QQ[b..e]
           vertices => {b, c, d, e}

o3 : Graph

i4 : H2 = inducedGraph(G,{a,b,d,e})

o4 = Graph{edges => {{a, b}, {a, e}, {d, e}}}
           ring => QQ[a..b, d..e]
           vertices => {a, b, d, e}

o4 : Graph

i5 : use ring H1

o5 = QQ[b..e]

o5 : PolynomialRing

i6 : inducedGraph(H1,{c,d,e})

o6 = Graph{edges => {{c, d}, {d, e}}}
           ring => QQ[c..e]
           vertices => {c, d, e}

o6 : Graph

i7 : use ring G

o7 = R

o7 : PolynomialRing

i8 : inducedGraph(G,{b,c,d,e},OriginalRing=>true) --H1 but in bigger ring

o8 = Graph{edges => {{b, c}, {c, d}, {d, e}}}
           ring => R
           vertices => {a, b, c, d, e}

o8 : Graph

i9 : R = QQ[a,b,c,d,e];

i10 : G = graph {a*b,b*c,c*d,d*e,e*a} -- graph of the 5-cycle

o10 = Graph{edges => {{a, b}, {b, c}, {c, d}, {a, e}, {d, e}}}
            ring => R
            vertices => {a, b, c, d, e}

o10 : Graph

i11 : H = inducedGraph(G,{b,c,d})

o11 = Graph{edges => {{b, c}, {c, d}}}
            ring => QQ[b..d]
            vertices => {b, c, d}

o11 : Graph

i12 : graph changeRing(H,R,{b,c,d})

o12 = Graph{edges => {{c, d}, {b, c}}  }
            ring => R
            vertices => {a, b, c, d, e}

o12 : Graph

i13 : 
