-- -*- M2-comint -*- hash: 164493427

i1 : S = QQ[a..e];

i2 : G = graph {a*b,b*c,c*d,d*e,a*e} -- the 5-cycle (connected)

o2 = Graph{edges => {{a, b}, {b, c}, {c, d}, {a, e}, {d, e}}}
           ring => S
           vertices => {a, b, c, d, e}

o2 : Graph

i3 : H = graph {a*b,b*c,c*a,d*e} -- a 3-cycle and a disjoint edge (not connected)

o3 = Graph{edges => {{a, b}, {a, c}, {b, c}, {d, e}}}
           ring => S
           vertices => {a, b, c, d, e}

o3 : Graph

i4 : isConnectedGraph G

o4 = true

i5 : isConnectedGraph H

o5 = false

i6 : S = QQ[a..e];

i7 : G = graph {a*b,b*c,c*d,a*d} -- 4-cycle with isolated vertex (not connected)

o7 = Graph{edges => {{a, b}, {b, c}, {a, d}, {c, d}}}
           ring => S
           vertices => {a, b, c, d, e}

o7 : Graph

i8 : isolatedVertices G

o8 = {e}

o8 : List

i9 : isConnectedGraph G

o9 = false

i10 : 
