-- -*- M2-comint -*- hash: -1878552475

i1 : S = QQ[a..d];

i2 : g = graph {a*b,b*c,c*d,d*a} -- the four cycle

o2 = Graph{edges => {{a, b}, {b, c}, {a, d}, {c, d}}}
           ring => S
           vertices => {a, b, c, d}

o2 : Graph

i3 : vertexCoverNumber g

o3 = 2

i4 : S = QQ[a..e];

i5 : g = graph {a*b,a*c,a*d,a*e,b*c,b*d,b*e,c*d,c*e,d*e} -- the complete graph K_5

o5 = Graph{edges => {{a, b}, {a, c}, {b, c}, {a, d}, {b, d}, {c, d}, {a, e}, {b, e}, {c, e}, {d, e}}}
           ring => S
           vertices => {a, b, c, d, e}

o5 : Graph

i6 : vertexCoverNumber g

o6 = 4

i7 : h = hyperGraph {a*b*c,a*d,c*e,b*d*e}

o7 = HyperGraph{edges => {{a, b, c}, {a, d}, {c, e}, {b, d, e}}}
                ring => S
                vertices => {a, b, c, d, e}

o7 : HyperGraph

i8 : vertexCoverNumber(h)

o8 = 2

i9 : 
