-- -*- M2-comint -*- hash: 486198654

i1 : R = QQ[x, y];

i2 : A = arrangement{x, y, x+y}

o2 = {x, y, x + y}

o2 : Hyperplane Arrangement 

i3 : assert(A == A)

i4 : B = arrangement{2*x, y, x+y}

o4 = {2x, y, x + y}

o4 : Hyperplane Arrangement 

i5 : A == B

o5 = false

i6 : assert not (A == B)

i7 : assert( A != B )

i8 : A' = arrangement{y, x, x+y}

o8 = {y, x, x + y}

o8 : Hyperplane Arrangement 

i9 : A == A'

o9 = false

i10 : assert( A != A' )

i11 : 
