-- -*- M2-comint -*- hash: 224873540

i1 : S = QQ[w,x,y,z];

i2 : A3 = arrangement(matrix{{1,1,1,0,0,0},{-1,0,0,1,1,0},{0,-1,0,-1,0,1},{0,0,-1,0,-1,-1}}, S)

o2 = {w - x, w - y, w - z, x - y, x - z, y - z}

o2 : Hyperplane Arrangement 

i3 : assert isCentral A3

i4 : R = S/ideal(w+x+y+z);

i5 : A3' = arrangement(matrix{{1,1,1,0,0,0},{-1,0,0,1,1,0},{0,-1,0,-1,0,1},{0,0,-1,0,-1,-1}}, R)

o5 = {- 2x - y - z, - x - 2y - z, - x - y - 2z, x - y, x - z, y - z}

o5 : Hyperplane Arrangement 

i6 : ring A3'

o6 = R

o6 : QuotientRing

i7 : assert(rank A3' === dim ring A3')

i8 : trivial = arrangement(map(S^4,S^0,0),S)

o8 = {}

o8 : Hyperplane Arrangement 

i9 : ring trivial

o9 = S

o9 : PolynomialRing

i10 : assert isCentral trivial

i11 : 
