-- -*- M2-comint -*- hash: 1265032100

i1 : A = typeA 3

o1 = {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
       1    2   1    3   1    4   2    3   2    4   3    4

o1 : Hyperplane Arrangement 

i2 : F = closure(A,{0,1})

o2 = {0, 1, 3}

o2 : Flat of {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
               1    2   1    3   1    4   2    3   2    4   3    4

i3 : A_F

o3 = {x  - x , x  - x , x  - x }
       1    2   1    3   2    3

o3 : Hyperplane Arrangement 

i4 : I = ideal((hyperplanes A)_{0,3}) -- one can also specify a linear ideal

o4 = ideal (x  - x , x  - x )
             1    2   2    3

o4 : Ideal of QQ[x ..x ]
                  1   4

i5 : assert (F == closure(A,I))

i6 : 
