-- -*- M2-comint -*- hash: -1085899504

i1 : A = arrangement "braid"

o1 = {x , x , x , x  - x , x  - x , x  - x }
       1   2   3   1    2   1    3   2    3

o1 : Hyperplane Arrangement 

i2 : deletion(A,5)

o2 = {x , x , x , x  - x , x  - x }
       1   2   3   1    2   1    3

o2 : Hyperplane Arrangement 

i3 : R = QQ[x,y]

o3 = R

o3 : PolynomialRing

i4 : A = arrangement {x,y,x-y}

o4 = {x, y, x - y}

o4 : Hyperplane Arrangement 

i5 : deletion(A, x-y)

o5 = {x, y}

o5 : Hyperplane Arrangement 

i6 : A = arrangement {x, x-y, y, x-y, y-x}

o6 = {x, x - y, y, x - y, - x + y}

o6 : Hyperplane Arrangement 

i7 : A1 = deletion(A, x-y)

o7 = {x, y, x - y, - x + y}

o7 : Hyperplane Arrangement 

i8 : A2 = deletion(A, y-x)

o8 = {x, y, x - y, - x + y}

o8 : Hyperplane Arrangement 

i9 : A3 = deletion(A, 2*(x-y))

o9 = {x, y, x - y, - x + y}

o9 : Hyperplane Arrangement 

i10 : assert(A1 == A2)

i11 : assert(A2 == A3)

i12 : 
