-- -*- M2-comint -*- hash: 830825731

i1 : R = QQ[x,y,z];

i2 : der arrangement {x,y,z,x-y,x-z,y-z}

o2 = {1} | -1 0      0            |
     {1} | -1 -x+y   0            |
     {1} | -1 -x+z   -xy+xz+yz-z2 |
     {1} | -1 y      0            |
     {1} | -1 z      yz-z2        |
     {1} | -1 -x+y+z xz-z2        |

             6       3
o2 : Matrix R  <--- R

i3 : prune image der typeA(3)

                 3
o3 = (QQ[x ..x ])
          1   4

o3 : QQ[x ..x ]-module, free, degrees {1..3}
         1   4

i4 : prune image der typeB(4)

                 4
o4 = (QQ[x ..x ])
          1   4

o4 : QQ[x ..x ]-module, free, degrees {1, 3, 5, 7}
         1   4

i5 : R = QQ[x,y,z];

i6 : A = arrangement {x,y,z,x+y+z}

o6 = {x, y, z, x + y + z}

o6 : Hyperplane Arrangement 

i7 : der A

o7 = {1} | -1 0  0    0      |
     {1} | -1 z  -z   -x-y-z |
     {1} | -1 -y -x-z 0      |
     {1} | -1 0  -z   -y     |

             4       4
o7 : Matrix R  <--- R

i8 : betti res prune image der A

            0 1
o8 = total: 4 1
         1: 1 .
         2: 3 1

o8 : BettiTally

i9 : der(A, Strategy => Popescu)

o9 = {0} | x 0   0     |
     {0} | y -yz yz    |
     {0} | z yz  xz+z2 |
     {1} | 4 y-z x+3z  |

             4       3
o9 : Matrix R  <--- R

i10 : R = QQ[x,y]

o10 = R

o10 : PolynomialRing

i11 : prune image der arrangement {x,y,x-y,y-x,y,2*x}   -- rank 2 => free

       2
o11 = R

o11 : R-module, free, degrees {2:3}

i12 : prune image der(arrangement {x,y,x-y}, {2,2,2})  -- same

       2
o12 = R

o12 : R-module, free, degrees {2:3}

i13 : 
