-- -*- M2-comint -*- hash: -1077360751

i1 : A2 = typeA 2

o1 = {x  - x , x  - x , x  - x }
       1    2   1    3   2    3

o1 : Hyperplane Arrangement 

i2 : euler A2

o2 = -1

i3 : assert all(5, n -> euler typeA (n+1) === (-1)^(n) * n!)

i4 : B2 = typeB 2

o4 = {x , x  - x , x  + x , x }
       1   1    2   1    2   2

o4 : Hyperplane Arrangement 

i5 : euler B2

o5 = -2

i6 : assert all(4, n -> euler typeB (n+1) === (-1)^(n) * 2^n * n!)

i7 : A4 = typeA 4

o7 = {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
       1    2   1    3   1    4   1    5   2    3   2    4   2    5   3    4   3    5   4    5

o7 : Hyperplane Arrangement 

i8 : F = flat(A4, {0,7})

o8 = {0, 7}

o8 : Flat of {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
               1    2   1    3   1    4   1    5   2    3   2    4   2    5   3    4   3    5   4    5

i9 : euler F

o9 = 0

i10 : assert(euler A4_F === euler F)

i11 : euler flat(A4, {2,3,9})

o11 = -1

i12 : euler flat(A4, {0,1,2,4,5,7})

o12 = 2

i13 : euler flat(A4, {2,4,6,8})

o13 = 0

i14 : assert (euler arrangement({}, ring A2) === 3)

i15 : 
