-- -*- M2-comint -*- hash: 684694980

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : A = arrangement {x,y,z,x-y,x-z}

o2 = {x, y, z, x - y, x - z}

o2 : Hyperplane Arrangement 

i3 : (A'',m'') = eulerRestriction(A,{1,1,1,1,1},1)

o3 = ({x - z, z, x}, {1, 1, 1})

o3 : Sequence

i4 : restriction(A,1)

o4 = {x, z, x, x - z}

o4 : Hyperplane Arrangement 

i5 : trim oo -- same underlying simple arrangement, different multiplicities

o5 = {z, x, x - z}

o5 : Hyperplane Arrangement 

i6 : m = {2,2,2,2,1}; m' = {2,2,2,1,1};

i8 : (A'',m'') = eulerRestriction(A,m,3)

o8 = ({y - z, z, y}, {1, 2, 3})

o8 : Sequence

i9 : prune image der(A,m)

      3
o9 = R

o9 : R-module, free, degrees {3:3}

i10 : prune image der(A,m')

       3
o10 = R

o10 : R-module, free, degrees {2..3, 3}

i11 : prune image der(A'',m'')

                2
o11 = (QQ[y..z])

o11 : QQ[y..z]-module, free, degrees {2:3}

i12 : A = arrangement "bracelet";

i13 : (B,m) = eulerRestriction(A,{1,1,1,1,1,1,1,1,1},0)

o13 = ({x , x  + x , x , x , x  + x  + x , x  + x }, {1, 1, 1, 1, 1, 1})
         2   3    4   3   4   2    3    4   2    4

o13 : Sequence

i14 : C = restriction(A,0)

o14 = {x , x , x , x  + x , x  + x , x  + x , x  + x , x  + x  + x }
        2   3   4   2    4   3    4   2    4   3    4   2    3    4

o14 : Hyperplane Arrangement 

i15 : assert(isFreeModule prune image der B) -- one is free

i16 : assert(not isFreeModule prune image der C) -- the other is not

i17 : 
