-- -*- M2-comint -*- hash: -1472803639

i1 : R = QQ[x, y, z];

i2 : A = arrangement{x, y, x-y, z}

o2 = {x, y, x - y, z}

o2 : Hyperplane Arrangement 

i3 : makeEssential A

o3 = {x, y, x - y, z}

o3 : Hyperplane Arrangement 

i4 : assert(A == makeEssential A)

i5 : A' = deletion(A, z)

o5 = {x, y, x - y}

o5 : Hyperplane Arrangement 

i6 : ring A'

o6 = R

o6 : PolynomialRing

i7 : makeEssential A'

o7 = {x + y, x, y}

o7 : Hyperplane Arrangement 

i8 : ring makeEssential A'

o8 = QQ[x..y]

o8 : PolynomialRing

i9 : A = typeA 3

o9 = {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
       1    2   1    3   1    4   2    3   2    4   3    4

o9 : Hyperplane Arrangement 

i10 : ring A

o10 = QQ[x ..x ]
          1   4

o10 : PolynomialRing

i11 : A' = makeEssential A

o11 = {x  - x , x  - x , x , x  - x , x , x }
        1    2   1    3   1   2    3   2   3

o11 : Hyperplane Arrangement 

i12 : ring A'

o12 = QQ[x ..x ]
          1   3

o12 : PolynomialRing

i13 : B = typeB 3

o13 = {x , x  - x , x  + x , x  - x , x  + x , x , x  - x , x  + x , x }
        1   1    2   1    2   1    3   1    3   2   2    3   2    3   3

o13 : Hyperplane Arrangement 

i14 : assert(B == makeEssential B)

i15 : 
