-- -*- M2-comint -*- hash: -98894610

i1 : A = typeA 3

o1 = {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
       1    2   1    3   1    4   2    3   2    4   3    4

o1 : Hyperplane Arrangement 

i2 : R = ring A

o2 = R

o2 : PolynomialRing

i3 : matrix A

o3 = | x_1-x_2 x_1-x_3 x_1-x_4 x_2-x_3 x_2-x_4 x_3-x_4 |

             1       6
o3 : Matrix R  <--- R

i4 : matrix typeB 2

o4 = | x_1 x_1-x_2 x_1+x_2 x_2 |

                        1                  4
o4 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                 1   2              1   2

i5 : matrix typeD 4

o5 = | x_1-x_2 x_1+x_2 x_1-x_3 x_1+x_3 x_1-x_4 x_1+x_4 x_2-x_3 x_2+x_3
     ------------------------------------------------------------------------
     x_2-x_4 x_2+x_4 x_3-x_4 x_3+x_4 |

                        1                  12
o5 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                 1   4              1   4

i6 : trivial = arrangement({},R)

o6 = {}

o6 : Hyperplane Arrangement 

i7 : matrix trivial

o7 = 0

             1
o7 : Matrix R  <--- 0

i8 : assert(matrix trivial == 0)

i9 : 
