-- -*- M2-comint -*- hash: 2027997050

i1 : R = QQ[x,y,z];

i2 : orlikTerao arrangement {x,y,z,x+y+z}

o2 = ideal(y y y  - y y y  - y y y  - y y y )
            1 2 3    1 2 4    1 3 4    2 3 4

o2 : Ideal of QQ[y ..y ]
                  1   4

i3 : I = orlikTerao arrangement "braid"

o3 = ideal (y y  - y y  + y y , y y  + y y  - y y , y y  + y y  - y y , y y 
             4 5    4 6    5 6   2 3    2 6    3 6   1 3    1 5    3 5   1 2
     ------------------------------------------------------------------------
     + y y  - y y )
        1 4    2 4

o3 : Ideal of QQ[y ..y ]
                  1   6

i4 : betti res I

            0 1 2 3
o4 = total: 1 4 5 2
         0: 1 . . .
         1: . 4 2 .
         2: . . 3 2

o4 : BettiTally

i5 : OT := comodule I;

i6 : apply(1+dim OT, i-> 0 == Ext^i(OT, ring OT))

o6 = {true, true, true, false}

o6 : List

i7 : p = poincare arrangement "braid"

                 2     3
o7 = 1 + 6T + 11T  + 6T

o7 : ZZ[T]

i8 : F = frac QQ[T]; f = map(F,ring p);

o9 : RingMap F <--- ZZ[T]

i10 : sub(f p, {T=>T/(1-T)})

            2
        - 2T  - 3T - 1
o10 = -----------------
       3     2
      T  - 3T  + 3T - 1

o10 : frac F

i11 : reduceHilbert hilbertSeries I

                 2
      1 + 3T + 2T
o11 = ------------
               3
        (1 - T)

o11 : Expression of class Divide

i12 : 
