-- -*- M2-comint -*- hash: -584828693

i1 : R = QQ[x,y,z];

i2 : B = arrangement("braid", R)

o2 = {x, y, z, x - y, x - z, y - z}

o2 : Hyperplane Arrangement 

i3 : rank B

o3 = 3

i4 : assert(rank B === rank matroid B)

i5 : rank typeA 4

o5 = 4

i6 : M = arrangement("MacLane")

o6 = {x , x , x , x  - x , x  - x , x  - 6420x , x  - 6420x  - x , x  - 6420x  + 6419x }
       1   2   3   1    2   1    3   2        3   1        2    3   1        2        3

o6 : Hyperplane Arrangement 

i7 : rank M

o7 = 3

i8 : trivial = arrangement(map(R^(numgens R),R^0,0),R)

o8 = {}

o8 : Hyperplane Arrangement 

i9 : rank trivial

o9 = 0

i10 : assert(rank trivial === 0)

i11 : 
