-- -*- M2-comint -*- hash: -907160922

i1 : A = typeA(3)

o1 = {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
       1    2   1    3   1    4   2    3   2    4   3    4

o1 : Hyperplane Arrangement 

i2 : L = flats(2,A)

o2 = {{3, 4, 5}, {1, 2, 5}, {0, 5}, {0, 2, 4}, {1, 4}, {2, 3}, {0, 1, 3}}

o2 : List

i3 : A' = restriction first L

o3 = {x  - x , x  - x , x  - x }
       1    4   1    4   1    4

o3 : Hyperplane Arrangement 

i4 : x := (ring A)_0 -- the subspace need not be in the arrangement

o4 = x
      1

o4 : QQ[x ..x ]
         1   4

i5 : restriction(A,x)

o5 = {-x , -x , -x , x  - x , x  - x , x  - x }
        2    3    4   2    3   2    4   3    4

o5 : Hyperplane Arrangement 

i6 : 
