-- -*- M2-comint -*- hash: 2068276752

i1 : A0 = typeD(3, ZZ)

o1 = {x  - x , x  + x , x  - x , x  + x , x  - x , x  + x }
       1    2   1    2   1    3   1    3   2    3   2    3

o1 : Hyperplane Arrangement 

i2 : ring A0

o2 = ZZ[x ..x ]
         1   3

o2 : PolynomialRing

i3 : A1 = typeD(4, QQ)

o3 = {x  - x , x  + x , x  - x , x  + x , x  - x , x  + x , x  - x , x  + x , x  - x , x  + x , x  - x , x  + x }
       1    2   1    2   1    3   1    3   1    4   1    4   2    3   2    3   2    4   2    4   3    4   3    4

o3 : Hyperplane Arrangement 

i4 : ring A1

o4 = QQ[x ..x ]
         1   4

o4 : PolynomialRing

i5 : A3 = typeD(2, ZZ/2)

o5 = {x  + x , x  + x }
       1    2   1    2

o5 : Hyperplane Arrangement 

i6 : trim A3

o6 = {x  + x }
       1    2

o6 : Hyperplane Arrangement 

i7 : ring A3

     ZZ
o7 = --[x ..x ]
      2  1   2

o7 : PolynomialRing

i8 : A4 = typeD(3, ZZ[a,b,c,d])

o8 = {a - b, a + b, a - c, a + c, b - c, b + c}

o8 : Hyperplane Arrangement 

i9 : ring A4

o9 = ZZ[a..d]

o9 : PolynomialRing

i10 : A5 = typeD(2, ZZ[t][x,y,z])

o10 = {x - y, x + y}

o10 : Hyperplane Arrangement 

i11 : ring A5

o11 = ZZ[t][x..z]

o11 : PolynomialRing

i12 : A6 = typeD 3

o12 = {x  - x , x  + x , x  - x , x  + x , x  - x , x  + x }
        1    2   1    2   1    3   1    3   2    3   2    3

o12 : Hyperplane Arrangement 

i13 : ring A6

o13 = QQ[x ..x ]
          1   3

o13 : PolynomialRing

i14 : 
