-- -*- M2-comint -*- hash: -2055405770

i1 : A0 = typeB(3, ZZ)

o1 = {x , x  - x , x  + x , x  - x , x  + x , x , x  - x , x  + x , x }
       1   1    2   1    2   1    3   1    3   2   2    3   2    3   3

o1 : Hyperplane Arrangement 

i2 : ring A0

o2 = ZZ[x ..x ]
         1   3

o2 : PolynomialRing

i3 : A1 = typeB(4, QQ)

o3 = {x , x  - x , x  + x , x  - x , x  + x , x  - x , x  + x , x , x  - x , x  + x , x  - x , x  + x , x , x  - x , x  + x , x }
       1   1    2   1    2   1    3   1    3   1    4   1    4   2   2    3   2    3   2    4   2    4   3   3    4   3    4   4

o3 : Hyperplane Arrangement 

i4 : ring A1

o4 = QQ[x ..x ]
         1   4

o4 : PolynomialRing

i5 : A3 = typeB(2, ZZ/2)

o5 = {x , x  + x , x  + x , x }
       1   1    2   1    2   2

o5 : Hyperplane Arrangement 

i6 : trim A3

o6 = {x , x , x  + x }
       2   1   1    2

o6 : Hyperplane Arrangement 

i7 : ring A3

     ZZ
o7 = --[x ..x ]
      2  1   2

o7 : PolynomialRing

i8 : A4 = typeB(3, ZZ[a,b,c,d])

o8 = {a, a - b, a + b, a - c, a + c, b, b - c, b + c, c}

o8 : Hyperplane Arrangement 

i9 : ring A4

o9 = ZZ[a..d]

o9 : PolynomialRing

i10 : A5 = typeB(2, ZZ[t][x,y,z])

o10 = {x, x - y, x + y, y}

o10 : Hyperplane Arrangement 

i11 : ring A5

o11 = ZZ[t][x..z]

o11 : PolynomialRing

i12 : A6 = typeB 3

o12 = {x , x  - x , x  + x , x  - x , x  + x , x , x  - x , x  + x , x }
        1   1    2   1    2   1    3   1    3   2   2    3   2    3   3

o12 : Hyperplane Arrangement 

i13 : ring A6

o13 = QQ[x ..x ]
          1   3

o13 : PolynomialRing

i14 : A7 = typeB 1

o14 = {x }
        1

o14 : Hyperplane Arrangement 

i15 : ring A7

o15 = QQ[x ]
          1

o15 : PolynomialRing

i16 : 
