-- -*- M2-comint -*- hash: -1988134227

i1 : A0 = typeA(3, ZZ)

o1 = {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
       1    2   1    3   1    4   2    3   2    4   3    4

o1 : Hyperplane Arrangement 

i2 : ring A0

o2 = ZZ[x ..x ]
         1   4

o2 : PolynomialRing

i3 : A1 = typeA(4, QQ)

o3 = {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
       1    2   1    3   1    4   1    5   2    3   2    4   2    5   3    4   3    5   4    5

o3 : Hyperplane Arrangement 

i4 : ring A1

o4 = QQ[x ..x ]
         1   5

o4 : PolynomialRing

i5 : A3 = typeA(2, ZZ/2)

o5 = {x  + x , x  + x , x  + x }
       1    2   1    3   2    3

o5 : Hyperplane Arrangement 

i6 : ring A3

     ZZ
o6 = --[x ..x ]
      2  1   3

o6 : PolynomialRing

i7 : A4 = typeA(3, ZZ[a,b,c,d])

o7 = {a - b, a - c, a - d, b - c, b - d, c - d}

o7 : Hyperplane Arrangement 

i8 : ring A4

o8 = ZZ[a..d]

o8 : PolynomialRing

i9 : A5 = typeA(2, ZZ[t][x,y,z])

o9 = {x - y, x - z, y - z}

o9 : Hyperplane Arrangement 

i10 : ring A5

o10 = ZZ[t][x..z]

o10 : PolynomialRing

i11 : A6 = typeA 2

o11 = {x  - x , x  - x , x  - x }
        1    2   1    3   2    3

o11 : Hyperplane Arrangement 

i12 : ring A6

o12 = QQ[x ..x ]
          1   3

o12 : PolynomialRing

i13 : 
