-- -*- M2-comint -*- hash: 370292556

i1 : A = typeA 6;

i2 : F = flat(A, {0, 1, 6, 15, 20})

o2 = {0, 1, 6, 15, 20}

o2 : Flat of {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
               1    2   1    3   1    4   1    5   1    6   1    7   2    3   2    4   2    5   2    6   2    7   3    4   3    5   3    6   3    7   4    5   4    6   4    7   5    6   5    7   6    7

i3 : G = flat(A, {0, 1, 2, 6, 7, 11})

o3 = {0, 1, 2, 6, 7, 11}

o3 : Flat of {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
               1    2   1    3   1    4   1    5   1    6   1    7   2    3   2    4   2    5   2    6   2    7   3    4   3    5   3    6   3    7   4    5   4    6   4    7   5    6   5    7   6    7

i4 : H = flat(A, {0, 1, 2, 3, 6, 7, 8, 11, 12, 15})

o4 = {0, 1, 2, 3, 6, 7, 8, 11, 12, 15}

o4 : Flat of {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
               1    2   1    3   1    4   1    5   1    6   1    7   2    3   2    4   2    5   2    6   2    7   3    4   3    5   3    6   3    7   4    5   4    6   4    7   5    6   5    7   6    7

i5 : F | G

o5 = {0, 1, 2, 3, 6, 7, 8, 11, 12, 15, 20}

o5 : Flat of {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
               1    2   1    3   1    4   1    5   1    6   1    7   2    3   2    4   2    5   2    6   2    7   3    4   3    5   3    6   3    7   4    5   4    6   4    7   5    6   5    7   6    7

i6 : G | H

o6 = {0, 1, 2, 3, 6, 7, 8, 11, 12, 15}

o6 : Flat of {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
               1    2   1    3   1    4   1    5   1    6   1    7   2    3   2    4   2    5   2    6   2    7   3    4   3    5   3    6   3    7   4    5   4    6   4    7   5    6   5    7   6    7

i7 : F | H

o7 = {0, 1, 2, 3, 6, 7, 8, 11, 12, 15, 20}

o7 : Flat of {x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x , x  - x }
               1    2   1    3   1    4   1    5   1    6   1    7   2    3   2    4   2    5   2    6   2    7   3    4   3    5   3    6   3    7   4    5   4    6   4    7   5    6   5    7   6    7

i8 : assert(vee(F, G) === F | G)

i9 : assert(F | G === G | F)

i10 : assert((F | G) | H === F | (G | H))

i11 : assert(G | G === G)

i12 : assert(rank F + rank G >= rank(F ^ G) + rank(F | G))

i13 : assert(rank F + rank H >= rank(F ^ H) + rank(F | H))

i14 : assert(rank H + rank G >= rank(H ^ G) + rank(H | G))

i15 : 
