-- -*- M2-comint -*- hash: 781669370

i1 : ZZ/101[a..c];

i2 : L={monomialIdeal"ab,bc", monomialIdeal"ab,bc3"}

                                                       3
o2 = {monomialIdeal (a*b, b*c), monomialIdeal (a*b, b*c )}

o2 : List

i3 : (meanShape,meanBetti,stdevBetti,pure) = bettiStats (L,CountPure=>true);

i4 : pure

o4 = 1

i5 : 
