-- -*- M2-comint -*- hash: -691822839

i1 : R=ZZ/101[a,b,c];

i2 : ideals = {monomialIdeal"a3,b,c2", monomialIdeal"a3,b,ac"}

                      3      2                   3
o2 = {monomialIdeal (a , b, c ), monomialIdeal (a , b, a*c)}

o2 : List

i3 : CMStats(ideals)

     1
o3 = -
     2

o3 : QQ

i4 : 
