-- -*- M2-comint -*- hash: -1955615017

i1 : D1=4; L1={0.1,0.2,0.3,0.4};

i3 : D2=4; L2={1,2,2,1};

i5 : myModel1 = ER(ZZ/101[a..d],D1,L1)

o5 = Model{Generate => -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/RandomMonomialIdeals.m2:185:23-185:47]*-}
           Name => Erdos-Renyi
                           ZZ
           Parameters => (---[a..d], 4, {.1, .2, .3, .4})
                          101

o5 : Model

i6 : myModel2 = ER(ZZ/101[a..d],D2,L2)

o6 = Model{Generate => -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/RandomMonomialIdeals.m2:185:23-185:47]*-}
           Name => Erdos-Renyi
                           ZZ
           Parameters => (---[a..d], 4, {1, 2, 2, 1})
                          101

o6 : Model

i7 : 
