-- -*- M2-comint -*- hash: -2146120660

i1 : s=sample(ER(6,3,0.2),100);

i2 : myStats = statistics(s, dim@@ideal);

i3 : myStats.Histogram

o3 = Tally{1 => 20}
           2 => 61
           3 => 17
           4 => 2

o3 : Tally

i4 : 
