-- -*- M2-comint -*- hash: 1065881967

i1 : R=ZZ/101[a,b,c];

i2 :       ideals = {monomialIdeal"a3,b,c2", monomialIdeal"a3,b,ac"}

                      3      2                   3
o2 = {monomialIdeal (a , b, c ), monomialIdeal (a , b, a*c)}

o2 : List

i3 :       dimStats(ideals)

o3 = (.5, .5)

o3 : Sequence

i4 : mingenStats(ideals)

o4 = (3, 0, 3, 0)

o4 : Sequence

i5 : degStats(ideals)

o5 = (3.5, 2.5)

o5 : Sequence

i6 : pdimStats(ideals)

o6 = (3, 0)

o6 : Sequence

i7 : dimStats(ideals,ShowTally=>true)

o7 = (.5, .5, Tally{0 => 1})
                    1 => 1

o7 : Sequence

i8 : mingenStats(ideals,ShowTally=>true)

o8 = (3, 0, Tally{3 => 2}, 3, 0, Tally{3 => 2})

o8 : Sequence

i9 : degStats(ideals,ShowTally=>true)

o9 = (3.5, 2.5, Tally{1 => 1})
                      6 => 1

o9 : Sequence

i10 : regStats(ideals,ShowTally=>true)

o10 = (3.5, .5, Tally{3 => 1})
                      4 => 1

o10 : Sequence

i11 : pdimStats(ideals,ShowTally=>true)

o11 = (3, 0, Tally{3 => 2})

o11 : Sequence

i12 : 
