-- -*- M2-comint -*- hash: -1599854616

i1 : s=sample(ER(6,3,0.2),100);

i2 : myStats = statistics(s, degree@@ideal);

i3 : myStats.StdDev

o3 = 5.11346262331114

o3 : RR (of precision 53)

i4 : 
