-- -*- M2-comint -*- hash: -841889575

i1 : ZZ/101[a..e];

i2 : L={monomialIdeal"a2b,bc", monomialIdeal"ab,bc3",monomialIdeal"ab,ac,bd,be,ae,cd,ce,a3,b3,c3,d3,e3"}

                      2                                3                   3 
o2 = {monomialIdeal (a b, b*c), monomialIdeal (a*b, b*c ), monomialIdeal (a ,
     ------------------------------------------------------------------------
           3        3             3                  3
     a*b, b , a*c, c , b*d, c*d, d , a*e, b*e, c*e, e )}

o2 : List

i3 : bettiStats (L,SaveBettis=>"myBettiDiagrams")

             0       1       2       3       4       5         0       1
o3 = (total: 1       2       2 1.33333 1.33333 .333333, total: 1 5.33333
          0: 1       .       .       .       .       .      0: 1       .
          1: .       1 .333333 .333333 .333333       .      1: .       3
          2: . .666667 .666667 .333333 .333333       .      2: .       2
          3: . .333333 .666667 .333333 .333333       .      3: . .333333
          4: .       . .333333 .333333 .333333 .333333      4: .       .
     ------------------------------------------------------------------------
           2       3       4 5               1       2       3       4
     10.3333      10       5 1, total: 5.46008 13.4481 14.1421 7.07107
           .       .       . .      1: 2.82843 5.18545 2.82843 .471405
     3.66667       2 .333333 .      2: 2.16025 6.37704 6.12826 1.88562
           5 4.33333 1.33333 .      3: .471405 .471405 .942809 .471405
     .666667 .666667 .333333 .      4:       . 1.41421 4.24264 4.24264
           1       3       3 1
     ------------------------------------------------------------------------
           5
     1.41421)
           .
           .
           .
     1.41421

o3 : Sequence

i4 : 
