-- -*- M2-comint -*- hash: -237700608

i1 : n=2; D=3; p=0.2;

i4 : randomMonomialSet(n,D,p)

       2   2     3
o4 = {x , x x , x }
       1   1 2   2

o4 : List

i5 : randomMonomialSet(n,D,p,VariableName => y)

       2
o5 = {y y }
       1 2

o5 : List

i6 : 
