-- -*- M2-comint -*- hash: -2110217604

i1 : R=ZZ/101[a,b,c];

i2 : ideals = {monomialIdeal"a3", monomialIdeal"a3,b,ac"}

                     3                  3
o2 = {monomialIdeal a , monomialIdeal (a , b, a*c)}

o2 : List

i3 : borelFixedStats(ideals)

     1
o3 = -
     2

o3 : QQ

i4 : 
