-- -*- M2-comint -*- hash: 88505260

i1 : R=ZZ/101[a,b,c];

i2 : ideals = {monomialIdeal"a3,b,c2", monomialIdeal"a3,b,ac"}

                      3      2                   3
o2 = {monomialIdeal (a , b, c ), monomialIdeal (a , b, a*c)}

o2 : List

i3 : degStats(ideals)

o3 = (3.5, 2.5)

o3 : Sequence

i4 : ideals = idealsFromGeneratingSets(randomMonomialSets(4,3,1.0,3))

o4 = {monomialIdeal (x , x , x , x ), monomialIdeal (x , x , x , x ),
                      1   2   3   4                   1   2   3   4  
     ------------------------------------------------------------------------
     monomialIdeal (x , x , x , x )}
                     1   2   3   4

o4 : List

i5 : degStats(ideals)

o5 = (1, 0)

o5 : Sequence

i6 : ideals = randomMonomialIdeals(4,3,1.0,3)

o6 = {monomialIdeal (x , x , x , x ), monomialIdeal (x , x , x , x ),
                      1   2   3   4                   1   2   3   4  
     ------------------------------------------------------------------------
     monomialIdeal (x , x , x , x )}
                     1   2   3   4

o6 : List

i7 : degStats(ideals)

o7 = (1, 0)

o7 : Sequence

i8 : 
