-- -*- M2-comint -*- hash: -652400168

i1 : n=3;D=3;p=0.0;N=3;

i5 : ideals = randomMonomialIdeals(n,D,p,N)

o5 = {monomialIdeal (), monomialIdeal (), monomialIdeal ()}

o5 : List

i6 : regStats(ideals)

o6 = (-infinity, 0)

o6 : Sequence

i7 : CMStats(ideals)

o7 = 1

o7 : QQ

i8 : regStats(ideals, Verbose => true)
All ideals in this list are the zero ideal.

o8 = (-infinity, 0)

o8 : Sequence

i9 : CMStats(ideals, Verbose => true)
There are 3 ideals in this sample. Of those, 3 are the zero ideal.
The zero ideals are included in the reported count of Cohen-Macaulay quotient rings.
3 out of 3 ideals in the given sample are Cohen-Macaulay.

o9 = 1

o9 : QQ

i10 : n=3;D=3;p=0.1;N=3;

i14 : ideals = randomMonomialIdeals(n,D,p,N)

                           3                                             
o14 = {monomialIdeal (x , x , x ), monomialIdeal (), monomialIdeal (x x ,
                       1   2   3                                     2 3 
      -----------------------------------------------------------------------
       2
      x )}
       3

o14 : List

i15 : regStats(ideals, Verbose => true)
There are 3 ideals in this sample. Of those, 1 are the zero ideal.
The zero ideals were extracted from the sample before reporting the regularity statistics.

o15 = (2.5, .5)

o15 : Sequence

i16 : CMStats(ideals, Verbose => true)
There are 3 ideals in this sample. Of those, 1 are the zero ideal.
The zero ideals are included in the reported count of Cohen-Macaulay quotient rings.
2 out of 3 ideals in the given sample are Cohen-Macaulay.

      2
o16 = -
      3

o16 : QQ

i17 : degStats(ideals, Verbose => true)
There are 3 ideals in this sample. Of those, 1 are the zero ideal.
The degree statistics do include those for the zero ideals.

o17 = (1.66667, .942809)

o17 : Sequence

i18 : dimStats(ideals, Verbose=>true)
There are 3 ideals in this sample. Of those, 1 are the zero ideal.
The Krull dimension statistics do include those for the zero ideals.

o18 = (1.66667, 1.24722)

o18 : Sequence

i19 : borelFixedStats(ideals, Verbose => true)
There are 3 ideals in this sample. Of those, 1 are the zero ideal.
The zero ideals are included in the reported count of Borel-fixed monomial ideals.
1 out of 3 monomial ideals in the given sample are Borel-fixed.

      1
o19 = -
      3

o19 : QQ

i20 : mingenStats(ideals, Verbose=>true)
There are 3 ideals in this sample. Of those, 1 are the zero ideal.
The statistics returned (mean and standard deviation of # of min gens and mean and standard deviation of degree complexity) do NOT include those for the zero ideals.

o20 = (2.5, .5, 2.5, .5)

o20 : Sequence

i21 : bettiStats(ideals, Verbose => true)
There are 3 ideals in this sample. Of those, 1 are the zero ideal.
The Betti statistics do include those for the zero ideals.

              0       1       2       3         0       1       2       3 
o21 = (total: 1       1       1 .333333, total: 1 1.66667 1.33333 .333333,
           0: 1 .333333 .333333       .      0: 1 .666667 .333333       . 
           1: . .333333 .333333       .      1: . .666667 .333333       . 
           2: . .333333 .333333 .333333      2: . .333333 .666667 .333333 
      -----------------------------------------------------------------------
                   1       2       3
      total: 2.35702 1.88562 .471405)
          0: .942809 .471405       .
          1: .942809 .471405       .
          2: .471405 .942809 .471405

o21 : Sequence

i22 : M = randomMonomialSets(n,D,p,N);

i23 : idealsFromGeneratingSets(M, Verbose => true)
There are 3 ideals in this sample. Of those, 1 are the zero ideal.

                             2
o23 = {monomialIdeal (x x , x ), monomialIdeal (), monomialIdeal(x x )}
                       1 2   3                                    2 3

o23 : List

i24 : 
