-- -*- M2-comint -*- hash: -1049709922

i1 : R=ZZ/101[a,b,c];

i2 : ideals = {monomialIdeal"a3,b,c2", monomialIdeal"a3,b,ac"}

                      3      2                   3
o2 = {monomialIdeal (a , b, c ), monomialIdeal (a , b, a*c)}

o2 : List

i3 : dimStats(ideals)

o3 = (.5, .5)

o3 : Sequence

i4 : ideals = idealsFromGeneratingSets(randomMonomialSets(4,3,1.0,3))

o4 = {monomialIdeal (x , x , x , x ), monomialIdeal (x , x , x , x ),
                      1   2   3   4                   1   2   3   4  
     ------------------------------------------------------------------------
     monomialIdeal (x , x , x , x )}
                     1   2   3   4

o4 : List

i5 : dimStats(ideals)

o5 = (0, 0)

o5 : Sequence

i6 : ideals = randomMonomialIdeals(4,3,1.0,3)

o6 = {monomialIdeal (x , x , x , x ), monomialIdeal (x , x , x , x ),
                      1   2   3   4                   1   2   3   4  
     ------------------------------------------------------------------------
     monomialIdeal (x , x , x , x )}
                     1   2   3   4

o6 : List

i7 : dimStats(ideals)

o7 = (0, 0)

o7 : Sequence

i8 : ideals = idealsFromGeneratingSets(randomMonomialSets(3,7,0.01,10))

                     4 2                     5   2 4                    
o8 = {monomialIdeal(x x x ), monomialIdeal (x , x x ), monomialIdeal (),
                     1 2 3                   1   1 2                    
     ------------------------------------------------------------------------
                                       5         4                  2 3  
     monomialIdeal (), monomialIdeal (x x x , x x ), monomialIdeal(x x ),
                                       1 2 3   1 3                  2 3  
     ------------------------------------------------------------------------
                    2                      2 3                    
     monomialIdeal(x x ), monomialIdeal(x x x ), monomialIdeal (),
                    1 3                  1 2 3                    
     ------------------------------------------------------------------------
                    4 3
     monomialIdeal(x x )}
                    2 3

o8 : List

i9 : dimStats(ideals)

o9 = (2.3, .458258)

o9 : Sequence

i10 : ideals = randomMonomialIdeals(5,7,0.05,8)

                       2     2 3   5     2           3           2     3 
o10 = {monomialIdeal (x x , x x , x x , x x x , x x x x , x x x x , x x ,
                       2 3   1 3   1 4   1 3 4   1 2 3 4   1 2 3 4   3 4 
      -----------------------------------------------------------------------
       2 5   4       4                   4       4       4 2     3 2     4 2 
      x x , x x x , x x x , x x x x , x x x , x x x x , x x x , x x x , x x ,
       1 4   1 2 5   1 3 5   1 2 3 5   1 3 5   2 3 4 5   1 4 5   3 4 5   2 5 
      -----------------------------------------------------------------------
       2 2 2     2 2   2 2   2   2 2 2     4 2     3   2   3   3   3       4 
      x x x , x x x , x x x x , x x x , x x x , x x , x x x , x x x , x x x ,
       1 3 5   2 3 5   1 2 4 5   1 4 5   2 4 5   2 5   1 3 5   3 4 5   3 4 5 
      -----------------------------------------------------------------------
       2 4                   3     2 3   7       2   3   4     6             
      x x ), monomialIdeal (x x , x x , x , x x x , x , x x , x x , x x x x ,
       4 5                   1 2   1 2   2   1 2 3   3   1 4   2 4   1 2 3 4 
      -----------------------------------------------------------------------
       2   2   2 2 2     3           2 2   2   2   4   2 4       5   2 5 
      x x x , x x x , x x , x x x , x x x x , x x x , x x , x x x , x x ,
       1 2 4   2 3 4   1 4   2 4 5   1 3 4 5   1 3 5   4 5   1 2 5   2 5 
      -----------------------------------------------------------------------
       2 5                   4   6   3         2   2 4     2 2 2   2 3 
      x x ), monomialIdeal (x , x , x x , x x x , x x x , x x x , x x ,
       3 5                   1   2   1 3   1 2 3   1 3 4   1 3 4   2 4 
      -----------------------------------------------------------------------
       2     3   3 2     2       4         4       3   2     3 3       3   
      x x x x , x x x , x x x , x x x , x x x x , x x x x , x x x , x x x ,
       1 2 3 4   1 2 5   2 3 5   2 4 5   1 3 4 5   1 2 4 5   1 4 5   3 4 5 
      -----------------------------------------------------------------------
         4     4 2   3   2         2   3 2 2       3     3     2 3   2 4 
      x x x , x x , x x x , x x x x , x x x , x x x , x x , x x x , x x ,
       2 4 5   3 5   1 4 5   2 3 4 5   3 4 5   1 2 5   3 5   1 4 5   1 5 
      -----------------------------------------------------------------------
         6                   6   3 3   2     2 2       5     5 2   2   4 
      x x ), monomialIdeal (x , x x , x x , x x x , x x x , x x , x x x ,
       2 5                   1   2 3   2 4   1 3 4   1 3 4   3 4   1 2 4 
      -----------------------------------------------------------------------
         5     2     4     2     2   2           2       5     2  
      x x , x x x , x x , x x , x x x x , x x x x x , x x x , x ),
       3 4   1 2 5   2 5   3 5   1 3 4 5   1 2 3 4 5   2 4 5   5  
      -----------------------------------------------------------------------
                          3 4   4 2     3 3     3   2   4 2   2 3     2 3 
      monomialIdeal (x , x x , x x x , x x x , x x x , x x , x x , x x x ,
                      2   1 3   1 3 4   1 3 4   1 3 4   3 4   1 4   1 3 4 
      -----------------------------------------------------------------------
             4     2                   4       5             2   3     6   
      x x , x x , x ), monomialIdeal (x x , x x , x x x , x x , x x , x x ,
       3 5   4 5   5                   1 2   1 2   1 2 3   1 3   2 4   3 4 
      -----------------------------------------------------------------------
       2 2       3     4     6   3     5       2       2 2 2       2   2 2 
      x x , x x x , x x , x x , x x , x x x , x x x , x x x , x x x , x x ,
       1 4   1 2 4   1 4   2 4   1 5   2 3 5   3 4 5   1 2 5   1 4 5   4 5 
      -----------------------------------------------------------------------
       2 4                         4 2   2 3     2 2     2 2   3 2   5 
      x x ), monomialIdeal (x x , x x , x x , x x x , x x x , x x , x ,
       2 5                   1 3   2 3   2 3   1 2 4   2 3 4   3 4   4 
      -----------------------------------------------------------------------
       3         2     2 4     4   2   2 2 2     3                     
      x x x , x x x , x x x , x x x , x x x , x x ), monomialIdeal (x ,
       1 2 5   1 2 5   3 4 5   3 4 5   1 4 5   4 5                   2 
      -----------------------------------------------------------------------
       2         2       3   7     4 2   4 3     4
      x x x , x x x , x x , x , x x x , x x , x x )}
       1 3 4   1 3 4   3 4   4   1 3 5   4 5   4 5

o10 : List

i11 : dimStats(ideals)

o11 = (1.75, .433013)

o11 : Sequence

i12 : ideals = idealsFromGeneratingSets(randomMonomialSets(5,7,1,10))

                        3 2                      2 4                    5    
o12 = {monomialIdeal(x x x x ), monomialIdeal(x x x ), monomialIdeal(x x x ),
                      1 2 3 4                  3 4 5                  2 3 5  
      -----------------------------------------------------------------------
                       2 3                  2       2  
      monomialIdeal(x x x ), monomialIdeal(x x x x x ),
                     1 3 4                  1 2 3 4 5  
      -----------------------------------------------------------------------
                     2 2 3                  2 4                  3 4  
      monomialIdeal(x x x ), monomialIdeal(x x ), monomialIdeal(x x ),
                     1 3 4                  1 2                  3 4  
      -----------------------------------------------------------------------
                     6                 2   3
      monomialIdeal x , monomialIdeal(x x x )}
                     1                 1 2 5

o12 : List

i13 : dimStats(ideals)

o13 = (4, 0)

o13 : Sequence

i14 : 
