-- -*- M2-comint -*- hash: 164717299

i1 : R=ZZ/101[a,b,c];

i2 : ideals = {monomialIdeal(a^3,b,c^2), monomialIdeal(a^3,b,a*c)}

                      3      2                   3
o2 = {monomialIdeal (a , b, c ), monomialIdeal (a , b, a*c)}

o2 : List

i3 : pdimStats(ideals)

o3 = (3, 0)

o3 : Sequence

i4 : R=ZZ/101[a,b,c];

i5 : ideals = {monomialIdeal(a,c),monomialIdeal(b),monomialIdeal(a^2*b,b^2)}

                                                             2    2
o5 = {monomialIdeal (a, c), monomialIdeal b, monomialIdeal (a b, b )}

o5 : List

i6 : pdimStats(ideals, ShowTally=>true)

o6 = (1.66667, .471405, Tally{1 => 1})
                              2 => 2

o6 : Sequence

i7 : ideals = randomMonomialIdeals(4,3,1.0,3)

o7 = {monomialIdeal (x , x , x , x ), monomialIdeal (x , x , x , x ),
                      1   2   3   4                   1   2   3   4  
     ------------------------------------------------------------------------
     monomialIdeal (x , x , x , x )}
                     1   2   3   4

o7 : List

i8 : pdimStats(ideals)

o8 = (4, 0)

o8 : Sequence

i9 : ideals = randomMonomialIdeals(4,6,0.01,10)

                     2 3                       2     3                    
o9 = {monomialIdeal(x x x ), monomialIdeal (x x x , x x x ), monomialIdeal
                     2 3 4                   1 2 4   1 3 4                
     ------------------------------------------------------------------------
                         5       3   2                    2 2  
     (), monomialIdeal (x x , x x , x x ), monomialIdeal(x x ),
                         2 3   2 3   1 4                  2 3  
     ------------------------------------------------------------------------
                    2 2                   5       4       2   2  
     monomialIdeal(x x ), monomialIdeal (x x , x x x , x x x x ),
                    1 4                   1 3   2 3 4   1 2 3 4  
     ------------------------------------------------------------------------
                      2                   3       2 2     2  
     monomialIdeal(x x ), monomialIdeal (x x x , x x x , x ),
                    2 3                   1 3 4   1 3 4   4  
     ------------------------------------------------------------------------
                      3
     monomialIdeal(x x x )}
                    2 3 4

o9 : List

i10 : pdimStats(ideals)

o10 = (1.6, 1.0198)

o10 : Sequence

i11 : 
