-- -*- M2-comint -*- hash: -504030193

i1 : n=2; D=3; p=0.2;

i4 : randomMonomialSet(n,D,p)

       2   2     3
o4 = {x , x x , x }
       1   1 2   2

o4 : List

i5 : randomMonomialSet(3,2,0.6)

               2   2
o5 = {x , x , x , x }
       2   3   2   3

o5 : List

i6 : randomMonomialSet(3,2,1.0)

                   2               2         2
o6 = {x , x , x , x , x x , x x , x , x x , x }
       1   2   3   1   1 2   1 3   2   2 3   3

o6 : List

i7 : n=10; D=5; M=4;

i10 : randomMonomialSet(n,D,M)

                3          3
o10 = {x x x , x x x  , x x x  , x x x  }
        1 3 8   3 4 10   3 8 10   1 8 10

o10 : List

i11 : randomMonomialSet(2,2,10)

            2             2
o11 = {x , x , x x , x , x }
        1   1   1 2   2   2

o11 : List

i12 : randomMonomialSet(2,3,{0.0, 1.0, 1.0})

        2         2   3   2       2   3
o12 = {x , x x , x , x , x x , x x , x }
        1   1 2   2   1   1 2   1 2   2

o12 : List

i13 : randomMonomialSet(2,3,{2,1,1})

                2   3
o13 = {x , x , x , x }
        1   2   2   1

o13 : List

i14 : randomMonomialSet(3,3,{1,1,1}, Strategy=>"Minimal")

            2   2
o14 = {x , x , x x }
        3   2   1 2

o14 : List

i15 : D=3;p=.5; R=ZZ/101[a,b,c];

i18 : randomMonomialSet(R,D,p)

                 2        2        2   3   2    2             2   2      2 
o18 = {a, b, c, a , a*c, b , b*c, c , a , a b, a c, a*b*c, a*c , b c, b*c ,
      -----------------------------------------------------------------------
       3
      c }

o18 : List

i19 : ring oo_0

o19 = R

o19 : PolynomialRing

i20 : 
