-- -*- M2-comint -*- hash: -155309130

i1 : n=2; D=3; p=0.2; N=10;

i5 : randomMonomialIdeals(n,D,p,N)

                      2   3                                    2 
o5 = {monomialIdeal (x , x ), monomialIdeal x , monomialIdeal x ,
                      1   2                  2                 2 
     ------------------------------------------------------------------------
                     3   2       2   3                                       
     monomialIdeal (x , x x , x x , x ), monomialIdeal x , monomialIdeal (x ,
                     1   1 2   1 2   2                  1                  1 
     ------------------------------------------------------------------------
      2                  2                                    2     2  
     x ), monomialIdeal x , monomialIdeal x , monomialIdeal (x x , x ),
      2                  1                 2                  1 2   2  
     ------------------------------------------------------------------------
                     2
     monomialIdeal (x , x )}
                     1   2

o5 : List

i6 : randomMonomialIdeals(5,3,0.4,4)

                                      2       2                       2 
o6 = {monomialIdeal (x x , x , x x , x x , x x , x ), monomialIdeal (x ,
                      1 2   3   1 4   2 4   2 4   5                   1 
     ------------------------------------------------------------------------
            2   2   2                                       3               
     x x , x , x , x , x x , x x x , x x ), monomialIdeal (x , x , x , x x ,
      1 2   2   3   4   1 5   2 3 5   4 5                   1   2   3   1 4 
     ------------------------------------------------------------------------
      2   2             2   3                   3   2     2   2       2   3 
     x , x x , x x , x x , x ), monomialIdeal (x , x x , x , x x , x x , x ,
      4   1 5   4 5   1 5   5                   1   1 2   2   1 3   2 3   3 
     ------------------------------------------------------------------------
                            2     2       2     2
     x x , x x x , x x x , x x , x x , x x , x x )}
      1 4   2 3 4   1 2 5   3 5   4 5   1 5   4 5

o6 : List

i7 : randomMonomialIdeals(3,2,1.0,1)

o7 = {monomialIdeal (x , x , x )}
                      1   2   3

o7 : List

i8 : n=8; D=4; M=7; N=3;

i12 : randomMonomialIdeals(n,D,M,N)

                         2           2       2         2             2      
o12 = {monomialIdeal (x x x , x x , x x x , x x x , x x x , x x x , x x x ),
                       1 4 5   4 6   2 5 6   1 2 7   1 3 7   1 5 7   2 3 8  
      -----------------------------------------------------------------------
                        3             2                             2   
      monomialIdeal (x x , x x x x , x x x , x x x x , x x x x , x x x ,
                      2 3   1 3 4 6   2 5 6   1 3 5 6   2 3 5 7   2 7 8 
      -----------------------------------------------------------------------
           2                     2       2       3     2         3
      x x x ), monomialIdeal (x x , x , x x x , x x , x x x , x x )}
       3 5 8                   2 4   7   1 3 8   3 8   1 5 8   1 8

o12 : List

i13 : randomMonomialIdeals(2,3,{0.0, 1.0, 1.0},1)

                       2         2
o13 = {monomialIdeal (x , x x , x )}
                       1   1 2   2

o13 : List

i14 : randomMonomialIdeals(3,3,{1,1,1},1)

                       3
o14 = {monomialIdeal (x , x )}
                       1   2

o14 : List

i15 : randomMonomialIdeals(3,3,{1,1,1},1, Strategy=>"Minimal")

                       2     2
o15 = {monomialIdeal (x , x x , x )}
                       1   1 2   3

o15 : List

i16 : 
