-- -*- M2-comint -*- hash: 1486047831

i1 : R=ZZ/101[a,b,c];

i2 : ideals = {monomialIdeal(a^3,b,c^2), monomialIdeal(a^3,b,a*c)}

                      3      2                   3
o2 = {monomialIdeal (a , b, c ), monomialIdeal (a , b, a*c)}

o2 : List

i3 : regStats(ideals)

o3 = (3.5, .5)

o3 : Sequence

i4 : B=randomMonomialIdeals(3,3,0.0,1)

o4 = {monomialIdeal ()}

o4 : List

i5 : regStats(B)

o5 = (-infinity, 0)

o5 : Sequence

i6 : 
