-- -*- M2-comint -*- hash: -262846567

i1 : s=sample(ER(3,2,0.2),4)

o1 = Sample{...4...}

o1 : Sample

i2 : getData s

            2   2     2           2         2               2
o2 = {{x , x , x }, {x }, {x x , x , x x , x }, {x , x x , x }}
        3   2   3     2     1 3   2   2 3   3     1   1 2   2

o2 : List

i3 : peek s

o3 = Sample{ModelName => Erdos-Renyi                                          }
            Parameters => (3, 2, .2)
            SampleSize => 4
                           2   2     2           2         2               2
            Data => {{x , x , x }, {x }, {x x , x , x x , x }, {x , x x , x }}
                       3   2   3     2     1 3   2   2 3   3     1   1 2   2

i4 : statistics(s,degree@@ideal)

o4 = HashTable{Histogram => Tally{2 => 4}}
               Mean => 2
               StdDev => 0

o4 : HashTable

i5 : 
