-- -*- M2-comint -*- hash: -634996613

i1 : s=sample(ER(6,3,0.2),15);

i2 : statistics(s, degree@@ideal)

o2 = HashTable{Histogram => Tally{1 => 4 }}
                                  2 => 3
                                  3 => 2
                                  4 => 3
                                  5 => 1
                                  10 => 1
                                  15 => 1
                       58
               Mean => --
                       15
               StdDev => 3.72141

o2 : HashTable

i3 : s=sample(ER(2,2,0.8),10)

o3 = Sample{...4...}

o3 : Sample

i4 : statistics(s,betti@@gens@@ideal)

                                         0 1
o4 = HashTable{Histogram => Tally{total: 1 3 => 1}}
                                      0: 1 2
                                      1: . 1
                                         0 1
                                  total: 1 3 => 3
                                      0: 1 1
                                      1: . 2
                                         0 1
                                  total: 1 4 => 2
                                      0: 1 1
                                      1: . 3
                                         0 1
                                  total: 1 5 => 4
                                      0: 1 2
                                      1: . 3
                              0   1
               Mean => total: 1   4
                           0: 1 1.5
                           1: . 2.5
                                      1
               StdDev => total: 1.17082
                             0:      .5
                             1:  .67082

o4 : HashTable

i5 : statistics(s,mingens@@ideal)
Warning: the statistics method is returning only the Tally of the outputs of 
		your function applied to the sample data. If you want more information, such as mean and 
		standard deviation, then ensure you use a function with numerical (ZZ) or BettiTally output.

o5 = Tally{| x_1 x_2^2 | => 3}
           | x_2 | => 1
           | x_2 x_1 | => 5
           | x_2 x_1^2 | => 1

o5 : Tally

i6 : 
