-- -*- M2-comint -*- hash: -1620518821

i1 : writeSample(sample(ER(2,3,0.1),5), "testDirectory")

i2 : mySample = sample("testDirectory")

o2 = Sample{...4...}

o2 : Sample

i3 : peek mySample

o3 = Sample{ModelName => Erdos-Renyi                            }
            Parameters => (2, 3, .1)
            SampleSize => 5
                       2   2            2       2          2
            Data => {{x , x x }, {0}, {x x , x x }, {0}, {x x }}
                       1   1 2          1 2   1 2          1 2

i4 : 
