-- -*- M2-comint -*- hash: -486846085

i1 : R = ZZ/2[x, y, MonomialOrder => GRevLex]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x*y + x + 1)

o2 = ideal(x*y + x + 1)

o2 : Ideal of R

i3 : P = biBasis(I, toGroebner => true)

o3 = ideal (x + 1, y)

o3 : Ideal of R

i4 : 
