-- -*- M2-comint -*- hash: -152918211

i1 : R = ZZ/5[x,y,z];

i2 : I = ideal(random(3,R)-2, random(2,R));

o2 : Ideal of R

i3 : M = jacobian(I);

             3       2
o3 : Matrix R  <--- R

i4 : findANonZeroMinor(2,M,I)

o4 = ({-2, 0, 2}, {0, 1}, {0, 1}, {1} | -2z -x2-2y2+2xz+2z2 |)
                                  {1} | 2z  xy-y2-2yz-2z2   |

o4 : Sequence

i5 : 
