-- -*- M2-comint -*- hash: 1847548827

i1 : R=ZZ/5[x,y,z,w];

i2 : I = ideal(x,y^2,w^3+x^2);

o2 : Ideal of R

i3 : genericProjection(2,I)

              ZZ                                                 4    3   
o3 = (map (R, --[z, w], {- 2x + 2z - 2w, - x - 2y - 2z}), ideal(z  - z w +
               5
     ------------------------------------------------------------------------
      2 2      3    4
     z w  - z*w  + w ))

o3 : Sequence

i4 : R=ZZ/5[x,y,z,w];

i5 : I = ideal(x,y^2);

o5 : Ideal of R

i6 : genericProjection(I)

              ZZ                                                           
o6 = (map (R, --[y..z, w], {- 2x + 2z + w, - 2x + 2z - 2w, - 2x + y + 2z}),
               5
     ------------------------------------------------------------------------
            2          2                 2
     ideal(y  + y*z - z  + 2y*w + z*w + w ))

o6 : Sequence

i7 : R = ZZ/13[x,y,z];

i8 : I = ideal(y^2*z-x*(x-z)*(x+z));

o8 : Ideal of R

i9 : genericProjection(R/I)

                   R          ZZ                                      
o9 = (map (-----------------, --[y..z], {3x + 5y + 6z, 3x + 5y - 6z}),
              3    2       2  13                                      
           - x  + y z + x*z
     ------------------------------------------------------------------------
     ZZ
     --[y..z])
     13

o9 : Sequence

i10 : 
