-- -*- M2-comint -*- hash: 765765233

i1 : R = ZZ/5[t_1..t_3];

i2 : I = ideal(t_1,t_2+t_3);

o2 : Ideal of R

i3 : randomPoints(3, I)

o3 = {{0, -1, 1}, {0, -1, 1}, {0, -1, 1}}

o3 : List

i4 : randomPoints(4, I, Strategy => Default)

o4 = {{0, -1, 1}, {0, -1, 1}, {0, -1, 1}, {0, -1, 1}}

o4 : List

i5 : randomPoints(4, I, Strategy => LinearIntersection)

o5 = {{0, -1, 1}, {0, -1, 1}, {0, -1, 1}, {0, -1, 1}}

o5 : List

i6 : S=ZZ/103[y_0..y_30];

i7 : I=minors(2,random(S^3,S^{3:-1}));

o7 : Ideal of S

i8 : elapsedTime randomPoints(I, Strategy=>LinearIntersection, DecompositionStrategy=>MultiplicationTable)
 -- 6.21686 seconds elapsed

o8 = {{-4, -35, -7, 0, 0, 1, 5, -13, 0, -47, 0, 41, 0, -51, -46, 35, 0, 0,
     ------------------------------------------------------------------------
     -47, 14, -30, 42, 30, 4, -41, 24, 0, 0, 15, 20, 1}}

o8 : List

i9 : elapsedTime randomPoints(I, Strategy=>LinearIntersection, DecompositionStrategy=>Decompose)
 -- 3.7961 seconds elapsed

o9 = {{11, 9, -9, -15, -7, 27, 19, -36, 48, 26, -4, 3, 29, -8, 7, -32, 16,
     ------------------------------------------------------------------------
     11, 7, 7, 25, -14, -39, 17, -16, 4, -50, -12, 21, -50, 51}}

o9 : List

i10 : 
