-- -*- M2-comint -*- hash: -618404289

i1 : G13 = flagBundle({2,2})

o1 = G13

o1 : a flag bundle with subquotient ranks {2:2}

i2 : T = tangentBundle(G13)

o2 = T

o2 : an abstract sheaf of rank 4 on G13

i3 : chern T

                   2                    2
o3 = 1 + 4H    + 7H    + 12H   H    + 6H
           2,1     2,1      2,1 2,2     2,2

                                   QQ[][H   ..H   ]
                                         1,1   2,2
o3 : ---------------------------------------------------------------------------
     (- H    - H   , - H    - H   H    - H   , - H   H    - H   H   , -H   H   )
         1,1    2,1     1,2    1,1 2,1    2,2     1,2 2,1    1,1 2,2    1,2 2,2

i4 : P5 = flagBundle({1,5})

o4 = P5

o4 : a flag bundle with subquotient ranks {1, 5}

i5 : TP5 = tangentBundle(P5)

o5 = TP5

o5 : an abstract sheaf of rank 5 on P5

i6 : O1 = dual(P5.Bundles#0)

o6 = O1

o6 : an abstract sheaf of rank 1 on P5

i7 : O2 = O1^**2

o7 = O2

o7 : an abstract sheaf of rank 1 on P5

i8 : TG = chern(TP5 - O2) -- total Chern class of TG in terms of the hyperplane section

o8 = 1 + 4H    + 7H    + 6H    + 3H
           2,1     2,2     2,3     2,4

                                             QQ[][H   , H   ..H   ]
                                                   1,1   2,1   2,5
o8 : ------------------------------------------------------------------------------------------------------
     (- H    - H   , - H   H    - H   , - H   H    - H   , - H   H    - H   , - H   H    - H   , -H   H   )
         1,1    2,1     1,1 2,1    2,2     1,1 2,2    2,3     1,1 2,3    2,4     1,1 2,4    2,5    1,1 2,5

i9 : sigma_1 = chern(1,G13.Bundles#1)

o9 = H
      2,1

                                   QQ[][H   ..H   ]
                                         1,1   2,2
o9 : ---------------------------------------------------------------------------
     (- H    - H   , - H    - H   H    - H   , - H   H    - H   H   , -H   H   )
         1,1    2,1     1,2    1,1 2,1    2,2     1,2 2,1    1,1 2,2    1,2 2,2

i10 : 1 + sum(1..4, i -> coefficient(chern(i,P5.Bundles#1),TG) * ((sigma_1)^i))

                    2                    2
o10 = 1 + 4H    + 7H    + 12H   H    + 6H
            2,1     2,1      2,1 2,2     2,2

                                    QQ[][H   ..H   ]
                                          1,1   2,2
o10 : ---------------------------------------------------------------------------
      (- H    - H   , - H    - H   H    - H   , - H   H    - H   H   , -H   H   )
          1,1    2,1     1,2    1,1 2,1    2,2     1,2 2,1    1,1 2,2    1,2 2,2

i11 : 
