-- -*- M2-comint -*- hash: 1861926457

i1 : P3 = flagBundle({1,3})

o1 = P3

o1 : a flag bundle with subquotient ranks {1, 3}

i2 : (S,Q) = P3.Bundles

o2 = (S, Q)

o2 : Sequence

i3 : O1 = dual(S)

o3 = O1

o3 : an abstract sheaf of rank 1 on P3

i4 : chern O1

o4 = 1 + H
          2,1

                          QQ[][H   , H   ..H   ]
                                1,1   2,1   2,3
o4 : ----------------------------------------------------------------
     (- H    - H   , - H   H    - H   , - H   H    - H   , -H   H   )
         1,1    2,1     1,1 2,1    2,2     1,1 2,2    2,3    1,1 2,3

i5 : P3' = abstractProjectiveSpace 3

o5 = P3'

o5 : a flag bundle with subquotient ranks {1, 3}

i6 : (S',Q') = P3'.Bundles

o6 = (S', Q')

o6 : Sequence

i7 : chern S'

o7 = 1 - H
          2,1

                       QQ[][h, H   ..H   ]
                                2,1   2,3
o7 : -------------------------------------------------------
     (- h - H   , - h*H    - H   , - h*H    - H   , -h*H   )
             2,1       2,1    2,2       2,2    2,3      2,3

i8 : chern Q' -- Q' is O(1) on P3'

o8 = 1 + H    + H    + H
          2,1    2,2    2,3

                       QQ[][h, H   ..H   ]
                                2,1   2,3
o8 : -------------------------------------------------------
     (- h - H   , - h*H    - H   , - h*H    - H   , -h*H   )
             2,1       2,1    2,2       2,2    2,3      2,3

i9 : T = tangentBundle(P3)

o9 = T

o9 : an abstract sheaf of rank 3 on P3

i10 : chern T

o10 = 1 + 4H    + 6H    + 4H
            2,1     2,2     2,3

                           QQ[][H   , H   ..H   ]
                                 1,1   2,1   2,3
o10 : ----------------------------------------------------------------
      (- H    - H   , - H   H    - H   , - H   H    - H   , -H   H   )
          1,1    2,1     1,1 2,1    2,2     1,1 2,2    2,3    1,1 2,3

i11 : TP3 = (4 * O1) - 1

o11 = T

o11 : an abstract sheaf of rank 3 on P3

i12 : chern T == chern TP3

o12 = true

i13 : rank T == rank TP3

o13 = true

i14 : 
