-- -*- M2-comint -*- hash: -458826296

i1 : R=makeProductRing({6})

o1 = R

o1 : PolynomialRing

i2 : x=gens(R)

o2 = {a, b, c, d, e, f, g}

o2 : List

i3 : J=ideal(x_0*x_2-x_4*x_5)

o3 = ideal(a*c - e*f)

o3 : Ideal of R

i4 : clX=chowClass(J,Strategy=>"prob")

o4 = 2H
       1

     ZZ[H ]
         1
o4 : ------
        7
       H
        1

i5 : clX2=chowClass(J,ring(clX))

o5 = 2H
       1

     ZZ[H ]
         1
o5 : ------
        7
       H
        1

i6 : clX==clX2

o6 = true

i7 : 
