-- -*- M2-comint -*- hash: 894028948

i1 : R = makeProductRing({3,4})

o1 = R

o1 : PolynomialRing

i2 : R = makeChowRing(R)

o2 = R

o2 : QuotientRing

i3 : describe R

     ZZ[H ..H ]
         1   2
o3 = ----------
        4   5
      (H , H )
        1   2

i4 : 
