-- -*- M2-comint -*- hash: 769047887

i1 : R = makeProductRing({3,3})

o1 = R

o1 : PolynomialRing

i2 : x = gens(R)

o2 = {a, b, c, d, e, f, g, h}

o2 : List

i3 : D = minors(2,matrix{{x_0..x_3},{x_4..x_7}})

o3 = ideal (- b*e + a*f, - c*e + a*g, - c*f + b*g, - d*e + a*h, - d*f + b*h,
     ------------------------------------------------------------------------
     - d*g + c*h)

o3 : Ideal of R

i4 : X = ideal(x_0*x_1,x_1*x_2,x_0*x_2)

o4 = ideal (a*b, b*c, a*c)

o4 : Ideal of R

i5 : segre(X,D)

          3 3     3 2     2 3
o5 = - 10H H  + 3H H  + 3H H
          1 2     1 2     1 2

     ZZ[H ..H ]
         1   2
o5 : ----------
        4   4
      (H , H )
        1   2

i6 : A = makeChowRing(R)

o6 = A

o6 : QuotientRing

i7 : s = segre(X,D,A)

          3 3     3 2     2 3
o7 = - 10H H  + 3H H  + 3H H
          1 2     1 2     1 2

o7 : A

i8 : 
