-- -*- M2-comint -*- hash: -1294491812

i1 : R = QQ[x_1..x_6];

i2 : I = minors(2, genericSymmetricMatrix(R,x_1,3))

               2                                                         2  
o2 = ideal (- x  + x x , - x x  + x x , - x x  + x x , - x x  + x x , - x  +
               2    1 4     2 3    1 5     3 4    2 5     2 3    1 5     3  
     ------------------------------------------------------------------------
                                                           2
     x x , - x x  + x x , - x x  + x x , - x x  + x x , - x  + x x )
      1 6     3 5    2 6     3 4    2 5     3 5    2 6     5    4 6

o2 : Ideal of R

i3 : c = codim I

o3 = 3

i4 : m = numgens I

o4 = 9

i5 : apply (m+1, i-> koszulDepth(i,I))

o5 = {3, 1, 3, 3, 6, 6, 6, 6, 6, 6}

o5 : List

i6 : hasSlidingDepth(m-c,I)

o6 = true

i7 : I = ideal{x_1*x_2,x_1*x_3,x_2*x_4*x_5,x_1*x_6,x_4*x_6,x_5*x_6};

o7 : Ideal of R

i8 : hasSlidingDepth(1,I)

o8 = true

i9 : hasSlidingDepth(2,I)

o9 = false

i10 : 
