-- -*- M2-comint -*- hash: -1296472312

i1 : P=convexHull(matrix{{0,2}});

i2 : Q1=convexHull(matrix{{0,4}});

i3 : Q2=convexHull(matrix{{0,3}});

i4 : R1=cayley({P,Q1},2);

i5 : R2=cayley({P,Q2},2);

i6 : (P0,P1,k)=iskCayleykEdges(R1)
Warning: This method is deprecated and will be removed in version 1.11 of Polyhedra. Please consider using polyhedronFromHData instead.

o6 = (P0, P1, 2)

o6 : Sequence

i7 : vertices(P0)

o7 = | 0 2 |
     | 0 0 |

              2        2
o7 : Matrix QQ  <--- QQ

i8 : vertices(P1)

o8 = | 0 4 |
     | 2 2 |

              2        2
o8 : Matrix QQ  <--- QQ

i9 : iskCayleykEdges(R2)
Conditions not met

i10 : 
