-- -*- M2-comint -*- hash: -2135731890

i1 : R = QQ[x,y,z];

i2 : M=matrix{{x^2,x^3,x^4},{y^4,y^2,y^3},{z^3,z^4,z^2}};

             3       3
o2 : Matrix R  <--- R

i3 : chooseRandomSubmatrix(2, M)

o3 = {{1, 2}, {2, 1}}

o3 : List

i4 : 
