-- -*- M2-comint -*- hash: 2047644931

i1 : R = QQ[x,y,z];

i2 : M=matrix{{x^2,x^3,x^4},{y^4,y^2,y^3},{z^3,z^4,z^2}}

o2 = | x2 x3 x4 |
     | y4 y2 y3 |
     | z3 z4 z2 |

             3       3
o2 : Matrix R  <--- R

i3 : chooseSubmatrixSmallestDegree(2, M)

o3 = {{2, 1}, {2, 1}}

o3 : List

i4 : 
