-- -*- M2-comint -*- hash: 1639053961

i1 : P = fromFVector({1,6,5,1});

i2 : I = stanleyPosetIdeal(P);

o2 : Ideal of QQ[x   , x   , x   , x   , x   , x   , x   , x   , x , x , x , x , x ]
                  000   001   010   011   100   101   110   111   1   2   3   4   5

i3 : R = ring(I)/I;

i4 : getFVector(P)

o4 = {1, 6, 5, 1}

o4 : List

i5 : isSimplicial(P)

o5 = true

i6 : 
