-- -*- M2-comint -*- hash: 388154864

i1 : n = 2

o1 = 2

i2 : a = 1, b = 2

o2 = (1, 2)

o2 : Sequence

i3 : D = slIrreducibleRepresentationsTensorProduct(n,a,b);

i4 : #D

o4 = 2

i5 : D#0

         2               2     2                         2     2          
o5 = {v v , 2v v v  + v v , v v  + 2v v v , 2v v v  + v v , v v , v v v  +
       0 0    0 0 1    1 0   0 1     1 0 1    0 0 2    2 0   1 1   0 1 2  
     ------------------------------------------------------------------------
                                   2     2               2               2
     v v v  + v v v , 2v v v  + v v , v v  + 2v v v , v v  + 2v v v , v v }
      1 0 2    2 0 1    1 1 2    2 1   0 2     2 0 2   1 2     2 1 2   2 2

o5 : List

i6 : D#1

                  2     2                       2                           
o6 = {v v v  - v v , v v  - v v v , v v v  - v v , v v v  - v v v , v v v  -
       0 0 1    1 0   0 1    1 0 1   0 0 2    2 0   0 1 2    2 0 1   1 0 2  
     ------------------------------------------------------------------------
                         2     2              2
     v v v , v v v  - v v , v v  - v v v , v v  - v v v }
      2 0 1   1 1 2    2 1   0 2    2 0 2   1 2    2 1 2

o6 : List

i7 : R = QQ[x_0,x_1,x_2];

i8 : a = 2, b = 3

o8 = (2, 3)

o8 : Sequence

i9 : D = slIrreducibleRepresentationsTensorProduct(R,a,b);

i10 : #D

o10 = 3

i11 : D#0

        2 3    2 2           3    2   2         2      2 3    2 2    
o11 = {x x , 3x x x  + 2x x x , 3x x x  + 6x x x x  + x x , 3x x x  +
        0 0    0 0 1     0 1 0    0 0 1     0 1 0 1    1 0    0 0 2  
      -----------------------------------------------------------------------
            3   2 3           2     2 2      2               2           2  
      2x x x , x x  + 6x x x x  + 3x x x , 3x x x x  + 3x x x x  + 3x x x x 
        0 2 0   0 1     0 1 0 1     1 0 1    0 0 1 2     0 1 0 2     0 2 0 1
      -----------------------------------------------------------------------
             3        3     2   2   2 2                    2 2             2
      + x x x , 2x x x  + 3x x x , x x x  + 4x x x x x  + x x x  + 2x x x x 
         1 2 0    0 1 1     1 0 1   0 1 2     0 1 0 1 2    1 0 2     0 2 0 1
      -----------------------------------------------------------------------
              2      2   2         2      2 3   2 3        2       2        
      + 2x x x x , 3x x x  + 6x x x x  + x x , x x , 3x x x x  + 3x x x x  +
          1 2 0 1    0 0 2     0 2 0 2    2 0   1 1    0 1 1 2     1 0 1 2  
      -----------------------------------------------------------------------
           3           2   2   2           2                       2    
      x x x  + 3x x x x , x x x  + 2x x x x  + 4x x x x x  + 2x x x x  +
       0 2 1     1 2 0 1   0 1 2     0 1 0 2     0 2 0 1 2     1 2 0 2  
      -----------------------------------------------------------------------
       2 2      2 2           3          2    2   2         2                
      x x x , 3x x x  + 2x x x , 2x x x x  + x x x  + 2x x x x  + 4x x x x x 
       2 0 1    1 1 2     1 2 1    0 1 1 2    1 0 2     0 2 1 2     1 2 0 1 2
      -----------------------------------------------------------------------
         2   2   2 3           2     2 2      2   2         2      2 3 
      + x x x , x x  + 6x x x x  + 3x x x , 3x x x  + 6x x x x  + x x ,
         2 0 1   0 2     0 2 0 2     2 0 2    1 1 2     1 2 1 2    2 1 
      -----------------------------------------------------------------------
           3           2           2     2         2 3           2     2 2   
      x x x  + 3x x x x  + 3x x x x  + 3x x x x , x x  + 6x x x x  + 3x x x ,
       0 1 2     0 2 1 2     1 2 0 2     2 0 1 2   1 2     1 2 1 2     2 1 2 
      -----------------------------------------------------------------------
            3     2   2        3     2   2   2 3
      2x x x  + 3x x x , 2x x x  + 3x x x , x x }
        0 2 2     2 0 2    1 2 2     2 1 2   2 2

o11 : List

i12 : D#1

        2 2          3    2   2        2      2 3   2 2          3   2 3  
o12 = {x x x  - x x x , 2x x x  - x x x x  - x x , x x x  - x x x , x x  +
        0 0 1    0 1 0    0 0 1    0 1 0 1    1 0   0 0 2    0 2 0   0 1  
      -----------------------------------------------------------------------
             2     2 2      2              2          3       2          2   
      x x x x  - 2x x x , 2x x x x  - x x x x  - x x x , x x x x  - x x x x ,
       0 1 0 1     1 0 1    0 0 1 2    0 2 0 1    1 2 0   0 1 0 2    0 2 0 1 
      -----------------------------------------------------------------------
           3    2   2   2 2      2 2            2        2                 
      x x x  - x x x , x x x  - x x x  + x x x x  - x x x x , 2x x x x x  +
       0 1 1    1 0 1   0 1 2    1 0 2    0 2 0 1    1 2 0 1    0 1 0 1 2  
      -----------------------------------------------------------------------
       2 2             2        2      2   2        2      2 3       2    
      x x x  - 2x x x x  - x x x x , 2x x x  - x x x x  - x x , x x x x  -
       1 0 2     0 2 0 1    1 2 0 1    0 0 2    0 2 0 2    2 0   0 1 1 2  
      -----------------------------------------------------------------------
             2    2              3          2    2   2                
      x x x x , 2x x x x  - x x x  - x x x x , 2x x x  + 2x x x x x  -
       1 2 0 1    1 0 1 2    0 2 1    1 2 0 1    0 1 2     0 2 0 1 2  
      -----------------------------------------------------------------------
            2      2 2            2                      2      2 2     2 2  
      3x x x x  - x x x , 2x x x x  - 2x x x x x  + x x x x  - x x x , x x x 
        1 2 0 2    2 0 1    0 1 0 2     0 2 0 1 2    1 2 0 2    2 0 1   1 1 2
      -----------------------------------------------------------------------
             3          2        2                    2   2    2   2  
      - x x x , 2x x x x  + x x x x  - 2x x x x x  - x x x , 2x x x  -
         1 2 1    0 1 1 2    0 2 1 2     1 2 0 1 2    2 0 1    1 0 2  
      -----------------------------------------------------------------------
            2                    2   2   2 3          2     2 2      2   2  
      3x x x x  + 2x x x x x  - x x x , x x  + x x x x  - 2x x x , 2x x x  -
        0 2 1 2     1 2 0 1 2    2 0 1   0 2    0 2 0 2     2 0 2    1 1 2  
      -----------------------------------------------------------------------
           2      2 3       3          2     2               2          2 
      x x x x  - x x , x x x  + x x x x  - 2x x x x , x x x x  - x x x x ,
       1 2 1 2    2 1   0 1 2    1 2 0 2     2 0 1 2   0 2 1 2    1 2 0 2 
      -----------------------------------------------------------------------
       2 3          2     2 2         3    2   2       3    2   2
      x x  + x x x x  - 2x x x , x x x  - x x x , x x x  - x x x }
       1 2    1 2 1 2     2 1 2   0 2 2    2 0 2   1 2 2    2 1 2

o12 : List

i13 : D#2

        2   2         2      2 3   2 3           2    2 2     2        
o13 = {x x x  - 2x x x x  + x x , x x  - 2x x x x  + x x x , x x x x  -
        0 0 1     0 1 0 1    1 0   0 1     0 1 0 1    1 0 1   0 0 1 2  
      -----------------------------------------------------------------------
           2          2          3   2 2      2 2             2         2   
      x x x x  - x x x x  + x x x , x x x  - x x x  - 2x x x x  + 2x x x x ,
       0 1 0 2    0 2 0 1    1 2 0   0 1 2    1 0 2     0 2 0 1     1 2 0 1 
      -----------------------------------------------------------------------
                    2 2            2        2     2   2         2      2 3 
      x x x x x  - x x x  - x x x x  + x x x x , x x x  - 2x x x x  + x x ,
       0 1 0 1 2    1 0 2    0 2 0 1    1 2 0 1   0 0 2     0 2 0 2    2 0 
      -----------------------------------------------------------------------
           2      2              3          2   2   2                  2 2   
      x x x x  - x x x x  - x x x  + x x x x , x x x  - 2x x x x x  + x x x ,
       0 1 1 2    1 0 1 2    0 2 1    1 2 0 1   0 1 2     0 2 0 1 2    2 0 1 
      -----------------------------------------------------------------------
             2                     2      2 2           2        2    
      x x x x  - x x x x x  - x x x x  + x x x , x x x x  - x x x x  -
       0 1 0 2    0 2 0 1 2    1 2 0 2    2 0 1   0 1 1 2    0 2 1 2  
      -----------------------------------------------------------------------
                    2   2   2   2                  2   2   2 3           2  
      x x x x x  + x x x , x x x  - 2x x x x x  + x x x , x x  - 2x x x x  +
       1 2 0 1 2    2 0 1   1 0 2     1 2 0 1 2    2 0 1   0 2     0 2 0 2  
      -----------------------------------------------------------------------
       2 2     2   2         2      2 3       3          2          2  
      x x x , x x x  - 2x x x x  + x x , x x x  - x x x x  - x x x x  +
       2 0 2   1 1 2     1 2 1 2    2 1   0 1 2    0 2 1 2    1 2 0 2  
      -----------------------------------------------------------------------
       2         2 3           2    2 2
      x x x x , x x  - 2x x x x  + x x x }
       2 0 1 2   1 2     1 2 1 2    2 1 2

o13 : List

i14 : 
