-- -*- M2-comint -*- hash: -952203389

i1 : n = 1, d = 3, m = 3

o1 = (1, 3, 3)

o1 : Sequence

i2 : M = slEquivariantConstantRankMatrix(n,d,m)

o2 = {-1} | -x_1 2x_2  x_3    0     0     0     0     0    |
     {-1} | x_0  3x_1  9x_2   x_3   0     0     0     0    |
     {-1} | 0    -5x_0 0      3x_2  2x_3  0     0     0    |
     {-1} | 0    0     -10x_0 -2x_1 2x_2  10x_3 0     0    |
     {-1} | 0    0     0      -2x_0 -3x_1 0     5x_3  0    |
     {-1} | 0    0     0      0     -x_0  -9x_1 -3x_2 x_3  |
     {-1} | 0    0     0      0     0     -x_0  -2x_1 -x_2 |

                        7                  8
o2 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                 0   3              0   3

i3 : n = 1, d = 3, m = 3

o3 = (1, 3, 3)

o3 : Sequence

i4 : M = slEquivariantConstantRankMatrix(n,d,m,CoefficientRing=>ZZ/10007)

o4 = {-1} | -x_1 2x_2  x_3    0     0     0     0     0    |
     {-1} | x_0  3x_1  9x_2   x_3   0     0     0     0    |
     {-1} | 0    -5x_0 0      3x_2  2x_3  0     0     0    |
     {-1} | 0    0     -10x_0 -2x_1 2x_2  10x_3 0     0    |
     {-1} | 0    0     0      -2x_0 -3x_1 0     5x_3  0    |
     {-1} | 0    0     0      0     -x_0  -9x_1 -3x_2 x_3  |
     {-1} | 0    0     0      0     0     -x_0  -2x_1 -x_2 |

               ZZ          7         ZZ          8
o4 : Matrix (-----[x ..x ])  <--- (-----[x ..x ])
             10007  0   3          10007  0   3

i5 : R = QQ[y_0,y_1];

i6 : d = 2, m = 3

o6 = (2, 3)

o6 : Sequence

i7 : M = slEquivariantConstantRankMatrix(R,d,m)

o7 = {-1} | -x_1 x_2   0    0     0    |
     {-1} | x_0  2x_1  x_2  0     0    |
     {-1} | 0    -3x_0 0    3x_2  0    |
     {-1} | 0    0     -x_0 -2x_1 x_2  |
     {-1} | 0    0     0    -x_0  -x_1 |

                        5                  5
o7 : Matrix (QQ[x ..x ])  <--- (QQ[x ..x ])
                 0   2              0   2

i8 : n = 1, d = 3, m = 3

o8 = (1, 3, 3)

o8 : Sequence

i9 : X = ZZ/7[z_0,z_1,z_2,z_3];

i10 : M = slEquivariantConstantRankMatrix(n,d,m,X)

o10 = {-1} | -z_1 2z_2 z_3   0     0     0     0     0    |
      {-1} | z_0  3z_1 2z_2  z_3   0     0     0     0    |
      {-1} | 0    2z_0 0     3z_2  2z_3  0     0     0    |
      {-1} | 0    0    -3z_0 -2z_1 2z_2  3z_3  0     0    |
      {-1} | 0    0    0     -2z_0 -3z_1 0     -2z_3 0    |
      {-1} | 0    0    0     0     -z_0  -2z_1 -3z_2 z_3  |
      {-1} | 0    0    0     0     0     -z_0  -2z_1 -z_2 |

              7       8
o10 : Matrix X  <--- X

i11 : R = QQ[y_0,y_1];

i12 : d = 3, m = 2

o12 = (3, 2)

o12 : Sequence

i13 : M = slEquivariantConstantRankMatrix(R,d,m,X)

o13 = {-1} | -z_1 z_2  z_3   0    0    |
      {-1} | z_0  0    3z_2  z_3  0    |
      {-1} | 0    -z_0 -3z_1 0    z_3  |
      {-1} | 0    0    -z_0  -z_1 -z_2 |

              4       5
o13 : Matrix X  <--- X

i14 : 
