-- -*- M2-comint -*- hash: -2001126627

i1 : n = 1, d = 3, m = 3

o1 = (1, 3, 3)

o1 : Sequence

i2 : W = slEquivariantVectorBundle(n,d,m)

o2 = cokernel {4} | 0     0     0     0    0     x_3   x_2   |
              {4} | x_1   x_0   0     0    0     0     0     |
              {4} | -2x_2 3x_1  x_0   0    0     0     0     |
              {4} | x_3   -9x_2 0     x_0  0     0     0     |
              {4} | 0     5x_3  -3x_2 -x_1 2x_0  0     0     |
              {4} | 0     0     2x_3  -x_2 -3x_1 5x_0  0     |
              {4} | 0     0     0     x_3  0     -9x_1 x_0   |
              {4} | 0     0     0     0    x_3   3x_2  -2x_1 |

                                                                       8
o2 : coherent sheaf on Proj(QQ[x ..x ]), quotient of OO                 (-4)
                                0   3                  Proj(QQ[x ..x ])
                                                                0   3

i3 : n = 1, d = 3, m = 3

o3 = (1, 3, 3)

o3 : Sequence

i4 : W = slEquivariantVectorBundle(n,d,m,CoefficientRing=>ZZ/10007)

o4 = cokernel {4} | 0       0        0       0       0        556x_3  -5003x_2 |
              {4} | x_1     x_0      0       0       0        0       0        |
              {4} | -x_2    -5002x_1 x_0     0       0        0       0        |
              {4} | 1668x_3 5002x_2  0       x_0     0        0       0        |
              {4} | 0       -1667x_3 -x_2    -x_1    x_0      0       0        |
              {4} | 0       0        4448x_3 3335x_2 -x_1     x_0     0        |
              {4} | 0       0        0       371x_3  0        -x_1    x_0      |
              {4} | 0       0        0       0       -2409x_3 1668x_2 -x_1     |

                              ZZ                                             8
o4 : coherent sheaf on Proj(-----[x ..x ]), quotient of OO                    (-4)
                            10007  0   3                         ZZ
                                                          Proj(-----[x ..x ])
                                                               10007  0   3

i5 : R = QQ[y_0,y_1];

i6 : d = 2, m = 3

o6 = (2, 3)

o6 : Sequence

i7 : W = slEquivariantVectorBundle(R,d,m)

                       1
o7 = OO                 (-2)
       Proj(QQ[x ..x ])
                0   2

o7 : coherent sheaf on Proj(QQ[x ..x ]), free
                                0   2

i8 : n = 1, d = 3, m = 3

o8 = (1, 3, 3)

o8 : Sequence

i9 : X = ZZ/7[z_0,z_1,z_2,z_3];

i10 : W = slEquivariantVectorBundle(n,d,m,X)

o10 = cokernel {4} | 0    0     0    0     0    2z_3 -3z_2 |
               {4} | z_1  z_0   0    0     0    0    0     |
               {4} | -z_2 -2z_1 z_0  0     0    0    0     |
               {4} | -z_3 2z_2  0    z_0   0    0    0     |
               {4} | 0    2z_3  -z_2 -z_1  z_0  0    0     |
               {4} | 0    0     2z_3 -3z_2 -z_1 z_0  0     |
               {4} | 0    0     0    -3z_3 0    -z_1 z_0   |
               {4} | 0    0     0    0     z_3  -z_2 -z_1  |

                                                    8
o10 : coherent sheaf on Proj X, quotient of OO       (-4)
                                              Proj X

i11 : R = QQ[y_0,y_1];

i12 : d = 3, m = 2

o12 = (3, 2)

o12 : Sequence

i13 : W = slEquivariantVectorBundle(R,d,m,X)

o13 = cokernel {2} | 0     -2z_3 0     z_2  |
               {2} | z_1   0     z_0   0    |
               {2} | -z_2  z_0   0     0    |
               {2} | -2z_3 -z_1  -z_2  z_0  |
               {2} | 0     0     -2z_3 -z_1 |

                                                    5
o13 : coherent sheaf on Proj X, quotient of OO       (-2)
                                              Proj X

i14 : 
