-- -*- M2-comint -*- hash: 1353622475

i1 : A = QQ[x];

i2 : I = ideal(x);

o2 : Ideal of A

i3 : B = A/I;

i4 : C = QQ[y];

i5 : f = map(B, A);

o5 : RingMap B <--- A

i6 : g = map(B, C, {0});

o6 : RingMap B <--- C

i7 : (pullback(f,g))#0

     QQ[IGen1, CGensInA1]
o7 = --------------------
        IGen1*CGensInA1

o7 : QuotientRing

i8 : A = QQ[x,y];

i9 : I = ideal(x);

o9 : Ideal of A

i10 : B = A/I;

i11 : C = QQ[u];

i12 : f = map(B, A);

o12 : RingMap B <--- A

i13 : g = map(B, C, {y^2});

o13 : RingMap B <--- C

i14 : (pullback(f,g))#0

      QQ[IGen1, CGensInA1, KGens1]
o14 = ----------------------------
             2                  2
        IGen1 CGensInA1 - KGens1

o14 : QuotientRing

i15 : A = QQ[x];

i16 : I = ideal(x^2);

o16 : Ideal of A

i17 : B = A/I;

i18 : C = QQ[]; 

i19 : f = map(B, A); 

o19 : RingMap B <--- A

i20 : g = map(B, C, {});

o20 : RingMap B <--- C

i21 : (pullback(f,g))#0

      QQ[IGen1, KGens1]
o21 = -----------------
            3         2
       IGen1  - KGens1

o21 : QuotientRing

i22 : 
