-- -*- M2-comint -*- hash: 1822025224

i1 : U24 = uniformMatroid(2, 4)

o1 = a "matroid" of rank 2 on 4 elements

o1 : Matroid

i2 : U24 == dual U24

o2 = true

i3 : ideal U24

o3 = monomialIdeal (x x x , x x x , x x x , x x x )
                     0 1 2   0 1 3   0 2 3   1 2 3

o3 : MonomialIdeal of QQ[x ..x ]
                          0   3

i4 : peek U24

o4 = Matroid{bases => {set {0, 1}, set {0, 2}, set {1, 2}, set {0, 3}, set {1, 3}, set {2, 3}}}
             cache => CacheTable{...3...}
             groundSet => set {0, 1, 2, 3}
             rank => 2

i5 : tuttePolynomial U24

      2    2
o5 = x  + y  + 2x + 2y

o5 : ZZ[x..y]

i6 : N = U24 / {0}

o6 = a "matroid" of rank 1 on 3 elements

o6 : Matroid

i7 : areIsomorphic(N, uniformMatroid(1, 3))

o7 = true

i8 : R10 = specificMatroid "R10"

o8 = a "matroid" of rank 5 on 10 elements

o8 : Matroid

i9 : keys R10.cache

o9 = {groundSet, rankFunction, storedRepresentation}

o9 : List

i10 : time isWellDefined R10
     -- used 0.0793533 seconds

o10 = true

i11 : time fVector R10
     -- used 0.0369945 seconds

o11 = HashTable{0 => 1 }
                1 => 10
                2 => 45
                3 => 75
                4 => 30
                5 => 1

o11 : HashTable

i12 : keys R10.cache

o12 = {hyperplanes, flatsRelationsTable, rankFunction, ideal, ranks, flats,
      -----------------------------------------------------------------------
      groundSet, dual, storedRepresentation}

o12 : List

i13 : time fVector R10
     -- used 0.000309767 seconds

o13 = HashTable{0 => 1 }
                1 => 10
                2 => 45
                3 => 75
                4 => 30
                5 => 1

o13 : HashTable

i14 : 
