-- -*- M2-comint -*- hash: 948049285

i1 : M = matroid({a,b,c,d},{{a,b},{a,c}})

o1 = a "matroid" of rank 2 on 4 elements

o1 : Matroid

i2 : bases M

o2 = {set {0, 1}, set {0, 2}}

o2 : List

i3 : M_((bases M)#0)

o3 = set {a, b}

o3 : Set

i4 : 
