-- -*- M2-comint -*- hash: -284025916

i1 : M = uniformMatroid(4, 5);

i2 : K = modularCut(M, {{0,1,2}, {2,3,4}})

o2 = {set {2, 3, 4}, set {0, 1, 2}, set {0, 1, 2, 3, 4}}

o2 : List

i3 : isModularCut(M, K)

o3 = true

i4 : N = extension(M, K)

o4 = a "matroid" of rank 4 on 6 elements

o4 : Matroid

i5 : F = set{0, 1, 3}

o5 = set {0, 1, 3}

o5 : Set

i6 : N = extension(M, F)

o6 = a "matroid" of rank 4 on 6 elements

o6 : Matroid

i7 : bases N

o7 = {set {0, 1, 2, 3}, set {0, 1, 2, 4}, set {0, 1, 3, 4}, set {0, 2, 3, 4},
     ------------------------------------------------------------------------
     set {1, 2, 3, 4}, set {2, 3, 4, 5}, set {1, 3, 4, 5}, set {0, 3, 4, 5},
     ------------------------------------------------------------------------
     set {1, 2, 4, 5}, set {0, 2, 4, 5}, set {0, 1, 4, 5}, set {1, 2, 3, 5},
     ------------------------------------------------------------------------
     set {0, 2, 3, 5}, set {0, 1, 2, 5}}

o7 : List

i8 : N = extension M

o8 = a "matroid" of rank 4 on 6 elements

o8 : Matroid

i9 : quickIsomorphismTest(N, uniformMatroid(4, 6))

o9 = true

i10 : 
