-- -*- M2-comint -*- hash: -1353557906

i1 : M = matroid({a,b,c,d},{{a,b},{a,c}})

o1 = a "matroid" of rank 2 on 4 elements

o1 : Matroid

i2 : fVector M

o2 = HashTable{0 => 1}
               1 => 2
               2 => 1

o2 : HashTable

i3 : fVector matroid completeGraph 4

o3 = HashTable{0 => 1}
               1 => 6
               2 => 7
               3 => 1

o3 : HashTable

i4 : 
