-- -*- M2-comint -*- hash: 1137671746

i1 : M = matroid({a,b,c},{{a,b},{a,c}})

o1 = a "matroid" of rank 2 on 3 elements

o1 : Matroid

i2 : U23 = uniformMatroid(2,3)

o2 = a "matroid" of rank 2 on 3 elements

o2 : Matroid

i3 : getIsos(M, U23) -- not isomorphic

o3 = {}

o3 : List

i4 : getIsos(M, M)

o4 = {{0, 1, 2}, {0, 2, 1}}

o4 : List

i5 : getIsos(U23, U23) -- the full symmetric group S3

o5 = {{0, 1, 2}, {0, 2, 1}, {1, 0, 2}, {1, 2, 0}, {2, 0, 1}, {2, 1, 0}}

o5 : List

i6 : F7 = specificMatroid "fano"

o6 = a "matroid" of rank 3 on 7 elements

o6 : Matroid

i7 : time autF7 = getIsos(F7, F7);
     -- used 0.0500674 seconds

i8 : #autF7

o8 = 168

i9 : 
