-- -*- M2-comint -*- hash: -738496812

i1 : A = random(QQ^3,QQ^5)

o1 = | 9/2 1/2 3/2 7/9  7/10 |
     | 1/2 1   3/4 7/10 7/3  |
     | 9/4 3/4 7/4 1/2  7    |

              3        5
o1 : Matrix QQ  <--- QQ

i2 : M = matroid A

o2 = a "matroid" of rank 3 on 5 elements

o2 : Matroid

i3 : A == getRepresentation M

o3 = true

i4 : K4 = completeGraph 4

o4 = Graph{0 => {1, 2, 3}}
           1 => {0, 2, 3}
           2 => {0, 1, 3}
           3 => {0, 1, 2}

o4 : Graph

i5 : M4 = matroid K4

o5 = a "matroid" of rank 3 on 6 elements

o5 : Matroid

i6 : getRepresentation M4 === K4

o6 = true

i7 : N = M / set{0}

o7 = a "matroid" of rank 2 on 4 elements

o7 : Matroid

i8 : getRepresentation N

o8 = | 11925/8863 7515/17726 1 0 |
     | 3270/62041 1270/8863  0 1 |

              2        4
o8 : Matrix QQ  <--- QQ

i9 : 
