-- -*- M2-comint -*- hash: 1901572668

i1 : isSimple matroid completeGraph 3

o1 = true

i2 : M = matroid(completeGraph 3, ParallelEdges => {set{0,1},set{0,1},set{1,2}}, Loops => {0,2})

o2 = a "matroid" of rank 2 on 8 elements

o2 : Matroid

i3 : isSimple M

o3 = false

i4 : S = simpleMatroid M

o4 = a "matroid" of rank 2 on 3 elements

o4 : Matroid

i5 : isSimple S

o5 = true

i6 : latticeOfFlats M == latticeOfFlats S

o6 = true

i7 : U = uniformMatroid(2, 2)

o7 = a "matroid" of rank 2 on 2 elements

o7 : Matroid

i8 : isSimple U

o8 = true

i9 : isSimple dual U

o9 = false

i10 : 
