-- -*- M2-comint -*- hash: -292826410

i1 : M = matroid random(ZZ^3,ZZ^6)

o1 = a "matroid" of rank 3 on 6 elements

o1 : Matroid

i2 : M_*

o2 = {| 8 |, | 7 |, | 3 |, | 8 |, | 8 |, | 3 |}
      | 1 |  | 8 |  | 7 |  | 5 |  | 5 |  | 6 |
      | 3 |  | 3 |  | 8 |  | 7 |  | 2 |  | 3 |

o2 : List

i3 : M.groundSet

o3 = set {0, 1, 2, 3, 4, 5}

o3 : Set

i4 : (X, Y) = (set{3}, set{0,1})

o4 = (set {3}, set {0, 1})

o4 : Sequence

i5 : (X1, Y1) = (M_X, M_Y)/toList

o5 = ({| 8 |}, {| 7 |, | 8 |})
       | 5 |    | 8 |  | 1 |
       | 7 |    | 3 |  | 3 |

o5 : Sequence

i6 : N = minor(M, X, Y)

o6 = a "matroid" of rank 2 on 3 elements

o6 : Matroid

i7 : peek N

o7 = Matroid{bases => {set {0, 1}, set {0, 2}, set {1, 2}}}
             cache => CacheTable{...1...}
             groundSet => set {0, 1, 2}
             rank => 2

i8 : N == minor(M, X1, Y1)

o8 = true

i9 : M5 = matroid completeGraph 5

o9 = a "matroid" of rank 4 on 10 elements

o9 : Matroid

i10 : M5.groundSet

o10 = set {0, 1, 2, 3, 4, 5, 6, 7, 8, 9}

o10 : Set

i11 : N = minor(M5, set{8}, set{3,4,9})

o11 = a "matroid" of rank 3 on 6 elements

o11 : Matroid

i12 : areIsomorphic(N, matroid completeGraph 4)

o12 = true

i13 : N == (M5 \ set{3,4,9}) / set{6} -- after deleting 3,4 (and 9), index 8 -> 6

o13 = true

i14 : N == M5 / set{8} \ set{3,4,8} -- after contracting 8, index 9 -> 8

o14 = true

i15 : (try minor(M5, set{8}, set{3,4,8,9})) === null

o15 = true

i16 : minor(M5, set{8}, set{3,4,8,9} - set{8})

o16 = a "matroid" of rank 3 on 6 elements

o16 : Matroid

i17 : 
