-- -*- M2-comint -*- hash: -526690986

i1 : N = matroid completeGraph 4;

i2 : F = set {0, 1, 3};

i3 : TFN = truncate(F, N);

i4 : isElementaryQuotient(TFN, N)

o4 = true

i5 : modularCut(TFN, N)

o5 = {{0, 1, 3}, {0, 1, 2, 3, 4, 5}}

o5 : List

i6 : A = matrix {{1, 0, 0, 1, 1}, {0, 1, 0, 1, -1}, {0, 0, 1, 0, 0}}

o6 = | 1 0 0 1 1  |
     | 0 1 0 1 -1 |
     | 0 0 1 0 0  |

              3        5
o6 : Matrix ZZ  <--- ZZ

i7 : M = matroid A

o7 = a "matroid" of rank 3 on 5 elements

o7 : Matroid

i8 : H = drop(hyperplanes M, 1)

o8 = {set {2, 4}, set {2, 3}, set {1, 2}, set {0, 2}}

o8 : List

i9 : isLinearSubclass(M, H)

o9 = true

i10 : modularCut(M, H)

o10 = {set {2}, set {2, 4}, set {2, 3}, set {1, 2}, set {0, 2}, set {0, 1, 2,
      -----------------------------------------------------------------------
      3, 4}}

o10 : List

i11 : 
