-- -*- M2-comint -*- hash: -777127985

i1 : F7 = specificMatroid "fano"

o1 = a "matroid" of rank 3 on 7 elements

o1 : Matroid

i2 : all(F7_*, x -> areIsomorphic(matroid completeGraph 4, F7 \ {x}))

o2 = true

i3 : AG32 = specificMatroid "AG32"

o3 = a "matroid" of rank 4 on 8 elements

o3 : Matroid

i4 : getRepresentation AG32

o4 = | 1 1 1 1 1 1 1 1 |
     | 0 0 0 0 1 1 1 1 |
     | 0 0 1 1 0 0 1 1 |
     | 0 1 0 1 0 1 0 1 |

             ZZ 4       ZZ 8
o4 : Matrix (--)  <--- (--)
              2          2

i5 : AG32 == dual AG32

o5 = true

i6 : R10 = specificMatroid "R10"

o6 = a "matroid" of rank 5 on 10 elements

o6 : Matroid

i7 : getRepresentation R10

o7 = | 1 0 0 0 0 1 1 0 0 1 |
     | 0 1 0 0 0 1 1 1 0 0 |
     | 0 0 1 0 0 0 1 1 1 0 |
     | 0 0 0 1 0 0 0 1 1 1 |
     | 0 0 0 0 1 1 0 0 1 1 |

             ZZ 5       ZZ 10
o7 : Matrix (--)  <--- (--)
              2          2

i8 : areIsomorphic(R10 \ set{0}, matroid completeMultipartiteGraph {3,3})

o8 = true

i9 : 
