-- -*- M2-comint -*- hash: 2051276453

i1 : R = QQ[vars(0..8)]

o1 = R

o1 : PolynomialRing

i2 : M = genericMatrix(R,a,3,3)

o2 = | a d g |
     | b e h |
     | c f i |

             3       3
o2 : Matrix R  <--- R

i3 : I = pminors(2,M)

o3 = ideal (b*d + a*e, b*g + a*h, e*g + d*h, c*d + a*f, c*g + a*i, f*g + d*i,
     ------------------------------------------------------------------------
     c*e + b*f, c*h + b*i, f*h + e*i)

o3 : Ideal of R

i4 : M=matrix{{1,2,3},{4,5,6}}

o4 = | 1 2 3 |
     | 4 5 6 |

              2        3
o4 : Matrix ZZ  <--- ZZ

i5 : pminors(2,M,Strategy=>glynn)

o5 = ideal (13, 18, 27)

o5 : Ideal of ZZ

i6 : pminors(2,M,Strategy=>ryser)

o6 = ideal (13, 18, 27)

o6 : Ideal of ZZ

i7 : 
