-- -*- M2-comint -*- hash: -1802970659

i1 : R = Grass(2,4,ZZ/11)

o1 = R

o1 : QuotientRing

i2 : R === Grass(2,4,ZZ/11)

o2 = true

i3 : L = trim ideal(random(1,Grass(0,3,ZZ/11,Variable=>x)),random(1,Grass(0,3,ZZ/11,Variable=>x)))

o3 = ideal (x  + 2x , x  - x  + 2x )
             1     3   0    2     3

              ZZ
o3 : Ideal of --[x ..x ]
              11  0   3

i4 : w = chowForm L

o4 = x    + x    + 2x    - 2x    - 2x
      0,1    1,2     0,3     1,3     2,3

     ZZ
     --[x   ..x   , x   , x   , x   , x   ]
     11  0,1   0,2   1,2   0,3   1,3   2,3
o4 : --------------------------------------
         x   x    - x   x    + x   x
          1,2 0,3    0,2 1,3    0,1 2,3

i5 : ring w === Grass(1,3,ZZ/11,Variable=>x)

o5 = true

i6 : L' = chowEquations w

o6 = ideal (x  + 2x , x  - x  + 2x )
             1     3   0    2     3

              ZZ
o6 : Ideal of --[x ..x ]
              11  0   3

i7 : ring L' === Grass(0,3,ZZ/11,Variable=>x)

o7 = true

i8 : L''= chowEquations(w,Variable=>y)

o8 = ideal (y  + 2y , y  - y  + 2y )
             1     3   0    2     3

              ZZ
o8 : Ideal of --[y ..y ]
              11  0   3

i9 : ring L'' === Grass(0,3,ZZ/11,Variable=>y)

o9 = true

i10 : 
