-- -*- M2-comint -*- hash: 1351736765

i1 : P3 = Grass(0,3,ZZ/11,Variable=>x);

i2 : -- an elliptic quartic curve
     C = ideal(x_0^2+x_1^2+x_2^2+x_3^2,x_0*x_1+x_1*x_2+x_2*x_3)

             2    2    2    2
o2 = ideal (x  + x  + x  + x , x x  + x x  + x x )
             0    1    2    3   0 1    1 2    2 3

o2 : Ideal of P3

i3 : -- Chow equations of C
     time eqsC = chowEquations chowForm C
     -- used 0.0686172 seconds

             2 2    2 2    2 2    4                2      2 2   2      
o3 = ideal (x x  + x x  + x x  + x , x x x x  + x x x  + x x , x x x  +
             0 3    1 3    2 3    3   0 1 2 3    1 2 3    2 3   0 2 3  
     ------------------------------------------------------------------------
      2        3           2         2      3   3         2          2    2 2
     x x x  + x x  - 2x x x  - 2x x x  - x x , x x  + 2x x x  - x x x  + x x 
      1 2 3    2 3     0 1 3     1 2 3    2 3   1 3     1 2 3    0 2 3    2 3
     ------------------------------------------------------------------------
          3     2      2             2         2       3   2          2    
     + x x , x x x  + x x x  + 2x x x  + 3x x x  + 2x x , x x x  - x x x  +
        1 3   0 1 3    1 2 3     0 1 3     1 2 3     2 3   0 1 3    1 2 3  
     ------------------------------------------------------------------------
          2    2 2   3      2          2           2         2      3  
     x x x  - x x , x x  - x x x  + x x x  + 4x x x  + 3x x x  + x x  +
      0 2 3    2 3   0 3    1 2 3    0 2 3     0 1 3     1 2 3    0 3  
     ------------------------------------------------------------------------
         3       2      3    3          2        2      3   2 2    2 2    4  
     4x x , x x x  + x x  + x x  + x x x  + x x x  + x x , x x  + x x  + x  +
       2 3   0 1 2    1 2    2 3    0 1 3    1 2 3    2 3   0 2    1 2    2  
     ------------------------------------------------------------------------
      2 2   3         3      2      3           2         2       3     2    
     x x , x x  + 2x x  - x x x  + x x  + 3x x x  + 4x x x  + 3x x , x x x  +
      2 3   1 2     1 2    0 2 3    2 3     0 1 3     1 2 3     2 3   0 1 2  
     ------------------------------------------------------------------------
      2 2      2     2          3      2      3          2        2      3 
     x x  + x x x , x x x  - x x  + x x x  - x x  + x x x  + x x x  + x x ,
      1 2    1 2 3   0 1 2    1 2    0 2 3    2 3    0 1 3    1 2 3    2 3 
     ------------------------------------------------------------------------
      3      2 2      3      2          2   4     2 2       2      2 2  
     x x  - x x  + x x  - x x x  + x x x , x  + 2x x  + 2x x x  + x x  +
      0 2    1 2    0 2    1 2 3    0 2 3   1     1 2     1 2 3    1 3  
     ------------------------------------------------------------------------
      2 2     3       3    2          2      3           2         2       3 
     x x , x x  - 2x x  + x x x  + x x x  - x x  - 2x x x  - 3x x x  - 2x x ,
      2 3   0 1     1 2    1 2 3    0 2 3    2 3     0 1 3     1 2 3     2 3 
     ------------------------------------------------------------------------
      2 2    2 2       2      2 2   3        3    2          2        3   4  
     x x  - x x  - 2x x x  - x x , x x  + x x  - x x x  - x x x  - x x , x  -
      0 1    1 2     1 2 3    2 3   0 1    1 2    1 2 3    0 2 3    2 3   0  
     ------------------------------------------------------------------------
      4       2      2 2    2 2    4
     x  + 2x x x  - x x  - x x  - x )
      2     1 2 3    1 3    2 3    3

o3 : Ideal of P3

i4 : C == saturate eqsC

o4 = true

i5 : -- a singular irreducible curve 
     D = ideal(x_1^2-x_0*x_2,x_2^3-x_0*x_1*x_3,x_1*x_2^2-x_0^2*x_3)

             2          3              2    2
o5 = ideal (x  - x x , x  - x x x , x x  - x x )
             1    0 2   2    0 1 3   1 2    0 3

o5 : Ideal of P3

i6 : -- Chow equations of D
     time eqsD = chowEquations chowForm D
     -- used 0.0616703 seconds

             4      3 2     3        2 2     3      2   2   2 2      2   2 
o6 = ideal (x x  - x x , x x x  - x x x , x x x  - x x x , x x x  - x x x ,
             2 3    1 3   1 2 3    0 1 3   0 2 3    0 1 3   1 2 3    0 1 3 
     ------------------------------------------------------------------------
          2      3 2   3        3 2   4         2         2 2       3    
     x x x x  - x x , x x x  - x x , x x  - 4x x x x  + 3x x x , x x x  -
      0 1 2 3    0 3   1 2 3    0 3   1 3     0 1 2 3     0 2 3   0 1 3  
     ------------------------------------------------------------------------
      2         2 2      3       5    3 2     4    2 2       4    2       
     x x x x , x x x  - x x x , x  - x x , x x  - x x x , x x  - x x x x ,
      0 1 2 3   0 1 3    0 2 3   2    0 3   1 2    0 2 3   0 2    0 1 2 3 
     ------------------------------------------------------------------------
      2 3    2             3    3       2 3    3       3 2    3       2   2  
     x x  - x x x x , x x x  - x x x , x x  - x x x , x x  - x x x , x x x  -
      1 2    0 1 2 3   0 1 2    0 2 3   0 2    0 1 3   1 2    0 2 3   0 1 2  
     ------------------------------------------------------------------------
      4     4      3         3      4     2 2      3 2   5    4       4  
     x x , x x  - x x x , x x x  - x x , x x x  - x x , x  - x x , x x  -
      0 3   1 2    0 1 3   0 1 2    0 3   0 1 2    0 2   1    0 3   0 1  
     ------------------------------------------------------------------------
      3 2   2 3    3       3 2    4
     x x , x x  - x x x , x x  - x x )
      0 2   0 1    0 1 2   0 1    0 2

o6 : Ideal of P3

i7 : D == saturate eqsD

o7 = false

i8 : D == radical eqsD

o8 = true

i9 : Q = ideal(x_0*x_1+x_2*x_3)

o9 = ideal(x x  + x x )
            0 1    2 3

o9 : Ideal of P3

i10 : -- tangential Chow forms of Q
      time (W0,W1,W2) = (tangentialChowForm(Q,0),tangentialChowForm(Q,1),tangentialChowForm(Q,2))
     -- used 0.102288 seconds

                     2                              2
o10 = (x x  + x x , x    - 4x   x    + 2x   x    + x   , x     x      +
        0 1    2 3   0,1     0,2 1,3     0,1 2,3    2,3   0,1,2 0,1,3  
      -----------------------------------------------------------------------
      x     x     )
       0,2,3 1,2,3

o10 : Sequence

i11 : time (Q,Q,Q) == (chowEquations(W0,0),chowEquations(W1,1),chowEquations(W2,2))
     -- used 0.0997177 seconds

o11 = true

i12 : 
