-- -*- M2-comint -*- hash: -514538325

i1 : R = QQ[x]

o1 = R

o1 : PolynomialRing

i2 : f = 3*x^4 - 7*x^3 + 5*x - 7

       4     3
o2 = 3x  - 7x  + 5x - 7

o2 : R

i3 : HurwitzMatrix(f) 

o3 = | -7 5  0  0  |
     | 3  0  -7 0  |
     | 0  -7 5  0  |
     | 0  3  0  -7 |

              4        4
o3 : Matrix QQ  <--- QQ

i4 : HurwitzMatrix(f,4)

o4 = | -7 5  0  0  |
     | 3  0  -7 0  |
     | 0  -7 5  0  |
     | 0  3  0  -7 |

              4        4
o4 : Matrix QQ  <--- QQ

i5 : HurwitzMatrix(f,3)	      

o5 = | -7 5  0  |
     | 3  0  -7 |
     | 0  -7 5  |

              3        3
o5 : Matrix QQ  <--- QQ

i6 : S = R[y]

o6 = S

o6 : PolynomialRing

i7 : g = y^3 + 2*y^2 + y - x + 1

      3     2
o7 = y  + 2y  + y - x + 1

o7 : S

i8 : HurwitzMatrix(g,3)

o8 = | 2 -x+1 0    |
     | 1 1    0    |
     | 0 2    -x+1 |

             3       3
o8 : Matrix R  <--- R

i9 : HurwitzMatrix(g,2)

o9 = | 2 -x+1 |
     | 1 1    |

             2       2
o9 : Matrix R  <--- R

i10 : HurwitzMatrix(g,1)

o10 = | 2 |

              1       1
o10 : Matrix R  <--- R

i11 : 
