-- -*- M2-comint -*- hash: 1870454445

i1 : R = QQ[x,y]

o1 = R

o1 : PolynomialRing

i2 : F = {y^2 - x^2 - 1,x - y^2 + 4*y - 2}

         2    2         2
o2 = {- x  + y  - 1, - y  + x + 4y - 2}

o2 : List

i3 : I = ideal F

               2    2         2
o3 = ideal (- x  + y  - 1, - y  + x + 4y - 2)

o3 : Ideal of R

i4 : S = R/I

o4 = S

o4 : QuotientRing

i5 : traceCount(S)

o5 = 2

i6 : R = QQ[x,y]

o6 = R

o6 : PolynomialRing

i7 : I = ideal(1 - x^2*y + 2*x*y^2, y - 2*x - x*y + x^2)

               2        2       2
o7 = ideal (- x y + 2x*y  + 1, x  - x*y - 2x + y)

o7 : Ideal of R

i8 : traceCount(I)

o8 = 3

i9 : 
