-- -*- M2-comint -*- hash: 1286488987

i1 : kk = toField(QQ[a]/ideal(sum apply(7,i->a^i)))

o1 = kk

o1 : PolynomialRing

i2 : R = kk[x,y,z]

o2 = R

o2 : PolynomialRing

i3 : f4 = x^3*y+y^3*z+z^3*x

      3     3       3
o3 = x y + y z + x*z

o3 : R

i4 : H = jacobian transpose jacobian f4

o4 = {-3} | 6xy 3x2 3z2 |
     {-3} | 3x2 6yz 3y2 |
     {-3} | 3z2 3y2 6xz |

             3       3
o4 : Matrix R  <--- R

i5 : f6 = -1/54*det(H)

        5    5      2 2 2      5
o5 = x*y  + x z - 5x y z  + y*z

o5 : R

i6 : I = minors(2,jacobian matrix{{f4,f6}})

               3 5     7      7       4 2 2        4 3     2   5    8    7   
o6 = ideal (14x y  - 5x z - 3y z - 35x y z  + 35x*y z  - 7x y*z  + z , 3x y -
     ------------------------------------------------------------------------
      8      4 3        5 2      5 3      2 2 4       7   8       7     5 2 
     y  - 35x y z + 7x*y z  - 14x z  + 35x y z  + 5y*z , x  - 5x*y  - 7x y z
     ------------------------------------------------------------------------
          2 4 2      3   4      3 5       7
     - 35x y z  + 35x y*z  + 14y z  - 3x*z )

o6 : Ideal of R

i7 : RI = res I

      1      3      2
o7 = R  <-- R  <-- R  <-- 0
                           
     0      1      2      3

o7 : ChainComplex

i8 : betti RI

            0 1 2
o8 = total: 1 3 2
         0: 1 . .
         1: . . .
         2: . . .
         3: . . .
         4: . . .
         5: . . .
         6: . . .
         7: . 3 .
         8: . . .
         9: . . 1
        10: . . .
        11: . . 1

o8 : BettiTally

i9 : I2 = I^2;

o9 : Ideal of R

i10 : RI2 = res I2

       1      6      6      1
o10 = R  <-- R  <-- R  <-- R  <-- 0
                                   
      0      1      2      3      4

o10 : ChainComplex

i11 : betti RI2

             0 1 2 3
o11 = total: 1 6 6 1
          0: 1 . . .
          1: . . . .
          2: . . . .
          3: . . . .
          4: . . . .
          5: . . . .
          6: . . . .
          7: . . . .
          8: . . . .
          9: . . . .
         10: . . . .
         11: . . . .
         12: . . . .
         13: . . . .
         14: . . . .
         15: . 6 . .
         16: . . . .
         17: . . 3 .
         18: . . . .
         19: . . 3 .
         20: . . . .
         21: . . . 1

o11 : BettiTally

i12 : g = matrix{{a^4,0,0},{0,a^2,0},{0,0,a}}

o12 = | a4 0  0 |
      | 0  a2 0 |
      | 0  0  a |

               3        3
o12 : Matrix kk  <--- kk

i13 : h = matrix{{0,1,0},{0,0,1},{1,0,0}}

o13 = | 0 1 0 |
      | 0 0 1 |
      | 1 0 0 |

               3        3
o13 : Matrix ZZ  <--- ZZ

i14 : i = (2*a^4+2*a^2+2*a+1)/7 * matrix{
          {a-a^6,a^2-a^5,a^4-a^3},
          {a^2-a^5,a^4-a^3,a-a^6},
          {a^4-a^3,a-a^6,a^2-a^5}
          }

o14 = | 3/7a5+1/7a4+1/7a3+3/7a2-1/7  -1/7a5+2/7a4+2/7a3-1/7a2-2/7
      | -1/7a5+2/7a4+2/7a3-1/7a2-2/7 -2/7a5-3/7a4-3/7a3-2/7a2-4/7
      | -2/7a5-3/7a4-3/7a3-2/7a2-4/7 3/7a5+1/7a4+1/7a3+3/7a2-1/7 
      -----------------------------------------------------------------------
      -2/7a5-3/7a4-3/7a3-2/7a2-4/7 |
      3/7a5+1/7a4+1/7a3+3/7a2-1/7  |
      -1/7a5+2/7a4+2/7a3-1/7a2-2/7 |

               3        3
o14 : Matrix kk  <--- kk

i15 : j = -1/(2*a^4+2*a^2+2*a+1) * matrix{
          {a^5-a^4,1-a^5,1-a^3},
          {1-a^5,a^6-a^2,1-a^6},
          {1-a^3,1-a^6,a^3-a}
          }

o15 = | -1/7a5-1/7a4+2/7a2-2/7a+2/7      1/7a5+4/7a4+2/7a3+2/7a2+4/7a+1/7
      | 1/7a5+4/7a4+2/7a3+2/7a2+4/7a+1/7 1/7a5-1/7a4+1/7a3+3/7a+3/7      
      | -2/7a5-1/7a3+2/7a2+2/7a-1/7      1/7a5+3/7a4-1/7a3+3/7a2+1/7a    
      -----------------------------------------------------------------------
      -2/7a5-1/7a3+2/7a2+2/7a-1/7  |
      1/7a5+3/7a4-1/7a3+3/7a2+1/7a |
      2/7a4-1/7a3-2/7a2-1/7a+2/7   |

               3        3
o15 : Matrix kk  <--- kk

i16 : G = {id_(R^3),i,h,j,g,inverse g};

i17 : A1 = action(RI,G,Sub=>false)

o17 = ChainComplex with 6 actors

o17 : ActionOnComplex

i18 : A2 = action(RI2,G,Sub=>false)

o18 = ChainComplex with 6 actors

o18 : ActionOnComplex

i19 : elapsedTime a1 = character A1
 -- 4.54603 seconds elapsed

o19 = Character over R
       
      (0, {0}) => | 1 1 1 1 1 1 |
      (1, {8}) => | 3 -1 0 1 a4+a2+a -a4-a2-a-1 |
      (2, {11}) => | 1 1 1 1 1 1 |
      (2, {13}) => | 1 1 1 1 1 1 |

o19 : Character

i20 : elapsedTime a2 = character A2
 -- 181.477 seconds elapsed

o20 = Character over R
       
      (0, {0}) => | 1 1 1 1 1 1 |
      (1, {16}) => | 6 2 0 0 -1 -1 |
      (2, {19}) => | 3 -1 0 1 a4+a2+a -a4-a2-a-1 |
      (2, {21}) => | 3 -1 0 1 a4+a2+a -a4-a2-a-1 |
      (3, {24}) => | 1 1 1 1 1 1 |

o20 : Character

i21 : s = {1,21,56,42,24,24}

o21 = {1, 21, 56, 42, 24, 24}

o21 : List

i22 : m = matrix{{1,1,1,1,1,1},
          {3,-1,0,1,a^4+a^2+a,-a^4-a^2-a-1},
          {3,-1,0,1,-a^4-a^2-a-1,a^4+a^2+a},
          {6,2,0,0,-1,-1},
          {7,-1,1,-1,0,0},
          {8,0,-1,0,1,1}};

               6        6
o22 : Matrix kk  <--- kk

i23 : conj = map(kk,kk,{a^6})

                       5    4    3    2
o23 = map (kk, kk, {- a  - a  - a  - a  - a - 1})

o23 : RingMap kk <--- kk

i24 : T = characterTable(s,m,R,conj)

o24 = Character table over R
       
          |  1  21  56  42                 24                 24
      ----+-----------------------------------------------------
      X0  |  1   1   1   1                  1                  1
          |                        4    2         4    2
      X1  |  3  -1   0   1        a  + a  + a  - a  - a  - a - 1
          |                    4    2                 4    2
      X2  |  3  -1   0   1  - a  - a  - a - 1        a  + a  + a
      X3  |  6   2   0   0                 -1                 -1
      X4  |  7  -1   1  -1                  0                  0
      X5  |  8   0  -1   0                  1                  1

o24 : CharacterTable

i25 : a1/T

o25 = Decomposition table
       
                 |  X0  X1
      -----------+--------
       (0, {0})  |   1   0
       (1, {8})  |   0   1
      (2, {11})  |   1   0
      (2, {13})  |   1   0

o25 : CharacterDecomposition

i26 : a2/T

o26 = Decomposition table
       
                 |  X0  X1  X3
      -----------+------------
       (0, {0})  |   1   0   0
      (1, {16})  |   0   0   1
      (2, {19})  |   0   1   0
      (2, {21})  |   0   1   0
      (3, {24})  |   1   0   0

o26 : CharacterDecomposition

i27 : needsPackage "SymbolicPowers"

o27 = SymbolicPowers

o27 : Package

i28 : Is2 = symbolicPower(I,2);

o28 : Ideal of R

i29 : M = Is2 / I2;

i30 : B = action(M,G,Sub=>false)

o30 = Module with 6 actors

o30 : ActionOnGradedModule

i31 : elapsedTime b = character(B,21)
 -- 83.9475 seconds elapsed

o31 = Character over R
       
      (0, {21}) => | 1 1 1 1 1 1 |

o31 : Character

i32 : b/T

o32 = Decomposition table
       
                 |  X0
      -----------+------
      (0, {21})  |   1

o32 : CharacterDecomposition

i33 : 
      
