-- -*- M2-comint -*- hash: -869999495

i1 : R=QQ[x_1..x_6]

o1 = R

o1 : PolynomialRing

i2 : I=intersect(apply(subsets(gens R,4),x->(ideal x)^3))

                                                                       
o2 = ideal (x x x x x , x x x x x , x x x x x , x x x x x , x x x x x ,
             2 3 4 5 6   1 3 4 5 6   1 2 4 5 6   1 2 3 5 6   1 2 3 4 6 
     ------------------------------------------------------------------------
                    2 2 2     2 2 2     2 2 2   2   2 2   2   2 2   2   2 2 
     x x x x x , x x x x , x x x x , x x x x , x x x x , x x x x , x x x x ,
      1 2 3 4 5   3 4 5 6   2 4 5 6   1 4 5 6   3 4 5 6   2 4 5 6   1 4 5 6 
     ------------------------------------------------------------------------
        2 2 2     2 2 2   2   2 2   2   2 2     2 2 2   2   2 2   2 2   2 
     x x x x , x x x x , x x x x , x x x x , x x x x , x x x x , x x x x ,
      2 3 5 6   1 3 5 6   2 3 5 6   1 3 5 6   1 2 5 6   1 2 5 6   3 4 5 6 
     ------------------------------------------------------------------------
      2 2   2   2 2   2   2 2   2   2 2   2   2 2   2     2 2 2     2 2 2 
     x x x x , x x x x , x x x x , x x x x , x x x x , x x x x , x x x x ,
      2 4 5 6   1 4 5 6   2 3 5 6   1 3 5 6   1 2 5 6   2 3 4 6   1 3 4 6 
     ------------------------------------------------------------------------
      2   2 2   2   2 2     2 2 2   2   2 2   2 2   2   2 2   2   2 2   2 
     x x x x , x x x x , x x x x , x x x x , x x x x , x x x x , x x x x ,
      2 3 4 6   1 3 4 6   1 2 4 6   1 2 4 6   2 3 4 6   1 3 4 6   1 2 4 6 
     ------------------------------------------------------------------------
        2 2 2   2   2 2   2 2   2   2 2 2     2 2 2     2 2 2     2 2 2   
     x x x x , x x x x , x x x x , x x x x , x x x x , x x x x , x x x x ,
      1 2 3 6   1 2 3 6   1 2 3 6   3 4 5 6   2 4 5 6   1 4 5 6   2 3 5 6 
     ------------------------------------------------------------------------
      2 2 2     2 2 2     2 2 2     2 2 2     2 2 2     2 2 2       2 2 2 
     x x x x , x x x x , x x x x , x x x x , x x x x , x x x x , x x x x ,
      1 3 5 6   1 2 5 6   2 3 4 6   1 3 4 6   1 2 4 6   1 2 3 6   2 3 4 5 
     ------------------------------------------------------------------------
        2 2 2   2   2 2   2   2 2     2 2 2   2   2 2   2 2   2   2 2   2 
     x x x x , x x x x , x x x x , x x x x , x x x x , x x x x , x x x x ,
      1 3 4 5   2 3 4 5   1 3 4 5   1 2 4 5   1 2 4 5   2 3 4 5   1 3 4 5 
     ------------------------------------------------------------------------
      2 2   2     2 2 2   2   2 2   2 2   2   2 2 2     2 2 2     2 2 2   
     x x x x , x x x x , x x x x , x x x x , x x x x , x x x x , x x x x ,
      1 2 4 5   1 2 3 5   1 2 3 5   1 2 3 5   2 3 4 5   1 3 4 5   1 2 4 5 
     ------------------------------------------------------------------------
      2 2 2       2 2 2   2   2 2   2 2   2   2 2 2     3 3 3   3 3 3 
     x x x x , x x x x , x x x x , x x x x , x x x x , x x x , x x x ,
      1 2 3 5   1 2 3 4   1 2 3 4   1 2 3 4   1 2 3 4   4 5 6   3 5 6 
     ------------------------------------------------------------------------
      3 3 3   3 3 3   3 3 3   3 3 3   3 3 3   3 3 3   3 3 3   3 3 3   3 3 3 
     x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x ,
      2 5 6   1 5 6   3 4 6   2 4 6   1 4 6   2 3 6   1 3 6   1 2 6   3 4 5 
     ------------------------------------------------------------------------
      3 3 3   3 3 3   3 3 3   3 3 3   3 3 3   3 3 3   3 3 3   3 3 3   3 3 3
     x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x , x x x )
      2 4 5   1 4 5   2 3 5   1 3 5   1 2 5   2 3 4   1 3 4   1 2 4   1 2 3

o2 : Ideal of R

i3 : RI=res I

      1      86      230      210      65
o3 = R  <-- R   <-- R    <-- R    <-- R   <-- 0
                                               
     0      1       2        3        4       5

o3 : ChainComplex

i4 : betti RI

            0  1   2   3  4
o4 = total: 1 86 230 210 65
         0: 1  .   .   .  .
         1: .  .   .   .  .
         2: .  .   .   .  .
         3: .  .   .   .  .
         4: .  6   5   .  .
         5: .  .   .   .  .
         6: . 60 165 150 45
         7: .  .   .   .  .
         8: . 20  60  60 20

o4 : BettiTally

i5 : S6 = symmetricGroupActors R

o5 = {| x_2 x_3 x_4 x_5 x_6 x_1 |, | x_2 x_3 x_4 x_5 x_1 x_6 |, | x_2 x_3 x_4
     ------------------------------------------------------------------------
     x_1 x_6 x_5 |, | x_2 x_3 x_4 x_1 x_5 x_6 |, | x_2 x_3 x_1 x_5 x_6 x_4 |,
     ------------------------------------------------------------------------
     | x_2 x_3 x_1 x_5 x_4 x_6 |, | x_2 x_3 x_1 x_4 x_5 x_6 |, | x_2 x_1 x_4
     ------------------------------------------------------------------------
     x_3 x_6 x_5 |, | x_2 x_1 x_4 x_3 x_5 x_6 |, | x_2 x_1 x_3 x_4 x_5 x_6 |,
     ------------------------------------------------------------------------
     | x_1 x_2 x_3 x_4 x_5 x_6 |}

o5 : List

i6 : A=action(RI,S6)

o6 = ChainComplex with 11 actors

o6 : ActionOnComplex

i7 : elapsedTime c=character A
 -- 1.35243 seconds elapsed

o7 = Character over R
      
     (0, {0}) => | 1 1 1 1 1 1 1 1 1 1 1 |
     (1, {5}) => | 0 1 0 2 0 1 3 0 2 4 6 |
     (1, {7}) => | 0 0 0 0 0 1 3 0 4 16 60 |
     (1, {9}) => | 0 0 0 0 2 2 2 0 4 8 20 |
     (2, {6}) => | -1 0 -1 1 -1 0 2 -1 1 3 5 |
     (2, {8}) => | 0 0 -1 -1 0 0 6 -3 1 33 165 |
     (2, {10}) => | 0 0 0 0 0 1 3 0 4 16 60 |
     (3, {9}) => | 0 0 0 -2 0 -1 3 0 -6 20 150 |
     (3, {11}) => | 0 0 0 0 0 -1 3 0 -4 8 60 |
     (4, {10}) => | 0 0 1 -1 0 0 0 3 -3 3 45 |
     (4, {12}) => | 0 0 0 0 2 0 2 0 -4 0 20 |

o7 : Character

i8 : T = symmetricGroupTable R

o8 = Character table over R
      
              |  120  144  90  90  40  120  40  15  45  15   1
     ---------+-----------------------------------------------
         (6)  |    1    1   1   1   1    1   1   1   1   1   1
       (5,1)  |   -1    0  -1   1  -1    0   2  -1   1   3   5
       (4,2)  |    0   -1   1  -1   0    0   0   3   1   3   9
          2   |                                             
      (4,1 )  |    1    0   0   0   1   -1   1  -2  -2   2  10
          2   |                                             
        (3 )  |    0    0  -1  -1   2    1  -1  -3   1   1   5
     (3,2,1)  |    0    1   0   0  -2    0  -2   0   0   0  16
          3   |                                             
      (3,1 )  |   -1    0   0   0   1    1   1   2  -2  -2  10
          3   |                                             
        (2 )  |    0    0  -1   1   2   -1  -1   3   1  -1   5
       2  2   |                                             
     (2 ,1 )  |    0   -1   1   1   0    0   0  -3   1  -3   9
          4   |                                             
      (2,1 )  |    1    0  -1  -1  -1    0   2   1   1  -3   5
          6   |                                             
        (1 )  |   -1    1   1  -1   1   -1   1  -1   1  -1   1

o8 : CharacterTable

i9 : decomposeCharacter(c,T)

o9 = Decomposition table
      
                |                         2     2                3
                |  (6)  (5,1)  (4,2)  (4,1 )  (3 )  (3,2,1)  (3,1 )
     -----------+--------------------------------------------------
      (0, {0})  |    1      0      0       0     0        0       0
      (1, {5})  |    1      1      0       0     0        0       0
      (1, {7})  |    1      2      2       1     1        1       0
      (1, {9})  |    1      1      1       0     1        0       0
      (2, {6})  |    0      1      0       0     0        0       0
      (2, {8})  |    1      4      4       4     2        3       1
     (2, {10})  |    1      2      2       1     1        1       0
      (3, {9})  |    0      2      3       4     1        3       2
     (3, {11})  |    0      1      1       2     0        1       1
     (4, {10})  |    0      0      1       1     0        1       1
     (4, {12})  |    0      0      0       1     0        0       1

o9 : CharacterDecomposition

i10 : 
