-- -*- M2-comint -*- hash: 141383155

i1 : R = QQ[x_1..x_4]

o1 = R

o1 : PolynomialRing

i2 : I = ideal apply(subsets(gens R,2),product)

o2 = ideal (x x , x x , x x , x x , x x , x x )
             1 2   1 3   2 3   1 4   2 4   3 4

o2 : Ideal of R

i3 : RI = res I

      1      6      8      3
o3 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o3 : ChainComplex

i4 : G = { (id_(R^4))_{1,2,3,0},
           (id_(R^4))_{1,2,0,3},
           (id_(R^4))_{1,0,3,2},
           (id_(R^4))_{1,0,2,3},
            id_(R^4) }

o4 = {| 0 0 0 1 |, | 0 0 1 0 |, | 0 1 0 0 |, | 0 1 0 0 |, | 1 0 0 0 |}
      | 1 0 0 0 |  | 1 0 0 0 |  | 1 0 0 0 |  | 1 0 0 0 |  | 0 1 0 0 |
      | 0 1 0 0 |  | 0 1 0 0 |  | 0 0 0 1 |  | 0 0 1 0 |  | 0 0 1 0 |
      | 0 0 1 0 |  | 0 0 0 1 |  | 0 0 1 0 |  | 0 0 0 1 |  | 0 0 0 1 |

o4 : List

i5 : A = action(RI,G,Sub=>false)

o5 = ChainComplex with 5 actors

o5 : ActionOnComplex

i6 : ringActors(A,Sub=>false)

o6 = {| 0 0 0 1 |, | 0 0 1 0 |, | 0 1 0 0 |, | 0 1 0 0 |, | 1 0 0 0 |}
      | 1 0 0 0 |  | 1 0 0 0 |  | 1 0 0 0 |  | 1 0 0 0 |  | 0 1 0 0 |
      | 0 1 0 0 |  | 0 1 0 0 |  | 0 0 0 1 |  | 0 0 1 0 |  | 0 0 1 0 |
      | 0 0 1 0 |  | 0 0 0 1 |  | 0 0 1 0 |  | 0 0 0 1 |  | 0 0 0 1 |

o6 : List

i7 : inverseRingActors(A,Sub=>false)

o7 = {| 0 1 0 0 |, | 0 1 0 0 |, | 0 1 0 0 |, | 0 1 0 0 |, | 1 0 0 0 |}
      | 0 0 1 0 |  | 0 0 1 0 |  | 1 0 0 0 |  | 1 0 0 0 |  | 0 1 0 0 |
      | 0 0 0 1 |  | 1 0 0 0 |  | 0 0 0 1 |  | 0 0 1 0 |  | 0 0 1 0 |
      | 1 0 0 0 |  | 0 0 0 1 |  | 0 0 1 0 |  | 0 0 0 1 |  | 0 0 0 1 |

o7 : List

i8 : ringActors(A)

o8 = {| x_2 x_3 x_4 x_1 |, | x_2 x_3 x_1 x_4 |, | x_2 x_1 x_4 x_3 |, | x_2
     ------------------------------------------------------------------------
     x_1 x_3 x_4 |, | x_1 x_2 x_3 x_4 |}

o8 : List

i9 : inverseRingActors(A)

o9 = {| x_4 x_1 x_2 x_3 |, | x_3 x_1 x_2 x_4 |, | x_2 x_1 x_4 x_3 |, | x_2
     ------------------------------------------------------------------------
     x_1 x_3 x_4 |, | x_1 x_2 x_3 x_4 |}

o9 : List

i10 : 
      
