-- -*- M2-comint -*- hash: 1342974285

i1 : R = QQ[x_1..x_4]

o1 = R

o1 : PolynomialRing

i2 : I = ideal apply(subsets(gens R,2),product)

o2 = ideal (x x , x x , x x , x x , x x , x x )
             1 2   1 3   2 3   1 4   2 4   3 4

o2 : Ideal of R

i3 : M = module I

o3 = image | x_1x_2 x_1x_3 x_2x_3 x_1x_4 x_2x_4 x_3x_4 |

                             1
o3 : R-module, submodule of R

i4 : RM = res M

      6      8      3
o4 = R  <-- R  <-- R  <-- 0
                           
     0      1      2      3

o4 : ChainComplex

i5 : G = {matrix{{x_2,x_3,x_4,x_1}},
          matrix{{x_2,x_3,x_1,x_4}},
          matrix{{x_2,x_1,x_4,x_3}},
          matrix{{x_2,x_1,x_3,x_4}},
          matrix{{x_1,x_2,x_3,x_4}} }

o5 = {| x_2 x_3 x_4 x_1 |, | x_2 x_3 x_1 x_4 |, | x_2 x_1 x_4 x_3 |, | x_2
     ------------------------------------------------------------------------
     x_1 x_3 x_4 |, | x_1 x_2 x_3 x_4 |}

o5 : List

i6 : G' = { (id_(R^6))_{2,4,5,0,1,3},
            (id_(R^6))_{2,0,1,4,5,3},
            (id_(R^6))_{0,4,3,2,1,5},
            (id_(R^6))_{0,2,1,4,3,5},
             id_(R^6) }

o6 = {| 0 0 0 1 0 0 |, | 0 1 0 0 0 0 |, | 1 0 0 0 0 0 |, | 1 0 0 0 0 0 |, | 1
      | 0 0 0 0 1 0 |  | 0 0 1 0 0 0 |  | 0 0 0 0 1 0 |  | 0 0 1 0 0 0 |  | 0
      | 1 0 0 0 0 0 |  | 1 0 0 0 0 0 |  | 0 0 0 1 0 0 |  | 0 1 0 0 0 0 |  | 0
      | 0 0 0 0 0 1 |  | 0 0 0 0 0 1 |  | 0 0 1 0 0 0 |  | 0 0 0 0 1 0 |  | 0
      | 0 1 0 0 0 0 |  | 0 0 0 1 0 0 |  | 0 1 0 0 0 0 |  | 0 0 0 1 0 0 |  | 0
      | 0 0 1 0 0 0 |  | 0 0 0 0 1 0 |  | 0 0 0 0 0 1 |  | 0 0 0 0 0 1 |  | 0
     ------------------------------------------------------------------------
     0 0 0 0 0 |}
     1 0 0 0 0 |
     0 1 0 0 0 |
     0 0 1 0 0 |
     0 0 0 1 0 |
     0 0 0 0 1 |

o6 : List

i7 : A = action(RM,G,G',0)

o7 = ChainComplex with 5 actors

o7 : ActionOnComplex

i8 : actors(A)

o8 = {{2} | 0 0 0 1 0 0 |, {2} | 0 1 0 0 0 0 |, {2} | 1 0 0 0 0 0 |, {2} | 1
      {2} | 0 0 0 0 1 0 |  {2} | 0 0 1 0 0 0 |  {2} | 0 0 0 0 1 0 |  {2} | 0
      {2} | 1 0 0 0 0 0 |  {2} | 1 0 0 0 0 0 |  {2} | 0 0 0 1 0 0 |  {2} | 0
      {2} | 0 0 0 0 0 1 |  {2} | 0 0 0 0 0 1 |  {2} | 0 0 1 0 0 0 |  {2} | 0
      {2} | 0 1 0 0 0 0 |  {2} | 0 0 0 1 0 0 |  {2} | 0 1 0 0 0 0 |  {2} | 0
      {2} | 0 0 1 0 0 0 |  {2} | 0 0 0 0 1 0 |  {2} | 0 0 0 0 0 1 |  {2} | 0
     ------------------------------------------------------------------------
     0 0 0 0 0 |, {2} | 1 0 0 0 0 0 |}
     0 1 0 0 0 |  {2} | 0 1 0 0 0 0 |
     1 0 0 0 0 |  {2} | 0 0 1 0 0 0 |
     0 0 0 1 0 |  {2} | 0 0 0 1 0 0 |
     0 0 1 0 0 |  {2} | 0 0 0 0 1 0 |
     0 0 0 0 1 |  {2} | 0 0 0 0 0 1 |

o8 : List

i9 : B = action(M,G)

o9 = Module with 5 actors

o9 : ActionOnGradedModule

i10 : actors(B)

o10 = {| 1 |, | 1 |, | 1 |, | 1 |, | 1 |}

o10 : List

i11 : 
