-- -*- M2-comint -*- hash: 442138915

i1 : R = QQ[x_1..x_4]

o1 = R

o1 : PolynomialRing

i2 : I = ideal apply(subsets(gens R,2),product)

o2 = ideal (x x , x x , x x , x x , x x , x x )
             1 2   1 3   2 3   1 4   2 4   3 4

o2 : Ideal of R

i3 : RI = res I

      1      6      8      3
o3 = R  <-- R  <-- R  <-- R  <-- 0
                                  
     0      1      2      3      4

o3 : ChainComplex

i4 : G = {matrix{{x_2,x_3,x_4,x_1}},
          matrix{{x_2,x_3,x_1,x_4}},
          matrix{{x_2,x_1,x_4,x_3}},
          matrix{{x_2,x_1,x_3,x_4}},
          matrix{{x_1,x_2,x_3,x_4}} }

o4 = {| x_2 x_3 x_4 x_1 |, | x_2 x_3 x_1 x_4 |, | x_2 x_1 x_4 x_3 |, | x_2
     ------------------------------------------------------------------------
     x_1 x_3 x_4 |, | x_1 x_2 x_3 x_4 |}

o4 : List

i5 : A = action(RI,G)

o5 = ChainComplex with 5 actors

o5 : ActionOnComplex

i6 : ringActors A

o6 = {| x_2 x_3 x_4 x_1 |, | x_2 x_3 x_1 x_4 |, | x_2 x_1 x_4 x_3 |, | x_2
     ------------------------------------------------------------------------
     x_1 x_3 x_4 |, | x_1 x_2 x_3 x_4 |}

o6 : List

i7 : inverseRingActors A

o7 = {| x_4 x_1 x_2 x_3 |, | x_3 x_1 x_2 x_4 |, | x_2 x_1 x_4 x_3 |, | x_2
     ------------------------------------------------------------------------
     x_1 x_3 x_4 |, | x_1 x_2 x_3 x_4 |}

o7 : List

i8 : numActors A

o8 = 5

i9 : M = module I

o9 = image | x_1x_2 x_1x_3 x_2x_3 x_1x_4 x_2x_4 x_3x_4 |

                             1
o9 : R-module, submodule of R

i10 : RM = res M

       6      8      3
o10 = R  <-- R  <-- R  <-- 0
                            
      0      1      2      3

o10 : ChainComplex

i11 : G' = { (id_(R^6))_{2,4,5,0,1,3},
             (id_(R^6))_{2,0,1,4,5,3},
             (id_(R^6))_{0,4,3,2,1,5},
             (id_(R^6))_{0,2,1,4,3,5},
              id_(R^6) }

o11 = {| 0 0 0 1 0 0 |, | 0 1 0 0 0 0 |, | 1 0 0 0 0 0 |, | 1 0 0 0 0 0 |, |
       | 0 0 0 0 1 0 |  | 0 0 1 0 0 0 |  | 0 0 0 0 1 0 |  | 0 0 1 0 0 0 |  |
       | 1 0 0 0 0 0 |  | 1 0 0 0 0 0 |  | 0 0 0 1 0 0 |  | 0 1 0 0 0 0 |  |
       | 0 0 0 0 0 1 |  | 0 0 0 0 0 1 |  | 0 0 1 0 0 0 |  | 0 0 0 0 1 0 |  |
       | 0 1 0 0 0 0 |  | 0 0 0 1 0 0 |  | 0 1 0 0 0 0 |  | 0 0 0 1 0 0 |  |
       | 0 0 1 0 0 0 |  | 0 0 0 0 1 0 |  | 0 0 0 0 0 1 |  | 0 0 0 0 0 1 |  |
      -----------------------------------------------------------------------
      1 0 0 0 0 0 |}
      0 1 0 0 0 0 |
      0 0 1 0 0 0 |
      0 0 0 1 0 0 |
      0 0 0 0 1 0 |
      0 0 0 0 0 1 |

o11 : List

i12 : action(RM,G,G',0)

o12 = ChainComplex with 5 actors

o12 : ActionOnComplex

i13 : E = Ext^3(R^1/I,R^{-4})

o13 = cokernel | x_4 x_2 0   x_3 0   x_3 0   0   |
               | 0   0   x_4 x_3 x_1 0   0   0   |
               | 0   0   0   0   0   x_3 x_2 x_1 |

                             3
o13 : R-module, quotient of R

i14 : RE = res E

       3      8      6      1
o14 = R  <-- R  <-- R  <-- R  <-- 0
                                   
      0      1      2      3      4

o14 : ChainComplex

i15 : G'' = toList(5:id_(R^1))

o15 = {| 1 |, | 1 |, | 1 |, | 1 |, | 1 |}

o15 : List

i16 : action(RE,G,G'',3)

o16 = ChainComplex with 5 actors

o16 : ActionOnComplex

i17 : 
