-- -*- M2-comint -*- hash: -1423866357

i1 : F = toField(QQ[w]/ideal(1+w+w^2))

o1 = F

o1 : PolynomialRing

i2 : s = {1,3,4,4}

o2 = {1, 3, 4, 4}

o2 : List

i3 : M = matrix{{1,1,1,1},{1,1,w,w^2},{1,1,w^2,w},{3,-1,0,0}}

o3 = | 1 1  1    1    |
     | 1 1  w    -w-1 |
     | 1 1  -w-1 w    |
     | 3 -1 0    0    |

             4       4
o3 : Matrix F  <--- F

i4 : R = F[x_1..x_4]

o4 = R

o4 : PolynomialRing

i5 : conj = map(F,F,{w^2})

o5 = map (F, F, {- w - 1})

o5 : RingMap F <--- F

i6 : T = characterTable(s,M,R,conj)

o6 = Character table over R
      
         |  1   3        4        4
     ----+-------------------------
     X0  |  1   1        1        1
     X1  |  1   1        w  - w - 1
     X2  |  1   1  - w - 1        w
     X3  |  3  -1        0        0

o6 : CharacterTable

i7 : perm = {1,2,4,3}

o7 = {1, 2, 4, 3}

o7 : List

i8 : T' = characterTable(s,M,R,perm)

o8 = Character table over R
      
         |  1   3        4        4
     ----+-------------------------
     X0  |  1   1        1        1
     X1  |  1   1        w  - w - 1
     X2  |  1   1  - w - 1        w
     X3  |  3  -1        0        0

o8 : CharacterTable

i9 : T' === T

o9 = true

i10 : 
