-- -*- M2-comint -*- hash: -488064519

i1 : R = QQ[x_1..x_4]

o1 = R

o1 : PolynomialRing

i2 : J = intersect(apply(subsets(gens R,3),x->(ideal x)^2))

                                             2 2   2 2   2 2   2 2   2 2 
o2 = ideal (x x x , x x x , x x x , x x x , x x , x x , x x , x x , x x ,
             2 3 4   1 3 4   1 2 4   1 2 3   3 4   2 4   1 4   2 3   1 3 
     ------------------------------------------------------------------------
      2 2
     x x )
      1 2

o2 : Ideal of R

i3 : RJ = res J

      1      10      15      6
o3 = R  <-- R   <-- R   <-- R  <-- 0
                                    
     0      1       2       3      4

o3 : ChainComplex

i4 : G = { matrix{{x_2,x_3,x_4,x_1}},
           matrix{{x_2,x_3,x_1,x_4}},
           matrix{{x_2,x_1,x_4,x_3}},
           matrix{{x_2,x_1,x_3,x_4}},
           matrix{{x_1,x_2,x_3,x_4}} }

o4 = {| x_2 x_3 x_4 x_1 |, | x_2 x_3 x_1 x_4 |, | x_2 x_1 x_4 x_3 |, | x_2
     ------------------------------------------------------------------------
     x_1 x_3 x_4 |, | x_1 x_2 x_3 x_4 |}

o4 : List

i5 : A = action(RJ,G)

o5 = ChainComplex with 5 actors

o5 : ActionOnComplex

i6 : character(A,0)

o6 = Character over R
      
     (0, {0}) => | 1 1 1 1 1 |

o6 : Character

i7 : character(A,1)

o7 = Character over R
      
     (1, {3}) => | 0 1 0 2 4 |
     (1, {4}) => | 0 0 2 2 6 |

o7 : Character

i8 : character(A,2)

o8 = Character over R
      
     (2, {4}) => | -1 0 -1 1 3 |
     (2, {5}) => | 0 0 0 2 12 |

o8 : Character

i9 : character(A,3)

o9 = Character over R
      
     (3, {6}) => | 0 0 -2 0 6 |

o9 : Character

i10 : 
