-- -*- M2-comint -*- hash: 698700654

i1 : R = QQ[x_1..x_3]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x_1+x_2+x_3)

o2 = ideal(x  + x  + x )
            1    2    3

o2 : Ideal of R

i3 : J = ideal(x_1-x_2,x_1-x_3)

o3 = ideal (x  - x , x  - x )
             1    2   1    3

o3 : Ideal of R

i4 : S3 = {matrix{{x_2,x_3,x_1}},
           matrix{{x_2,x_1,x_3}},
           matrix{{x_1,x_2,x_3}} }

o4 = {| x_2 x_3 x_1 |, | x_2 x_1 x_3 |, | x_1 x_2 x_3 |}

o4 : List

i5 : A = action(I,S3)

o5 = Ideal with 3 actors

o5 : ActionOnGradedModule

i6 : B = action(J,S3)

o6 = Ideal with 3 actors

o6 : ActionOnGradedModule

i7 : a = character(A,1)

o7 = Character over R
      
     (0, {1}) => | 1 1 1 |

o7 : Character

i8 : b = character(B,1)

o8 = Character over R
      
     (0, {1}) => | -1 0 2 |

o8 : Character

i9 : a ++ b

o9 = Character over R
      
     (0, {1}) => | 0 1 3 |

o9 : Character

i10 : K = ideal(x_1,x_2,x_3)

o10 = ideal (x , x , x )
              1   2   3

o10 : Ideal of R

i11 : C = action(K,S3)

o11 = Ideal with 3 actors

o11 : ActionOnGradedModule

i12 : c = character(C,1)

o12 = Character over R
       
      (0, {1}) => | 0 1 3 |

o12 : Character

i13 : a ++ b === c

o13 = true

i14 : 
