-- -*- M2-comint -*- hash: -780278385

i1 : isClosedUnderArrows ({0, 2, 3}, bipartiteQuiver(2, 3))

o1 = false

i2 : isClosedUnderArrows ({2, 3, 4}, bipartiteQuiver(2, 3))

o2 = true

i3 : Q = threeVertexQuiver {1, 2, 3}

o3 = ToricQuiver{flow => {1, 1, 1, 1, 1, 1}                            }
                 IncidenceMatrix => | -1 -1 -1 -1 0  0  |
                                    | 1  0  0  0  -1 -1 |
                                    | 0  1  1  1  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 2}, {0, 2}, {0, 2}, {1, 2}, {1, 2}}
                 weights => {-4, -1, 5}

o3 : ToricQuiver

i4 : SQ = Q_{0,1}

o4 = ToricQuiver{flow => {1, 1}              }
                 IncidenceMatrix => | -1 -1 |
                                    | 1  0  |
                                    | 0  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 2}}
                 weights => {-2, 1, 1}

o4 : ToricQuiver

i5 : isClosedUnderArrows (SQ, Q)

o5 = true

i6 : Q = threeVertexQuiver {1, 2, 3}

o6 = ToricQuiver{flow => {1, 1, 1, 1, 1, 1}                            }
                 IncidenceMatrix => | -1 -1 -1 -1 0  0  |
                                    | 1  0  0  0  -1 -1 |
                                    | 0  1  1  1  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 2}, {0, 2}, {0, 2}, {1, 2}, {1, 2}}
                 weights => {-4, -1, 5}

o6 : ToricQuiver

i7 : SQ = Q^{0,1}

o7 = ToricQuiver{flow => {1, 1, 0, 0, 0, 0}                            }
                 IncidenceMatrix => | -1 -1 -1 -1 0  0  |
                                    | 1  0  0  0  -1 -1 |
                                    | 0  1  1  1  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 2}, {0, 2}, {0, 2}, {1, 2}, {1, 2}}
                 weights => {-2, 1, 1}

o7 : ToricQuiver

i8 : isClosedUnderArrows (SQ, Q)

o8 = true

i9 : 
