-- -*- M2-comint -*- hash: -2110378822

i1 : Q = toricQuiver matrix({{-1,-1,-1,-1},{1,1,0,0},{0,0,1,1}})

o1 = ToricQuiver{flow => {1, 1, 1, 1}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-4, 2, 2}

o1 : ToricQuiver

i2 : Q = toricQuiver(matrix({{-1,-1,-1,-1},{1,1,0,0},{0,0,1,1}}), {3, 1, 0, 5})

o2 = ToricQuiver{flow => {3, 1, 0, 5}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-9, 4, 5}

o2 : ToricQuiver

i3 : Q = toricQuiver {{0,1},{0,1},{0,2},{0,2}}

o3 = ToricQuiver{flow => {1, 1, 1, 1}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-4, 2, 2}

o3 : ToricQuiver

i4 : Q = toricQuiver ({{0,1},{0,1},{0,2},{0,2}}, {1,2,3,4})

o4 = ToricQuiver{flow => {1, 2, 3, 4}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-10, 3, 7}

o4 : ToricQuiver

i5 : Q = toricQuiver(matrix({{-1,-1,-1,-1},{1,1,0,0},{0,0,1,1}}), Flow=>"Canonical")

o5 = ToricQuiver{flow => {1, 1, 1, 1}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-4, 2, 2}

o5 : ToricQuiver

i6 : Q = toricQuiver(matrix({{-1,-1,-1,-1},{0,0,1,1},{1,1,0,0}}), Flow=>"Random")

o6 = ToricQuiver{flow => {24, 65, 71, 72}              }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 0  0  1  1  |
                                    | 1  1  0  0  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 2}, {0, 2}, {0, 1}, {0, 1}}
                 weights => {-232, 143, 89}

o6 : ToricQuiver

i7 : R = toricQuiver(Q)

o7 = ToricQuiver{flow => {24, 65, 71, 72}              }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 0  0  1  1  |
                                    | 1  1  0  0  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 2}, {0, 2}, {0, 1}, {0, 1}}
                 weights => {-232, 143, 89}

o7 : ToricQuiver

i8 : R = toricQuiver(Q, {1,2,3,4})

o8 = ToricQuiver{flow => {1, 2, 3, 4}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 0  0  1  1  |
                                    | 1  1  0  0  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 2}, {0, 2}, {0, 1}, {0, 1}}
                 weights => {-10, 7, 3}

o8 : ToricQuiver

i9 : 
