-- -*- M2-comint -*- hash: 2065918846

i1 : Q0 = {{0,2},{0,3},{0,4},{1,2},{1,3},{1,4}}

o1 = {{0, 2}, {0, 3}, {0, 4}, {1, 2}, {1, 3}, {1, 4}}

o1 : List

i2 : Q = toricQuiver(Q0, Flow=>"Random")

o2 = ToricQuiver{flow => {24, 65, 71, 72, 19, 19}                      }
                 IncidenceMatrix => | -1 -1 -1 0  0  0  |
                                    | 0  0  0  -1 -1 -1 |
                                    | 1  0  0  1  0  0  |
                                    | 0  1  0  0  1  0  |
                                    | 0  0  1  0  0  1  |
                 Q0 => {0, 1, 2, 3, 4}
                 Q1 => {{0, 2}, {0, 3}, {0, 4}, {1, 2}, {1, 3}, {1, 4}}
                 weights => {-160, -110, 96, 84, 90}

o2 : ToricQuiver

i3 : Q = toricQuiver matrix({{-1,-1,-1,-1},{1,1,0,0},{0,0,1,1}})

o3 = ToricQuiver{flow => {1, 1, 1, 1}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-4, 2, 2}

o3 : ToricQuiver

i4 : Q = toricQuiver(matrix({{-1,-1,-1,-1},{1,1,0,0},{0,0,1,1}}), {3, 1, 0, 5})

o4 = ToricQuiver{flow => {3, 1, 0, 5}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-9, 4, 5}

o4 : ToricQuiver

i5 : Q = toricQuiver {{0,1},{0,1},{0,2},{0,2}}

o5 = ToricQuiver{flow => {1, 1, 1, 1}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-4, 2, 2}

o5 : ToricQuiver

i6 : Q = toricQuiver ({{0,1},{0,1},{0,2},{0,2}}, {1,2,3,4})

o6 = ToricQuiver{flow => {1, 2, 3, 4}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-10, 3, 7}

o6 : ToricQuiver

i7 : Q = toricQuiver(matrix({{-1,-1,-1,-1},{1,1,0,0},{0,0,1,1}}), Flow=>"Canonical")

o7 = ToricQuiver{flow => {1, 1, 1, 1}                  }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 1  1  0  0  |
                                    | 0  0  1  1  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 1}, {0, 1}, {0, 2}, {0, 2}}
                 weights => {-4, 2, 2}

o7 : ToricQuiver

i8 : Q = toricQuiver(matrix({{-1,-1,-1,-1},{0,0,1,1},{1,1,0,0}}), Flow=>"Random")

o8 = ToricQuiver{flow => {91, 72, 93, 79}              }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 0  0  1  1  |
                                    | 1  1  0  0  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 2}, {0, 2}, {0, 1}, {0, 1}}
                 weights => {-335, 172, 163}

o8 : ToricQuiver

i9 : R = toricQuiver(Q)

o9 = ToricQuiver{flow => {91, 72, 93, 79}              }
                 IncidenceMatrix => | -1 -1 -1 -1 |
                                    | 0  0  1  1  |
                                    | 1  1  0  0  |
                 Q0 => {0, 1, 2}
                 Q1 => {{0, 2}, {0, 2}, {0, 1}, {0, 1}}
                 weights => {-335, 172, 163}

o9 : ToricQuiver

i10 : R = toricQuiver(Q, {1,2,3,4})

o10 = ToricQuiver{flow => {1, 2, 3, 4}                  }
                  IncidenceMatrix => | -1 -1 -1 -1 |
                                     | 0  0  1  1  |
                                     | 1  1  0  0  |
                  Q0 => {0, 1, 2}
                  Q1 => {{0, 2}, {0, 2}, {0, 1}, {0, 1}}
                  weights => {-10, 7, 3}

o10 : ToricQuiver

i11 : 
