-- -*- M2-comint -*- hash: 1003359971

i1 : tMacaulayExpansion(50,12,2,1)

o1 = {{10, 2}, {5, 1}}

o1 : List

i2 : tMacaulayExpansion(50,12,2,1,Shift=>true)

o2 = {{10, 3}, {5, 2}}

o2 : List

i3 : tMacaulayExpansion(50,12,2,2,Shift=>true)

o3 = {{9, 3}, {4, 2}}

o3 : List

i4 : 
