-- -*- M2-comint -*- hash: 264683765

i1 : S=QQ[x_1..x_8]

o1 = S

o1 : PolynomialRing

i2 : f={1,8,2,0,0}

o2 = {1, 8, 2, 0, 0}

o2 : List

i3 : I=tLexIdeal(S,f,2)

o3 = ideal (x x , x x , x x , x x , x x , x x , x x , x x , x x , x x , x x ,
             1 3   1 4   2 4   1 5   2 5   3 5   1 6   2 6   3 6   4 6   1 7 
     ------------------------------------------------------------------------
     x x , x x , x x , x x , x x , x x , x x , x x )
      2 7   3 7   4 7   5 7   1 8   2 8   3 8   4 8

o3 : Ideal of S

i4 : fTVector(I,2)==f

o4 = true

i5 : isTLexIdeal(I,2)

o5 = true

i6 : J=tStronglyStableIdeal(ideal {x_1*x_4*x_6},2)

o6 = ideal (x x x , x x x , x x x )
             1 3 5   1 3 6   1 4 6

o6 : Ideal of S

i7 : K=tLexIdeal(J,2)

o7 = ideal (x x x , x x x , x x x , x x x x )
             1 3 5   1 3 6   1 3 7   1 4 6 8

o7 : Ideal of S

i8 : fTVector(J,2)==fTVector(K,2)

o8 = true

i9 : 
