-- -*- M2-comint -*- hash: 1616162341

i1 : NNParser "1"

o1 = -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Parsing.m2:152:40-152:102]*-

o1 : Parser

i2 : oo null

o2 = 1

i3 : ooo "2"

o3 = -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Parsing.m2:152:40-152:102]*-

o3 : Parser

i4 : oo null

o4 = 12

i5 : ooo "3"

o5 = -*Function[../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/Parsing.m2:152:40-152:102]*-

o5 : Parser

i6 : oo null

o6 = 123

i7 : (NNParser : charAnalyzer) "123456789123456789123456789"

o7 = 123456789123456789123456789

i8 : class oo

o8 = ZZ

o8 : Ring

i9 : 
