-- -*- M2-comint -*- hash: 480546734

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : I = ideal(x*y,z*y,x*z)

o2 = ideal (x*y, y*z, x*z)

o2 : Ideal of R

i3 : isKonig(I)

o3 = false

i4 : isPacked(I)

o4 = false

i5 : noPackedAllSubs(I)

o5 = Only I is not Konig -- all proper substitutions are Konig.

i6 : R = QQ[a,b,c,d,A,B,C,D]

o6 = R

o6 : PolynomialRing

i7 : J = ideal"ABCD,cdAB,abcD,bcABD,abcBD,abcdA,abcAD,abdAC,acdBC,acBCD,abcdC,bcdAC,bcACD,bcdAD,acdBD,adBCD,acABD,bdABC,adABC"

o7 = ideal (A*B*C*D, c*d*A*B, a*b*c*D, b*c*A*B*D, a*b*c*B*D, a*b*c*d*A,
     ------------------------------------------------------------------------
     a*b*c*A*D, a*b*d*A*C, a*c*d*B*C, a*c*B*C*D, a*b*c*d*C, b*c*d*A*C,
     ------------------------------------------------------------------------
     b*c*A*C*D, b*c*d*A*D, a*c*d*B*D, a*d*B*C*D, a*c*A*B*D, b*d*A*B*C,
     ------------------------------------------------------------------------
     a*d*A*B*C)

o7 : Ideal of R

i8 : isPacked(J)

o8 = false

i9 : noPackedSub(J)

o9 = The ideal itself is not Konig!

i10 : L = substitute(J,matrix{{1,0,c,d,A,1,C,D}})

o10 = ideal (A*C*D, c*d*A, 0, 0, 0, 0, 0, 0, c*d*C, c*C*D, 0, 0, 0, 0, c*d*D,
      -----------------------------------------------------------------------
      d*C*D, c*A*D, 0, d*A*C)

o10 : Ideal of R

i11 : isKonig(L)

o11 = false

i12 : 
