-- -*- M2-comint -*- hash: 624924722

i1 : S = QQ[x,y,z];

i2 : I = ideal(x^3,x^2*y^2,x*z^3,y^4,y^2*z);

o2 : Ideal of S

i3 : J = joinIdeals(I,I)

             5   5    7   4 3   3 5   2 3 3   3 5
o3 = ideal (x , y z, y , x y , x z , x y z , x y )

o3 : Ideal of S

i4 : 
