-- -*- M2-comint -*- hash: 918827116

i1 : R = QQ[x,y,z];

i2 : I = ideal(x*y,y*z,x^2);

o2 : Ideal of R

i3 : squarefreeGens(I)

o3 = {y*z, x*y}

o3 : List

i4 : 
