-- -*- M2-comint -*- hash: -1336468134

i1 : B = QQ[x,y,z];

i2 : f = map(QQ[t],B,{t^3,t^4,t^5})

                      3   4   5
o2 = map (QQ[t], B, {t , t , t })

o2 : RingMap QQ[t] <--- B

i3 : I = ker f;

o3 : Ideal of B

i4 : symbolicPower(I,2)

             4       2     2 2   2 3    3       2 2      3   3 2    4     3 
o4 = ideal (y  - 2x*y z + x z , x y  - x y*z - y z  + x*z , x y  - x z - y z
     ------------------------------------------------------------------------
            2   5      3     2       3
     + x*y*z , x  + x*y  - 3x y*z + z )

o4 : Ideal of B

i5 : P = ker map(QQ[t],QQ[x,y,z],{t^3,t^4,t^5})

             2         2     2   3
o5 = ideal (y  - x*z, x y - z , x  - y*z)

o5 : Ideal of QQ[x..z]

i6 : isHomogeneous P

o6 = false

i7 : time symbolicPower(P,4);
     -- used 0.179049 seconds

o7 : Ideal of QQ[x..z]

i8 : Q = ker map(QQ[t],QQ[x,y,z, Degrees => {3,4,5}],{t^3,t^4,t^5})

             2         3         2     2
o8 = ideal (y  - x*z, x  - y*z, x y - z )

o8 : Ideal of QQ[x..z]

i9 : isHomogeneous Q

o9 = true

i10 : time symbolicPower(Q,4);
     -- used 0.0564897 seconds

o10 : Ideal of QQ[x..z]

i11 : 
