-- -*- M2-comint -*- hash: 602410344

i1 : R = QQ[x,y,z];

i2 : J = ideal (x*(y^3-z^3),y*(z^3-x^3),z*(x^3-y^3));

o2 : Ideal of R

i3 : waldschmidt(J, SampleSize=>5)

o3 = 3

o3 : QQ

i4 : 
