-- -*- M2-comint -*- hash: -550313230

i1 : R = QQ[x,y,z];

i2 : I = ideal(x*y,y*z,x*z);

o2 : Ideal of R

i3 : waldschmidt(I)

     3
o3 = -
     2

o3 : QQ

i4 : R = QQ[x,y,z];

i5 : J = ideal (x*(y^3-z^3),y*(z^3-x^3),z*(x^3-y^3));

o5 : Ideal of R

i6 : waldschmidt(J, SampleSize=>5)

o6 = 3

o6 : QQ

i7 : 
