-- -*- M2-comint -*- hash: 528426052

i1 : R = QQ[x_(1,1)..x_(3,3)]

o1 = R

o1 : PolynomialRing

i2 : G = genericMatrix(R,3,3)

o2 = | x_(1,1) x_(2,1) x_(3,1) |
     | x_(1,2) x_(2,2) x_(3,2) |
     | x_(1,3) x_(2,3) x_(3,3) |

             3       3
o2 : Matrix R  <--- R

i3 : I1 = minors(1,G)

o3 = ideal (x   , x   , x   , x   , x   , x   , x   , x   , x   )
             1,1   1,2   1,3   2,1   2,2   2,3   3,1   3,2   3,3

o3 : Ideal of R

i4 : JI1 = jets(1,I1)

o4 = ideal (x1   , x0   , x1   , x0   , x1   , x0   , x1   , x0   , x1   ,
              1,1    1,1    1,2    1,2    1,3    1,3    2,1    2,1    2,2 
     ------------------------------------------------------------------------
     x0   , x1   , x0   , x1   , x0   , x1   , x0   , x1   , x0   )
       2,2    2,3    2,3    3,1    3,1    3,2    3,2    3,3    3,3

o4 : Ideal of QQ[x0   ..x0   ][x1   ..x1   ]
                   1,1    3,3    1,1    3,3

i5 : dim JI1, isPrime JI1

o5 = (0, true)

o5 : Sequence

i6 : I3 = minors(3,G)

o6 = ideal(- x   x   x    + x   x   x    + x   x   x    - x   x   x    -
              1,3 2,2 3,1    1,2 2,3 3,1    1,3 2,1 3,2    1,1 2,3 3,2  
     ------------------------------------------------------------------------
     x   x   x    + x   x   x   )
      1,2 2,1 3,3    1,1 2,2 3,3

o6 : Ideal of R

i7 : JI3 = jets(1,I3)

o7 = ideal ((- x0   x0    + x0   x0   )x1    + (x0   x0    - x0   x0   )x1   
                 2,3  3,2     2,2  3,3   1,1      2,3  3,1     2,1  3,3   1,2
     ------------------------------------------------------------------------
     + (- x0   x0    + x0   x0   )x1    + (x0   x0    - x0   x0   )x1    + (-
            2,2  3,1     2,1  3,2   1,3      1,3  3,2     1,2  3,3   2,1     
     ------------------------------------------------------------------------
     x0   x0    + x0   x0   )x1    + (x0   x0    - x0   x0   )x1    + (-
       1,3  3,1     1,1  3,3   2,2      1,2  3,1     1,1  3,2   2,3     
     ------------------------------------------------------------------------
     x0   x0    + x0   x0   )x1    + (x0   x0    - x0   x0   )x1    + (-
       1,3  2,2     1,2  2,3   3,1      1,3  2,1     1,1  2,3   3,2     
     ------------------------------------------------------------------------
     x0   x0    + x0   x0   )x1   , - x0   x0   x0    + x0   x0   x0    +
       1,2  2,1     1,1  2,2   3,3      1,3  2,2  3,1     1,2  2,3  3,1  
     ------------------------------------------------------------------------
     x0   x0   x0    - x0   x0   x0    - x0   x0   x0    + x0   x0   x0   )
       1,3  2,1  3,2     1,1  2,3  3,2     1,2  2,1  3,3     1,1  2,2  3,3

o7 : Ideal of QQ[x0   ..x0   ][x1   ..x1   ]
                   1,1    3,3    1,1    3,3

i8 : isPrime JI3

o8 = true

i9 : I2 = minors(2,G)

o9 = ideal (- x   x    + x   x   , - x   x    + x   x   , - x   x    +
               1,2 2,1    1,1 2,2     1,3 2,1    1,1 2,3     1,3 2,2  
     ------------------------------------------------------------------------
     x   x   , - x   x    + x   x   , - x   x    + x   x   , - x   x    +
      1,2 2,3     1,2 3,1    1,1 3,2     1,3 3,1    1,1 3,3     1,3 3,2  
     ------------------------------------------------------------------------
     x   x   , - x   x    + x   x   , - x   x    + x   x   , - x   x    +
      1,2 3,3     2,2 3,1    2,1 3,2     2,3 3,1    2,1 3,3     2,3 3,2  
     ------------------------------------------------------------------------
     x   x   )
      2,2 3,3

o9 : Ideal of R

i10 : JI2 = jets(1,I2)

o10 = ideal (x0   x1    - x0   x1    - x0   x1    + x0   x1   , - x0   x0   
               2,2  1,1     2,1  1,2     1,2  2,1     1,1  2,2      1,2  2,1
      -----------------------------------------------------------------------
      + x0   x0   , x0   x1    - x0   x1    - x0   x1    + x0   x1   , -
          1,1  2,2    2,3  1,1     2,1  1,3     1,3  2,1     1,1  2,3   
      -----------------------------------------------------------------------
      x0   x0    + x0   x0   , x0   x1    - x0   x1    - x0   x1    +
        1,3  2,1     1,1  2,3    2,3  1,2     2,2  1,3     1,3  2,2  
      -----------------------------------------------------------------------
      x0   x1   , - x0   x0    + x0   x0   , x0   x1    - x0   x1    -
        1,2  2,3      1,3  2,2     1,2  2,3    3,2  1,1     3,1  1,2  
      -----------------------------------------------------------------------
      x0   x1    + x0   x1   , - x0   x0    + x0   x0   , x0   x1    -
        1,2  3,1     1,1  3,2      1,2  3,1     1,1  3,2    3,3  1,1  
      -----------------------------------------------------------------------
      x0   x1    - x0   x1    + x0   x1   , - x0   x0    + x0   x0   ,
        3,1  1,3     1,3  3,1     1,1  3,3      1,3  3,1     1,1  3,3 
      -----------------------------------------------------------------------
      x0   x1    - x0   x1    - x0   x1    + x0   x1   , - x0   x0    +
        3,3  1,2     3,2  1,3     1,3  3,2     1,2  3,3      1,3  3,2  
      -----------------------------------------------------------------------
      x0   x0   , x0   x1    - x0   x1    - x0   x1    + x0   x1   , -
        1,2  3,3    3,2  2,1     3,1  2,2     2,2  3,1     2,1  3,2   
      -----------------------------------------------------------------------
      x0   x0    + x0   x0   , x0   x1    - x0   x1    - x0   x1    +
        2,2  3,1     2,1  3,2    3,3  2,1     3,1  2,3     2,3  3,1  
      -----------------------------------------------------------------------
      x0   x1   , - x0   x0    + x0   x0   , x0   x1    - x0   x1    -
        2,1  3,3      2,3  3,1     2,1  3,3    3,3  2,2     3,2  2,3  
      -----------------------------------------------------------------------
      x0   x1    + x0   x1   , - x0   x0    + x0   x0   )
        2,3  3,2     2,2  3,3      2,3  3,2     2,2  3,3

o10 : Ideal of QQ[x0   ..x0   ][x1   ..x1   ]
                    1,1    3,3    1,1    3,3

i11 : P = primaryDecomposition JI2; #P

o12 = 2

i13 : P_1

o13 = ideal (x0   , x0   , x0   , x0   , x0   , x0   , x0   , x0   , x0   )
               3,3    3,2    3,1    2,3    2,2    2,1    1,3    1,2    1,1

o13 : Ideal of QQ[x0   ..x0   ][x1   ..x1   ]
                    1,1    3,3    1,1    3,3

i14 : radical JI2 == JI2

o14 = true

i15 : P_0 == principalComponent(1,I2,Saturate=>false)

o15 = true

i16 : P_0

o16 = ideal (x0   x0    - x0   x0   , x0   x0    - x0   x0   , x0   x0    -
               2,3  3,2     2,2  3,3    1,3  3,2     1,2  3,3    2,3  3,1  
      -----------------------------------------------------------------------
      x0   x0   , x0   x0    - x0   x0   , x0   x0    - x0   x0   ,
        2,1  3,3    2,2  3,1     2,1  3,2    1,3  3,1     1,1  3,3 
      -----------------------------------------------------------------------
      x0   x0    - x0   x0   , x0   x0    - x0   x0   , x0   x0    -
        1,2  3,1     1,1  3,2    1,3  2,2     1,2  2,3    1,3  2,1  
      -----------------------------------------------------------------------
      x0   x0   , x0   x0    - x0   x0   , x0   x1    - x0   x1    -
        1,1  2,3    1,2  2,1     1,1  2,2    3,3  2,2     3,2  2,3  
      -----------------------------------------------------------------------
      x0   x1    + x0   x1   , x0   x1    - x0   x1    - x0   x1    +
        2,3  3,2     2,2  3,3    3,3  2,1     3,1  2,3     2,3  3,1  
      -----------------------------------------------------------------------
      x0   x1   , x0   x1    - x0   x1    - x0   x1    + x0   x1   ,
        2,1  3,3    3,2  2,1     3,1  2,2     2,2  3,1     2,1  3,2 
      -----------------------------------------------------------------------
      x0   x1    - x0   x1    - x0   x1    + x0   x1   , x0   x1    -
        3,3  1,2     3,2  1,3     1,3  3,2     1,2  3,3    2,3  1,2  
      -----------------------------------------------------------------------
      x0   x1    - x0   x1    + x0   x1   , x0   x1    - x0   x1    -
        2,2  1,3     1,3  2,2     1,2  2,3    3,3  1,1     3,1  1,3  
      -----------------------------------------------------------------------
      x0   x1    + x0   x1   , x0   x1    - x0   x1    - x0   x1    +
        1,3  3,1     1,1  3,3    3,2  1,1     3,1  1,2     1,2  3,1  
      -----------------------------------------------------------------------
      x0   x1   , x0   x1    - x0   x1    - x0   x1    + x0   x1   ,
        1,1  3,2    2,3  1,1     2,1  1,3     1,3  2,1     1,1  2,3 
      -----------------------------------------------------------------------
      x0   x1    - x0   x1    - x0   x1    + x0   x1   , x1   x1   x1    -
        2,2  1,1     2,1  1,2     1,2  2,1     1,1  2,2    1,3  2,2  3,1  
      -----------------------------------------------------------------------
      x1   x1   x1    - x1   x1   x1    + x1   x1   x1    + x1   x1   x1    -
        1,2  2,3  3,1     1,3  2,1  3,2     1,1  2,3  3,2     1,2  2,1  3,3  
      -----------------------------------------------------------------------
      x1   x1   x1   )
        1,1  2,2  3,3

o16 : Ideal of QQ[x0   ..x0   ][x1   ..x1   ]
                    1,1    3,3    1,1    3,3

i17 : apply({P_0,I2}, X -> hilbertSeries(X,Reduce=>true))

                   2     3    4            2
       1 + 8T + 18T  + 8T  + T   1 + 4T + T
o17 = {------------------------, -----------}
                      10                  5
               (1 - T)             (1 - T)

o17 : List

i18 : numerator (first oo) == (numerator last oo)^2

o18 = true

i19 : 
