-- -*- M2-comint -*- hash: 1107772440

i1 : R = QQ[x,y]

o1 = R

o1 : PolynomialRing

i2 : I = ideal (x^3 + y^3 - 3*x*y)

            3    3
o2 = ideal(x  + y  - 3x*y)

o2 : Ideal of R

i3 : J = jets(3,I);

o3 : Ideal of QQ[x0, y0][x1, y1][x2, y2][x3, y3]

i4 : netList J_*

     +-----------------------------------------------------------------------------------+
     |    2                2                                                      3     3|
o4 = |(3x0  - 3y0)x3 + (3y0  - 3x0)y3 + (6x0*x1 - 3y1)x2 + (- 3x1 + 6y0*y1)y2 + x1  + y1 |
     +-----------------------------------------------------------------------------------+
     |    2                2                  2                  2                       |
     |(3x0  - 3y0)x2 + (3y0  - 3x0)y2 + 3x0*x1  - 3x1*y1 + 3y0*y1                        |
     +-----------------------------------------------------------------------------------+
     |    2                2                                                             |
     |(3x0  - 3y0)x1 + (3y0  - 3x0)y1                                                    |
     +-----------------------------------------------------------------------------------+
     |  3     3                                                                          |
     |x0  + y0  - 3x0*y0                                                                 |
     +-----------------------------------------------------------------------------------+

i5 : R = QQ[x,y,z]

o5 = R

o5 : PolynomialRing

i6 : I = ideal (y-x^2, z-x^3)

               2         3
o6 = ideal (- x  + y, - x  + z)

o6 : Ideal of R

i7 : JI = jets(2,I)

                              2                     2            2         
o7 = ideal (- 2x0*x2 + y2 - x1 , - 2x0*x1 + y1, - x0  + y0, - 3x0 x2 + z2 -
     ------------------------------------------------------------------------
           2       2             3
     3x0*x1 , - 3x0 x1 + z1, - x0  + z0)

o7 : Ideal of QQ[x0, y0, z0][x1, y1, z1][x2, y2, z2]

i8 : isHomogeneous JI

o8 = false

i9 : JIproj = jets(2,I,Projective=>true)

                              2                     2            2         
o9 = ideal (- 2x0*x2 + y2 - x1 , - 2x0*x1 + y1, - x0  + y0, - 3x0 x2 + z2 -
     ------------------------------------------------------------------------
           2       2             3
     3x0*x1 , - 3x0 x1 + z1, - x0  + z0)

o9 : Ideal of QQ[x0, y0, z0][x1, y1, z1][x2, y2, z2]

i10 : isHomogeneous JIproj

o10 = true

i11 : 
