-- -*- M2-comint -*- hash: -945469931

i1 : R = QQ[x,y,z,Degrees=>{2,1,3}]

o1 = R

o1 : PolynomialRing

i2 : JR = jets(2,R)

o2 = JR

o2 : PolynomialRing

i3 : describe JR

o3 = QQ[x0, y0, z0][x1, y1, z1][x2, y2, z2, Degrees => {2, 1, 3}, Heft => {1}, Join => false, MonomialOrder => {MonomialSize => 32  }]
                                                                                                               {GRevLex => {2, 1, 3}}
                                                                                                               {Position => Up      }

i4 : degrees (flattenRing JR)_0

o4 = {{2}, {1}, {3}, {2}, {1}, {3}, {2}, {1}, {3}}

o4 : List

i5 : R = QQ[x,y,z,Degrees=>{2,1,3}]

o5 = R

o5 : PolynomialRing

i6 : JR = jets(2,R,Projective=>true)

o6 = JR

o6 : PolynomialRing

i7 : degrees (flattenRing JR)_0

o7 = {{2}, {2}, {2}, {1}, {1}, {1}, {0}, {0}, {0}}

o7 : List

i8 : A = QQ[a_1..a_3]

o8 = A

o8 : PolynomialRing

i9 : JA = jets(1,A)

o9 = JA

o9 : PolynomialRing

i10 : describe JA

o10 = QQ[a0 ..a0 ][a1 ..a1 , Degrees => {3:1}, Heft => {1}, Join => false]
           1    3    1    3

i11 : Zi = ZZ[i]/ideal(i^2+1)

o11 = Zi

o11 : QuotientRing

i12 : B = Zi[b_1..b_3]

o12 = B

o12 : PolynomialRing

i13 : JB = jets(1,B)

o13 = JB

o13 : PolynomialRing

i14 : describe JB

o14 = Zi[b0 ..b0 ][b1 ..b1 , Degrees => {3:{1}}, Heft => {1, 0}, Join => false]
           1    3    1    3                {0}

i15 : 
