-- -*- M2-comint -*- hash: -270136609

i1 : R = QQ[x,y];

i2 : I = ideal(y^2-x^3);

o2 : Ideal of R

i3 : Q = R/I;

i4 : JQ = jets(2,Q);

i5 : describe JQ

                          QQ[x0, y0][x1, y1][x2, y2]
o5 = -------------------------------------------------------------------
           2                    2     2       2                 3     2
     (- 3x0 x2 + 2y0*y2 - 3x0*x1  + y1 , - 3x0 x1 + 2y0*y1, - x0  + y0 )

i6 : 
