-- -*- M2-comint -*- hash: 849786612

i1 : S = ZZ[x_0..x_6];

i2 : R = ZZ[y_0..y_2];

i3 : Torus = smallManifold(2,7,6,S);

i4 : Circle = simplicialComplex{R_0*R_1, R_0*R_2, R_1*R_2};

i5 : f1 = map(Torus,Circle,matrix{{S_3,S_6,S_5}});

o5 : SimplicialMap simplicialComplex | x_2x_5x_6 x_0x_5x_6 x_1x_4x_6 x_0x_4x_6 x_2x_3x_6 x_1x_3x_6 x_3x_4x_5 x_1x_4x_5 x_0x_3x_5 x_1x_2x_5 x_2x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 | <--- simplicialComplex | y_1y_2 y_0y_2 y_0y_1 |

i6 : f2 = map(Torus,Circle,matrix{{S_0,S_2,S_3}});

o6 : SimplicialMap simplicialComplex | x_2x_5x_6 x_0x_5x_6 x_1x_4x_6 x_0x_4x_6 x_2x_3x_6 x_1x_3x_6 x_3x_4x_5 x_1x_4x_5 x_0x_3x_5 x_1x_2x_5 x_2x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 | <--- simplicialComplex | y_1y_2 y_0y_2 y_0y_1 |

i7 : prune homology(1, f1)

o7 = | 1 |
     | 0 |

              2        1
o7 : Matrix ZZ  <--- ZZ

i8 : prune homology(1, f2)

o8 = | 0 |
     | 1 |

              2        1
o8 : Matrix ZZ  <--- ZZ

i9 : 
