-- -*- M2-comint -*- hash: -868358061

i1 : S = ZZ[x_0..x_4];

i2 : Δ = skeleton(2, simplexComplex(3,S));

i3 : prune cohomology(1, Δ)

o3 = 0

o3 : ZZ-module

i4 : prune cohomology(2, Δ)

       1
o4 = ZZ

o4 : ZZ-module, free

i5 : figureEight = simplicialComplex {x_0*x_1, x_0*x_2, x_1*x_2, x_2*x_3, x_2*x_4, x_3*x_4}

o5 = simplicialComplex | x_3x_4 x_2x_4 x_2x_3 x_1x_2 x_0x_2 x_0x_1 |

o5 : SimplicialComplex

i6 : prune cohomology(1, figureEight)

       2
o6 = ZZ

o6 : ZZ-module, free

i7 : 
