-- -*- M2-comint -*- hash: -1690526761

i1 : S = ZZ[a..h];

i2 : Δ = bartnetteSphereComplex S;

i3 : matrix {facets Δ}

o3 = | defh befh cdfh bcfh adeh abeh acdh abch defg cefg adfg acfg bdeg bceg
     ------------------------------------------------------------------------
     abdg abcg bcef acdf abde |

             1       19
o3 : Matrix S  <--- S

i4 : dim Δ

o4 = 3

i5 : fVector Δ

o5 = {1, 8, 27, 38, 19}

o5 : List

i6 : assert(dim Δ === 3 and isPure Δ)

i7 : assert(ideal Δ === ideal(b*c*d, a*c*e, c*d*e, a*b*f, b*d*f, a*e*f,
             c*d*g, a*e*g, b*f*g, b*d*h, c*e*h, a*f*h, g*h))

i8 : assert(fVector Δ === {1,8,27,38,19})

i9 : R = QQ[x_0..x_10];

i10 : Γ = bartnetteSphereComplex R;

i11 : monomialIdeal Γ

o11 = monomialIdeal (x x x , x x x , x x x , x x x , x x x , x x x , x x x ,
                      1 2 3   0 2 4   2 3 4   0 1 5   1 3 5   0 4 5   2 3 6 
      -----------------------------------------------------------------------
      x x x , x x x , x x x , x x x , x x x , x x , x , x , x  )
       0 4 6   1 5 6   1 3 7   2 4 7   0 5 7   6 7   8   9   10

o11 : MonomialIdeal of R

i12 : assert(dim Γ === 3 and isPure Γ)

i13 : 
