-- -*- M2-comint -*- hash: -804065527

i1 : R = ZZ/101[x_0..x_4];

i2 : S = ZZ/101[a,b,c,d,e];

i3 : I = monomialIdeal(x_1^2, x_2^2, x_3^2, x_1*x_3, x_2*x_4);

o3 : MonomialIdeal of R

i4 : B1 = buchbergerSimplicialComplex(I,S)

o4 = simplicialComplex | acde abcd |

o4 : SimplicialComplex

i5 : BRes = chainComplex(B1, Labels => first entries mingens I)

      1      5      9      7      2
o5 = R  <-- R  <-- R  <-- R  <-- R
                                  
     0      1      2      3      4

o5 : ChainComplex

i6 : HH_0(BRes)

o6 = cokernel | x_2x_4 x_3^2 x_1x_3 x_2^2 x_1^2 |

                            1
o6 : R-module, quotient of R

i7 : all(1..dim B1+1, i -> prune HH_i(BRes) == 0)

o7 = true

i8 : BRes == buchbergerResolution(I)

o8 = true

i9 : L = {x_1*x_2, x_1*x_3*x_4, x_0*x_2*x_4};

i10 : B2 = buchbergerSimplicialComplex(L,S)

o10 = simplicialComplex | abc |

o10 : SimplicialComplex

i11 : 
