-- -*- M2-comint -*- hash: 76484365

i1 : S = ZZ[x_0..x_5];

i2 : Δ = simplicialComplex monomialIdeal(x_0*x_5, x_1*x_4, x_2*x_3)

o2 = simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 |

o2 : SimplicialComplex

i3 : Γ = simplicialComplex monomialIdeal(x_1*x_2)

o3 = simplicialComplex | x_0x_2x_3x_4x_5 x_0x_1x_3x_4x_5 |

o3 : SimplicialComplex

i4 : f = map(Γ, Δ, {x_0,x_0,x_1,x_2,x_3,x_3})

o4 = | x_0 x_0 x_1 x_2 x_3 x_3 |

o4 : SimplicialMap simplicialComplex | x_0x_2x_3x_4x_5 x_0x_1x_3x_4x_5 | <--- simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 |

i5 : F = chainComplex f

            1              1
o5 = -1 : ZZ  <--------- ZZ  : -1
                 | 1 |

           6                        6
     0 : ZZ  <------------------- ZZ  : 0
                | 1 1 0 0 0 0 |
                | 0 0 1 0 0 0 |
                | 0 0 0 1 0 0 |
                | 0 0 0 0 1 1 |
                | 0 0 0 0 0 0 |
                | 0 0 0 0 0 0 |

           14                                    12
     1 : ZZ   <------------------------------- ZZ   : 1
                 | 0 1 0 0 1 0 0 0 0 0 0 0 |
                 | 0 0 1 0 0 1 0 0 0 0 0 0 |
                 | 0 0 0 1 0 0 1 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 1 1 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 1 1 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 0 0 0 0 |

           16                            8
     2 : ZZ   <----------------------- ZZ  : 2
                 | 0 0 1 0 1 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 1 0 1 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |
                 | 0 0 0 0 0 0 0 0 |

o5 : ChainComplexMap

i6 : S' = ZZ[y_0..y_5];

i7 : fish = simplicialComplex {y_0*y_1*y_2, y_1*y_2*y_3, y_3*y_4*y_5}

o7 = simplicialComplex | y_3y_4y_5 y_1y_2y_3 y_0y_1y_2 |

o7 : SimplicialComplex

i8 : S'' = ZZ[z_0,z_1,z_2];

i9 : fishface = simplicialComplex {z_0*z_1*z_2}

o9 = simplicialComplex | z_0z_1z_2 |

o9 : SimplicialComplex

i10 : f = map(fish,fishface,{y_0,y_1,y_2});

o10 : SimplicialMap simplicialComplex | y_3y_4y_5 y_1y_2y_3 y_0y_1y_2 | <--- simplicialComplex | z_0z_1z_2 |

i11 : F = chainComplex f

             1              1
o11 = -1 : ZZ  <--------- ZZ  : -1
                  | 1 |

            6                  3
      0 : ZZ  <------------- ZZ  : 0
                 | 1 0 0 |
                 | 0 1 0 |
                 | 0 0 1 |
                 | 0 0 0 |
                 | 0 0 0 |
                 | 0 0 0 |

            8                  3
      1 : ZZ  <------------- ZZ  : 1
                 | 1 0 0 |
                 | 0 1 0 |
                 | 0 0 1 |
                 | 0 0 0 |
                 | 0 0 0 |
                 | 0 0 0 |
                 | 0 0 0 |
                 | 0 0 0 |

            3              1
      2 : ZZ  <--------- ZZ  : 2
                 | 1 |
                 | 0 |
                 | 0 |

o11 : ChainComplexMap

i12 : kernel F == 0

o12 = true

i13 : 
