-- -*- M2-comint -*- hash: 1222111316

i1 : S = QQ[x_0..x_6];

i2 : Δ = simplicialComplex {x_0*x_1, x_1*x_2, x_3*x_4, x_4*x_5, x_5*x_6}

o2 = simplicialComplex | x_5x_6 x_4x_5 x_3x_4 x_1x_2 x_0x_1 |

o2 : SimplicialComplex

i3 : C = connectedComponents Δ

o3 = {simplicialComplex | x_1x_2 x_0x_1 |, simplicialComplex | x_5x_6 x_4x_5
     ------------------------------------------------------------------------
     x_3x_4 |}

o3 : List

i4 : assert all(C, Γ -> connectedComponents Γ === {Γ})

i5 : void = simplicialComplex monomialIdeal(1_S)

o5 = simplicialComplex 0

o5 : SimplicialComplex

i6 : connectedComponents void

o6 = {simplicialComplex 0}

o6 : List

i7 : assert({void} === connectedComponents void)

i8 : irrelevant = simplicialComplex {1_S}

o8 = simplicialComplex | 1 |

o8 : SimplicialComplex

i9 : connectedComponents irrelevant

o9 = {simplicialComplex | 1 |}

o9 : List

i10 : assert({irrelevant} === connectedComponents irrelevant)

i11 : 
