-- -*- M2-comint -*- hash: -1019632067

i1 : R = ZZ/103[x_0..x_3];

i2 : Δ = simplicialComplex{R_0*R_1*R_2,R_0*R_2*R_3,R_0*R_1*R_3}

o2 = simplicialComplex | x_0x_2x_3 x_0x_1x_3 x_0x_1x_2 |

o2 : SimplicialComplex

i3 : C1 = elementaryCollapse(Δ,R_1*R_2)

o3 = simplicialComplex | x_0x_2x_3 x_0x_1x_3 |

o3 : SimplicialComplex

i4 : C2 = elementaryCollapse(C1,R_2*R_3)

o4 = simplicialComplex | x_0x_2 x_0x_1x_3 |

o4 : SimplicialComplex

i5 : C3 = elementaryCollapse(C2,R_1*R_3)

o5 = simplicialComplex | x_0x_3 x_0x_2 x_0x_1 |

o5 : SimplicialComplex

i6 : C4 = elementaryCollapse(C3,R_1)

o6 = simplicialComplex | x_0x_3 x_0x_2 |

o6 : SimplicialComplex

i7 : C5 = elementaryCollapse(C4,R_2)

o7 = simplicialComplex | x_0x_3 |

o7 : SimplicialComplex

i8 : C6 = elementaryCollapse(C5,R_3)

o8 = simplicialComplex | x_0 |

o8 : SimplicialComplex

i9 : 
