-- -*- M2-comint -*- hash: -1965349202

i1 : S = ZZ[x_0..x_6];

i2 : netList for n from -1 to 6 list fVector simplexComplex(n, S)

     +-+-+--+--+--+--+-+-+
o2 = |1| |  |  |  |  | | |
     +-+-+--+--+--+--+-+-+
     |1|1|  |  |  |  | | |
     +-+-+--+--+--+--+-+-+
     |1|2|1 |  |  |  | | |
     +-+-+--+--+--+--+-+-+
     |1|3|3 |1 |  |  | | |
     +-+-+--+--+--+--+-+-+
     |1|4|6 |4 |1 |  | | |
     +-+-+--+--+--+--+-+-+
     |1|5|10|10|5 |1 | | |
     +-+-+--+--+--+--+-+-+
     |1|6|15|20|15|6 |1| |
     +-+-+--+--+--+--+-+-+
     |1|7|21|35|35|21|7|1|
     +-+-+--+--+--+--+-+-+

i3 : assert all(1..7, i -> (fVector simplexComplex(6,S))#i === binomial(7,i))

i4 : S = ZZ[x_1..x_16];

i5 : fVector bartnetteSphereComplex S

o5 = {1, 8, 27, 38, 19}

o5 : List

i6 : fVector bjornerComplex S

o6 = {1, 6, 15, 11}

o6 : List

i7 : fVector dunceHatComplex S

o7 = {1, 8, 24, 17}

o7 : List

i8 : fVector poincareSphereComplex S

o8 = {1, 16, 106, 180, 90}

o8 : List

i9 : fVector rudinBallComplex S

o9 = {1, 14, 66, 94, 41}

o9 : List

i10 : irrelevant = simplicialComplex monomialIdeal gens S

o10 = simplicialComplex | 1 |

o10 : SimplicialComplex

i11 : fVector irrelevant

o11 = {1}

o11 : List

i12 : assert(fVector irrelevant === {1})

i13 : void = simplicialComplex monomialIdeal 1_S

o13 = simplicialComplex 0

o13 : SimplicialComplex

i14 : fVector void

o14 = {0}

o14 : List

i15 : assert(fVector void === {0})

i16 : 
