-- -*- M2-comint -*- hash: 1824398977

i1 : S = ZZ[a..e];

i2 : Δ = simplicialComplex monomialIdeal (a*b*c*d*e)

o2 = simplicialComplex | bcde acde abde abce abcd |

o2 : SimplicialComplex

i3 : facets Δ

o3 = {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}

o3 : List

i4 : assert (facets Δ == {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}
         and isPure Δ and dim Δ === 3)

i5 : Γ = simplicialComplex {e, c*d, b*d, a*b*c}

o5 = simplicialComplex | e cd bd abc |

o5 : SimplicialComplex

i6 : facets Γ

o6 = {e, c*d, b*d, a*b*c}

o6 : List

i7 : assert (facets Γ == {e, c*d, b*d, a*b*c} and
         ideal Γ == ideal (a*d, b*c*d, a*e, b*e, c*e, d*e) and
         not isPure Γ and dim Γ === 2)

i8 : irrelevant = simplicialComplex {1_S}

o8 = simplicialComplex | 1 |

o8 : SimplicialComplex

i9 : facets irrelevant

o9 = {1}

o9 : List

i10 : void = simplicialComplex monomialIdeal 1_S

o10 = simplicialComplex 0

o10 : SimplicialComplex

i11 : facets void

o11 = {}

o11 : List

i12 : assert (facets irrelevant == {1_S} and facets void == {})

i13 : peek Δ

o13 = SimplicialComplex{cache => CacheTable{...1...}                           }
                        facets => {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}
                        monomialIdeal => monomialIdeal(a*b*c*d*e)
                        ring => S

i14 : 
