-- -*- M2-comint -*- hash: 733545534

i1 : S = QQ[a,b,c, DegreeRank => 3];

i2 : degrees S

o2 = {{1, 0, 0}, {0, 1, 0}, {0, 0, 1}}

o2 : List

i3 : Δ = simplexComplex(2, S)

o3 = simplicialComplex | abc |

o3 : SimplicialComplex

i4 : flagfVector Δ

o4 = HashTable{{0, 0, 0} => 1}
               {0, 0, 1} => 1
               {0, 1, 0} => 1
               {0, 1, 1} => 1
               {1, 0, 0} => 1
               {1, 0, 1} => 1
               {1, 1, 0} => 1
               {1, 1, 1} => 1

o4 : HashTable

i5 : R = ZZ[a..e, Degrees => {{1,0,0},{0,1,0},{0,0,1},{1,0,0},{0,1,0}}];

i6 : Γ = simplicialComplex {a*b*c, c*d*e}

o6 = simplicialComplex | cde abc |

o6 : SimplicialComplex

i7 : assert isProper Γ

i8 : flagfVector Γ

o8 = HashTable{{0, 0, 0} => 1}
               {0, 0, 1} => 1
               {0, 1, 0} => 2
               {0, 1, 1} => 2
               {1, 0, 0} => 2
               {1, 0, 1} => 2
               {1, 1, 0} => 2
               {1, 1, 1} => 2

o8 : HashTable

i9 : fVector Γ

o9 = {1, 5, 6, 2}

o9 : List

i10 : apply(toList(-1..dim Γ), i -> (
          F := flagfVector Γ;
          sum for L in keys F list if sum L == i+1 then F#L else 0))

o10 = {1, 5, 6, 2}

o10 : List

i11 : assert(oo === fVector Γ)

i12 : 
