-- -*- M2-comint -*- hash: -1426716353

i1 : S = ZZ[x_0..x_5];

i2 : Δ = simplicialComplex {x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_5,x_5*x_0}

o2 = simplicialComplex | x_4x_5 x_0x_5 x_3x_4 x_2x_3 x_1x_2 x_0x_1 |

o2 : SimplicialComplex

i3 : Γ = simplicialComplex {x_0*x_1}

o3 = simplicialComplex | x_0x_1 |

o3 : SimplicialComplex

i4 : prune homology Δ

o4 = -1 : 0  

      0 : 0  

            1
      1 : ZZ

o4 : GradedModule

i5 : prune homology(Δ, Γ)

o5 = -1 : 0  

      0 : 0  

            1
      1 : ZZ

o5 : GradedModule

i6 : assert(prune homology(Δ, Γ) == prune homology Δ)

i7 : S = ZZ[y_0..y_4];

i8 : Δ = simplicialComplex {y_0*y_1*y_3, y_0*y_2*y_3, y_1*y_2*y_3,
                            y_0*y_1*y_4, y_0*y_2*y_4, y_1*y_2*y_4}

o8 = simplicialComplex | y_1y_2y_4 y_0y_2y_4 y_0y_1y_4 y_1y_2y_3 y_0y_2y_3 y_0y_1y_3 |

o8 : SimplicialComplex

i9 : prune homology Δ

o9 = -1 : 0  

      0 : 0  

      1 : 0  

            1
      2 : ZZ

o9 : GradedModule

i10 : Γ = simplicialComplex {y_3, y_4}

o10 = simplicialComplex | y_4 y_3 |

o10 : SimplicialComplex

i11 : prune homology(Δ, Γ)

o11 = -1 : 0  

       0 : 0  

             1
       1 : ZZ

             1
       2 : ZZ

o11 : GradedModule

i12 : 
