-- -*- M2-comint -*- hash: 212867596

i1 : S = ZZ[a..e];

i2 : Δ = simplexComplex(4, S)

o2 = simplicialComplex | abcde |

o2 : SimplicialComplex

i3 : f = id_Δ

o3 = | a b c d e |

o3 : SimplicialMap simplicialComplex | abcde | <--- simplicialComplex | abcde |

i4 : assert (isWellDefined f and source f === Δ and
         target f === Δ and matrix f === vars S)

i5 : R = ZZ[x_0..x_5];

i6 : Γ = simplicialComplex monomialIdeal(x_0*x_5, x_1*x_4, x_2*x_3)

o6 = simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 |

o6 : SimplicialComplex

i7 : g = id_Γ

o7 = | x_0 x_1 x_2 x_3 x_4 x_5 |

o7 : SimplicialMap simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 | <--- simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 |

i8 : assert (isWellDefined g and source g === Γ and
         target g === Γ and matrix g === vars R)

i9 : 
