-- -*- M2-comint -*- hash: -1128461916

i1 : S = ZZ[a..e];

i2 : Δ = simplicialComplex {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}

o2 = simplicialComplex | bcde acde abde abce abcd |

o2 : SimplicialComplex

i3 : I = ideal Δ

o3 = ideal(a*b*c*d*e)

o3 : Ideal of S

i4 : dim Δ

o4 = 3

i5 : assert (I == ideal a*b*c*d*e and instance(I, Ideal) and
         numgens I === 1 and dim Δ === 3)

i6 : Γ = simplicialComplex {e, c*d, b*d, a*b*c}

o6 = simplicialComplex | e cd bd abc |

o6 : SimplicialComplex

i7 : J = ideal Γ

o7 = ideal (a*d, b*c*d, a*e, b*e, c*e, d*e)

o7 : Ideal of S

i8 : assert (J == ideal (a*d, b*c*d, a*e, b*e, c*e, d*e) and
         dim Γ === 2 and instance(J, Ideal))

i9 : irrelevant = simplicialComplex {1_S};

i10 : M = ideal irrelevant

o10 = ideal (a, b, c, d, e)

o10 : Ideal of S

i11 : assert (M == ideal gens S and instance(M, Ideal))

i12 : void = simplicialComplex monomialIdeal 1_S

o12 = simplicialComplex 0

o12 : SimplicialComplex

i13 : U = ideal void

o13 = ideal 1

o13 : Ideal of S

i14 : assert (U == ideal 1_S and instance (U, Ideal))

i15 : printWidth = 250;

i16 : code (ideal, SimplicialComplex)

o16 = -- code for method: ideal(SimplicialComplex)
      ../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/SimplicialComplexes/Code.m2:19:39-19:50: --source code:
      ideal SimplicialComplex := Ideal => D -> ideal D.monomialIdeal

i17 : code (monomialIdeal, SimplicialComplex)

o17 = -- code for method: monomialIdeal(SimplicialComplex)
      ../../macaulay2-20230205-25510-hsiem6/M2-release-1.21/M2/Macaulay2/packages/SimplicialComplexes/Code.m2:20:55-20:60: --source code:
      monomialIdeal SimplicialComplex := MonomialIdeal => D -> D.monomialIdeal

i18 : 
