-- -*- M2-comint -*- hash: -725680238

i1 : R = ZZ/229[a,b,c];

i2 : D = simplicialComplex{a*b*c}

o2 = simplicialComplex | abc |

o2 : SimplicialComplex

i3 : E = simplicialComplex{a*b,b*c}

o3 = simplicialComplex | bc ab |

o3 : SimplicialComplex

i4 : f = map(E,D,{a,b,a})

o4 = | a b a |

o4 : SimplicialMap simplicialComplex | bc ab | <--- simplicialComplex | abc |

i5 : isWellDefined f

o5 = true

i6 : image f

o6 = simplicialComplex | ab |

o6 : SimplicialComplex

i7 : 
