-- -*- M2-comint -*- hash: -1378295962

i1 : R = ZZ[a,b,c];

i2 : triangle = simplicialComplex {a*b*c}

o2 = simplicialComplex | abc |

o2 : SimplicialComplex

i3 : R' = ZZ[x_0,x_1];

i4 : edge = simplicialComplex {x_0*x_1}

o4 = simplicialComplex | x_0x_1 |

o4 : SimplicialComplex

i5 : f = map(edge,triangle,{x_0,x_0,x_1})

o5 = | x_0 x_0 x_1 |

o5 : SimplicialMap simplicialComplex | x_0x_1 | <--- simplicialComplex | abc |

i6 : isSurjective f

o6 = true

i7 : isSurjective id_triangle

o7 = true

i8 : assert isSurjective id_triangle

i9 : f' = map(triangle,edge,{a,b});

o9 : SimplicialMap simplicialComplex | abc | <--- simplicialComplex | x_0x_1 |

i10 : isSurjective f'

o10 = false

i11 : assert not isSurjective f'

i12 : 
