-- -*- M2-comint -*- hash: -1951371322

i1 : S = QQ[a, b, c, DegreeRank => 3];

i2 : Δ = simplexComplex(2, S)

o2 = simplicialComplex | abc |

o2 : SimplicialComplex

i3 : isProper Δ

o3 = true

i4 : assert isProper Δ

i5 : Δ1 = sub(Δ, newRing(ring Δ, Degrees => {{1,0,0},{1,0,0},{0,0,1}}));

i6 : isProper Δ1

o6 = false

i7 : assert not isProper Δ1

i8 : flagfVector({1,0,0}, Δ1)

o8 = 2

i9 : Δ2 = sub(Δ, newRing(ring Δ, Degrees => {{1,0,0},{0,1,0},{0,2,1}}));

i10 : isProper Δ2

o10 = true

i11 : assert isProper Δ2

i12 : Δ3 = sub(Δ, newRing(ring Δ, Degrees => {{1,0,0},{0,1,0},{1,1,0}}));

i13 : isProper Δ3

o13 = false

i14 : assert not isProper Δ3

i15 : 
