-- -*- M2-comint -*- hash: 1277102330

i1 : S = ZZ[x_1..x_18];

i2 : isPure simplexComplex(5, S)

o2 = true

i3 : isPure bartnetteSphereComplex S

o3 = true

i4 : isPure bjornerComplex S

o4 = true

i5 : isPure dunceHatComplex S

o5 = true

i6 : isPure poincareSphereComplex S

o6 = true

i7 : R = ZZ/101[a..f];

i8 : Γ = simplicialComplex {e, c*d, b*d, a*b*c}

o8 = simplicialComplex | e cd bd abc |

o8 : SimplicialComplex

i9 : isPure Γ

o9 = false

i10 : isPure skeleton (1, Γ)

o10 = false

i11 : isPure skeleton (2, Γ)

o11 = false

i12 : irrelevant = simplicialComplex monomialIdeal gens S

o12 = simplicialComplex | 1 |

o12 : SimplicialComplex

i13 : isPure irrelevant

o13 = true

i14 : void = simplicialComplex monomialIdeal 1_S

o14 = simplicialComplex 0

o14 : SimplicialComplex

i15 : isPure void

o15 = true

i16 : 
