-- -*- M2-comint -*- hash: 1726586185

i1 : R = ZZ/229[a,b,c,d];

i2 : D = simplicialComplex{a*b*c, b*c*d}

o2 = simplicialComplex | bcd abc |

o2 : SimplicialComplex

i3 : E = simplicialComplex{a*b, b*c}

o3 = simplicialComplex | bc ab |

o3 : SimplicialComplex

i4 : f = map(E,D,{a,b,b,c})

o4 = | a b b c |

o4 : SimplicialMap simplicialComplex | bc ab | <--- simplicialComplex | bcd abc |

i5 : isWellDefined f

o5 = true

i6 : g = map(E,D,{b*c,c,c+a,1})

o6 = | bc c a+c 1 |

o6 : SimplicialMap simplicialComplex | bc ab | <--- simplicialComplex | bcd abc |

i7 : isWellDefined g

o7 = false

i8 : debugLevel = 1;

i9 : isWellDefined g
-- expected image of a vertex to be a vertex
o9 = false

i10 : h = map(E,D,{a,b,c,c})

o10 = | a b c c |

o10 : SimplicialMap simplicialComplex | bc ab | <--- simplicialComplex | bcd abc |

i11 : isWellDefined h
-- expected image of a face to be a face
o11 = false

i12 : 
