-- -*- M2-comint -*- hash: -1724513708

i1 : R = ZZ[a..f];

i2 : fish = simplicialComplex {a*b*c, b*c*d, d*e*f}

o2 = simplicialComplex | def bcd abc |

o2 : SimplicialComplex

i3 : R' = ZZ[x_0,x_1,x_2];

i4 : fishface = simplicialComplex {x_0*x_1*x_2}

o4 = simplicialComplex | x_0x_1x_2 |

o4 : SimplicialComplex

i5 : f = map(fish,fishface,{a,b,c})

o5 = | a b c |

o5 : SimplicialMap simplicialComplex | def bcd abc | <--- simplicialComplex | x_0x_1x_2 |

i6 : isInjective f

o6 = true

i7 : isInjective id_fish

o7 = true

i8 : assert isInjective id_fish

i9 : f' = map(fish, fishface, {b,c,c})

o9 = | b c c |

o9 : SimplicialMap simplicialComplex | def bcd abc | <--- simplicialComplex | x_0x_1x_2 |

i10 : isInjective f'

o10 = false

i11 : assert not isInjective f'

i12 : 
