-- -*- M2-comint -*- hash: -1868945466

i1 : S = QQ[x,y];

i2 : R = QQ[a,b,c];

i3 : M = monomialIdeal{x*y,x^2,y^3};

o3 : MonomialIdeal of S

i4 : D = lyubeznikSimplicialComplex(M,R)

o4 = simplicialComplex | ac ab |

o4 : SimplicialComplex

i5 : L = lyubeznikResolution(M);

i6 : L.dd

          1                    3
o6 = 0 : S  <---------------- S  : 1
               | xy x2 y3 |

          3                      2
     1 : S  <------------------ S  : 2
               {2} | -x -y2 |
               {2} | y  0   |
               {3} | 0  x   |

o6 : ChainComplexMap

i7 : L' = chainComplex(D,Labels=>(first entries mingens M));

i8 : L'.dd

          1                    3
o8 = 0 : S  <---------------- S  : 1
               | xy x2 y3 |

          3                      2
     1 : S  <------------------ S  : 2
               {2} | -x -y2 |
               {2} | y  0   |
               {3} | 0  x   |

o8 : ChainComplexMap

i9 : first entries mingens M

            2   3
o9 = {x*y, x , y }

o9 : List

i10 : D' = lyubeznikSimplicialComplex(M,R,MonomialOrder=>{1,2,0})

o10 = simplicialComplex | abc |

o10 : SimplicialComplex

i11 : D' = lyubeznikSimplicialComplex({x^2,y^3,x*y},R)

o11 = simplicialComplex | abc |

o11 : SimplicialComplex

i12 : (lyubeznikResolution(M,MonomialOrder=>{1,2,0})).dd

           1                    3
o12 = 0 : S  <---------------- S  : 1
                | x2 y3 xy |

           3                         3
      1 : S  <--------------------- S  : 2
                {2} | -y3 -y 0  |
                {3} | x2  0  -x |
                {2} | 0   x  y2 |

           3                   1
      2 : S  <--------------- S  : 3
                {5} | 1   |
                {3} | -y2 |
                {4} | x   |

o12 : ChainComplexMap

i13 : 
