-- -*- M2-comint -*- hash: -2063018235

i1 : S = QQ[x,y];

i2 : M = monomialIdeal{x*y,x^2,y^3};

o2 : MonomialIdeal of S

i3 : F = lyubeznikResolution M;

i4 : F.dd

          1                    3
o4 = 0 : S  <---------------- S  : 1
               | xy x2 y3 |

          3                      2
     1 : S  <------------------ S  : 2
               {2} | -x -y2 |
               {2} | y  0   |
               {3} | 0  x   |

o4 : ChainComplexMap

i5 : first entries mingens M

            2   3
o5 = {x*y, x , y }

o5 : List

i6 : F' = lyubeznikResolution({x^2,y^3,x*y});

i7 : F'.dd

          1                    3
o7 = 0 : S  <---------------- S  : 1
               | x2 y3 xy |

          3                         3
     1 : S  <--------------------- S  : 2
               {2} | -y3 -y 0  |
               {3} | x2  0  -x |
               {2} | 0   x  y2 |

          3                   1
     2 : S  <--------------- S  : 3
               {5} | 1   |
               {3} | -y2 |
               {4} | x   |

o7 : ChainComplexMap

i8 : F' = lyubeznikResolution(M,MonomialOrder=>{1,2,0});

i9 : F'.dd

          1                    3
o9 = 0 : S  <---------------- S  : 1
               | x2 y3 xy |

          3                         3
     1 : S  <--------------------- S  : 2
               {2} | -y3 -y 0  |
               {3} | x2  0  -x |
               {2} | 0   x  y2 |

          3                   1
     2 : S  <--------------- S  : 3
               {5} | 1   |
               {3} | -y2 |
               {4} | x   |

o9 : ChainComplexMap

i10 : 
