-- -*- M2-comint -*- hash: 1573878699

i1 : S = ZZ/101[a,b,c,d];

i2 : Δ = simplexComplex(3,S)

o2 = simplicialComplex | abcd |

o2 : SimplicialComplex

i3 : f = map(Δ,Δ,matrix{{a,b,c,d}})

o3 = | a b c d |

o3 : SimplicialMap simplicialComplex | abcd | <--- simplicialComplex | abcd |

i4 : map f

o4 = map (S, S, {a, b, c, d})

o4 : RingMap S <--- S

i5 : 
