-- -*- M2-comint -*- hash: 1444000647

i1 : S = QQ[a,b,c,d];

i2 : Δ = simplexComplex(3,S);

i3 : f = map(Δ,Δ, id_S)

o3 = | a b c d |

o3 : SimplicialMap simplicialComplex | abcd | <--- simplicialComplex | abcd |

i4 : matrix f

o4 = | a b c d |

             1       4
o4 : Matrix S  <--- S

i5 : map f

o5 = map (S, S, {a, b, c, d})

o5 : RingMap S <--- S

i6 : R = QQ[s,t,u,v,w];

i7 : Γ = simplicialComplex{s*t*u,u*v*w};

i8 : g = map(Δ,Γ, {a,b,c,d,d})

o8 = | a b c d d |

o8 : SimplicialMap simplicialComplex | abcd | <--- simplicialComplex | uvw stu |

i9 : source g

o9 = simplicialComplex | uvw stu |

o9 : SimplicialComplex

i10 : target g

o10 = simplicialComplex | abcd |

o10 : SimplicialComplex

i11 : image g

o11 = simplicialComplex | cd abc |

o11 : SimplicialComplex

i12 : 
