-- -*- M2-comint -*- hash: 955753159

i1 : S = ZZ[x_0..x_5];

i2 : Δ = simplicialComplex monomialIdeal(x_0*x_5, x_1*x_4, x_2*x_3)

o2 = simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 |

o2 : SimplicialComplex

i3 : id_Δ

o3 = | x_0 x_1 x_2 x_3 x_4 x_5 |

o3 : SimplicialMap simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 | <--- simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 |

i4 : net id_Δ

o4 = | x_0 x_1 x_2 x_3 x_4 x_5 |

i5 : matrix id_Δ

o5 = | x_0 x_1 x_2 x_3 x_4 x_5 |

             1       6
o5 : Matrix S  <--- S

i6 : S' = ZZ[y_0..y_3];

i7 : Γ = simplicialComplex monomialIdeal(y_1*y_2)

o7 = simplicialComplex | y_0y_2y_3 y_0y_1y_3 |

o7 : SimplicialComplex

i8 : f = map(Γ, Δ, {y_0,y_0,y_1,y_2,y_3,y_3})

o8 = | y_0 y_0 y_1 y_2 y_3 y_3 |

o8 : SimplicialMap simplicialComplex | y_0y_2y_3 y_0y_1y_3 | <--- simplicialComplex | x_3x_4x_5 x_2x_4x_5 x_1x_3x_5 x_1x_2x_5 x_0x_3x_4 x_0x_2x_4 x_0x_1x_3 x_0x_1x_2 |

i9 : assert isWellDefined f

i10 : net f

o10 = | y_0 y_0 y_1 y_2 y_3 y_3 |

i11 : matrix f

o11 = | y_0 y_0 y_1 y_2 y_3 y_3 |

               1        6
o11 : Matrix S'  <--- S'

i12 : 
