-- -*- M2-comint -*- hash: -8089590

i1 : S = ZZ[a..f];

i2 : Δ = simplicialComplex monomialIdeal(a*f, b*d, c*e)

o2 = simplicialComplex | def bef cdf bcf ade abe acd abc |

o2 : SimplicialComplex

i3 : net Δ

o3 = simplicialComplex | def bef cdf bcf ade abe acd abc |

i4 : assert instance(net Δ, Net)

i5 : void = simplicialComplex monomialIdeal 1_S

o5 = simplicialComplex 0

o5 : SimplicialComplex

i6 : net void

o6 = simplicialComplex 0

i7 : irrelevant = simplicialComplex {1_S};

i8 : net irrelevant

o8 = simplicialComplex | 1 |

i9 : 
