-- -*- M2-comint -*- hash: -2023842022

i1 : S = ZZ/101[a..q];

i2 : Δ = poincareSphereComplex S;

i3 : matrix {facets Δ}

o3 = | mnop inop jmop ijop kmnp iknp jkmp ijkp lmno hlno gino ghno flmo ajmo
     ------------------------------------------------------------------------
     afmo bhlo bflo ghko bhko dgko bdko eijo cejo acjo egio dego abfo cdeo
     ------------------------------------------------------------------------
     acdo abdo clmn ckmn dhln cdln aikn cekn aekn ghjn dhjn bgjn dfjn bfjn
     ------------------------------------------------------------------------
     bgin abin defn aefn abfn cden fglm cglm djkm bdkm bckm dhjm ahjm ehim
     ------------------------------------------------------------------------
     dhim egim bgim bdim aehm efgm bcgm aefm ijkl fjkl aikl fgkl agkl eijl
     ------------------------------------------------------------------------
     bfjl bejl ehil dhil adil behl acgl acdl dfjk aghk behk aehk dfgk bcek
     ------------------------------------------------------------------------
     aghj bcgj acgj bcej abdi defg |

             1       90
o3 : Matrix S  <--- S

i4 : dim Δ

o4 = 3

i5 : fVector Δ

o5 = {1, 16, 106, 180, 90}

o5 : List

i6 : prune HH chainComplex Δ

o6 = -1 : 0     

      0 : 0     

      1 : 0     

      2 : 0     

            ZZ 1
      3 : (---)
           101

o6 : GradedModule

i7 : assert(dim Δ === 3 and isPure Δ)

i8 : assert(fVector Δ === {1,16,106,180,90})

i9 : 
