-- -*- M2-comint -*- hash: 483209354

i1 : S = ZZ[a..e];

i2 : Δ = simplicialComplex {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}

o2 = simplicialComplex | bcde acde abde abce abcd |

o2 : SimplicialComplex

i3 : ring Δ

o3 = S

o3 : PolynomialRing

i4 : coefficientRing Δ

o4 = ZZ

o4 : Ring

i5 : dim Δ

o5 = 3

i6 : assert (ring Δ === S and coefficientRing Δ === ZZ)

i7 : R = ZZ/101[a..e];

i8 : Γ = simplicialComplex {e, c*d, b*d, a*b*c}

o8 = simplicialComplex | e cd bd abc |

o8 : SimplicialComplex

i9 : ring Γ

o9 = R

o9 : PolynomialRing

i10 : ideal Γ

o10 = ideal (a*d, b*c*d, a*e, b*e, c*e, d*e)

o10 : Ideal of R

i11 : assert (ring Γ === R and coefficientRing Γ === ZZ/101)

i12 : irrelevant = simplicialComplex {1_R};

i13 : ring irrelevant

o13 = R

o13 : PolynomialRing

i14 : void = simplicialComplex monomialIdeal 1_S

o14 = simplicialComplex 0

o14 : SimplicialComplex

i15 : ring void

o15 = S

o15 : PolynomialRing

i16 : assert (ring irrelevant === R and ring void === S)

i17 : peek Δ

o17 = SimplicialComplex{cache => CacheTable{...1...}                           }
                        facets => {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}
                        monomialIdeal => monomialIdeal(a*b*c*d*e)
                        ring => S

i18 : 
