-- -*- M2-comint -*- hash: -82744796

i1 : R = ZZ[a,b,c,d];

i2 : S = ZZ/17[x_0..x_3];

i3 : M  = monomialIdeal(x_0*x_1,x_1*x_2,x_2*x_3)

o3 = monomialIdeal (x x , x x , x x )
                     0 1   1 2   2 3

o3 : MonomialIdeal of S

i4 : D = scarfSimplicialComplex(M,R)

o4 = simplicialComplex | bc ab |

o4 : SimplicialComplex

i5 : prune homology D

o5 = -1 : 0

      0 : 0

      1 : 0

o5 : GradedModule

i6 : M' = monomialIdeal(x_0*x_1,x_0*x_3,x_1*x_2,x_2*x_3)

o6 = monomialIdeal (x x , x x , x x , x x )
                     0 1   1 2   0 3   2 3

o6 : MonomialIdeal of S

i7 : D' = scarfSimplicialComplex(M',R)

o7 = simplicialComplex | cd bd ac ab |

o7 : SimplicialComplex

i8 : prune homology D'

o8 = -1 : 0  

      0 : 0  

            1
      1 : ZZ

o8 : GradedModule

i9 : 
