-- -*- M2-comint -*- hash: -1643014771

i1 : S = ZZ[a..e];

i2 : Δ = simplicialComplex {a*b*d*e, b*c*d*e, a*b*c*e, a*b*c*d, a*c*d*e}

o2 = simplicialComplex | bcde acde abde abce abcd |

o2 : SimplicialComplex

i3 : facets Δ

o3 = {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}

o3 : List

i4 : monomialIdeal Δ

o4 = monomialIdeal(a*b*c*d*e)

o4 : MonomialIdeal of S

i5 : dim Δ

o5 = 3

i6 : assert (dim Δ === 3 and numgens ideal Δ === 1 and isPure Δ)

i7 : assert (Δ === simplicialComplex facets Δ)

i8 : Γ = simplicialComplex {a*b*d*e, b*c, a*b*c*d,  a*c*d*e, a*c*d,  b*c*d*e, d, a*b*c*e}

o8 = simplicialComplex | bcde acde abde abce abcd |

o8 : SimplicialComplex

i9 : monomialIdeal Γ

o9 = monomialIdeal(a*b*c*d*e)

o9 : MonomialIdeal of S

i10 : assert (Γ === Δ)

i11 : assert (Γ === simplicialComplex facets Γ)

i12 : S' = ZZ/101[a..e];

i13 : Δ' = simplicialComplex {e, c*d, b*d, a*b*c}

o13 = simplicialComplex | e cd bd abc |

o13 : SimplicialComplex

i14 : monomialIdeal Δ'

o14 = monomialIdeal (a*d, b*c*d, a*e, b*e, c*e, d*e)

o14 : MonomialIdeal of S'

i15 : facets Δ'

o15 = {e, c*d, b*d, a*b*c}

o15 : List

i16 : dim Δ'

o16 = 2

i17 : assert (dim Δ' === 2 and not isPure Δ')

i18 : assert (Δ' === simplicialComplex facets Δ')

i19 : irrelevant = simplicialComplex {1_S'};

i20 : dim irrelevant

o20 = -1

i21 : void = simplicialComplex monomialIdeal 1_S

o21 = simplicialComplex 0

o21 : SimplicialComplex

i22 : dim void

o22 = -infinity

o22 : InfiniteNumber

i23 : assert (dim irrelevant === -1 and dim void === -infinity)

i24 : assert (irrelevant === simplicialComplex facets irrelevant)

i25 : chainComplex Δ

        1       5       10       10       5
o25 = ZZ  <-- ZZ  <-- ZZ   <-- ZZ   <-- ZZ
                                         
      -1      0       1        2        3

o25 : ChainComplex

i26 : chainComplex Γ

        1       5       10       10       5
o26 = ZZ  <-- ZZ  <-- ZZ   <-- ZZ   <-- ZZ
                                         
      -1      0       1        2        3

o26 : ChainComplex

i27 : chainComplex Δ'

        ZZ 1       ZZ 5       ZZ 5       ZZ 1
o27 = (---)  <-- (---)  <-- (---)  <-- (---)
       101        101        101        101
                                        
      -1         0          1          2

o27 : ChainComplex

i28 : 
