-- -*- M2-comint -*- hash: -1464093437

i1 : S = ZZ[a..e];

i2 : Δ = simplicialComplex monomialIdeal (a*b*c*d*e)

o2 = simplicialComplex | bcde acde abde abce abcd |

o2 : SimplicialComplex

i3 : monomialIdeal Δ

o3 = monomialIdeal(a*b*c*d*e)

o3 : MonomialIdeal of S

i4 : facets Δ

o4 = {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}

o4 : List

i5 : dim Δ

o5 = 3

i6 : assert (dim Δ === 3 and numgens ideal Δ === 1 and isPure Δ)

i7 : R = QQ[a..f];

i8 : Γ = simplicialComplex monomialIdeal (a*b*c*d*e, f)

o8 = simplicialComplex | bcde acde abde abce abcd |

o8 : SimplicialComplex

i9 : monomialIdeal Γ

o9 = monomialIdeal (a*b*c*d*e, f)

o9 : MonomialIdeal of R

i10 : facets Γ

o10 = {b*c*d*e, a*c*d*e, a*b*d*e, a*b*c*e, a*b*c*d}

o10 : List

i11 : assert((for F in facets Γ list sub(F,S)) === facets Δ)

i12 : S' = ZZ/101[a..e];

i13 : Δ' = simplicialComplex monomialIdeal (a*d, b*c*d, a*e, b*e, c*e, d*e)

o13 = simplicialComplex | e cd bd abc |

o13 : SimplicialComplex

i14 : monomialIdeal Δ'

o14 = monomialIdeal (a*d, b*c*d, a*e, b*e, c*e, d*e)

o14 : MonomialIdeal of S'

i15 : facets Δ'

o15 = {e, c*d, b*d, a*b*c}

o15 : List

i16 : dim Δ'

o16 = 2

i17 : assert (dim Δ' === 2 and not isPure Δ')

i18 : irrelevant = simplicialComplex monomialIdeal gens S

o18 = simplicialComplex | 1 |

o18 : SimplicialComplex

i19 : monomialIdeal irrelevant

o19 = monomialIdeal (a, b, c, d, e)

o19 : MonomialIdeal of S

i20 : facets irrelevant

o20 = {1}

o20 : List

i21 : void = simplicialComplex monomialIdeal 1_R

o21 = simplicialComplex 0

o21 : SimplicialComplex

i22 : monomialIdeal void

o22 = monomialIdeal 1

o22 : MonomialIdeal of R

i23 : facets void

o23 = {}

o23 : List

i24 : assert (facets irrelevant === {1_S} and facets void === {})

i25 : chainComplex Δ

        1       5       10       10       5
o25 = ZZ  <-- ZZ  <-- ZZ   <-- ZZ   <-- ZZ
                                         
      -1      0       1        2        3

o25 : ChainComplex

i26 : chainComplex Γ

        1       5       10       10       5
o26 = QQ  <-- QQ  <-- QQ   <-- QQ   <-- QQ
                                         
      -1      0       1        2        3

o26 : ChainComplex

i27 : chainComplex Δ'

        ZZ 1       ZZ 5       ZZ 5       ZZ 1
o27 = (---)  <-- (---)  <-- (---)  <-- (---)
       101        101        101        101
                                        
      -1         0          1          2

o27 : ChainComplex

i28 : Bowtie = simplicialComplex ideal {a*d, b*d, a*e, b*e}

o28 = simplicialComplex | cde abc |

o28 : SimplicialComplex

i29 : 
