-- -*- M2-comint -*- hash: 235104286

i1 : S = ZZ[a..j];

i2 : Γ = smallManifold(3, 8, 21, S);

i3 : matrix {facets Γ}

o3 = | dfgh afgh cdgh bcgh abgh bdfh abfh bcdh defg aefg cdeg bceg abeg adef
     ------------------------------------------------------------------------
     abdf acde abce abcd |

             1       18
o3 : Matrix S  <--- S

i4 : prune HH Γ

o4 = -1 : 0  

      0 : 0  

      1 : 0  

      2 : 0  

            1
      3 : ZZ

o4 : GradedModule

i5 : assert(isWellDefined Γ and dim Γ === 3 and # vertices Γ === 8)

i6 : assert (simplicialComplex faces(3, simplexComplex(4, S)) === smallManifold(3,5,0,S))

i7 : RP2 = smallManifold(2, 6, 1, S)

o7 = simplicialComplex | bef aef cdf adf bcf cde bde ace abd abc |

o7 : SimplicialComplex

i8 : KleinBottle = smallManifold(2, 8, 12, S)

o8 = simplicialComplex | cgh agh cfh afh efg dfg aeg cdg bef adf bcf cde bde ace abd abc |

o8 : SimplicialComplex

i9 : RP2H = prune HH RP2

o9 = -1 : 0             

      0 : 0             

      1 : cokernel | 2 |

      2 : 0             

o9 : GradedModule

i10 : KBH = prune HH KleinBottle

o10 = -1 : 0             

       0 : 0             

       1 : cokernel | 2 |
                    | 0 |

       2 : 0             

o10 : GradedModule

i11 : 
