-- -*- M2-comint -*- hash: -1557102281

i1 : S = ZZ[a..e];

i2 : Δ = simplicialComplex {a*b*c, c*d*e}

o2 = simplicialComplex | cde abc |

o2 : SimplicialComplex

i3 : star (Δ, c)

o3 = simplicialComplex | cde abc |

o3 : SimplicialComplex

i4 : assert (star (Δ, c) === Δ)

i5 : star (Δ, a*b)

o5 = simplicialComplex | abc |

o5 : SimplicialComplex

i6 : assert (star (Δ, a*b) === simplicialComplex {a*b*c})

i7 : star (Δ, a*d)

o7 = simplicialComplex 0

o7 : SimplicialComplex

i8 : assert (star (Δ, a*d) === simplicialComplex monomialIdeal 1_S)

i9 : 
