-- -*- M2-comint -*- hash: -975720791

i1 : S = QQ[vars(0..3)]

o1 = S

o1 : PolynomialRing

i2 : M = monomialIdeal(a*b,c^3,c*d,b^2*c)

                          2    3
o2 = monomialIdeal (a*b, b c, c , c*d)

o2 : MonomialIdeal of S

i3 : T = taylorResolution M

      1      4      6      4      1
o3 = S  <-- S  <-- S  <-- S  <-- S
                                  
     0      1      2      3      4

o3 : ChainComplex

i4 : T.dd

          1                        4
o4 = 0 : S  <-------------------- S  : 1
               | cd ab c3 b2c |

          4                                       6
     1 : S  <----------------------------------- S  : 2
               {2} | -ab -c2 -b2 0   0   0   |
               {2} | cd  0   0   -c3 -bc 0   |
               {3} | 0   d   0   ab  0   -b2 |
               {3} | 0   0   d   0   a   c2  |

          6                              4
     2 : S  <-------------------------- S  : 3
               {4} | c2  b  0   0   |
               {4} | -ab 0  b2  0   |
               {4} | 0   -a -c2 0   |
               {5} | d   0  0   b   |
               {4} | 0   d  0   -c2 |
               {5} | 0   0  d   a   |

          4                  1
     3 : S  <-------------- S  : 4
               {6} | -b |
               {5} | c2 |
               {6} | -a |
               {6} | d  |

o4 : ChainComplexMap

i5 : L = gens S

o5 = {a, b, c, d}

o5 : List

i6 : T = taylorResolution L;

i7 : K = koszul matrix{L};

i8 : T.dd

          1                   4
o8 = 0 : S  <--------------- S  : 1
               | a b c d |

          4                                 6
     1 : S  <----------------------------- S  : 2
               {1} | -b -c -d 0  0  0  |
               {1} | a  0  0  -c -d 0  |
               {1} | 0  a  0  b  0  -d |
               {1} | 0  0  a  0  b  c  |

          6                           4
     2 : S  <----------------------- S  : 3
               {2} | c  d  0  0  |
               {2} | -b 0  d  0  |
               {2} | 0  -b -c 0  |
               {2} | a  0  0  d  |
               {2} | 0  a  0  -c |
               {2} | 0  0  a  b  |

          4                  1
     3 : S  <-------------- S  : 4
               {3} | -d |
               {3} | c  |
               {3} | -b |
               {3} | a  |

o8 : ChainComplexMap

i9 : K.dd

          1                   4
o9 = 0 : S  <--------------- S  : 1
               | a b c d |

          4                                 6
     1 : S  <----------------------------- S  : 2
               {1} | -b -c 0  -d 0  0  |
               {1} | a  0  -c 0  -d 0  |
               {1} | 0  a  b  0  0  -d |
               {1} | 0  0  0  a  b  c  |

          6                           4
     2 : S  <----------------------- S  : 3
               {2} | c  d  0  0  |
               {2} | -b 0  d  0  |
               {2} | a  0  0  d  |
               {2} | 0  -b -c 0  |
               {2} | 0  a  0  -c |
               {2} | 0  0  a  b  |

          4                  1
     3 : S  <-------------- S  : 4
               {3} | -d |
               {3} | c  |
               {3} | -b |
               {3} | a  |

o9 : ChainComplexMap

i10 : 
