-- -*- M2-comint -*- hash: 696219138

i1 : S = QQ[a..e];

i2 : vertices simplexComplex(4, S)

o2 = {a, b, c, d, e}

o2 : List

i3 : Δ = simplicialComplex monomialIdeal(a*b, b*c, c*d, d*e)

o3 = simplicialComplex | be bd ad ace |

o3 : SimplicialComplex

i4 : vertices Δ

o4 = {a, b, c, d, e}

o4 : List

i5 : faces(0, Δ)

o5 = {a, b, c, d, e}

o5 : List

i6 : assert(vertices Δ === gens S)

i7 : vertices simplexComplex(2, S)

o7 = {a, b, c}

o7 : List

i8 : Γ = simplicialComplex monomialIdeal(a, a*b, b*c, c*d)

o8 = simplicialComplex | ce bde |

o8 : SimplicialComplex

i9 : vertices Γ

o9 = {b, c, d, e}

o9 : List

i10 : faces(0, Γ)

o10 = {b, c, d, e}

o10 : List

i11 : assert(vertices Γ === {b, c, d, e})

i12 : irrelevant = simplicialComplex monomialIdeal gens S

o12 = simplicialComplex | 1 |

o12 : SimplicialComplex

i13 : vertices irrelevant

o13 = {}

o13 : List

i14 : assert(vertices irrelevant === {})

i15 : void = simplicialComplex monomialIdeal 1_S

o15 = simplicialComplex 0

o15 : SimplicialComplex

i16 : vertices void

o16 = {}

o16 : List

i17 : assert(vertices void === {})

i18 : 
