-- -*- M2-comint -*- hash: -494862038

i1 : S = QQ[a,b,c];

i2 : Δ = simplexComplex(2, S)

o2 = simplicialComplex | abc |

o2 : SimplicialComplex

i3 : R = QQ[d,e,f];

i4 : Γ = simplexComplex(2, R)

o4 = simplicialComplex | def |

o4 : SimplicialComplex

i5 : ΔvΓ = wedge (Δ, Γ, a, f)

o5 = simplicialComplex | ade abc |

o5 : SimplicialComplex

i6 : vertices ΔvΓ

o6 = {a, b, c, d, e}

o6 : List

i7 : assert (# gens ring ΔvΓ === # gens ring Δ + # gens ring Γ - 1)

i8 : ΔvΓ' = wedge (Δ, Γ, a, d, Variables => toList(x_0..x_4))

o8 = simplicialComplex | x_0x_3x_4 x_0x_1x_2 |

o8 : SimplicialComplex

i9 : vertices ΔvΓ'

o9 = {x , x , x , x , x }
       0   1   2   3   4

o9 : List

i10 : ΔvΓ'' = wedge (Δ, Δ, a, a, Variables => {a,b,c,d,e})

o10 = simplicialComplex | ade abc |

o10 : SimplicialComplex

i11 : vertices ΔvΓ''

o11 = {a, b, c, d, e}

o11 : List

i12 : ring ΔvΓ''

o12 = QQ[a..e]

o12 : PolynomialRing

i13 : 
