-- -*- M2-comint -*- hash: 397211301

i1 : R=ZZ[x,y,z];

i2 : I=ideal(x,y,z);

o2 : Ideal of R

i3 : F=res I;

i4 : lambda={1,1};

i5 : G=schurComplex(lambda,F)

      3      9      10      6      3      1
o5 = R  <-- R  <-- R   <-- R  <-- R  <-- R
                                          
     1      2      3       4      5      6

o5 : ChainComplex

i6 : G.dd

          3                                9
o6 = 1 : R  <---------------------------- R  : 2
               | z y x 0 0 0 0  y  x  |
               | 0 z 0 y x 0 x  -z 0  |
               | 0 0 z 0 y x -y 0  -z |

          9                                            10
     2 : R  <---------------------------------------- R   : 3
               | 0  0  2y 2x 0  0   0  0   0  0   |
               | 0  x  -z 0  0  y   x  0   0  0   |
               | 0  -y 0  -z 0  0   0  0   y  x   |
               | 0  0  0  0  2x -2z 0  0   0  0   |
               | 0  0  0  0  -y 0   -z x   -z 0   |
               | 0  0  0  0  0  0   0  -2y 0  -2z |
               | z  -z 0  0  -y 0   0  -x  0  0   |
               | x  0  -z 0  0  -y  0  0   -x 0   |
               | -y 0  0  -z 0  0   -y 0   0  -x  |

          10                             6
     3 : R   <------------------------- R  : 4
                | z  y  x  0  0  0  |
                | z  0  0  y  x  0  |
                | x  0  0  0  0  x  |
                | -y 0  0  0  0  -y |
                | 0  z  0  -z 0  0  |
                | 0  x  0  -x 0  0  |
                | 0  -y 0  0  -x z  |
                | 0  0  z  0  -z 0  |
                | 0  0  x  y  0  -z |
                | 0  0  -y 0  y  0  |

          6                    3
     4 : R  <---------------- R  : 5
               | 0  y  x  |
               | x  -z 0  |
               | -y 0  -z |
               | x  -z 0  |
               | -y 0  -z |
               | 0  -y -x |

          3              1
     5 : R  <---------- R  : 6
               | z  |
               | x  |
               | -y |

o6 : ChainComplexMap

i7 : R=QQ[x11,x21,x12,x22,x13,x23,x14,x24];

i8 : M=genericMatrix(R,x11,2,4);

             2       4
o8 : Matrix R  <--- R

i9 : F = new ChainComplex; F.ring = R; F#0=target M; F#1=source M; F.dd#1=M;

              2       4
o13 : Matrix R  <--- R

i14 : lambda={3};

i15 : G=schurComplex(lambda,F)

       4      12      12      4
o15 = R  <-- R   <-- R   <-- R
                              
      0      1       2       3

o15 : ChainComplex

i16 : G.dd

           4                                                           12
o16 = 0 : R  <------------------------------------------------------- R   : 1
                | x14 0   0   x13 0   0   x12 0   0   x11 0   0   |
                | x24 x14 0   x23 x13 0   x22 x12 0   x21 x11 0   |
                | 0   x24 x14 0   x23 x13 0   x22 x12 0   x21 x11 |
                | 0   0   x24 0   0   x23 0   0   x22 0   0   x21 |

           12                                                                       12
      1 : R   <------------------------------------------------------------------- R   : 2
                 | -x13 0    -x12 0    -x11 0    0    0    0    0    0    0    |
                 | -x23 -x13 -x22 -x12 -x21 -x11 0    0    0    0    0    0    |
                 | 0    -x23 0    -x22 0    -x21 0    0    0    0    0    0    |
                 | x14  0    0    0    0    0    -x12 0    -x11 0    0    0    |
                 | x24  x14  0    0    0    0    -x22 -x12 -x21 -x11 0    0    |
                 | 0    x24  0    0    0    0    0    -x22 0    -x21 0    0    |
                 | 0    0    x14  0    0    0    x13  0    0    0    -x11 0    |
                 | 0    0    x24  x14  0    0    x23  x13  0    0    -x21 -x11 |
                 | 0    0    0    x24  0    0    0    x23  0    0    0    -x21 |
                 | 0    0    0    0    x14  0    0    0    x13  0    x12  0    |
                 | 0    0    0    0    x24  x14  0    0    x23  x13  x22  x12  |
                 | 0    0    0    0    0    x24  0    0    0    x23  0    x22  |

           12                               4
      2 : R   <--------------------------- R  : 3
                 | x12  x11  0    0    |
                 | x22  x21  0    0    |
                 | -x13 0    x11  0    |
                 | -x23 0    x21  0    |
                 | 0    -x13 -x12 0    |
                 | 0    -x23 -x22 0    |
                 | x14  0    0    x11  |
                 | x24  0    0    x21  |
                 | 0    x14  0    -x12 |
                 | 0    x24  0    -x22 |
                 | 0    0    x14  x13  |
                 | 0    0    x24  x23  |

o16 : ChainComplexMap

i17 : apply((length G)+1,i->reduceHilbert hilbertSeries HH_(i)(G))

           4     0  0  0
o17 = {--------, -, -, -}
              5  1  1  1
       (1 - T)

o17 : List

i18 : R=ZZ/7[x,y,z,w];

i19 : I=ideal(x*z-y^2,x*w-y*z, y*w-z^2);

o19 : Ideal of R

i20 : F=res I;

i21 : lambda={2,1};

i22 : G=schurComplex(lambda,F)

       3      11      20      22      12      2
o22 = R  <-- R   <-- R   <-- R   <-- R   <-- R
                                              
      1      2       3       4       5       6

o22 : ChainComplex

i23 : G.dd

           3                                                                       11
o23 = 1 : R  <------------------------------------------------------------------- R   : 2
                | yz-xw y2-xz z2-yw yz-xw y2-xz 0     0     0     0     -x y  |
                | 0     0     0     z2-yw 0     y2-xz yz-xw y2-xz 0     y  -z |
                | 0     0     0     0     z2-yw 0     0     yz-xw y2-xz -z w  |

           11                                                                                                                               20
      2 : R   <--------------------------------------------------------------------------------------------------------------------------- R   : 3
                 | z2-yw  yz-xw  y2-xz  0      0      0      0      0      y  -z 0      0      0      0      x  -y 0      0      0  0  |
                 | 0      0      0      z2-yw  yz-xw  y2-xz  0      0      -z w  0      0      0      0      0  0  0      0      x  -y |
                 | -yz+xw 0      0      -y2+xz 0      0      -2x    2y     -x y  0      0      0      0      0  0  0      0      0  0  |
                 | 0      -yz+xw 0      0      -y2+xz 0      y      -z     0  0  0      0      -x     y      -x y  0      0      0  0  |
                 | 0      0      -yz+xw 0      0      -y2+xz -z     w      0  0  0      0      0      0      0  0  -x     y      -x y  |
                 | 0      0      -z2+yw 0      z2-yw  0      0      0      0  0  yz-xw  y2-xz  0      0      -z w  0      0      -y z  |
                 | 0      z2-yw  0      0      0      0      0      0      0  0  -y2+xz 0      2y     -2z    y  -z 0      0      0  0  |
                 | 0      0      z2-yw  0      0      0      0      0      0  0  0      -y2+xz -z     w      0  0  y      -z     y  -z |
                 | 0      0      0      0      0      z2-yw  0      0      0  0  0      yz-xw  0      0      0  0  -2z    2w     -z w  |
                 | 0      0      0      0      0      0      -z2+yw 0      0  0  0      0      -yz+xw 0      0  0  -y2+xz 0      0  0  |
                 | 0      0      0      0      0      0      0      -z2+yw 0  0  0      0      0      -yz+xw 0  0  0      -y2+xz 0  0  |

           20                                                                                                                                           22
      3 : R   <--------------------------------------------------------------------------------------------------------------------------------------- R   : 4
                 | -2x    2y     0      0      -y    -x    0     z     y     0     0      0      0     0     0     0     0     0     0   0  0  0   |
                 | y      -z     0      0      0     -y    0     0     z     0     0      0      -x    0     y     0     0     0     0   0  0  0   |
                 | -z     w      0      0      0     0     -y    0     0     z     0      0      0     -x    0     y     0     0     0   0  0  0   |
                 | 0      0      -2x    2y     z     0     -x    -w    0     y     0      0      0     0     0     0     0     0     0   0  0  0   |
                 | 0      0      y      -z     0     z     0     0     -w    0     -x     y      0     -x    0     y     0     0     0   0  0  0   |
                 | 0      0      -z     w      0     0     z     0     0     -w    0      0      0     0     0     0     -x    y     0   0  0  0   |
                 | yz-xw  0      y2-xz  0      0     0     0     0     0     0     0      0      0     0     0     0     0     0     x   0  -y 0   |
                 | 0      yz-xw  0      y2-xz  0     0     0     0     0     0     0      0      0     0     0     0     0     0     0   x  0  -y  |
                 | 0      0      0      0      z2-yw yz-xw y2-xz 0     0     0     0      0      0     0     0     0     0     0     -2x y  y  0   |
                 | 0      0      0      0      0     0     0     z2-yw yz-xw y2-xz 0      0      0     0     0     0     0     0     0   -x -x 2y  |
                 | 0      0      0      0      0     0     0     0     0     0     2y     -2z    z     y     -w    -z    0     0     0   0  0  0   |
                 | 0      0      0      0      0     0     0     0     0     0     -z     w      0     z     0     -w    y     -z    0   0  0  0   |
                 | -z2+yw 0      0      0      0     0     0     0     0     0     y2-xz  0      0     0     0     0     0     0     -y  0  z  0   |
                 | 0      -z2+yw 0      0      0     0     0     0     0     0     0      y2-xz  0     0     0     0     0     0     0   -y 0  z   |
                 | z2-yw  0      0      0      0     z2-yw 0     0     0     0     0      0      yz-xw y2-xz 0     0     0     0     2y  -z -z 0   |
                 | 0      z2-yw  0      0      0     0     0     0     z2-yw 0     0      0      0     0     yz-xw y2-xz 0     0     0   y  y  -2z |
                 | 0      0      -z2+yw 0      0     0     0     0     0     0     -yz+xw 0      0     0     0     0     0     0     z   0  -w 0   |
                 | 0      0      0      -z2+yw 0     0     0     0     0     0     0      -yz+xw 0     0     0     0     0     0     0   z  0  -w  |
                 | 0      0      z2-yw  0      0     0     z2-yw 0     0     0     yz-xw  0      0     yz-xw 0     0     y2-xz 0     -2z w  w  0   |
                 | 0      0      0      z2-yw  0     0     0     0     0     z2-yw 0      yz-xw  0     0     0     yz-xw 0     y2-xz 0   -z -z 2w  |

           22                                                                                               12
      4 : R   <------------------------------------------------------------------------------------------- R   : 5
                 | y      0      -z     0      x      0      -y     0      0      0      0      0      |
                 | 0      y      0      -z     0      x      0      -y     0      0      0      0      |
                 | -z     0      w      0      0      0      0      0      x      0      -y     0      |
                 | 0      -z     0      w      0      0      0      0      0      x      0      -y     |
                 | -3x    2y     y      0      0      0      0      0      0      0      0      0      |
                 | y      -z     0      0      -2x    y      y      0      0      0      0      0      |
                 | -z     w      0      0      0      0      0      0      -2x    y      y      0      |
                 | 0      -x     -2x    3y     0      0      0      0      0      0      0      0      |
                 | 0      0      y      -z     0      -x     -x     2y     0      0      0      0      |
                 | 0      0      -z     w      0      0      0      0      0      -x     -x     2y     |
                 | 0      0      0      0      -z     0      w      0      -y     0      z      0      |
                 | 0      0      0      0      0      -z     0      w      0      -y     0      z      |
                 | 0      0      0      0      3y     -2z    -z     0      0      0      0      0      |
                 | 0      0      0      0      -z     w      0      0      2y     -z     -z     0      |
                 | 0      0      0      0      0      y      2y     -3z    0      0      0      0      |
                 | 0      0      0      0      0      0      -z     w      0      y      y      -2z    |
                 | 0      0      0      0      0      0      0      0      -3z    2w     w      0      |
                 | 0      0      0      0      0      0      0      0      0      -z     -2z    3w     |
                 | -z2+yw 0      0      0      -yz+xw 0      0      0      -y2+xz 0      0      0      |
                 | 0      -z2+yw 0      0      0      -yz+xw 0      0      0      -y2+xz 0      0      |
                 | 0      0      -z2+yw 0      0      0      -yz+xw 0      0      0      -y2+xz 0      |
                 | 0      0      0      -z2+yw 0      0      0      -yz+xw 0      0      0      -y2+xz |

           12                   2
      5 : R   <--------------- R  : 6
                 | y   0   |
                 | 2x  -y  |
                 | -x  2y  |
                 | 0   x   |
                 | -z  0   |
                 | -2y z   |
                 | y   -2z |
                 | 0   -y  |
                 | w   0   |
                 | 2z  -w  |
                 | -z  2w  |
                 | 0   z   |

o23 : ChainComplexMap

i24 : 
      
      
