-- -*- M2-comint -*- hash: -2118018069

i1 : Q = ZZ/2[u,v,w,x,y,z];

i2 : R = Q/ideal(x*y,y*z,x^3,x^2*z,x*z^2-y^3,z^3);

i3 : R.?attemptsAtGenericReduction

o3 = false

i4 : setAttemptsAtGenericReduction(R,100)

o4 = 10000 attempt(s) will be made to compute the Bass numbers via a generic
     reduction

i5 : R.attemptsAtGenericReduction

o5 = 100

i6 : Q = ZZ/2[x,y,z];

i7 : R = Q/ideal(x*y,y*z,x^3,x^2*z,x*z^2-y^3,z^3);

i8 : setAttemptsAtGenericReduction(R,0)

o8 = 0 attempt(s) will be made to compute the Bass numbers via a generic
     reduction

i9 : torAlgClass R

o9 = G(3)

i10 : 
