-- -*- M2-comint -*- hash: -1625107367

i1 : Q = QQ[x,y,z];

i2 : data = torAlgData (Q/ideal(x*y,y*z,x^3,x^2*z,x*z^2-y^3,z^3))

                                        2    3    4
                             2 + 2T - 2T  - T  + T
o2 = HashTable{BassSeries => ----------------------    }
                                       2     3    4
                             1 - T - 5T  - 2T  + T
               c => 3
               Class => G
               e => 3
               h => 0
               isCI => false
               isGolod => false
               isGorenstein => false
               m => 6
               n => 2
               p => 0
                                               2
                                        (1 + T)
               PoincareSeries => ----------------------
                                           2     3    4
                                 1 - T - 5T  - 2T  + T
               q => 1
               r => 3

o2 : HashTable

i3 : data#"PoincareSeries"

                   2
            (1 + T)
o3 = ----------------------
               2     3    4
     1 - T - 5T  - 2T  + T

o3 : Expression of class Divide

i4 : Q = QQ[w,x,y,z];

i5 : torAlgData (Q/ideal(w^2-x*y*z,x^3,y^3,x^2*z,y^2*z,z^3-x*y*w,x*z*w,y*z*w,z^2*w-x^2*y^2))

o5 = HashTable{BassSeries => 1                          }
               c => 4
               Class => GH
               e => 4
               h => 0
               isCI => false
               isGolod => false
               isGorenstein => true
               m => 9
               n => 1
               p => 2
                                                2
                                         (1 + T)
               PoincareSeries => -----------------------
                                            2     4    5
                                 1 - 2T - 6T  + 2T  - T
               q => 3
               r => 9

o5 : HashTable

i6 : Q = QQ[v,w,x,y,z];

i7 : torAlgData (Q/(ideal(v^2-w^3)*ideal(v,w,x,y,z)))

                                        2     3    4    5
                             1 + 4T + 6T  + 4T  + T  - T
o7 = HashTable{BassSeries => ----------------------------    }
                                       2     3     4    5
                             1 - T - 4T  - 6T  - 4T  - T
               c => 5
               Class => Golod
               e => 5
               h => 4
               isCI => false
               isGolod => true
               isGorenstein => false
               m => 5
               n => 1
               p => 0
                                                  4
                                           (1 + T)
               PoincareSeries => ----------------------------
                                           2     3     4    5
                                 1 - T - 4T  - 6T  - 4T  - T
               q => 0
               r => -

o7 : HashTable

i8 : Q = QQ[u,v,w,x,y,z];

i9 : torAlgData (Q/ideal(u^2,v^2,w^2-y^4,x^2,x*y^15))

o9 = HashTable{BassSeries => UNDETERMINED    }
               c => 5
               Class => no class
               e => 6
               h => 1
               isCI => false
               isGolod => false
               isGorenstein => false
               m => 5
               n => 1
               p => UNDETERMINED
               PoincareSeries => UNDETERMINED
               q => UNDETERMINED
               r => -

o9 : HashTable

i10 : 
