-- -*- M2-comint -*- hash: -2105827486

i1 : S = ZZ/101[a,b,c,d]

o1 = S

o1 : PolynomialRing

i2 : nPowers = (S, n,d) ->sum(apply(n, j->(random(1,S))^d))

o2 = nPowers

o2 : FunctionClosure

i3 : minimalBetti inverseSystem nPowers(S,4,3)

            0 1  2 3 4
o3 = total: 1 9 16 9 1
         0: 1 .  . . .
         1: . 6  8 3 .
         2: . 3  8 6 .
         3: . .  . . 1

o3 : BettiTally

i4 : minimalBetti inverseSystem nPowers (S,5,3)

            0 1  2 3 4
o4 = total: 1 6 10 6 1
         0: 1 .  . . .
         1: . 6  5 . .
         2: . .  5 6 .
         3: . .  . . 1

o4 : BettiTally

i5 : Msymm = matrix"0,a,b;a,0,c;b,c,0"

o5 = | 0 a b |
     | a 0 c |
     | b c 0 |

             3       3
o5 : Matrix S  <--- S

i6 : Mskew = matrix"0,a,b;-a,0,c;-b,-c,0"

o6 = | 0  a  b |
     | -a 0  c |
     | -b -c 0 |

             3       3
o6 : Matrix S  <--- S

i7 : minimalBetti coker gens inverseSystem Msymm

            0  1  2  3 4
o7 = total: 3 10 14 10 3
         0: 3  9  7  1 .
         1: .  1  7  9 3

o7 : BettiTally

i8 : minimalBetti coker gens inverseSystem Mskew

            0 1  2 3 4
o8 = total: 3 9 12 9 3
         0: 3 9  6 . .
         1: . .  6 9 3

o8 : BettiTally

i9 : Hessian = (d,f) ->(
         S = ring f;
         B = basis(d,S);
         diff(transpose B, diff(B,f))
         )

o9 = Hessian

o9 : FunctionClosure

i10 : S = ZZ/101[x_1..x_4]

o10 = S

o10 : PolynomialRing

i11 : f = nPowers (S,6,4)

         4      3        2 2        3      4      3        2          2    
o11 = 33x  - 20x x  - 44x x  + 33x x  + 32x  - 19x x  - 37x x x  + x x x  -
         1      1 2      1 2      1 2      2      1 3      1 2 3    1 2 3  
      -----------------------------------------------------------------------
        3        2 2          2    2 2       3        3      4      3    
      6x x  + 37x x  - 16x x x  - x x  - 2x x  - 40x x  + 10x  - 47x x  +
        2 3      1 3      1 2 3    2 3     1 3      2 3      3      1 4  
      -----------------------------------------------------------------------
       2            2        3        2                       2      
      x x x  - 16x x x  - 27x x  + 13x x x  + 41x x x x  + 40x x x  -
       1 2 4      1 2 4      2 4      1 3 4      1 2 3 4      2 3 4  
      -----------------------------------------------------------------------
           2          2        3        2 2         2      2 2          2  
      18x x x  - 49x x x  + 38x x  + 39x x  - 7x x x  - 32x x  - 24x x x  +
         1 3 4      2 3 4      3 4      1 4     1 2 4      2 4      1 3 4  
      -----------------------------------------------------------------------
             2    2 2       3        3       3      4
      48x x x  - x x  + 7x x  - 10x x  + 3x x  + 16x
         2 3 4    3 4     1 4      2 4     3 4      4

o11 : S

i12 : minimalBetti coker gens inverseSystem f

             0 1  2 3 4
o12 = total: 1 6 10 6 1
          0: 1 .  . . .
          1: . 4  2 . .
          2: . 2  6 2 .
          3: . .  2 4 .
          4: . .  . . 1

o12 : BettiTally

i13 : minimalBetti coker gens inverseSystem Hessian(1, f)

             0  1  2  3 4
o13 = total: 4 13 18 13 4
          1: 4 10  6  1 .
          2: .  2  6  2 .
          3: .  1  6 10 4

o13 : BettiTally

i14 : minimalBetti coker gens inverseSystem Hessian(2, f)

             0  1  2  3 4
o14 = total: 6 24 36 24 6
          2: 6 24 36 24 6

o14 : BettiTally

i15 : 
