-- -*- M2-comint -*- hash: 1982661800

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : A = matrix{ {x, x^2 + y^2},
                 {-y, y^2 + z*x},
                 {0, x^2}
               };

             3       2
o2 : Matrix R  <--- R

i3 : I = minors(2, A) -- a birational map

             2       2    3    2    3    2
o3 = ideal (x y + x*y  + y  + x z, x , -x y)

o3 : Ideal of R

i4 : gensSatSpecialFib I

         2    3    2    2    3
o4 = {x*y  + y  + x z, x y, x }

o4 : List

i5 : gensSatSpecialFib(I, 5)

         2    3    2    2    3
o5 = {x*y  + y  + x z, x y, x }

o5 : List

i6 : A = matrix{ {x^3, x^2 + y^2},
                 {-y^3, y^2 + z*x},
                 {0, x^2}
               };

             3       2
o6 : Matrix R  <--- R

i7 : I = minors(2, A) -- a non birational map

             3 2    2 3    5    4    5    2 3
o7 = ideal (x y  + x y  + y  + x z, x , -x y )

o7 : Ideal of R

i8 : gensSatSpecialFib I

       2 3   3 2    5    4    5   9    4 11    11 3     8 6    13 2
o8 = {x y , x y  + y  + x z, x , x y, x y   - x  y z + x y z, x  y }

o8 : List

i9 : gensSatSpecialFib(I, 5)

       2 3   3 2    5    4    5   9    4 11    11 3     8 6    13 2
o9 = {x y , x y  + y  + x z, x , x y, x y   - x  y z + x y z, x  y }

o9 : List

i10 : R = QQ[x,y,u,v, Degrees => {{1,0}, {1,0}, {0,1}, {0,1}}]

o10 = R

o10 : PolynomialRing

i11 : I = ideal(x*u, y*v, x*v + y*u) -- a non birational map

o11 = ideal (x*u, y*v, y*u + x*v)

o11 : Ideal of R

i12 : gensSatSpecialFib(I, 5)

o12 = {x*u, x*v, y*u, y*v}

o12 : List

i13 : 
