-- -*- M2-comint -*- hash: 2093438091

i1 : R = QQ[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : A = matrix{ {x, x^5 + y^5},
                 {-y, y^5 + z*x^2*y^2},
                 {0, x^5}
               };

             3       2
o2 : Matrix R  <--- R

i3 : I = minors(2, A) -- a birational map

             5       5    6    3 2    6    5
o3 = ideal (x y + x*y  + y  + x y z, x , -x y)

o3 : Ideal of R

i4 : satSpecialFiberIdeal I

o4 = ideal ()

o4 : Ideal of QQ[Z ..Z ]
                  1   3

i5 : A = matrix{ {x^3, x^2 + y^2},
                 {-y^3, y^2 + z*x},
                 {0, x^2}
               };

             3       2
o5 : Matrix R  <--- R

i6 : I = minors(2, A) -- a non birational map

             3 2    2 3    5    4    5    2 3
o6 = ideal (x y  + x y  + y  + x z, x , -x y )

o6 : Ideal of R

i7 : satSpecialFiberIdeal I

             2          2            2                   4          2 3  
o7 = ideal (Z  - Z Z , Z Z Z  - Z Z Z  - Z Z  + Z Z , Z Z  - Z Z , Z Z  +
             4    3 6   1 2 3    1 2 3    3 5    1 6   1 3    4 6   1 3  
     ------------------------------------------------------------------------
      2                           3      2   2 2      2                 
     Z Z Z  - Z Z Z Z  - Z Z , Z Z Z  - Z , Z Z Z  + Z Z Z  - Z Z Z Z  -
      1 2 4    1 2 3 4    4 5   1 3 4    6   1 3 4    1 2 6    1 2 3 6  
     ------------------------------------------------------------------------
            2 2        2        3                 2              4 2      2 3
     Z Z , Z Z Z  - Z Z Z Z  + Z Z  - Z Z Z  - Z Z Z  + Z Z Z , Z Z  - Z Z Z 
      5 6   1 2 4    1 2 3 4    3 5    2 4 5    1 3 6    2 4 6   1 2    1 2 3
     ------------------------------------------------------------------------
        3         2          2      2     2                  2        2 2    
     - Z Z Z  - 2Z Z Z  - Z Z Z  + Z  + 2Z Z Z  + Z Z Z Z , Z Z Z  + Z Z Z  -
        1 3 4     1 2 5    2 3 5    5     1 2 6    1 2 3 6   3 4 5    1 2 6  
     ------------------------------------------------------------------------
        2                              2   4        3
     Z Z Z Z  - Z Z Z Z  - Z Z Z  + Z Z , Z Z  - Z Z Z  - Z Z Z Z  +
      1 2 3 6    1 3 4 6    2 5 6    2 6   3 5    1 3 6    1 2 4 6  
     ------------------------------------------------------------------------
     Z Z Z Z )
      2 3 4 6

o7 : Ideal of QQ[Z ..Z ]
                  1   6

i8 : R = QQ[x,y,u,v, Degrees => {{1,0}, {1,0}, {0,1}, {0,1}}]

o8 = R

o8 : PolynomialRing

i9 : I = ideal(x*u, y*u, y*v) -- a birational map

o9 = ideal (x*u, y*u, y*v)

o9 : Ideal of R

i10 : satSpecialFiberIdeal(I, 5)

o10 = ideal ()

o10 : Ideal of QQ[Z ..Z ]
                   1   3

i11 : I = ideal(x*u, y*v, x*v + y*u) -- a non birational map

o11 = ideal (x*u, y*v, y*u + x*v)

o11 : Ideal of R

i12 : satSpecialFiberIdeal(I, 5)

o12 = ideal(Z Z  - Z Z )
             2 3    1 4

o12 : Ideal of QQ[Z ..Z ]
                   1   4

i13 : 
