-- -*- M2-comint -*- hash: -1169735863

i1 : M = matroid({a,b,c,d},{{a,b},{a,c}})

o1 = a "matroid" of rank 2 on 4 elements

o1 : Matroid

i2 : M_2

o2 = c

o2 : Symbol

i3 : M_{0,2,3}

o3 = {a, c, d}

o3 : List

i4 : B = (bases M)#0

o4 = set {0, 1}

o4 : Set

i5 : M_B

o5 = set {a, b}

o5 : Set

i6 : F7 = specificMatroid "fano"

o6 = a "matroid" of rank 3 on 7 elements

o6 : Matroid

i7 : M4 = matroid completeGraph 4

o7 = a "matroid" of rank 3 on 6 elements

o7 : Matroid

i8 : all(F7_*, x -> areIsomorphic(F7 \ {x}, M4))

o8 = true

i9 : 
