-- -*- M2-comint -*- hash: -1738273687

i1 : M = matroid completeGraph 4

o1 = a "matroid" of rank 3 on 6 elements

o1 : Matroid

i2 : I = idealChowRing M;

o2 : Ideal of QQ[x   , x   , x   , x   , x   , x   , x         , x         , x      , x         , x      , x      , x         ]
                  {5}   {4}   {3}   {2}   {1}   {0}   {3, 4, 5}   {1, 2, 5}   {0, 5}   {0, 2, 4}   {1, 4}   {2, 3}   {0, 1, 3}

i3 : R = ring I

o3 = R

o3 : PolynomialRing

i4 : S = R/I

o4 = S

o4 : QuotientRing

i5 : R_0

o5 = x
      {5}

o5 : R

i6 : S_1

o6 = x    - x          + x       - x       + x
      {0}    {3, 4, 5}    {0, 5}    {1, 4}    {0, 1, 3}

o6 : S

i7 : S_5*S_6

o7 = 0

o7 : S

i8 : R_7

o8 = x
      {1, 2, 5}

o8 : R

i9 : last baseName R_7

o9 = {1, 2, 5}

o9 : List

i10 : chowVars = hashTable apply(#gens R, i -> last baseName R_i => S_i)

o10 = HashTable{{0, 1, 3} => x                                                 }
                              {0, 1, 3}
                {0, 2, 4} => x
                              {0, 2, 4}
                {0, 5} => x
                           {0, 5}
                {0} => x
                        {0}
                {1, 2, 5} => x
                              {1, 2, 5}
                {1, 4} => x
                           {1, 4}
                {1} => x    - x          + x       + x          - x
                        {0}    {1, 2, 5}    {0, 5}    {0, 2, 4}    {1, 4}
                {2, 3} => x
                           {2, 3}
                {2} => x    - x          + x       - x       + x
                        {0}    {1, 2, 5}    {0, 5}    {2, 3}    {0, 1, 3}
                {3, 4, 5} => x
                              {3, 4, 5}
                {3} => x    - x          + x       + x          - x
                        {0}    {3, 4, 5}    {0, 5}    {0, 2, 4}    {2, 3}
                {4} => x    - x          + x       - x       + x
                        {0}    {3, 4, 5}    {0, 5}    {1, 4}    {0, 1, 3}
                {5} => x    - x          - x          + x          + x
                        {0}    {3, 4, 5}    {1, 2, 5}    {0, 2, 4}    {0, 1, 3}

o10 : HashTable

i11 : chowVars#{5} * chowVars#{0,5}

        2
o11 = -x
        {0, 1, 3}

o11 : S

i12 : 
