-- -*- M2-comint -*- hash: -1791745756

i1 : M = matroid({a,b,c},{{a,b},{a,c},{b,c}})

o1 = a "matroid" of rank 2 on 3 elements

o1 : Matroid

i2 : areIsomorphic(M, uniformMatroid(2,3))

o2 = true

i3 : M0 = matroid({a,b,c},{{a,b},{a,c}})

o3 = a "matroid" of rank 2 on 3 elements

o3 : Matroid

i4 : areIsomorphic(M, M0)

o4 = false

i5 : 
