-- -*- M2-comint -*- hash: 2074764245

i1 : M = uniformMatroid(3, 4);

i2 : N = coextension M

o2 = a "matroid" of rank 4 on 5 elements

o2 : Matroid

i3 : quickIsomorphismTest(N, uniformMatroid(4, 5))

o3 = true

i4 : M = matroid completeGraph 3;

i5 : partition(I -> #I, independentSets M)

o5 = HashTable{0 => {set {}}                            }
               1 => {set {1}, set {2}, set {0}}
               2 => {set {1, 2}, set {0, 2}, set {0, 1}}

o5 : HashTable

i6 : partition(F -> rank(M, F), flats M)

o6 = HashTable{0 => {set {}}                   }
               1 => {set {2}, set {1}, set {0}}
               2 => {set {0, 1, 2}}

o6 : HashTable

i7 : N = coextension M

o7 = a "matroid" of rank 3 on 4 elements

o7 : Matroid

i8 : partition(F -> rank(N, F), flats N)

o8 = HashTable{0 => {set {}}                                                                }
               1 => {set {3}, set {2}, set {1}, set {0}}
               2 => {set {2, 3}, set {1, 3}, set {0, 3}, set {1, 2}, set {0, 2}, set {0, 1}}
               3 => {set {0, 1, 2, 3}}

o8 : HashTable

i9 : 
