-- -*- M2-comint -*- hash: 1398899277

i1 : A = matrix {{1, 0, 0, 1, 1}, {0, 1, 0, 1, -1}, {0, 0, 1, 0, 0}}

o1 = | 1 0 0 1 1  |
     | 0 1 0 1 -1 |
     | 0 0 1 0 0  |

              3        5
o1 : Matrix ZZ  <--- ZZ

i2 : M = matroid A

o2 = a "matroid" of rank 3 on 5 elements

o2 : Matroid

i3 : K = {{2}, {2, 4}, {2, 3}, {1, 2}, {0, 2}, {0, 1, 2, 3, 4}};

i4 : isModularCut(M, K)

o4 = true

i5 : Q1 = elementaryQuotient(M, K)

o5 = a "matroid" of rank 2 on 5 elements

o5 : Matroid

i6 : H = linearSubclass(M, K)

o6 = {set {0, 2}, set {2, 4}, set {1, 2}, set {2, 3}}

o6 : List

i7 : Q2 = elementaryQuotient(M, H, EntryMode => "hyperplanes")

o7 = a "matroid" of rank 2 on 5 elements

o7 : Matroid

i8 : Q1 == Q2

o8 = true

i9 : 
