-- -*- M2-comint -*- hash: -1111085603

i1 : A = matrix {{1, 0, 0, 1, 1}, {0, 1, 0, 1, -1}, {0, 0, 1, 0, 0}}

o1 = | 1 0 0 1 1  |
     | 0 1 0 1 -1 |
     | 0 0 1 0 0  |

              3        5
o1 : Matrix ZZ  <--- ZZ

i2 : M = matroid A

o2 = a "matroid" of rank 3 on 5 elements

o2 : Matroid

i3 : K = modularCut(M, drop(hyperplanes M, 1))

o3 = {set {2}, set {2, 4}, set {2, 3}, set {1, 2}, set {0, 2}, set {0, 1, 2,
     ------------------------------------------------------------------------
     3, 4}}

o3 : List

i4 : extension(M, K, CheckWellDefined => true)

o4 = a "matroid" of rank 3 on 6 elements

o4 : Matroid

i5 : 
