-- -*- M2-comint -*- hash: 1164430975

i1 : M = matroid({a,b,c,d},{{a,b},{a,c}})

o1 = a "matroid" of rank 2 on 4 elements

o1 : Matroid

i2 : peek M

o2 = Matroid{bases => {set {0, 1}, set {0, 2}}}
             cache => CacheTable{...1...}
             groundSet => set {0, 1, 2, 3}
             rank => 2

i3 : M.groundSet

o3 = set {0, 1, 2, 3}

o3 : Set

i4 : M_*

o4 = {a, b, c, d}

o4 : List

i5 : bases M

o5 = {set {0, 1}, set {0, 2}}

o5 : List

i6 : (bases M)#0

o6 = set {0, 1}

o6 : Set

i7 : circuits M

o7 = {set {1, 2}, set {3}}

o7 : List

i8 : flats M

o8 = {set {3}, set {1, 2, 3}, set {0, 3}, set {0, 1, 2, 3}}

o8 : List

i9 : loops M

o9 = {3}

o9 : List

i10 : coloops M

o10 = {0}

o10 : List

i11 : N1 = M | {a,c,d}

o11 = a "matroid" of rank 2 on 3 elements

o11 : Matroid

i12 : N2 = M | set{0,2,3}

o12 = a "matroid" of rank 2 on 3 elements

o12 : Matroid

i13 : N1 == N2

o13 = true

i14 : debugLevel = 1

o14 = 1

i15 : N3 = M | {0,2,3} -- gives a warning, but attempts to treat 0 as an index
 -- indicesOf: 0 is not a member of {a, b, c, d}. Treating 0 as an index (cf. 'help groundSet')...

o15 = a "matroid" of rank 2 on 3 elements

o15 : Matroid

i16 : N3 == N2

o16 = true

i17 : 
