-- -*- M2-comint -*- hash: 1111889396

i1 : isWellDefined matroid({a,b,c,d},{{a,b},{c,d}})

o1 = false

i2 : isWellDefined matroid({a,b,c,d},{{a,b},{a,c}})

o2 = true

i3 : isWellDefined matroid({{1,2,3},{1,4,5},{2,3,4,5},{2,3,6,7},{4,5,6,7}}, EntryMode =>"circuits") -- the Escher "matroid"

o3 = false

i4 : isWellDefined matroid({{1,2,3},{1,4,5},{1,6,7},{2,3,4,5},{2,3,6,7},{4,5,6,7}}, EntryMode =>"circuits")

o4 = true

i5 : isWellDefined matroid random(ZZ^3, ZZ^5)

o5 = true

i6 : isWellDefined matroid completeGraph 4

o6 = true

i7 : isWellDefined uniformMatroid(4, 5)

o7 = true

i8 : R = QQ[x_0..x_3]

o8 = R

o8 : PolynomialRing

i9 : I = monomialIdeal(x_0*x_1, x_0*x_2, x_3)

o9 = monomialIdeal (x x , x x , x )
                     0 1   0 2   3

o9 : MonomialIdeal of R

i10 : isWellDefined matroid I

o10 = false

i11 : symbolicCube = intersect apply(irreducibleDecomposition I, P -> P^3)

                      3 3   3 2     3   2   3 3   2 2     2         2 2   
o11 = monomialIdeal (x x , x x x , x x x , x x , x x x , x x x x , x x x ,
                      0 1   0 1 2   0 1 2   0 2   0 1 3   0 1 2 3   0 2 3 
      -----------------------------------------------------------------------
           2       2   3
      x x x , x x x , x )
       0 1 3   0 2 3   3

o11 : MonomialIdeal of R

i12 : (codim symbolicCube, pdim betti res symbolicCube)

o12 = (2, 3)

o12 : Sequence

i13 : 
