-- -*- M2-comint -*- hash: -1424741031

i1 : A = matrix {{1, 0, 0, 1, 1}, {0, 1, 0, 1, -1}, {0, 0, 1, 0, 0}}

o1 = | 1 0 0 1 1  |
     | 0 1 0 1 -1 |
     | 0 0 1 0 0  |

              3        5
o1 : Matrix ZZ  <--- ZZ

i2 : M = matroid A

o2 = a "matroid" of rank 3 on 5 elements

o2 : Matroid

i3 : K = {{2}, {2, 4}, {2, 3}, {1, 2}, {0, 2}, {0, 1, 2, 3, 4}};

i4 : linearSubclass(M, K, CheckWellDefined => true)

o4 = {set {0, 2}, set {2, 4}, set {1, 2}, set {2, 3}}

o4 : List

i5 : 
