-- -*- M2-comint -*- hash: -1616095994

i1 : M = matroid({a,b,c,d},{{a,b},{a,c}})

o1 = a "matroid" of rank 2 on 4 elements

o1 : Matroid

i2 : loops M

o2 = {3}

o2 : List

i3 : all(loops M, l -> member(set{l}, circuits M))

o3 = true

i4 : loops(M/(set loops M)) == {}

o4 = true

i5 : 
