-- -*- M2-comint -*- hash: -1008747859

i1 : wtr=matrix{{5,6,6},{2,6,0}};

              2        3
o1 : Matrix ZZ  <--- ZZ

i2 : r=ZZ/2[x,y,z,Weights=> entries weightGrevlex(wtr)];

i3 : GB={x^6+x^3*z-y^3*z^2};

i4 : L=testWeightMatrix(wtr,r,GB)

o4 = {false}

o4 : List

i5 : 
