-- -*- M2-comint -*- hash: 673192954

i1 : R = ZZ/32003[x,y,z]

o1 = R

o1 : PolynomialRing

i2 : A = koszulComplexDGA(R)

o2 = {Ring => R                      }
      Underlying algebra => R[T ..T ]
                               1   3
      Differential => {x, y, z}

o2 : DGAlgebra

i3 : apply(numgens R+1, i -> numgens prune homology(i,A))

o3 = {1, 0, 0, 0}

o3 : List

i4 : 
