-- -*- M2-comint -*- hash: 253881904

i1 : R = ZZ/101[a,b,c]/ideal{a^3+b^3+c^3,a*b*c}

o1 = R

o1 : QuotientRing

i2 : K1 = koszulComplexDGA(ideal vars R,Variable=>"Y")

o2 = {Ring => R                      }
      Underlying algebra => R[Y ..Y ]
                               1   3
      Differential => {a, b, c}

o2 : DGAlgebra

i3 : K2 = koszulComplexDGA(ideal {b,c},Variable=>"T")

o3 = {Ring => R                      }
      Underlying algebra => R[T ..T ]
                               1   2
      Differential => {b, c}

o3 : DGAlgebra

i4 : f = dgAlgebraMap(K2,K1,matrix{{0,T_1,T_2}})

o4 = map (R[T ..T ], R[Y ..Y ], {0, T , T , a, b, c})
             1   2      1   3        1   2

o4 : DGAlgebraMap

i5 : g = dgAlgebraMap(K1,K2,matrix{{Y_2,Y_3}})

o5 = map (R[Y ..Y ], R[T ..T ], {Y , Y , a, b, c})
             1   3      1   2     2   3

o5 : DGAlgebraMap

i6 : toComplexMap g

          1             1
o6 = 0 : R  <--------- R  : 0
               | 1 |

          3                   2
     1 : R  <--------------- R  : 1
               {1} | 0 0 |
               {1} | 1 0 |
               {1} | 0 1 |

          3                 1
     2 : R  <------------- R  : 2
               {2} | 0 |
               {2} | 0 |
               {2} | 1 |

o6 : ChainComplexMap

i7 : HHg = HH g
Finding easy relations           :      -- used 0.0210618 seconds

                         ZZ
                        ---[a..c]
           ZZ           101
o7 = map (---[X ..X ], ----------[X ], {X , 0, 0, 0})
          101  1   2           3   1     1
                       (c, b, a )

                                ZZ
                               ---[a..c]
              ZZ               101
o7 : RingMap ---[X ..X ] <--- ----------[X ]
             101  1   2               3   1
                              (c, b, a )

i8 : 
