-- -*- M2-comint -*- hash: -558054071

i1 : R = ZZ/101[a,b,c,d]/ideal{a^3,b^4,c^5,d^6}

o1 = R

o1 : QuotientRing

i2 : A = koszulComplexDGA(R)

o2 = {Ring => R                      }
      Underlying algebra => R[T ..T ]
                               1   4
      Differential => {a, b, c, d}

o2 : DGAlgebra

i3 : apply(maxDegree A + 1, i -> numgens prune homology(i,A))

o3 = {1, 4, 6, 4, 1}

o3 : List

i4 : HA = homologyAlgebra(A)
Finding easy relations           :      -- used 0.0363425 seconds

o4 = HA

o4 : PolynomialRing, 4 skew commutative variables

i5 : numgens HA

o5 = 4

i6 : HA.cache.cycles

       2     3     4     5
o6 = {a T , b T , c T , d T }
         1     2     3     4

o6 : List

i7 : 
