-- -*- M2-comint -*- hash: -74465774

i1 : Q = QQ[x,y,z]

o1 = Q

o1 : PolynomialRing

i2 : I = ideal (x^3,y^3,z^3)

             3   3   3
o2 = ideal (x , y , z )

o2 : Ideal of Q

i3 : R = Q/I

o3 = R

o3 : QuotientRing

i4 : KR = koszulComplexDGA R

o4 = {Ring => R                      }
      Underlying algebra => R[T ..T ]
                               1   3
      Differential => {x, y, z}

o4 : DGAlgebra

i5 : z1 = x^2*T_1

      2
o5 = x T
        1

o5 : R[T ..T ]
        1   3

i6 : z2 = y^2*T_2

      2
o6 = y T
        2

o6 : R[T ..T ]
        1   3

i7 : H = HH(KR)
Finding easy relations           :      -- used 0.0220912 seconds

o7 = H

o7 : PolynomialRing, 3 skew commutative variables

i8 : homologyClass(KR,z1*z2)

o8 = X X
      1 2

o8 : H

i9 : 
