-- -*- M2-comint -*- hash: -1681910074

i1 : R = ZZ/101[a,b,c,d]/ideal{a^4,b^4,c^4,d^4}

o1 = R

o1 : QuotientRing

i2 : S = R/ideal{a^3*b^3*c^3*d^3}

o2 = S

o2 : QuotientRing

i3 : A = acyclicClosure(R,EndDegree=>3)

o3 = {Ring => R                                           }
      Underlying algebra => R[T ..T ]
                               1   8
                                    3     3     3     3
      Differential => {a, b, c, d, a T , b T , c T , d T }
                                      1     2     3     4

o3 : DGAlgebra

i4 : B = A ** S

o4 = {Ring => S                                           }
      Underlying algebra => S[T ..T ]
                               1   8
                                    3     3     3     3
      Differential => {a, b, c, d, a T , b T , c T , d T }
                                      1     2     3     4

o4 : DGAlgebra

i5 : isHomologyAlgebraTrivial(B,GenDegreeLimit=>6)

o5 = true

i6 : R = ZZ/101[a,b,c,d]/ideal{a^4,b^4,c^4,d^4}

o6 = R

o6 : QuotientRing

i7 : A = koszulComplexDGA(R)

o7 = {Ring => R                      }
      Underlying algebra => R[T ..T ]
                               1   4
      Differential => {a, b, c, d}

o7 : DGAlgebra

i8 : isHomologyAlgebraTrivial(A)

o8 = false

i9 : 
