-- -*- M2-comint -*- hash: -541267082

i1 : R = ZZ/101[a,b,c,d]/ideal{a^4+b^4+c^4+d^4}

o1 = R

o1 : QuotientRing

i2 : isGolod(R)

o2 = true

i3 : R = ZZ/101[a,b,c,d]/ideal{a^4,b^4,c^4,d^4}

o3 = R

o3 : QuotientRing

i4 : isGolod(R)

o4 = false

i5 : Q = ZZ/101[a,b,c,d]

o5 = Q

o5 : PolynomialRing

i6 : R = Q/(ideal vars Q)^2

o6 = R

o6 : QuotientRing

i7 : isGolod(R)

o7 = true

i8 : Q = ZZ/101[x_1,x_2,y_1,y_2,z,w]

o8 = Q

o8 : PolynomialRing

i9 : I = ideal {x_1*x_2^2,z^2*w,y_1*y_2^2,x_2^2*z*w,y_2^2*z^2,x_1*x_2*y_1*y_2,x_2^2*y_2^2*z,x_1*y_1*z}

               2   2      2   2      2 2             2 2
o9 = ideal (x x , z w, y y , x z*w, y z , x x y y , x y z, x y z)
             1 2        1 2   2      2     1 2 1 2   2 2    1 1

o9 : Ideal of Q

i10 : R = Q/I

o10 = R

o10 : QuotientRing

i11 : isHomologyAlgebraTrivial koszulComplexDGA R

o11 = true

i12 : isGolod R

o12 = false

i13 : 
