-- -*- M2-comint -*- hash: 1259324654

i1 : R = ZZ/101[a,b,c,d]/ideal{a^4+b^4+c^4+d^4}

o1 = R

o1 : QuotientRing

i2 : isGolodHomomorphism(R,GenDegreeLimit=>5)

o2 = true

i3 : Q = ZZ/101[a,b,c,d]/ideal{a^4,b^4,c^4,d^4}

o3 = Q

o3 : QuotientRing

i4 : R = Q/ideal (a^3*b^3*c^3*d^3)

o4 = R

o4 : QuotientRing

i5 : isGolodHomomorphism(R,GenDegreeLimit=>5,TMOLimit=>3)

o5 = true

i6 : 
