-- -*- M2-comint -*- hash: 1082345402

i1 : Q = QQ[t_1,t_2,t_3,t_4]

o1 = Q

o1 : PolynomialRing

i2 : I = ideal (t_1^3,t_2^3,t_3^3-t_1*t_2^2,t_1^2*t_3^2,t_1*t_2*t_3^2,t_2^2*t_4,t_4^2)

             3   3       2    3   2 2       2   2     2
o2 = ideal (t , t , - t t  + t , t t , t t t , t t , t )
             1   2     1 2    3   1 3   1 2 3   2 4   4

o2 : Ideal of Q

i3 : R = Q/I

o3 = R

o3 : QuotientRing

i4 : KR = koszulComplexDGA R

o4 = {Ring => R                       }
      Underlying algebra => R[T ..T ]
                               1   4
      Differential => {t , t , t , t }
                        1   2   3   4

o4 : DGAlgebra

i5 : H = HH(KR)
Finding easy relations           :      -- used 0.226485 seconds

o5 = H

o5 : QuotientRing

i6 : masseys = masseyTripleProduct(KR,1,1,1);

              5        343
o6 : Matrix QQ  <--- QQ

i7 : rank masseys

o7 = 1

i8 : masseyTripleProduct(KR,X_2,X_4,X_1)

o8 = X
      21

o8 : H

i9 : 
