-- -*- M2-comint -*- hash: 120542325

i1 : Q = QQ[x_1,x_2,y_1,y_2,z]

o1 = Q

o1 : PolynomialRing

i2 : I = ideal (x_1*x_2^2,y_1*y_2^2,z^3,x_1*x_2*y_1*y_2,y_2^2*z^2,x_2^2*z^2,x_1*y_1*z,x_2^2*y_2^2*z)

               2     2   3             2 2   2 2          2 2
o2 = ideal (x x , y y , z , x x y y , y z , x z , x y z, x y z)
             1 2   1 2       1 2 1 2   2     2     1 1    2 2

o2 : Ideal of Q

i3 : R = Q/I

o3 = R

o3 : QuotientRing

i4 : KR = koszulComplexDGA R

o4 = {Ring => R                          }
      Underlying algebra => R[T ..T ]
                               1   5
      Differential => {x , x , y , y , z}
                        1   2   1   2

o4 : DGAlgebra

i5 : z1 = z^2*T_5

      2
o5 = z T
        5

o5 : R[T ..T ]
        1   5

i6 : z2 = y_2^2*T_3

      2
o6 = y T
      2 3

o6 : R[T ..T ]
        1   5

i7 : z3 = x_2^2*T_1

      2
o7 = x T
      2 1

o7 : R[T ..T ]
        1   5

i8 : (lifted12,lift12) = getBoundaryPreimage(KR,z1*z2)

o8 = (true, 0)

o8 : Sequence

i9 : (lifted23,lift23) = getBoundaryPreimage(KR,z2*z3)

               2
o9 = (true, x y T T T  - x x y T T T )
             2 2 1 2 3    1 2 2 2 3 4

o9 : Sequence

i10 : z123 = masseyTripleProduct(KR,z1,z2,z3)
Finding easy relations           :      -- used 0.736188 seconds

             2
o10 = x x y z T T T T
       1 2 2   2 3 4 5

o10 : R[T ..T ]
         1   5

i11 : z123 == lift12*z3 + z1*lift23

o11 = true

i12 : H = HH(KR)

o12 = H

o12 : QuotientRing

i13 : h1 = homologyClass(KR,z1)

o13 = X
       4

o13 : H

i14 : h2 = homologyClass(KR,z2)

o14 = X
       3

o14 : H

i15 : h3 = homologyClass(KR,z3)

o15 = X
       2

o15 : H

i16 : h123 = masseyTripleProduct(KR,h1,h2,h3)

o16 = -X
        31

o16 : H

i17 : h123 == homologyClass(KR,z123)

o17 = true

i18 : 
