-- -*- M2-comint -*- hash: -165334441

i1 : R = ZZ/101[a,b,c,d]

o1 = R

o1 : PolynomialRing

i2 : A = koszulComplexDGA(R)

o2 = {Ring => R                      }
      Underlying algebra => R[T ..T ]
                               1   4
      Differential => {a, b, c, d}

o2 : DGAlgebra

i3 : A.natural

o3 = R[T ..T ]
        1   4

o3 : PolynomialRing, 4 skew commutative variables

i4 : 
