-- -*- M2-comint -*- hash: 824115731

i1 : A = matrix "1,1,1,1; 1,2,3,4"

o1 = | 1 1 1 1 |
     | 1 2 3 4 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : B = syz A

o2 = | 1  2  |
     | -2 -3 |
     | 1  0  |
     | 0  1  |

              4        2
o2 : Matrix ZZ  <--- ZZ

i3 : hilbertBasis(transpose B)

o3 = | 3 2 1 0 |
     | 0 1 2 3 |
     | 1 1 1 1 |

              3        4
o3 : Matrix ZZ  <--- ZZ

i4 : hilbertBasis(A, InputType => "lattice")

o4 = | 3 2 1 0 |
     | 0 1 2 3 |
     | 1 1 1 1 |

              3        4
o4 : Matrix ZZ  <--- ZZ

i5 : 
