-- -*- M2-comint -*- hash: -1112215020

i1 : A = matrix "1,1,1,1; 1,2,3,4"

o1 = | 1 1 1 1 |
     | 1 2 3 4 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : C = toricCircuits A

o2 = | 0 1  -2 1 |
     | 1 -2 1  0 |
     | 1 0  -3 2 |
     | 2 -3 0  1 |

              4        4
o2 : Matrix ZZ  <--- ZZ

i3 : R = QQ[a..d]

o3 = R

o3 : PolynomialRing

i4 : Icircuit = toBinomial(toricCircuits(A), R) -- this is the circuit ideal of A

               2           2           3      2     3    2
o4 = ideal (- c  + b*d, - b  + a*c, - c  + a*d , - b  + a d)

o4 : Ideal of R

i5 : I = toBinomial(toricMarkov(A), R)

               2           2
o5 = ideal (- c  + b*d, - b  + a*c, - b*c + a*d)

o5 : Ideal of R

i6 : I==Icircuit

o6 = false

i7 : a*d-b*c % I -- this binomial is in I:

o7 = 0

o7 : R

i8 : a*d-b*c % Icircuit -- but not in Icircuit:

o8 = - b*c + a*d

o8 : R

i9 : 
