-- -*- M2-comint -*- hash: -1801979901

i1 : A = matrix "1,1,1,1; 1,2,3,4"

o1 = | 1 1 1 1 |
     | 1 2 3 4 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : toricGroebner(A)

o2 = | -1 1  1  -1 |
     | -1 2  -1 0  |
     | 0  -1 2  -1 |

              3        4
o2 : Matrix ZZ  <--- ZZ

i3 : R = QQ[a..d]

o3 = R

o3 : PolynomialRing

i4 : toricGroebner(A,R)

                        2         2
o4 = ideal (b*c - a*d, b  - a*c, c  - b*d)

o4 : Ideal of R

i5 : toricGroebner(A,Weights=>{1,2,3,4})

o5 = | -1 1  1  -1 |
     | -1 2  -1 0  |
     | 0  -1 2  -1 |

              3        4
o5 : Matrix ZZ  <--- ZZ

i6 : 
