-- -*- M2-comint -*- hash: 232114658

i1 : A = matrix "1,1,1,1; 1,2,3,4"

o1 = | 1 1 1 1 |
     | 1 2 3 4 |

              2        4
o1 : Matrix ZZ  <--- ZZ

i2 : toricGraver(A)

o2 = | 1 -2 1  0 |
     | 2 -3 0  1 |
     | 1 -1 -1 1 |
     | 0 1  -2 1 |
     | 1 0  -3 2 |

              5        4
o2 : Matrix ZZ  <--- ZZ

i3 : R = QQ[a..d]

o3 = R

o3 : PolynomialRing

i4 : toricGraver(A,R)

               2           3    2                   2           3      2
o4 = ideal (- b  + a*c, - b  + a d, - b*c + a*d, - c  + b*d, - c  + a*d )

o4 : Ideal of R

i5 : 
