-- -*- M2-comint -*- hash: -2134585664

i1 : S = ZZ/5[x,y,z];

i2 : g = x^4 + y^4 + z^4;

i3 : h = g^4;

i4 : R = S/(g);

i5 : ascendIdeal(1, h, ideal y^3)

             2             2        2
o5 = ideal (z , y*z, x*z, y , x*y, x )

o5 : Ideal of R

i6 : ascendIdeal(1, h, ideal (sub(y, S))^3)

             2             2        2
o6 = ideal (z , y*z, x*z, y , x*y, x )

o6 : Ideal of S

i7 : S = ZZ/5[x,y,z];

i8 : g = x^4 + y^4 + z^4;

i9 : R = S/(g);

i10 : ascendIdeal(1, 4, g, ideal y^3)

              2             2        2
o10 = ideal (z , y*z, x*z, y , x*y, x )

o10 : Ideal of R

i11 : ascendIdeal(1, 4, g, ideal (sub(y, S))^3)

              2             2        2
o11 = ideal (z , y*z, x*z, y , x*y, x )

o11 : Ideal of S

i12 : R = ZZ/5[x,y,z];

i13 : J = ideal(x^12, y^15, z^21);

o13 : Ideal of R

i14 : f = y^2 + x^3 - z^5;

i15 : ascendIdeal(1, f^4, J)

o15 = ideal (z, y, x)

o15 : Ideal of R

i16 : ascendIdeal(1, f^4, J, AscentCount => true)

o16 = (ideal (z, y, x), 3)

o16 : Sequence

i17 : 
