-- -*- M2-comint -*- hash: 1269364695

i1 : S = QQ[x,y,u,v];

i2 : T = QQ[a,b];

i3 : f = map(T, S, {a^3, a^2*b, a*b^2, b^3});

o3 : RingMap T <--- S

i4 : R = S/(ker f);

i5 : canonicalIdeal(R)

o5 = ideal (v, u)

o5 : Ideal of R

i6 : R = ZZ/13[x,y,z]/(x*y, x*z, y*z);

i7 : print \ unique apply(10, i -> canonicalIdeal(R));
ideal (y - 5z, x + 4z)
ideal (y - 4z, x + 2z)
ideal (y - 3z, x + z)
ideal (y + 3z, x + 2z)
ideal (y - 4z, x - z)
ideal (y - 4z, x - 4z)
ideal (y + 5z, x - 3z)
ideal (y - 6z, x + 6z)
ideal (y + 6z, x + 2z)
ideal (y + 6z, x + 4z)

i8 : 
