-- -*- M2-comint -*- hash: 387125745

i1 : R = ZZ/5[x,y,z]/(x^2 + y*z);

i2 : isFPure(R)

o2 = true

i3 : R = ZZ/7[x,y,z]/(x^3 + y^3 + z^3);

i4 : isFPure(R)

o4 = true

i5 : R = ZZ/5[x,y,z]/(x^3 + y^3 + z^3);

i6 : isFPure(R)

o6 = false

i7 : S = ZZ/2[x,y,z];

i8 : isFPure ideal(y^2 - x^3)

o8 = false

i9 : isFPure ideal(z^2 - x*y*z + x*y^2 + x^2*y)

o9 = true

i10 : R = ZZ/5[x,y,z]/((x - 1)^3 + (y - 2)^3 + z^3);

i11 : isFPure(R)

o11 = false

i12 : isFPure(R, AtOrigin => true)

o12 = true

i13 : S = ZZ/13[x,y,z]/(x^3 + y^3 + z^3);

i14 : isFPure(S)

o14 = true

i15 : isFPure(S, AtOrigin => true)

o15 = true

i16 : 
