-- -*- M2-comint -*- hash: -744283027

i1 : T = ZZ/5[x,y];

i2 : S = ZZ/5[a,b,c,d];

i3 : g = map(T, S, {x^3, x^2*y, x*y^2, y^3});

o3 : RingMap T <--- S

i4 : R = S/(ker g);

i5 : time isCohenMacaulay(R)
     -- used 0.00259275 seconds

o5 = true

i6 : time isCohenMacaulay(R, AtOrigin => true)
     -- used 0.00586301 seconds

o6 = true

i7 : R = QQ[x,y,u,v]/(x*u, x*v, y*u, y*v);

i8 : isCohenMacaulay(R)

o8 = false

i9 : 
