-- -*- M2-comint -*- hash: -1372276349

i1 : T = ZZ/5[x,y];

i2 : S = ZZ/5[a,b,c,d];

i3 : g = map(T, S, {x^3, x^2*y, x*y^2, y^3});

o3 : RingMap T <--- S

i4 : R = S/(ker g);

i5 : parameterTestIdeal(R)

o5 = ideal 1

o5 : Ideal of R

i6 : R = ZZ/7[x,y,z]/(x^3 + y^3 + z^3);

i7 : parameterTestIdeal(R)

o7 = ideal (z, y, x)

o7 : Ideal of R

i8 : testIdeal(R)

o8 = ideal (z, y, x)

o8 : Ideal of R

i9 : 
