-- -*- M2-comint -*- hash: -1594037033

i1 : setRandomSeed "nice example 2";

i2 : C=randomChainComplex({1,1,1},{2,2},Height=>10)

       3       5       3
o2 = ZZ  <-- ZZ  <-- ZZ
                      
     0       1       2

o2 : ChainComplex

i3 : C.dd

           3                              5
o3 = 0 : ZZ  <------------------------- ZZ  : 1
                | -14 -7  5 5   3   |
                | 8   13  1 -17 -21 |
                | -13 -15 1 18  21  |

           5                        3
     1 : ZZ  <------------------- ZZ  : 2
                | -11 5   -10 |
                | 26  -29 37  |
                | 19  -16 23  |
                | -41 -1  -22 |
                | 46  -16 38  |

o3 : ChainComplexMap

i4 : maximalEntry C

o4 = {21, 46}

o4 : List

i5 : B=randomChainComplex({2,2,4,2,5,2,2},{2,3,3,2,3,3},Height=>5)

       4       7       10       7       10       8       5
o5 = ZZ  <-- ZZ  <-- ZZ   <-- ZZ  <-- ZZ   <-- ZZ  <-- ZZ
                                                        
     0       1       2        3       4        5       6

o5 : ChainComplex

i6 : maximalEntry B

o6 = {6, 28, 14, 15, 16, 11}

o6 : List

i7 : apply(min B..max B,i->rank HH_i(B**QQ))

o7 = (2, 2, 4, 2, 5, 2, 2)

o7 : Sequence

i8 : 
