-- -*- M2-comint -*- hash: -1518154993

i1 : setRandomSeed "nice example 2";

i2 : C = randomSimplicialComplex(7,20)

       8       24       34       21       3
o2 = ZZ  <-- ZZ   <-- ZZ   <-- ZZ   <-- ZZ
                                         
     0       1        2        3        4

o2 : ChainComplex

i3 : prune HH C

           1
o3 = 0 : ZZ

     1 : 0  

     2 : 0  

           1
     3 : ZZ

     4 : 0  

o3 : GradedModule

i4 : 
