-- -*- M2-comint -*- hash: 1120229902

i1 : F=GF(4);

i2 : R=F[x,y];

i3 : P={{0,0},{1,0},{0,1},{a,a}};

i4 : S={x+y,x^2+y^2, a+x*y^2};

i5 : C=evaluationCode(F,P,S);

i6 : C.VanishingIdeal

                          2              2    2
o6 = ideal (x*y + (a + 1)y  + (a + 1)y, x  + y  + x + y)

o6 : Ideal of R

i7 : C.PolynomialSet

              2    2     2
o7 = {x + y, x  + y , x*y  + a}

o7 : List

i8 : C.LinearCode

                                  4
o8 = LinearCode{AmbientModule => F                                          }
                BaseField => F
                cache => CacheTable{}
                Code => image | 0 0 a   |
                              | 1 1 a   |
                              | 1 1 a   |
                              | 0 0 a+1 |
                GeneratorMatrix => | 0 1 1 0   |
                                   | 0 1 1 0   |
                                   | a a a a+1 |
                Generators => {{0, 1, 1, 0}, {0, 1, 1, 0}, {a, a, a, a + 1}}
                ParityCheckMatrix => | 1 0 0 a+1 |
                                     | 0 1 1 0   |
                ParityCheckRows => {{1, 0, 0, a + 1}, {0, 1, 1, 0}}

o8 : LinearCode

i9 : length C.LinearCode

o9 = 4

i10 : dim C.LinearCode

o10 = 2

i11 : 
