-- -*- M2-comint -*- hash: -1805089894

i1 : F1=GF(2)

o1 = F1

o1 : GaloisField

i2 : G1={{1,1,0,0,0,0},{0,0,1,1,0,0},{0,0,0,0,1,1}}

o2 = {{1, 1, 0, 0, 0, 0}, {0, 0, 1, 1, 0, 0}, {0, 0, 0, 0, 1, 1}}

o2 : List

i3 : C1=linearCode(F1,G1)

                                   6
o3 = LinearCode{AmbientModule => F1                                                            }
                BaseField => F1
                cache => CacheTable{}
                Code => image | 1 0 0 |
                              | 1 0 0 |
                              | 0 1 0 |
                              | 0 1 0 |
                              | 0 0 1 |
                              | 0 0 1 |
                GeneratorMatrix => | 1 1 0 0 0 0 |
                                   | 0 0 1 1 0 0 |
                                   | 0 0 0 0 1 1 |
                Generators => {{1, 1, 0, 0, 0, 0}, {0, 0, 1, 1, 0, 0}, {0, 0, 0, 0, 1, 1}}
                ParityCheckMatrix => | 1 1 0 0 0 0 |
                                     | 0 0 1 1 0 0 |
                                     | 0 0 0 0 1 1 |
                ParityCheckRows => {{1, 1, 0, 0, 0, 0}, {0, 0, 1, 1, 0, 0}, {0, 0, 0, 0, 1, 1}}

o3 : LinearCode

i4 : C1.Code

o4 = image | 1 0 0 |
           | 1 0 0 |
           | 0 1 0 |
           | 0 1 0 |
           | 0 0 1 |
           | 0 0 1 |

                               6
o4 : F1-module, submodule of F1

i5 : F2=GF(3)

o5 = F2

o5 : GaloisField

i6 : G2={{1,0,0,0,0,1,1,1},{0,1,0,0,1,0,1,1},{0,0,1,0,1,1,0,1},{0,0,0,1,1,1,1,0}}

o6 = {{1, 0, 0, 0, 0, 1, 1, 1}, {0, 1, 0, 0, 1, 0, 1, 1}, {0, 0, 1, 0, 1, 1,
     ------------------------------------------------------------------------
     0, 1}, {0, 0, 0, 1, 1, 1, 1, 0}}

o6 : List

i7 : C2=linearCode(F2,G2)

                                   8
o7 = LinearCode{AmbientModule => F2                                                                                                               }
                BaseField => F2
                cache => CacheTable{}
                Code => image | 1 0 0 0 |
                              | 0 1 0 0 |
                              | 0 0 1 0 |
                              | 0 0 0 1 |
                              | 0 1 1 1 |
                              | 1 0 1 1 |
                              | 1 1 0 1 |
                              | 1 1 1 0 |
                GeneratorMatrix => | 1 0 0 0 0 1 1 1 |
                                   | 0 1 0 0 1 0 1 1 |
                                   | 0 0 1 0 1 1 0 1 |
                                   | 0 0 0 1 1 1 1 0 |
                Generators => {{1, 0, 0, 0, 0, 1, 1, 1}, {0, 1, 0, 0, 1, 0, 1, 1}, {0, 0, 1, 0, 1, 1, 0, 1}, {0, 0, 0, 1, 1, 1, 1, 0}}
                ParityCheckMatrix => | 1 0 0 -1 0 -1 -1 1  |
                                     | 0 1 0 -1 0 1  0  -1 |
                                     | 0 0 1 -1 0 0  1  -1 |
                                     | 0 0 0 0  1 1  1  1  |
                ParityCheckRows => {{1, 0, 0, -1, 0, -1, -1, 1}, {0, 1, 0, -1, 0, 1, 0, -1}, {0, 0, 1, -1, 0, 0, 1, -1}, {0, 0, 0, 0, 1, 1, 1, 1}}

o7 : LinearCode

i8 : AM=C2.AmbientModule

       8
o8 = F2

o8 : F2-module, free

i9 : rank(AM)==length(C2)

o9 = true

i10 : dim(C2)==rank(C2.GeneratorMatrix)

o10 = true

i11 : c=matrix{G2_0}

o11 = | 1 0 0 0 0 1 1 1 |

               1        8
o11 : Matrix ZZ  <--- ZZ

i12 : h=transpose matrix({(entries(C2.ParityCheckMatrix))_0})

o12 = | 1  |
      | 0  |
      | 0  |
      | -1 |
      | 0  |
      | -1 |
      | -1 |
      | 1  |

               8        1
o12 : Matrix F2  <--- F2

i13 : c*h

o13 = 0

               1        1
o13 : Matrix F2  <--- F2

i14 : 
