-- -*- M2-comint -*- hash: 1309531753

i1 : C=cartesianCode(ZZ/11,{{1,2,3},{2,6,8}},3)

o1 = EvaluationCode{cache => CacheTable{}                                                                                                                                                                                                                                                                                                                                                             }
                                                               ZZ 9
                    LinearCode => LinearCode{AmbientModule => (--)                                                                                                                                                                                                                                                                                                                                   }
                                                               11
                                                          ZZ
                                             BaseField => --
                                                          11
                                             cache => CacheTable{}
                                             Code => image | 1 1 1  1  -5 -5 3  -5 3  -4 |
                                                           | 1 2 4  -3 2  1  -5 -5 3  -4 |
                                                           | 1 3 -2 5  -1 -4 -2 -5 3  -4 |
                                                           | 1 1 1  1  -3 -3 -2 -3 -2 -5 |
                                                           | 1 2 4  -3 -1 5  -4 -3 -2 -5 |
                                                           | 1 3 -2 5  -5 2  5  -3 -2 -5 |
                                                           | 1 1 1  1  2  2  4  2  4  -3 |
                                                           | 1 2 4  -3 -3 4  -3 2  4  -3 |
                                                           | 1 3 -2 5  -4 -5 1  2  4  -3 |
                                             GeneratorMatrix => | 1  1  1  1  1  1  1  1  1  |
                                                                | 1  2  3  1  2  3  1  2  3  |
                                                                | 1  4  -2 1  4  -2 1  4  -2 |
                                                                | 1  -3 5  1  -3 5  1  -3 5  |
                                                                | -5 2  -1 -3 -1 -5 2  -3 -4 |
                                                                | -5 1  -4 -3 5  2  2  4  -5 |
                                                                | 3  -5 -2 -2 -4 5  4  -3 1  |
                                                                | -5 -5 -5 -3 -3 -3 2  2  2  |
                                                                | 3  3  3  -2 -2 -2 4  4  4  |
                                                                | -4 -4 -4 -5 -5 -5 -3 -3 -3 |
                                             Generators => {{1, 1, 1, 1, 1, 1, 1, 1, 1}, {1, 2, 3, 1, 2, 3, 1, 2, 3}, {1, 4, -2, 1, 4, -2, 1, 4, -2}, {1, -3, 5, 1, -3, 5, 1, -3, 5}, {-5, 2, -1, -3, -1, -5, 2, -3, -4}, {-5, 1, -4, -3, 5, 2, 2, 4, -5}, {3, -5, -2, -2, -4, 5, 4, -3, 1}, {-5, -5, -5, -3, -3, -3, 2, 2, 2}, {3, 3, 3, -2, -2, -2, 4, 4, 4}, {-4, -4, -4, -5, -5, -5, -3, -3, -3}}
                                             ParityCheckMatrix => | 1 -2 1 3 5 3 -4 -3 -4 |
                                             ParityCheckRows => {{1, -2, 1, 3, 5, 3, -4, -3, -4}}
                    Points => {{1, 6}, {2, 6}, {3, 6}, {1, 8}, {2, 8}, {3, 8}, {1, 2}, {2, 2}, {3, 2}}
                                              2   3   2             2       2   3
                    PolynomialSet => {1, t , t , t , t t , t t , t t , t , t , t }
                                          0   0   0   0 1   0 1   0 1   1   1   1
                    Sets => {{1, 2, 3}, {2, 6, 8}}
                                              3     2       3     2
                    VanishingIdeal => ideal (t  + 5t  + 5, t  - 5t  - t  + 3)
                                              0     0       1     1    1

o1 : EvaluationCode

i2 : F=GF(4);

i3 : R=F[x,y];

i4 : C=cartesianCode(F,{{0,1,a},{0,1,a}},{1+x+y,x*y})

o4 = EvaluationCode{cache => CacheTable{}                                                                                                                                                                                                                                           }
                                                               9
                    LinearCode => LinearCode{AmbientModule => F                                                                                                                                                                                                                    }
                                             BaseField => F
                                             cache => CacheTable{}
                                             Code => image | a   a   |
                                                           | a   a   |
                                                           | 1   a+1 |
                                                           | 1   0   |
                                                           | 0   0   |
                                                           | 0   0   |
                                                           | 1   1   |
                                                           | a+1 0   |
                                                           | a+1 0   |
                                             GeneratorMatrix => | a a 1   1 0 0 1 a+1 a+1 |
                                                                | a a a+1 0 0 0 1 0   0   |
                                             Generators => {{a, a, 1, 1, 0, 0, 1, a + 1, a + 1}, {a, a, a + 1, 0, 0, 0, 1, 0, 0}}
                                             ParityCheckMatrix => | 1 0 0 0 0 0 a   0   0 |
                                                                  | 0 1 0 0 0 0 a   0   0 |
                                                                  | 0 0 1 0 0 0 a+1 a+1 0 |
                                                                  | 0 0 0 1 0 0 0   a   0 |
                                                                  | 0 0 0 0 1 0 0   0   0 |
                                                                  | 0 0 0 0 0 1 0   0   0 |
                                                                  | 0 0 0 0 0 0 0   1   1 |
                                             ParityCheckRows => {{1, 0, 0, 0, 0, 0, a, 0, 0}, {0, 1, 0, 0, 0, 0, a, 0, 0}, {0, 0, 1, 0, 0, 0, a + 1, a + 1, 0}, {0, 0, 0, 1, 0, 0, 0, a, 0}, {0, 0, 0, 0, 1, 0, 0, 0, 0}, {0, 0, 0, 0, 0, 1, 0, 0, 0}, {0, 0, 0, 0, 0, 0, 0, 1, 1}}
                    Points => {{1, a}, {a, 1}, {a, a}, {0, 0}, {0, 1}, {1, 0}, {1, 1}, {0, a}, {a, 0}}
                    PolynomialSet => {x + y + 1, x*y}
                    Sets => {{0, 1, a}, {0, 1, a}}
                                              3           2         3           2
                    VanishingIdeal => ideal (x  + (a + 1)x  + a*x, y  + (a + 1)y  + a*y)

o4 : EvaluationCode

i5 : C.LinearCode

                                  9
o5 = LinearCode{AmbientModule => F                                                                                                                                                                                                                    }
                BaseField => F
                cache => CacheTable{}
                Code => image | a   a   |
                              | a   a   |
                              | 1   a+1 |
                              | 1   0   |
                              | 0   0   |
                              | 0   0   |
                              | 1   1   |
                              | a+1 0   |
                              | a+1 0   |
                GeneratorMatrix => | a a 1   1 0 0 1 a+1 a+1 |
                                   | a a a+1 0 0 0 1 0   0   |
                Generators => {{a, a, 1, 1, 0, 0, 1, a + 1, a + 1}, {a, a, a + 1, 0, 0, 0, 1, 0, 0}}
                ParityCheckMatrix => | 1 0 0 0 0 0 a   0   0 |
                                     | 0 1 0 0 0 0 a   0   0 |
                                     | 0 0 1 0 0 0 a+1 a+1 0 |
                                     | 0 0 0 1 0 0 0   a   0 |
                                     | 0 0 0 0 1 0 0   0   0 |
                                     | 0 0 0 0 0 1 0   0   0 |
                                     | 0 0 0 0 0 0 0   1   1 |
                ParityCheckRows => {{1, 0, 0, 0, 0, 0, a, 0, 0}, {0, 1, 0, 0, 0, 0, a, 0, 0}, {0, 0, 1, 0, 0, 0, a + 1, a + 1, 0}, {0, 0, 0, 1, 0, 0, 0, a, 0}, {0, 0, 0, 0, 1, 0, 0, 0, 0}, {0, 0, 0, 0, 0, 1, 0, 0, 0}, {0, 0, 0, 0, 0, 0, 0, 1, 1}}

o5 : LinearCode

i6 : F=GF(4);

i7 : R=F[x,y];

i8 : C=cartesianCode(F,{{0,1,a},{0,1,a}},matrix{{1,2},{2,3}})

o8 = EvaluationCode{cache => CacheTable{}                                                                                                                                                                                                                                       }
                                                               9
                    LinearCode => LinearCode{AmbientModule => F                                                                                                                                                                                                                }
                                             BaseField => F
                                             cache => CacheTable{}
                                             Code => image | 0   0   |
                                                           | 0   0   |
                                                           | 0   0   |
                                                           | 0   0   |
                                                           | 0   0   |
                                                           | 1   1   |
                                                           | a+1 1   |
                                                           | a   a+1 |
                                                           | 1   a+1 |
                                             GeneratorMatrix => | 0 0 0 0 0 1 a+1 a   1   |
                                                                | 0 0 0 0 0 1 1   a+1 a+1 |
                                             Generators => {{0, 0, 0, 0, 0, 1, a + 1, a, 1}, {0, 0, 0, 0, 0, 1, 1, a + 1, a + 1}}
                                             ParityCheckMatrix => | 1 0 0 0 0 0 0 0 0   |
                                                                  | 0 1 0 0 0 0 0 0 0   |
                                                                  | 0 0 1 0 0 0 0 0 0   |
                                                                  | 0 0 0 1 0 0 0 0 0   |
                                                                  | 0 0 0 0 1 0 0 0 0   |
                                                                  | 0 0 0 0 0 1 0 1 a+1 |
                                                                  | 0 0 0 0 0 0 1 a 0   |
                                             ParityCheckRows => {{1, 0, 0, 0, 0, 0, 0, 0, 0}, {0, 1, 0, 0, 0, 0, 0, 0, 0}, {0, 0, 1, 0, 0, 0, 0, 0, 0}, {0, 0, 0, 1, 0, 0, 0, 0, 0}, {0, 0, 0, 0, 1, 0, 0, 0, 0}, {0, 0, 0, 0, 0, 1, 0, 1, a + 1}, {0, 0, 0, 0, 0, 0, 1, a, 0}}
                    Points => {{0, 0}, {1, 0}, {0, 1}, {a, 0}, {0, a}, {1, 1}, {1, a}, {a, 1}, {a, a}}
                                         2   2 3
                    PolynomialSet => {t t , t t }
                                       0 1   0 1
                    Sets => {{0, 1, a}, {0, 1, a}}
                                              3           2          3           2
                    VanishingIdeal => ideal (t  + (a + 1)t  + a*t , t  + (a + 1)t  + a*t )
                                              0           0      0   1           1      1

o8 : EvaluationCode

i9 : 
