-- -*- M2-comint -*- hash: 1160353209

i1 : F=GF(5);

i2 : R=F[x];

i3 : g=x-1;

i4 : C=cyclicCode(F,g,8)

                                  8
o4 = LinearCode{AmbientModule => F                                                                                                                                                                                         }
                BaseField => F
                cache => CacheTable{}
                Code => image | -1 0  0  0  0  0  0  |
                              | 1  -1 0  0  0  0  0  |
                              | 0  1  -1 0  0  0  0  |
                              | 0  0  1  -1 0  0  0  |
                              | 0  0  0  1  -1 0  0  |
                              | 0  0  0  0  1  -1 0  |
                              | 0  0  0  0  0  1  -1 |
                              | 0  0  0  0  0  0  1  |
                GeneratorMatrix => | -1 1  0  0  0  0  0  0 |
                                   | 0  -1 1  0  0  0  0  0 |
                                   | 0  0  -1 1  0  0  0  0 |
                                   | 0  0  0  -1 1  0  0  0 |
                                   | 0  0  0  0  -1 1  0  0 |
                                   | 0  0  0  0  0  -1 1  0 |
                                   | 0  0  0  0  0  0  -1 1 |
                Generators => {{-1, 1, 0, 0, 0, 0, 0, 0}, {0, -1, 1, 0, 0, 0, 0, 0}, {0, 0, -1, 1, 0, 0, 0, 0}, {0, 0, 0, -1, 1, 0, 0, 0}, {0, 0, 0, 0, -1, 1, 0, 0}, {0, 0, 0, 0, 0, -1, 1, 0}, {0, 0, 0, 0, 0, 0, -1, 1}}
                ParityCheckMatrix => | 1 1 1 1 1 1 1 1 |
                ParityCheckRows => {{1, 1, 1, 1, 1, 1, 1, 1}}

o4 : LinearCode

i5 : F=GF(5);

i6 : R=F[x];

i7 : C=cyclicCode(F,0,5)

                                  5
o7 = LinearCode{AmbientModule => F                                                                                      }
                BaseField => F
                cache => CacheTable{}
                GeneratorMatrix => 0
                Generators => {{}}
                ParityCheckMatrix => | 1 0 0 0 0 |
                                     | 0 1 0 0 0 |
                                     | 0 0 1 0 0 |
                                     | 0 0 0 1 0 |
                                     | 0 0 0 0 1 |
                ParityCheckRows => {{1, 0, 0, 0, 0}, {0, 1, 0, 0, 0}, {0, 0, 1, 0, 0}, {0, 0, 0, 1, 0}, {0, 0, 0, 0, 1}}

o7 : LinearCode

i8 : C=cyclicCode(F,2,5)

                                  5
o8 = LinearCode{AmbientModule => F                                                                                 }
                BaseField => F
                cache => CacheTable{}
                GeneratorMatrix => | 1 0 0 0 0 |
                                   | 0 1 0 0 0 |
                                   | 0 0 1 0 0 |
                                   | 0 0 0 1 0 |
                                   | 0 0 0 0 1 |
                Generators => {{1, 0, 0, 0, 0}, {0, 1, 0, 0, 0}, {0, 0, 1, 0, 0}, {0, 0, 0, 1, 0}, {0, 0, 0, 0, 1}}
                ParityCheckMatrix => 0
                ParityCheckRows => {{}}

o8 : LinearCode

i9 : 
