-- -*- M2-comint -*- hash: -900995577

i1 : v=toList(1,0,2,0);

i2 : M =cyclicMatrix(v)

o2 = | 1 0 2 0 |
     | 0 1 0 2 |
     | 2 0 1 0 |
     | 0 2 0 1 |

              4        4
o2 : Matrix ZZ  <--- ZZ

i3 : F=GF(4,Variable=>a);

i4 : v={0,1,a};

i5 : M=cyclicMatrix(F,v)

o5 = | 0 1 a |
     | a 0 1 |
     | 1 a 0 |

             3       3
o5 : Matrix F  <--- F

i6 : 
