-- -*- M2-comint -*- hash: -586928789

i1 : F=GF(4);

i2 : R=F[x,y,z];

i3 : P={{0,0,0},{1,0,0},{0,1,0},{0,0,1},{1,1,1},{a,a,a}};

i4 : S={x+y+z,a+y*z^2,z^2,x+y+z+z^2};

i5 : C=evaluationCode(F,P,S)

o5 = EvaluationCode{cache => CacheTable{}                                                                                                               }
                                                               6
                    LinearCode => LinearCode{AmbientModule => F                                                                                        }
                                             BaseField => F
                                             cache => CacheTable{}
                                             Code => image | 0 a   0   0 |
                                                           | 1 a   0   1 |
                                                           | 1 a   0   1 |
                                                           | 1 a   1   0 |
                                                           | 1 a+1 1   0 |
                                                           | a a+1 a+1 1 |
                                             GeneratorMatrix => | 0 1 1 1 1   a   |
                                                                | a a a a a+1 a+1 |
                                                                | 0 0 0 1 1   a+1 |
                                                                | 0 1 1 0 0   1   |
                                             Generators => {{0, 1, 1, 1, 1, a}, {a, a, a, a, a + 1, a + 1}, {0, 0, 0, 1, 1, a + 1}, {0, 1, 1, 0, 0, 1}}
                                             ParityCheckMatrix => | 1 0 0 a   a 0 |
                                                                  | 0 1 0 a+1 0 1 |
                                                                  | 0 0 1 a+1 0 1 |
                                             ParityCheckRows => {{1, 0, 0, a, a, 0}, {0, 1, 0, a + 1, 0, 1}, {0, 0, 1, a + 1, 0, 1}}
                    Points => {{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {1, 1, 1}, {a, a, a}}
                                                    2       2   2
                    PolynomialSet => {x + y + z, y*z  + a, z , z  + x + y + z}
                                                         2    2                      2    2           3           2
                    VanishingIdeal => ideal (x*z + y*z, y  + z  + y + z, x*y + y*z, x  + z  + x + z, z  + (a + 1)z  + a*z)

o5 : EvaluationCode

i6 : F=GF(4);

i7 : R=F[x,y,z];

i8 : P={{0,0,0},{1,0,0},{0,1,0},{0,0,1},{1,1,1},{a,a,a}};

i9 : M=matrix{{0,0,1},{1,1,1}};

              2        3
o9 : Matrix ZZ  <--- ZZ

i10 : C=evaluationCode(F,P,M)

o10 = EvaluationCode{cache => CacheTable{}                                                                                                        }
                                                                6
                     LinearCode => LinearCode{AmbientModule => F                                                                                 }
                                              BaseField => F
                                              cache => CacheTable{}
                                              Code => image | 0 0 |
                                                            | 0 0 |
                                                            | 0 0 |
                                                            | 1 0 |
                                                            | 1 1 |
                                                            | a 1 |
                                              GeneratorMatrix => | 0 0 0 1 1 a |
                                                                 | 0 0 0 0 1 1 |
                                              Generators => {{0, 0, 0, 1, 1, a}, {0, 0, 0, 0, 1, 1}}
                                              ParityCheckMatrix => | 1 0 0 0 0 0 |
                                                                   | 0 1 0 0 0 0 |
                                                                   | 0 0 1 0 0 0 |
                                                                   | 0 0 0 1 a a |
                                              ParityCheckRows => {{1, 0, 0, 0, 0, 0}, {0, 1, 0, 0, 0, 0}, {0, 0, 1, 0, 0, 0}, {0, 0, 0, 1, a, a}}
                     Points => {{0, 0, 0}, {1, 0, 0}, {0, 1, 0}, {0, 0, 1}, {1, 1, 1}, {a, a, a}}
                     PolynomialSet => {t , t t t }
                                        2   0 1 2
                                                            2    2                          2    2             3           2
                     VanishingIdeal => ideal (t t  + t t , t  + t  + t  + t , t t  + t t , t  + t  + t  + t , t  + (a + 1)t  + a*t )
                                               0 2    1 2   1    2    1    2   0 1    1 2   0    2    0    2   2           2      2

o10 : EvaluationCode

i11 : 
