-- -*- M2-comint -*- hash: -1156031439

i1 : F = GF(4);

i2 : P = {{0, 0}, {a, a}, {a+1, a}, {1, a}, {a, a+1}, {a+1, a+1}, {1, a+1}, {0, 1}};

i3 : C = orderCode(F,P,{2,3},7);

i4 : peek C

o4 = EvaluationCode{cache => CacheTable{}                                                                                                                                                                                                                                                                                           }
                    Points => {{0, 0}, {a, a}, {a + 1, a}, {1, a}, {a, a + 1}, {a + 1, a + 1}, {1, a + 1}, {0, 1}}
                                                               8
                    LinearCode => LinearCode{AmbientModule => F                                                                                                                                                                                                                                                                    }
                                             BaseField => F
                                             cache => CacheTable{}
                                             Code => image | 1 0   0   0   0 0   0   0   |
                                                           | 1 a+1 1   a   1 a   a+1 a+1 |
                                                           | 1 a   a+1 a   1 a+1 a+1 1   |
                                                           | 1 1   a   a   1 1   a+1 a   |
                                                           | 1 a+1 a   a+1 1 a   a   1   |
                                                           | 1 a   1   a+1 1 a+1 a   a   |
                                                           | 1 1   a+1 a+1 1 1   a   a+1 |
                                                           | 1 0   0   1   0 0   1   0   |
                                             GeneratorMatrix => | 1 1   1   1   1   1   1   1 |
                                                                | 0 a+1 a   1   a+1 a   1   0 |
                                                                | 0 1   a+1 a   a   1   a+1 0 |
                                                                | 0 a   a   a   a+1 a+1 a+1 1 |
                                                                | 0 1   1   1   1   1   1   0 |
                                                                | 0 a   a+1 1   a   a+1 1   0 |
                                                                | 0 a+1 a+1 a+1 a   a   a   1 |
                                                                | 0 a+1 1   a   1   a   a+1 0 |
                                             Generators => {{1, 1, 1, 1, 1, 1, 1, 1}, {0, a + 1, a, 1, a + 1, a, 1, 0}, {0, 1, a + 1, a, a, 1, a + 1, 0}, {0, a, a, a, a + 1, a + 1, a + 1, 1}, {0, 1, 1, 1, 1, 1, 1, 0}, {0, a, a + 1, 1, a, a + 1, 1, 0}, {0, a + 1, a + 1, a + 1, a, a, a, 1}, {0, a + 1, 1, a, 1, a, a + 1, 0}}
                                             ParityCheckMatrix => | 1 1 1 1 1 1 1 1 |
                                             ParityCheckRows => {{1, 1, 1, 1, 1, 1, 1, 1}}
                                                2               3    2        4
                    VanishingIdeal => ideal (t t  + t t  + t , t  + t  + t , t  + t )
                                              0 1    0 1    0   0    1    1   1    1
                                          2   2         3       2
                    PolynomialSet => {1, t , t t , t , t , t , t , t t }
                                          0   0 1   1   0   0   1   0 1

i5 : F = GF(4);

i6 : R = F[x,y];

i7 : I = ideal(x^3+y^2+y)

            3    2
o7 = ideal(x  + y  + y)

o7 : Ideal of R

i8 : P = {{0, 0}, {a, a}, {a+1, a}, {1, a}};

i9 : C = orderCode(I,P,{2,3},7);

i10 : peek C

o10 = EvaluationCode{cache => CacheTable{}                                                                                                                                     }
                     Points => {{0, 0}, {a, a}, {a + 1, a}, {1, a}}
                                                                4
                     LinearCode => LinearCode{AmbientModule => F                                                                                                              }
                                              BaseField => F
                                              cache => CacheTable{}
                                              Code => image | 0   0 0   0   0   1 0 |
                                                            | 1   a a+1 a+1 a   1 1 |
                                                            | a+1 a 1   a   a+1 1 1 |
                                                            | a   a a   1   1   1 1 |
                                              GeneratorMatrix => | 0 1   a+1 a |
                                                                 | 0 a   a   a |
                                                                 | 0 a+1 1   a |
                                                                 | 0 a+1 a   1 |
                                                                 | 0 a   a+1 1 |
                                                                 | 1 1   1   1 |
                                                                 | 0 1   1   1 |
                                              Generators => {{0, 1, a + 1, a}, {0, a, a, a}, {0, a + 1, 1, a}, {0, a + 1, a, 1}, {0, a, a + 1, 1}, {1, 1, 1, 1}, {0, 1, 1, 1}}
                                              ParityCheckMatrix => 0
                                              ParityCheckRows => {}
                                               2                       3
                     VanishingIdeal => ideal (t  + a*t , t t  + a*t , t  + (a + 1)t )
                                               1      1   0 1      0   0           1
                                        2               2          3
                     PolynomialSet => {t t , t , t t , t , t , 1, t }
                                        0 1   1   0 1   0   0      0

i11 : F = GF(4);

i12 : R = F[x,y];

i13 : I = ideal(x^3+y^2+y);

o13 : Ideal of R

i14 : C = orderCode(I,{2,3},7);

i15 : peek C

o15 = EvaluationCode{cache => CacheTable{}                                                                                                                                                                                                                                                     }
                     Points => {{0, 0}, {a, a}, {a + 1, a}, {1, a}, {a, a + 1}, {a + 1, a + 1}, {1, a + 1}, {0, 1}}
                                                                8
                     LinearCode => LinearCode{AmbientModule => F                                                                                                                                                                                                                              }
                                              BaseField => F
                                              cache => CacheTable{}
                                              Code => image | 0   0   1 0 0   0   0   |
                                                            | a+1 a   1 1 1   a   a+1 |
                                                            | a   a+1 1 1 a+1 a   1   |
                                                            | 1   1   1 1 a   a   a   |
                                                            | a+1 a   1 1 a   a+1 1   |
                                                            | a   a+1 1 1 1   a+1 a   |
                                                            | 1   1   1 1 a+1 a+1 a+1 |
                                                            | 0   0   1 0 0   1   0   |
                                              GeneratorMatrix => | 0 a+1 a   1 a+1 a   1   0 |
                                                                 | 0 a   a+1 1 a   a+1 1   0 |
                                                                 | 1 1   1   1 1   1   1   1 |
                                                                 | 0 1   1   1 1   1   1   0 |
                                                                 | 0 1   a+1 a a   1   a+1 0 |
                                                                 | 0 a   a   a a+1 a+1 a+1 1 |
                                                                 | 0 a+1 1   a 1   a   a+1 0 |
                                              Generators => {{0, a + 1, a, 1, a + 1, a, 1, 0}, {0, a, a + 1, 1, a, a + 1, 1, 0}, {1, 1, 1, 1, 1, 1, 1, 1}, {0, 1, 1, 1, 1, 1, 1, 0}, {0, 1, a + 1, a, a, 1, a + 1, 0}, {0, a, a, a, a + 1, a + 1, a + 1, 1}, {0, a + 1, 1, a, 1, a, a + 1, 0}}
                                              ParityCheckMatrix => | 1 1 1 1 1 1 1 1 |
                                              ParityCheckRows => {{1, 1, 1, 1, 1, 1, 1, 1}}
                                                 2               3    2        4
                     VanishingIdeal => ideal (t t  + t t  + t , t  + t  + t , t  + t )
                                               0 1    0 1    0   0    1    1   1    1
                                        2          3   2
                     PolynomialSet => {t , t , 1, t , t t , t , t t }
                                        0   0      0   0 1   1   0 1

i16 : 
