-- -*- M2-comint -*- hash: 1941963498

i1 : F = GF(5);

i2 : L = apply(toList(1..2),j-> apply(toList(1..4),i-> random(F)));

i3 : L

o3 = {{-2, 0, 2, -2}, {0, -1, -2, 1}}

o3 : List

i4 : C2=quasiCyclicCode(L)

                                  4
o4 = LinearCode{AmbientModule => F                                                                                                                            }
                BaseField => F
                cache => CacheTable{}
                Code => image | -2 -2 2  0  0  1  -2 -1 |
                              | 0  -2 -2 2  -1 0  1  -2 |
                              | 2  0  -2 -2 -2 -1 0  1  |
                              | -2 2  0  -2 1  -2 -1 0  |
                GeneratorMatrix => | -2 0  2  -2 |
                                   | -2 -2 0  2  |
                                   | 2  -2 -2 0  |
                                   | 0  2  -2 -2 |
                                   | 0  -1 -2 1  |
                                   | 1  0  -1 -2 |
                                   | -2 1  0  -1 |
                                   | -1 -2 1  0  |
                Generators => {{-2, 0, 2, -2}, {-2, -2, 0, 2}, {2, -2, -2, 0}, {0, 2, -2, -2}, {0, -1, -2, 1}, {1, 0, -1, -2}, {-2, 1, 0, -1}, {-1, -2, 1, 0}}
                ParityCheckMatrix => 0
                ParityCheckRows => {}

o4 : LinearCode

i5 : F = GF(5);

i6 : L = apply(toList(1..2),j-> apply(toList(1..4),i-> random(F)));

i7 : L

o7 = {{-2, -2, 0, 0}, {-2, 0, -1, -2}}

o7 : List

i8 : C2=quasiCyclicCode(F,L)

                                  4
o8 = LinearCode{AmbientModule => F                                                                                                                                }
                BaseField => F
                cache => CacheTable{}
                Code => image | -2 0  0  -2 -2 -2 -1 0  |
                              | -2 -2 0  0  0  -2 -2 -1 |
                              | 0  -2 -2 0  -1 0  -2 -2 |
                              | 0  0  -2 -2 -2 -1 0  -2 |
                GeneratorMatrix => | -2 -2 0  0  |
                                   | 0  -2 -2 0  |
                                   | 0  0  -2 -2 |
                                   | -2 0  0  -2 |
                                   | -2 0  -1 -2 |
                                   | -2 -2 0  -1 |
                                   | -1 -2 -2 0  |
                                   | 0  -1 -2 -2 |
                Generators => {{-2, -2, 0, 0}, {0, -2, -2, 0}, {0, 0, -2, -2}, {-2, 0, 0, -2}, {-2, 0, -1, -2}, {-2, -2, 0, -1}, {-1, -2, -2, 0}, {0, -1, -2, -2}}
                ParityCheckMatrix => 0
                ParityCheckRows => {}

o8 : LinearCode

i9 : 
