-- -*- M2-comint -*- hash: 866990658

i1 : F = GF(4);

i2 : n = 7;

i3 : k = 3;

i4 : L = apply(toList(1..k),j-> apply(toList(1..n),i-> random(F)));

i5 : m=matrix(L)

o5 = | 1 0 a 1 1 0 a+1 |
     | 1 0 1 1 1 0 a   |
     | 1 0 a 1 1 a 1   |

             3       7
o5 : Matrix F  <--- F

i6 : reducedMatrix(m)

o6 = | 1 0 0   1 1 0 0 |
     | 0 0 a+1 0 0 1 0 |
     | 0 0 a+1 0 0 0 1 |

             3       7
o6 : Matrix F  <--- F

i7 : 
