-- -*- M2-comint -*- hash: 178046976

i1 : F = GF(2);

i2 : codeLen = 10;

i3 : L = {{0, 1, 0, 0, 0, 0, 0, 0, 0, 0}, {0, 0, 1, 0, 1, 1, 0, 1, 0,0}, {1, 1, 0, 0, 0, 1, 0, 0, 1, 0}, {1, 0, 0, 1, 0, 0, 0, 1, 1,1}};

i4 : C = linearCode(F,codeLen,L);

i5 : shorten(C, {3,6,8,9});

i6 : F = GF(2);

i7 : codeLen = 10;

i8 : L = {{0, 1, 0, 0, 0, 0, 0, 0, 0, 0}, {0, 0, 1, 0, 1, 1, 0, 1, 0,0}, {1, 1, 0, 0, 0, 1, 0, 0, 1, 0}, {1, 0, 0, 1, 0, 0, 0, 1, 1,1}};

i9 : C = linearCode(F,codeLen,L);

i10 : shorten(C, 3)

                                   9
o10 = LinearCode{AmbientModule => F                                                                                                                                                                                                                                    }
                 BaseField => F
                 cache => CacheTable{}
                 Code => image | 0 1 1 1 0 0 1 0 |
                               | 1 1 1 0 0 0 0 1 |
                               | 0 0 1 1 1 0 0 1 |
                               | 0 0 1 1 1 0 0 1 |
                               | 0 1 0 0 1 0 1 1 |
                               | 0 0 0 0 0 0 0 0 |
                               | 0 0 1 1 1 0 0 1 |
                               | 0 1 1 1 0 0 1 0 |
                               | 0 0 0 0 0 0 0 0 |
                 GeneratorMatrix => | 0 1 0 0 0 0 0 0 0 |
                                    | 1 1 0 0 1 0 0 1 0 |
                                    | 1 1 1 1 0 0 1 1 0 |
                                    | 1 0 1 1 0 0 1 1 0 |
                                    | 0 0 1 1 1 0 1 0 0 |
                                    | 0 0 0 0 0 0 0 0 0 |
                                    | 1 0 0 0 1 0 0 1 0 |
                                    | 0 1 1 1 1 0 1 0 0 |
                 Generators => {{0, 1, 0, 0, 0, 0, 0, 0, 0}, {1, 1, 0, 0, 1, 0, 0, 1, 0}, {1, 1, 1, 1, 0, 0, 1, 1, 0}, {1, 0, 1, 1, 0, 0, 1, 1, 0}, {0, 0, 1, 1, 1, 0, 1, 0, 0}, {0, 0, 0, 0, 0, 0, 0, 0, 0}, {1, 0, 0, 0, 1, 0, 0, 1, 0}, {0, 1, 1, 1, 1, 0, 1, 0, 0}}
                 ParityCheckMatrix => | 0 0 1 1 0 0 0 0 0 |
                                      | 1 0 1 0 1 0 0 0 0 |
                                      | 0 0 0 0 0 1 0 0 0 |
                                      | 0 0 1 0 0 0 1 0 0 |
                                      | 1 0 0 0 0 0 0 1 0 |
                                      | 0 0 0 0 0 0 0 0 1 |
                 ParityCheckRows => {{0, 0, 1, 1, 0, 0, 0, 0, 0}, {1, 0, 1, 0, 1, 0, 0, 0, 0}, {0, 0, 0, 0, 0, 1, 0, 0, 0}, {0, 0, 1, 0, 0, 0, 1, 0, 0}, {1, 0, 0, 0, 0, 0, 0, 1, 0}, {0, 0, 0, 0, 0, 0, 0, 0, 1}}

o10 : LinearCode

i11 : 
