-- -*- M2-comint -*- hash: -455661316

i1 : C = linearCode(GF(4),{{1,1,1,1}});

i2 : size C

o2 = 4

i3 : H = hammingCode(2,3);

i4 : size H

o4 = 16

i5 : F = GF(4,Variable=>a);

i6 : L = {{1,a,a+1},{a+1,1,a},{a,a+1,1},{1,0,1}};

i7 : C = linearCode(F,L);

i8 : size C

o8 = 16

i9 : RM = reedMullerCode(2,3,1);

i10 : size RM.LinearCode

o10 = 16

i11 : 
