-- -*- M2-comint -*- hash: -1174164942

i1 : G = mixedGraph(graph{{3,1}},digraph {{1,2},{2,3}},bigraph {{3,4},{2,4}})

o1 = MixedGraph{Bigraph => Bigraph{2 => {4}   }}
                                   3 => {4}
                                   4 => {3, 2}
                Digraph => Digraph{1 => {2}}
                                   2 => {3}
                                   3 => {}
                Graph => Graph{1 => {3}}
                               3 => {1}

o1 : MixedGraph

i2 : children (G,1)

o2 = set {2}

o2 : Set

i3 : children (G,2)

o3 = set {3}

o3 : Set

i4 : children (G,3)

o4 = set {}

o4 : Set

i5 : 
