-- -*- M2-comint -*- hash: 1488845238

i1 : (g,k,n) = (8,5,1000)

o1 = (8, 5, 1000)

o1 : Sequence

i2 : e = balancedPartition(k-1,g-k+1)

o2 = {1, 1, 1, 1}

o2 : List

i3 : Ican = canCurveWithFixedScroll(g,k,n);

               ZZ
o3 : Ideal of ----[t ..t ]
              1009  0   7

i4 : Jcan = curveOnScroll(Ican,g,k);

               ZZ
o4 : Ideal of ----[pp ..pp , v..w]
              1009   0    3

i5 : betti(resX = resCurveOnScroll(Jcan,g,2))

            0 1 2 3
o5 = total: 1 5 5 1
         0: 1 . . .
         1: . . . .
         2: . 4 1 .
         3: . 1 4 .
         4: . . . .
         5: . . . 1

o5 : BettiTally

i6 : betti(liftMatrixToEN(resX.dd_1,e))

            0 1
o6 = total: 1 9
         0: 1 .
         1: . 9

o6 : BettiTally

i7 : betti(liftMatrixToEN(resX.dd_2,e))

            0  1
o7 = total: 9 11
         2: 9 11

o7 : BettiTally

i8 : betti(liftMatrixToEN(resX.dd_3,e))

             0 1
o8 = total: 11 3
         3: 11 .
         4:  . 3

o8 : BettiTally

i9 : 
