-- -*- M2-comint -*- hash: -367585131

i1 : posHull matrix {{0,0,-1,-1,1},{2,-2,1,-1,0},{1,1,1,1,0}}

o1 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 3
      number of facets => 5
      number of rays => 5

o1 : Cone

i2 : R = matrix{{1,2,3,1},{2,3,1,1},{3,1,2,1}}

o2 = | 1 2 3 1 |
     | 2 3 1 1 |
     | 3 1 2 1 |

              3        4
o2 : Matrix ZZ  <--- ZZ

i3 : C = posHull R

o3 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 3
      number of facets => 3
      number of rays => 3

o3 : Cone

i4 : rays C

o4 = | 2 3 1 |
     | 3 1 2 |
     | 1 2 3 |

              3        3
o4 : Matrix ZZ  <--- ZZ

i5 : LS = matrix{{1},{1},{-2}}

o5 = | 1  |
     | 1  |
     | -2 |

              3        1
o5 : Matrix ZZ  <--- ZZ

i6 : C = posHull(R,LS)

o6 = {ambient dimension => 3           }
      dimension of lineality space => 1
      dimension of the cone => 3
      number of facets => 2
      number of rays => 2

o6 : Cone

i7 : rays C

o7 = | 3 3 |
     | 1 5 |
     | 2 4 |

              3        2
o7 : Matrix ZZ  <--- ZZ

i8 : HS = transpose R

o8 = | 1 2 3 |
     | 2 3 1 |
     | 3 1 2 |
     | 1 1 1 |

              4        3
o8 : Matrix ZZ  <--- ZZ

i9 : C = intersection HS

o9 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 3
      number of facets => 3
      number of rays => 3

o9 : Cone

i10 : rays C

o10 = | 1  7  -5 |
      | 7  -5 1  |
      | -5 1  7  |

               3        3
o10 : Matrix ZZ  <--- ZZ

i11 : HP = transpose LS

o11 = | 1 1 -2 |

               1        3
o11 : Matrix ZZ  <--- ZZ

i12 : C = intersection(HS,HP)

o12 = {ambient dimension => 3           }
       dimension of lineality space => 0
       dimension of the cone => 2
       number of facets => 2
       number of rays => 2

o12 : Cone

i13 : rays C

o13 = | 7  -2 |
      | -5 4  |
      | 1  1  |

               3        2
o13 : Matrix ZZ  <--- ZZ

i14 : 
