-- -*- M2-comint -*- hash: -2139397859

i1 : convexHull(matrix {{0,0,-1,-1},{2,-2,1,-1},{0,0,0,0}},matrix {{1},{0},{0}})

o1 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of polyhedron => 2
      number of facets => 5
      number of rays => 1
      number of vertices => 4

o1 : Polyhedron

i2 : V = matrix {{1,1,-1,-1},{1,-1,1,-1}}

o2 = | 1 1  -1 -1 |
     | 1 -1 1  -1 |

              2        4
o2 : Matrix ZZ  <--- ZZ

i3 : convexHull V

o3 = {ambient dimension => 2           }
      dimension of lineality space => 0
      dimension of polyhedron => 2
      number of facets => 4
      number of rays => 0
      number of vertices => 4

o3 : Polyhedron

i4 : R = matrix {{1},{1}}

o4 = | 1 |
     | 1 |

              2        1
o4 : Matrix ZZ  <--- ZZ

i5 : convexHull(V,R)

o5 = {ambient dimension => 2           }
      dimension of lineality space => 0
      dimension of polyhedron => 2
      number of facets => 4
      number of rays => 1
      number of vertices => 3

o5 : Polyhedron

i6 : HS = transpose V

o6 = | 1  1  |
     | 1  -1 |
     | -1 1  |
     | -1 -1 |

              4        2
o6 : Matrix ZZ  <--- ZZ

i7 : v = R || R

o7 = | 1 |
     | 1 |
     | 1 |
     | 1 |

              4        1
o7 : Matrix ZZ  <--- ZZ

i8 : P = intersection(HS,v)

o8 = {ambient dimension => 2           }
      dimension of lineality space => 0
      dimension of polyhedron => 2
      number of facets => 4
      number of rays => 0
      number of vertices => 4

o8 : Polyhedron

i9 : vertices P

o9 = | -1 1 0  0 |
     | 0  0 -1 1 |

              2        4
o9 : Matrix QQ  <--- QQ

i10 : HS = HS | matrix {{0},{0},{0},{0}}

o10 = | 1  1  0 |
      | 1  -1 0 |
      | -1 1  0 |
      | -1 -1 0 |

               4        3
o10 : Matrix ZZ  <--- ZZ

i11 : HP = matrix {{0,0,1}}

o11 = | 0 0 1 |

               1        3
o11 : Matrix ZZ  <--- ZZ

i12 : w = matrix {{1}}

o12 = | 1 |

               1        1
o12 : Matrix ZZ  <--- ZZ

i13 : P = intersection(HS,v,HP,w)

o13 = {ambient dimension => 3           }
       dimension of lineality space => 0
       dimension of polyhedron => 2
       number of facets => 4
       number of rays => 0
       number of vertices => 4

o13 : Polyhedron

i14 : vertices P

o14 = | -1 1 0  0 |
      | 0  0 -1 1 |
      | 1  1 1  1 |

               3        4
o14 : Matrix QQ  <--- QQ

i15 : 
