-- -*- M2-comint -*- hash: -903262864

i1 : C1 = posHull matrix {{1,1,-1,-1},{1,-1,1,-1},{1,1,1,1}};

i2 : C2 = posHull matrix {{1,1,1},{0,1,-1},{-1,1,1}};

i3 : C3 = posHull matrix {{-1,-1,-1},{0,1,-1},{-1,1,1}};

i4 : C4 = posHull matrix {{1,-1},{0,0},{-1,-1}};

i5 : F = fan {C1,C2,C3,C4}

o5 = {ambient dimension => 3         }
      number of generating cones => 4
      number of rays => 6
      top dimension of the cones => 3

o5 : Fan

i6 : isComplete F

o6 = false

i7 : isPure F

o7 = false

i8 : C5 = posHull matrix {{1,-1,1,-1},{-1,-1,0,0},{1,1,-1,-1}};

i9 : C6 = posHull matrix {{1,-1,1,-1},{1,1,0,0},{1,1,-1,-1}};

i10 : F = addCone({C5,C6},F)

o10 = {ambient dimension => 3         }
       number of generating cones => 5
       number of rays => 6
       top dimension of the cones => 3

o10 : Fan

i11 : isComplete F

o11 = true

i12 : isPolytopal F
{({ambient dimension => 3           }, {2, 3, 5}), ({ambient dimension => 3           }, {2, 3, 4}), ({ambient dimension => 3           }, {1, 3, 5}), ({ambient dimension => 3           }, {1, 3, 4}), ({ambient dimension => 3           }, {1, 2, 5}), ({ambient dimension => 3           }, {1, 2, 4})}
   dimension of lineality space => 0                 dimension of lineality space => 0                 dimension of lineality space => 0                 dimension of lineality space => 0                 dimension of lineality space => 0                 dimension of lineality space => 0
   dimension of the cone => 1                        dimension of the cone => 1                        dimension of the cone => 1                        dimension of the cone => 1                        dimension of the cone => 1                        dimension of the cone => 1
   number of facets => 1                             number of facets => 1                             number of facets => 1                             number of facets => 1                             number of facets => 1                             number of facets => 1
   number of rays => 1                               number of rays => 1                               number of rays => 1                               number of rays => 1                               number of rays => 1                               number of rays => 1
v: {{ambient dimension => 3           }, {ambient dimension => 3           }}
     dimension of lineality space => 0    dimension of lineality space => 0
     dimension of the cone => 3           dimension of the cone => 3
     number of facets => 4                number of facets => 3
     number of rays => 4                  number of rays => 3
v: {{ambient dimension => 3           }, {ambient dimension => 3           }}
     dimension of lineality space => 0    dimension of lineality space => 0
     dimension of the cone => 3           dimension of the cone => 3
     number of facets => 4                number of facets => 3
     number of rays => 4                  number of rays => 3
v: {{ambient dimension => 3           }, {ambient dimension => 3           }}
     dimension of lineality space => 0    dimension of lineality space => 0
     dimension of the cone => 3           dimension of the cone => 3
     number of facets => 4                number of facets => 3
     number of rays => 4                  number of rays => 3
v: {{ambient dimension => 3           }, {ambient dimension => 3           }}
     dimension of lineality space => 0    dimension of lineality space => 0
     dimension of the cone => 3           dimension of the cone => 3
     number of facets => 4                number of facets => 3
     number of rays => 4                  number of rays => 3
v: {{ambient dimension => 3           }, {ambient dimension => 3           }}
     dimension of lineality space => 0    dimension of lineality space => 0
     dimension of the cone => 3           dimension of the cone => 3
     number of facets => 4                number of facets => 3
     number of rays => 4                  number of rays => 3
v: {{ambient dimension => 3           }, {ambient dimension => 3           }}
     dimension of lineality space => 0    dimension of lineality space => 0
     dimension of the cone => 3           dimension of the cone => 3
     number of facets => 4                number of facets => 3
     number of rays => 4                  number of rays => 3

o12 = true

i13 : 
