-- -*- M2-comint -*- hash: -607368738

i1 : C1 = posHull matrix{{1,0},{1,1}};

i2 : C2 = posHull matrix{{1,0},{0,-1}};

i3 : C3 = posHull matrix{{-1,0},{0,1}};

i4 : C4 = posHull matrix{{1,1},{0,1}};

i5 : C5 = posHull matrix {{1,2},{2,1}};

i6 : L = {C1,C2,C3,C4,C5};

i7 : Lpairs = incompCones L

o7 = {({ambient dimension => 2           }, {ambient dimension => 2         
        dimension of lineality space => 0    dimension of lineality space =>
        dimension of the cone => 2           dimension of the cone => 2     
        number of facets => 2                number of facets => 2          
        number of rays => 2                  number of rays => 2            
     ------------------------------------------------------------------------
      }), ({ambient dimension => 2           }, {ambient dimension => 2      
     0      dimension of lineality space => 0    dimension of lineality space
            dimension of the cone => 2           dimension of the cone => 2
            number of facets => 2                number of facets => 2
            number of rays => 2                  number of rays => 2
     ------------------------------------------------------------------------
         })}
     => 0

o7 : List

i8 : Lpairs == {(C1,C4),(C1,C5)}

o8 = false

i9 : 
