-- -*- M2-comint -*- hash: 315611517

i1 : P1 = convexHull matrix {{1,0,0},{1,1,0}};

i2 : P2 = convexHull matrix {{1,0,0},{0,-1,0}};

i3 : P3 = convexHull matrix {{-1,0,0},{0,1,0}};

i4 : P4 = convexHull matrix {{1,1,0},{0,1,0}};

i5 : P5 = convexHull matrix {{1,2,0},{2,1,0}};

i6 : L = {P1,P2,P3,P4,P5};

i7 : Lpairs = incompPolyhedra L

o7 = {({ambient dimension => 2           }, {ambient dimension => 2         
        dimension of lineality space => 0    dimension of lineality space =>
        dimension of polyhedron => 2         dimension of polyhedron => 2   
        number of facets => 3                number of facets => 3          
        number of rays => 0                  number of rays => 0            
        number of vertices => 3              number of vertices => 3        
     ------------------------------------------------------------------------
      }), ({ambient dimension => 2           }, {ambient dimension => 2      
     0      dimension of lineality space => 0    dimension of lineality space
            dimension of polyhedron => 2         dimension of polyhedron => 2
            number of facets => 3                number of facets => 3
            number of rays => 0                  number of rays => 0
            number of vertices => 3              number of vertices => 3
     ------------------------------------------------------------------------
         })}
     => 0

o7 : List

i8 : Lpairs == {(P1,P4),(P1,P5)}

o8 = false

i9 : 
