-- -*- M2-comint -*- hash: -1122741265

i1 : M = matrix {{1,2,3},{2,3,1},{3,1,2}}

o1 = | 1 2 3 |
     | 2 3 1 |
     | 3 1 2 |

              3        3
o1 : Matrix ZZ  <--- ZZ

i2 : C = intersection M

o2 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 3
      number of facets => 3
      number of rays => 3

o2 : Cone

i3 : M = M || matrix {{-1,-1,-1}}

o3 = | 1  2  3  |
     | 2  3  1  |
     | 3  1  2  |
     | -1 -1 -1 |

              4        3
o3 : Matrix ZZ  <--- ZZ

i4 : v = matrix {{1},{2},{3},{4}}

o4 = | 1 |
     | 2 |
     | 3 |
     | 4 |

              4        1
o4 : Matrix ZZ  <--- ZZ

i5 : P = intersection(M,v)

o5 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of polyhedron => 3
      number of facets => 4
      number of rays => 0
      number of vertices => 4

o5 : Polyhedron

i6 : N = matrix {{1,2,0}}

o6 = | 1 2 0 |

              1        3
o6 : Matrix ZZ  <--- ZZ

i7 : w = matrix {{2}}

o7 = | 2 |

              1        1
o7 : Matrix ZZ  <--- ZZ

i8 : Q = intersection (M,v,N,w)

o8 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of polyhedron => 2
      number of facets => 4
      number of rays => 0
      number of vertices => 4

o8 : Polyhedron

i9 : HC = intersection(matrix {{1,0,0},{-1,0,0},{0,1,0},{0,-1,0},{0,0,1},{0,0,-1}},matrix {{1},{1},{1},{1},{1},{1}})

o9 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of polyhedron => 3
      number of facets => 6
      number of rays => 0
      number of vertices => 8

o9 : Polyhedron

i10 : C1 = intersection(C,HC)

o10 = {ambient dimension => 3           }
       dimension of lineality space => 0
       dimension of polyhedron => 3
       number of facets => 6
       number of rays => 0
       number of vertices => 8

o10 : Polyhedron

i11 : Q1 = intersection(P,HC)

o11 = {ambient dimension => 3           }
       dimension of lineality space => 0
       dimension of polyhedron => 3
       number of facets => 9
       number of rays => 0
       number of vertices => 13

o11 : Polyhedron

i12 : 
