-- -*- M2-comint -*- hash: -1427529584

i1 : C1 = posHull matrix {{1,0},{0,1}};

i2 : C2 = posHull matrix {{1,-1},{0,-2}};

i3 : C3 = posHull matrix {{0,-2},{1,-1}};

i4 : F = fan {C1,C2,C3}

o4 = {ambient dimension => 2         }
      number of generating cones => 3
      number of rays => 4
      top dimension of the cones => 2

o4 : Fan

i5 : isComplete F

o5 = false

i6 : C4 = posHull matrix {{-1,-2},{-2,-1}};

i7 : F = addCone(C4,F)

o7 = {ambient dimension => 2         }
      number of generating cones => 4
      number of rays => 4
      top dimension of the cones => 2

o7 : Fan

i8 : isComplete F

o8 = true

i9 : 
