-- -*- M2-comint -*- hash: -167616503

i1 : P = convexHull matrix {{3,0,0,0,1},{0,3,0,0,1},{0,0,3,0,1}}

o1 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of polyhedron => 3
      number of facets => 4
      number of rays => 0
      number of vertices => 4

o1 : Polyhedron

i2 : isSimplicial P

o2 = true

i3 : P = hypercube 2

o3 = {ambient dimension => 2           }
      dimension of lineality space => 0
      dimension of polyhedron => 2
      number of facets => 4
      number of rays => 0
      number of vertices => 4

o3 : Polyhedron

i4 : isSimplicial P

o4 = false

i5 : C = posHull matrix {{1,0,0,1},{0,1,0,1},{0,0,1,1}}

o5 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 3
      number of facets => 3
      number of rays => 3

o5 : Cone

i6 : isSimplicial C

o6 = true

i7 : C = posHull matrix {{1,1,-1,-1},{1,-1,1,-1},{1,1,1,1}}

o7 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 3
      number of facets => 4
      number of rays => 4

o7 : Cone

i8 : isSimplicial C

o8 = false

i9 : F = normalFan hypercube 3

o9 = {ambient dimension => 3         }
      number of generating cones => 8
      number of rays => 6
      top dimension of the cones => 3

o9 : Fan

i10 : isSimplicial F

o10 = true

i11 : PC = skeleton(2,polyhedralComplex crossPolytope 3)

o11 = {ambient dimension => 3             }
       number of generating polyhedra => 8
       top dimension of the polyhedra => 2

o11 : PolyhedralComplex

i12 : isSimplicial PC

o12 = true

i13 : 
