-- -*- M2-comint -*- hash: -1024230083

i1 : R = matrix {{1,2},{2,1},{0,0}}

o1 = | 1 2 |
     | 2 1 |
     | 0 0 |

              3        2
o1 : Matrix ZZ  <--- ZZ

i2 : C = posHull R

o2 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 2
      number of facets => 2
      number of rays => 2

o2 : Cone

i3 : LS = matrix {{0},{0},{1}}

o3 = | 0 |
     | 0 |
     | 1 |

              3        1
o3 : Matrix ZZ  <--- ZZ

i4 : C1 = posHull (R,LS)

o4 = {ambient dimension => 3           }
      dimension of lineality space => 1
      dimension of the cone => 3
      number of facets => 2
      number of rays => 2

o4 : Cone

i5 : r = matrix {{0},{1},{2}}

o5 = | 0 |
     | 1 |
     | 2 |

              3        1
o5 : Matrix ZZ  <--- ZZ

i6 : C2 = posHull {C,r}

o6 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 3
      number of facets => 3
      number of rays => 3

o6 : Cone

i7 : r = posHull r

o7 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 1
      number of facets => 1
      number of rays => 1

o7 : Cone

i8 : C3 = posHull(C,r)

o8 = {ambient dimension => 3           }
      dimension of lineality space => 0
      dimension of the cone => 3
      number of facets => 3
      number of rays => 3

o8 : Cone

i9 : C3 == C2

o9 = true

i10 : 
