-- -*- M2-comint -*- hash: -393514310

i1 : n = 3;

i2 : R = ZZ/2[vars(0)..vars(n-1)];

i3 : J = apply( gens R, x -> x^2 + x);

i4 : QR = R/J;

i5 : I = ideal(a+b,b);

o5 : Ideal of QR

i6 : gbBoolean I

o6 = ideal (b, a)

o6 : Ideal of QR

i7 : gens gb I

o7 = | b a |

              1        2
o7 : Matrix QR  <--- QR

i8 : 
