-- -*- M2-comint -*- hash: 914025784

i1 : R1 = ZZ/32003[x,y,z, MonomialOrder=>Weights=>{1,10,100}];

i2 : I1 = ideal(y-x^2, z-x^3);

o2 : Ideal of R1

i3 : R2 = ZZ/32003[x,y,z, MonomialOrder=>Lex];

i4 : groebnerWalk(gb I1, R2)

o4 = GroebnerBasis[status: done; S-pairs encountered up to degree 0]

o4 : GroebnerBasis

i5 : setWalkTrace 2;

i6 : groebnerWalk(gb I1, R2)
Conversion Number: 1
Weight Vector: {1, 10, 100}
Size of new Groebner Basis: 2

Conversion Number: 2
Weight Vector: {1, 2, 20}
Size of new Groebner Basis: 2

Conversion Number: 3
Weight Vector: {9, 1, 10}
Size of new Groebner Basis: 4

Conversion Number: 4
Weight Vector: {1, 0, 0}
Size of new Groebner Basis: 4

Conversion Number: 5
Weight Vector: {1, 0, 0}
Size of new Groebner Basis: 4

Total Conversions: 5

o6 = GroebnerBasis[status: done; S-pairs encountered up to degree 0]

o6 : GroebnerBasis

i7 : 
