-- -*- M2-comint -*- hash: -84454538

i1 : S = ZZ/101[a,b,c,d]

o1 = S

o1 : PolynomialRing

i2 : K = koszul vars S

      1      4      6      4      1
o2 = S  <-- S  <-- S  <-- S  <-- S
                                  
     0      1      2      3      4

o2 : ChainComplex

i3 : apply(numgens S, i-> depth coker K.dd_(i+1))

o3 = {0, 1, 2, 3}

o3 : List

i4 : I = ideal"ab,bc,cd2,da"

                         2
o4 = ideal (a*b, b*c, c*d , a*d)

o4 : Ideal of S

i5 : codim I

o5 = 2

i6 : setRandomSeed 0

o6 = 0

i7 : systemOfParameters(I, Density => .1, Attempts => 1000, Verbose => true)
Attempts: 1000 Density: .1 Seed: null

                    2
o7 = ideal (a*b, c*d )

o7 : Ideal of S

i8 : inhomogeneousSystemOfParameters I

o8 = | cd2+bc bc+ad |

             1       2
o8 : Matrix S  <--- S

i9 : 
