-- -*- M2-comint -*- hash: 558956944

i1 : A = ZZ/5051[x, y, z];

i2 : I = ideal (x, x*y, y*z);

o2 : Ideal of A

i3 : X = inhomogeneousSystemOfParameters(I,A)

o3 = | yz+x xy |

             1       2
o3 : Matrix A  <--- A

i4 : isRegularSequence(X,A)

o4 = true

i5 : A = ZZ/5051[x, y, z];

i6 : I = ideal (x, x*y, y*z);

o6 : Ideal of A

i7 : inhomogeneousSystemOfParameters(I,A,Attempts=>1,Bound=>100,Sparseness=>.9)
--warning: no maximal regular sequence found

o7 = 0

             1
o7 : Matrix A  <--- 0

i8 : x = symbol x; y = symbol y;

i10 : n = 2;

i11 : A = ZZ/101[x_(1,1)..x_(n,n),y_(1,1)..y_(n,n)];

i12 : X = transpose genericMatrix(A,n,n);

              2       2
o12 : Matrix A  <--- A

i13 : Y = transpose genericMatrix(A,y_(1,1),n,n);

              2       2
o13 : Matrix A  <--- A

i14 : b = ideal(X*Y - Y*X);

o14 : Ideal of A

i15 : B = A/b;

i16 : inhomogeneousSystemOfParameters(B,Attempts=>1,Maximal=>false)

o16 = | -x_(2,1)-y_(1,2)+y_(2,1) x_(1,2)-y_(2,2)
      -----------------------------------------------------------------------
      -x_(2,1)+x_(2,2)-y_(1,1)+y_(1,2) -x_(1,1)+x_(2,1)
      -----------------------------------------------------------------------
      x_(1,1)-x_(2,1)-y_(1,1) x_(1,1)+x_(1,2) |

              1       6
o16 : Matrix B  <--- B

i17 : 
