-- -*- M2-comint -*- hash: 1445661083

i1 : m1 = map(ZZ^50, ZZ^50, (j,i) -> (i+1)^8 * (j+1)^4 + i + j + 2);

              50        50
o1 : Matrix ZZ   <--- ZZ

i2 : m = syz m1;

              50        47
o2 : Matrix ZZ   <--- ZZ

i3 : time LLL m;
     -- used 0.00932726 seconds

              50        47
o3 : Matrix ZZ   <--- ZZ

i4 : time LLL(m, Strategy=>CohenEngine);
     -- used 0.0510229 seconds

              50        47
o4 : Matrix ZZ   <--- ZZ

i5 : time LLL(m, Strategy=>CohenTopLevel);
     -- used 0.164491 seconds

              50        47
o5 : Matrix ZZ   <--- ZZ

i6 : time LLL(m, Strategy=>{Givens,RealFP});
     -- used 0.0113406 seconds

              50        47
o6 : Matrix ZZ   <--- ZZ

i7 : time LLL(m, Strategy=>{Givens,RealQP});
     -- used 0.071228 seconds

              50        47
o7 : Matrix ZZ   <--- ZZ

i8 : time LLL(m, Strategy=>{Givens,RealXD});
     -- used 0.0544708 seconds

              50        47
o8 : Matrix ZZ   <--- ZZ

i9 : time LLL(m, Strategy=>{Givens,RealRR});
     -- used 0.329338 seconds

              50        47
o9 : Matrix ZZ   <--- ZZ

i10 : time LLL(m, Strategy=>{BKZ,Givens,RealQP});
     -- used 0.184791 seconds

               50        47
o10 : Matrix ZZ   <--- ZZ

i11 : 
