-- -*- M2-comint -*- hash: 970667493

i1 : s = apply(5,i->372*(random 1000000))

o1 = {306370272, 229247604, 135272220, 220821804, 229345440}

o1 : List

i2 : (g,z) = gcdLLL s

o2 = (372, | 1   -2  11  48  -20 |)
           | -5  -24 -2  -19 7   |
           | -12 15  -15 -7  7   |
           | 7   5   -31 0   11  |
           | 4   13  26  -41 5   |

o2 : Sequence

i3 : matrix{s} * z

o3 = | 0 0 0 0 372 |

              1        5
o3 : Matrix ZZ  <--- ZZ

i4 : 
