-- -*- M2-comint -*- hash: -385945540

i1 : V = {{0,0},{1,0},{0,1},{-1,-1}};

i2 : F = {{0,1,2},{0,2,3},{0,1,3}};

i3 : C = idealsComplex(V,F,1);

i4 : prune HH C

o4 = 0 : 0            

                     2
     1 : (QQ[t ..t ])
              0   2

     2 : 0            

o4 : GradedModule

i5 : V = {{-1,-1},{1,-1},{0,1},{-2,-2},{2,-2},{0,2}};

i6 : F = {{0,1,2},{0,1,3,4},{1,2,4,5},{0,2,3,5}};

i7 : C = idealsComplex(V,F,1);

i8 : prune HH C

o8 = 0 : cokernel {2} | 8t_0 0        8t_1-2t_2 -2t_2    -2t_2    0        |
                  {2} | t_2  8t_0+t_2 t_2       8t_1+t_2 t_2      t_2      |
                  {2} | -t_2 -t_2     t_2       t_2      8t_1+t_2 8t_0-t_2 |

                     3
     1 : (QQ[t ..t ])
              0   2                                                         

     2 : 0                                                                  

o8 : GradedModule

i9 : 
