-- -*- M2-comint -*- hash: 47035746

i1 : V = {{0,0},{1,0},{1,1},{0,1}};

i2 : F = {{0,1,2},{0,2,3}};

i3 : E = {{0,1},{0,2},{0,3},{1,2},{2,3}};

i4 : M=splineModule(V,F,E,2);

i5 : splineDimensionTable(0,8,M)

     +---------+-+-+-+--+--+--+--+--+--+
o5 = |Degree   |0|1|2|3 |4 |5 |6 |7 |8 |
     +---------+-+-+-+--+--+--+--+--+--+
     |Dimension|1|3|6|11|18|27|38|51|66|
     +---------+-+-+-+--+--+--+--+--+--+

i6 : V = {{0,0},{1,0},{1,1},{0,1}};

i7 : F = {{0,1,2},{0,2,3}};

i8 : L = {V,F,E};

i9 : splineDimensionTable(0,8,L,2)

     +---------+-+-+-+--+--+--+--+--+--+
o9 = |Degree   |0|1|2|3 |4 |5 |6 |7 |8 |
     +---------+-+-+-+--+--+--+--+--+--+
     |Dimension|1|3|6|11|18|27|38|51|66|
     +---------+-+-+-+--+--+--+--+--+--+

i10 : V = {{-1,-1},{1,-1},{0,1},{10,10},{-10,10},{0,-10}};

i11 : V'= {{-1,-1},{1,-1},{0,1},{10,10},{-10,10},{1,-10}};

i12 : F = {{0,1,2},{2,3,4},{0,4,5},{1,3,5},{1,2,3},{0,2,4},{0,1,5}};

i13 : M = splineModule(V,F,1);

i14 : M' = splineModule(V',F,1);

i15 : splineDimensionTable(0,4,M)

      +---------+-+-+-+--+--+
o15 = |Degree   |0|1|2|3 |4 |
      +---------+-+-+-+--+--+
      |Dimension|1|3|7|16|33|
      +---------+-+-+-+--+--+

i16 : splineDimensionTable(0,4,M')

      +---------+-+-+-+--+--+
o16 = |Degree   |0|1|2|3 |4 |
      +---------+-+-+-+--+--+
      |Dimension|1|3|6|16|33|
      +---------+-+-+-+--+--+

i17 : 
