-- -*- M2-comint -*- hash: -696175007

i1 : X = binomialDistribution(5, 0.25)

o1 = B(5,.25)

o1 : DiscreteProbabilityDistribution

i2 : density_X 2

o2 = .263671875

o2 : RR (of precision 53)

i3 : binomial(5, 2) * 0.25^2 * 0.75^3

o3 = .263671875

o3 : RR (of precision 53)

i4 : Z = normalDistribution()

o4 = N(0,1)

o4 : ContinuousProbabilityDistribution

i5 : density_Z 0

o5 = .398942280401433

o5 : RR (of precision 53)

i6 : 1/sqrt(2 * pi)

o6 = .398942280401433

o6 : RR (of precision 53)

i7 : integrate(density_Z, -1, 1)

o7 = .682689492137086

o7 : RR (of precision 53)

i8 : integrate(density_Z, -2, 2)

o8 = .95449973610347

o8 : RR (of precision 53)

i9 : integrate(density_Z, -3, 3)

o9 = .997300204130616

o9 : RR (of precision 53)

i10 : 
