-- -*- M2-comint -*- hash: -1363779868

i1 : X = discreteProbabilityDistribution(x -> 1/6, Support => (1, 6))

o1 = a discrete probability distribution

o1 : DiscreteProbabilityDistribution

i2 : density_X 3

     1
o2 = -
     6

o2 : QQ

i3 : density_X 3.5

o3 = 0

i4 : density_X 7

o4 = 0

i5 : probability_X 3

     1
o5 = -
     2

o5 : QQ

i6 : quantile_X 0.2

o6 = 2

i7 : random X

o7 = 6

i8 : X = discreteProbabilityDistribution(x -> 1/6, Support => (1, 6),
         DistributionFunction => x -> x / 6,
         QuantileFunction => p -> 6 * p,
         Description => "six-sided die")

o8 = six-sided die

o8 : DiscreteProbabilityDistribution

i9 : 
