-- -*- M2-comint -*- hash: 1185506204

i1 : Z = normalDistribution()

o1 = N(0,1)

o1 : ContinuousProbabilityDistribution

i2 : quantile_Z 0.95

o2 = 1.64485362695147

o2 : RR (of precision 53)

i3 : probability_Z oo

o3 = .95

o3 : RR (of precision 53)

i4 : X = binomialDistribution(10, 0.25)

o4 = B(10,.25)

o4 : DiscreteProbabilityDistribution

i5 : quantile_X 0.75

o5 = 3

i6 : probability_X 2

o6 = .525592803955078

o6 : RR (of precision 53)

i7 : probability_X 3

o7 = .775875091552734

o7 : RR (of precision 53)

i8 : quantile_Z(0.95, LowerTail => false)

o8 = -1.64485362695147

o8 : RR (of precision 53)

i9 : probability_Z(oo, LowerTail => false)

o9 = .95

o9 : RR (of precision 53)

i10 : quantile_X(0.75, LowerTail => false)

o10 = 2

i11 : probability_X(2, LowerTail => false)

o11 = .474407196044922

o11 : RR (of precision 53)

i12 : probability_X(1, LowerTail => false)

o12 = .755974769592285

o12 : RR (of precision 53)

i13 : 
