-- -*- M2-comint -*- hash: -586305090

i1 : kk=ZZ/101

o1 = kk

o1 : QuotientRing

i2 : B = {{1,2},{3,0},{0,4},{0,5}}

o2 = {{1, 2}, {3, 0}, {0, 4}, {0, 5}}

o2 : List

i3 : S = kk[x_0..x_3, Degrees=> B]

o3 = S

o3 : PolynomialRing

i4 : binomialIdeal S

             3        2   6    2 3     4    3 2   5    4
o4 = ideal (x x  - x x , x  - x x , x x  - x x , x  - x )
             0 2    1 3   0    1 2   1 2    0 3   2    3

o4 : Ideal of S

i5 : C = {{1,2},{0,5}}

o5 = {{1, 2}, {0, 5}}

o5 : List

i6 : P = kk[y_0,y_1, Degrees=> C]

o6 = P

o6 : PolynomialRing

i7 : binomialIdeal P

o7 = ideal ()

o7 : Ideal of P

i8 : M = monomialAlgebra B

o8 = kk[x ..x ]
         0   3

o8 : MonomialAlgebra generated by {{1, 2}, {3, 0}, {0, 4}, {0, 5}}

i9 : binomialIdeal M

             3        2   6    2 3     4    3 2   5    4
o9 = ideal (x x  - x x , x  - x x , x x  - x x , x  - x )
             0 2    1 3   0    1 2   1 2    0 3   2    3

o9 : Ideal of kk[x ..x ]
                  0   3

i10 : 
