-- -*- M2-comint -*- hash: -182315281

i1 : B = {{4,0},{3,1},{1,3},{0,4}}

o1 = {{4, 0}, {3, 1}, {1, 3}, {0, 4}}

o1 : List

i2 : S = ZZ/101[x_0..x_(#B-1), Degrees=>B];

i3 : decomposeHomogeneousMA S

o3 = HashTable{| -1 | => {ideal 1, 1}      }
               | 1  |
               0 => {ideal 1, 0}
               | 1  | => {ideal 1, 1}
               | -1 |
               | 2 | => {ideal (x , x ), 1}
               | 2 |             0   3

o3 : HashTable

i4 : decomposeHomogeneousMA B

o4 = HashTable{| -1 | => {ideal 1, 1}      }
               | 1  |
               0 => {ideal 1, 0}
               | 1  | => {ideal 1, 1}
               | -1 |
               | 2 | => {ideal (x , x ), 1}
               | 2 |             0   3

o4 : HashTable

i5 : decomposeHomogeneousMA {{2,0,1},{0,2,1},{1,1,1},{2,2,1},{2,1,1},{1,4,1}}

                                 2
o5 = HashTable{0 => {ideal (x , x x ), -1}    }
                             3   0 5
                                       2
               | 0 | => {ideal (x x , x ), -1}
               | 1 |             0 5   3
               | 0 |

o5 : HashTable

i6 : M = monomialAlgebra {{2,0,1},{0,2,1},{1,1,1},{2,2,1},{2,1,1},{1,4,1}}

      ZZ
o6 = ---[x ..x ]
     101  0   5

o6 : MonomialAlgebra generated by {{2, 0, 1}, {0, 2, 1}, {1, 1, 1}, {2, 2, 1}, {2, 1, 1}, {1, 4, 1}}

i7 : decomposeHomogeneousMA M

                                 2
o7 = HashTable{0 => {ideal (x , x x ), -1}    }
                             3   0 5
                                       2
               | 0 | => {ideal (x x , x ), -1}
               | 1 |             0 5   3
               | 0 |

o7 : HashTable

i8 : 
