-- -*- M2-comint -*- hash: -1225784009

i1 : a=3

o1 = 3

i2 : B={{a, 0}, {0, a}, {1, a-1}, {a-1, 1}}

o2 = {{3, 0}, {0, 3}, {1, 2}, {2, 1}}

o2 : List

i3 : R=QQ[x_0..x_3, Degrees=> B]

o3 = R

o3 : PolynomialRing

i4 : findMonomialSubalgebra R

o4 = QQ[x ..x ]
         0   1

o4 : PolynomialRing

i5 : a=3

o5 = 3

i6 : B={{a, 0}, {0, a}, {1, a-1}, {a-1, 1}}

o6 = {{3, 0}, {0, 3}, {1, 2}, {2, 1}}

o6 : List

i7 : M=monomialAlgebra B

      ZZ
o7 = ---[x ..x ]
     101  0   3

o7 : MonomialAlgebra generated by {{3, 0}, {0, 3}, {1, 2}, {2, 1}}

i8 : findMonomialSubalgebra M

      ZZ
o8 = ---[x ..x ]
     101  0   1

o8 : MonomialAlgebra generated by {{3, 0}, {0, 3}}

i9 : 
