-- -*- M2-comint -*- hash: 1944869272

i1 : a=3

o1 = 3

i2 : B={{a, 0}, {0, a}, {1, a-1}, {a-1, 1}}

o2 = {{3, 0}, {0, 3}, {1, 2}, {2, 1}}

o2 : List

i3 : findGeneratorsOfSubalgebra B

o3 = {{{3, 0}, 0}, {{0, 3}, 1}}

o3 : List

i4 : a=4

o4 = 4

i5 : B={{a, 0}, {2, a-2}, {1, a-1}, {a-1, 1}}

o5 = {{4, 0}, {2, 2}, {1, 3}, {3, 1}}

o5 : List

i6 : findGeneratorsOfSubalgebra B

o6 = {{{4, 0}, 0}, {{1, 3}, 2}}

o6 : List

i7 : B={{3, 0}, {2, 0}, {1, 1}, {0, 2}}

o7 = {{3, 0}, {2, 0}, {1, 1}, {0, 2}}

o7 : List

i8 : findGeneratorsOfSubalgebra B

o8 = {{{2, 0}, 1}, {{0, 2}, 3}}

o8 : List

i9 : 
