-- -*- M2-comint -*- hash: -2012204584

i1 : R=QQ[x_0..x_3,Degrees=>{{6,0},{0,6},{4,2},{1,5}}]

o1 = R

o1 : PolynomialRing

i2 : isBuchsbaumMA R

o2 = false

i3 : decomposeMonomialAlgebra R

o3 = HashTable{| -1 | => {ideal 1, | 5 |}       }
               | 1  |              | 7 |
               | -2 | => {ideal 1, | 4 |}
               | 2  |              | 2 |
               0 => {ideal 1, 0}
               | 1  | => {ideal 1, | 1 |}
               | -1 |              | 5 |
               | 2  | => {ideal (x , x ), | 2 |}
               | -2 |             0   1   | 4 |
               | 3 | => {ideal (x , x ), | 3 |}
               | 3 |             0   1   | 9 |

o3 : HashTable

i4 : R=QQ[x_0..x_3,Degrees=>{{4,0},{0,4},{3,1},{1,3}}]

o4 = R

o4 : PolynomialRing

i5 : isBuchsbaumMA R

o5 = true

i6 : decomposeMonomialAlgebra R

o6 = HashTable{| -1 | => {ideal 1, | 3 |}      }
               | 1  |              | 1 |
               0 => {ideal 1, 0}
               | 1  | => {ideal 1, | 1 |}
               | -1 |              | 3 |
               | 2 | => {ideal (x , x ), | 2 |}
               | 2 |             0   1   | 2 |

o6 : HashTable

i7 : R=QQ[x_0..x_3,Degrees=>{{5,0},{0,5},{4,1},{1,4}}]

o7 = R

o7 : PolynomialRing

i8 : isBuchsbaumMA R

o8 = false

i9 : decomposeMonomialAlgebra R

o9 = HashTable{| -1 | => {ideal 1, | 4 |}       }
               | 1  |              | 1 |
                                      2
               | -2 | => {ideal (x , x ), | 3 |}
               | 2  |             0   1   | 2 |
               0 => {ideal 1, 0}
               | 1  | => {ideal 1, | 1 |}
               | -1 |              | 4 |
                                  2
               | 2  | => {ideal (x , x ), | 2 |}
               | -2 |             0   1   | 3 |

o9 : HashTable

i10 : R=QQ[x_0..x_3,Degrees=>{{5,0},{0,5},{4,1},{1,4}}]

o10 = R

o10 : PolynomialRing

i11 : M=monomialAlgebra R

o11 = R

o11 : MonomialAlgebra generated by {{5, 0}, {0, 5}, {4, 1}, {1, 4}}

i12 : isBuchsbaumMA M

o12 = false

i13 : 
