-- -*- M2-comint -*- hash: 628543413

i1 : B={{1,0,0},{0,2,0},{0,0,2},{1,0,1},{0,1,1}}

o1 = {{1, 0, 0}, {0, 2, 0}, {0, 0, 2}, {1, 0, 1}, {0, 1, 1}}

o1 : List

i2 : R=QQ[x_0..x_4,Degrees=>B]

o2 = R

o2 : PolynomialRing

i3 : isSeminormalMA R

o3 = true

i4 : isNormalMA R

o4 = false

i5 : B={{1,0,0},{0,2,0},{0,0,2},{1,0,1},{0,1,1}}

o5 = {{1, 0, 0}, {0, 2, 0}, {0, 0, 2}, {1, 0, 1}, {0, 1, 1}}

o5 : List

i6 : M=monomialAlgebra B

      ZZ
o6 = ---[x ..x ]
     101  0   4

o6 : MonomialAlgebra generated by {{1, 0, 0}, {0, 2, 0}, {0, 0, 2}, {1, 0, 1}, {0, 1, 1}}

i7 : isSeminormalMA M

o7 = true

i8 : isNormalMA M

o8 = false

i9 : 
