-- -*- M2-comint -*- hash: 1704185915

i1 : B={{1,0,0},{0,2,0},{0,0,2},{1,0,1},{0,1,1}}

o1 = {{1, 0, 0}, {0, 2, 0}, {0, 0, 2}, {1, 0, 1}, {0, 1, 1}}

o1 : List

i2 : R=QQ[x_0..x_4,Degrees=>B]

o2 = R

o2 : PolynomialRing

i3 : isSimplicialMA R

o3 = true

i4 : isSimplicialMA B

o4 = true

i5 : B={{1,0,1},{0,1,1},{1,1,1},{0,0,1}}

o5 = {{1, 0, 1}, {0, 1, 1}, {1, 1, 1}, {0, 0, 1}}

o5 : List

i6 : R=QQ[x_0..x_3,Degrees=>B]

o6 = R

o6 : PolynomialRing

i7 : isSimplicialMA R

o7 = false

i8 : isSimplicialMA B

o8 = false

i9 : B={{1,0,1},{0,1,1},{1,1,1},{0,0,1}}

o9 = {{1, 0, 1}, {0, 1, 1}, {1, 1, 1}, {0, 0, 1}}

o9 : List

i10 : M=monomialAlgebra B

       ZZ
o10 = ---[x ..x ]
      101  0   3

o10 : MonomialAlgebra generated by {{1, 0, 1}, {0, 1, 1}, {1, 1, 1}, {0, 0, 1}}

i11 : isSimplicialMA M

o11 = false

i12 : 
