-- -*- M2-comint -*- hash: -1992220723

i1 : a=5

o1 = 5

i2 : B={{a, 0}, {0, a}, {1, a-1}, {a-1, 1}}

o2 = {{5, 0}, {0, 5}, {1, 4}, {4, 1}}

o2 : List

i3 : R=QQ[x_0..x_3,Degrees=>B]

o3 = R

o3 : PolynomialRing

i4 : regularityMA R

                   2                            2
o4 = {3, {{ideal (x , x ), | 3 |}, {ideal (x , x ), | 2 |}}}
                   1   0   | 2 |            1   0   | 3 |

o4 : List

i5 : a=5

o5 = 5

i6 : B={{a, 0}, {0, a}, {1, a-1}, {a-1, 1}}

o6 = {{5, 0}, {0, 5}, {1, 4}, {4, 1}}

o6 : List

i7 : M=monomialAlgebra B

      ZZ
o7 = ---[x ..x ]
     101  0   3

o7 : MonomialAlgebra generated by {{5, 0}, {0, 5}, {1, 4}, {4, 1}}

i8 : regularityMA M

                   2                            2
o8 = {3, {{ideal (x , x ), | 3 |}, {ideal (x , x ), | 2 |}}}
                   1   0   | 2 |            1   0   | 3 |

o8 : List

i9 : a=5

o9 = 5

i10 : B={{a, 0}, {0, a}, {1, a-1}, {a-1, 1}}

o10 = {{5, 0}, {0, 5}, {1, 4}, {4, 1}}

o10 : List

i11 : R=QQ[x_0..x_3,Degrees=>B]

o11 = R

o11 : PolynomialRing

i12 : dc=decomposeMonomialAlgebra R

o12 = HashTable{| -1 | => {ideal 1, | 4 |}       }
                | 1  |              | 1 |
                                   2
                | -2 | => {ideal (x , x ), | 3 |}
                | 2  |             1   0   | 2 |
                0 => {ideal 1, 0}
                | 1  | => {ideal 1, | 1 |}
                | -1 |              | 4 |
                                       2
                | 2  | => {ideal (x , x ), | 2 |}
                | -2 |             1   0   | 3 |

o12 : HashTable

i13 : regularityMA(B,Decomposition=>dc)

                    2                            2
o13 = {3, {{ideal (x , x ), | 3 |}, {ideal (x , x ), | 2 |}}}
                    1   0   | 2 |            1   0   | 3 |

o13 : List

i14 : a=5

o14 = 5

i15 : B={{a, 0}, {0, a}, {1, a-1}, {a-1, 1}}

o15 = {{5, 0}, {0, 5}, {1, 4}, {4, 1}}

o15 : List

i16 : regularityMA B

                    2                            2
o16 = {3, {{ideal (x , x ), | 3 |}, {ideal (x , x ), | 2 |}}}
                    1   0   | 2 |            1   0   | 3 |

o16 : List

i17 : I=ker map(QQ[s,t],QQ[x_0..x_3],matrix {{s^a,t^a,s*t^(a-1),s^(a-1)*t}})

                           4    3       3    2 2   2 2      3   3      4
o17 = ideal (x x  - x x , x  - x x , x x  - x x , x x  - x x , x x  - x )
              0 1    2 3   2    1 3   0 2    1 3   0 2    1 3   0 2    3

o17 : Ideal of QQ[x ..x ]
                   0   3

i18 : -1+regularity I

o18 = 3

i19 : 
