-- -*- M2-comint -*- hash: 463272834

i1 : R=QQ[x_0..x_4];

i2 : addCokerGrading(R)

o2 = | -1 -1 -1 -1 |
     | 1  0  0  0  |
     | 0  1  0  0  |
     | 0  0  1  0  |
     | 0  0  0  1  |

              5        4
o2 : Matrix ZZ  <--- ZZ

i3 : I=ideal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0)

o3 = ideal (x x , x x , x x , x x , x x )
             0 1   1 2   2 3   3 4   0 4

o3 : Ideal of R

i4 : mg=mingens I;

             1       5
o4 : Matrix R  <--- R

i5 : f=firstOrderDeformation(mg, vector {-1,-1,0,2,0})

       2
      x
       3
o5 = ----
     x x
      0 1

o5 : first order deformation space of dimension 1

i6 : f.gens

o6 = | x_3x_4 x_0x_4 x_2x_3 x_1x_2 x_0x_1 |

             1       5
o6 : Matrix R  <--- R

i7 : f.bigTorusDegree

o7 = | -1 |
     | -1 |
     |  0 |
     |  2 |
     |  0 |

       5
o7 : ZZ

i8 : simplexRing f

o8 = R

o8 : PolynomialRing

i9 : target f

o9 = cokernel | x_3x_4 x_0x_4 x_2x_3 x_1x_2 x_0x_1 |

                            1
o9 : R-module, quotient of R

i10 : source f

o10 = image | x_3x_4 x_0x_4 x_2x_3 x_1x_2 x_0x_1 |

                              1
o10 : R-module, submodule of R

i11 : numerator f

o11 = | 0 |
      | 0 |
      | 0 |
      | 2 |
      | 0 |

        5
o11 : ZZ

i12 : denominator f

o12 = | 1 |
      | 1 |
      | 0 |
      | 0 |
      | 0 |

        5
o12 : ZZ

i13 : bigTorusDegree f

o13 = | -1 |
      | -1 |
      |  0 |
      |  2 |
      |  0 |

        5
o13 : ZZ

i14 : numeratorMonomial f

       2
o14 = x
       3

o14 : R

i15 : degree f

o15 = 0

o15 : cokernel | -1 -1 -1 -1 |
               | 1  0  0  0  |
               | 0  1  0  0  |
               | 0  0  1  0  |
               | 0  0  0  1  |

i16 : grading f

o16 = | -1 -1 -1 -1 |
      | 1  0  0  0  |
      | 0  1  0  0  |
      | 0  0  1  0  |
      | 0  0  0  1  |

               5        4
o16 : Matrix ZZ  <--- ZZ

i17 : isHomogeneous f

o17 = true

i18 : relationsCoefficients f

o18 = 0

               1
o18 : Matrix ZZ  <--- 0

i19 : parameters f

o19 = | 0 |
      | 0 |
      | 0 |
      | 0 |
      | 1 |

               5        1
o19 : Matrix ZZ  <--- ZZ

i20 : dim f

o20 = 1

i21 : isNonzero f

o21 = true

i22 : isTrivial f

o22 = false

i23 : 
