-- -*- M2-comint -*- hash: 2051635872

i1 : R=QQ[x_0..x_4];

i2 : face {x_0,x_1} == face {x_1,x_0}

o2 = true

i3 : addCokerGrading R;

              5        4
o3 : Matrix ZZ  <--- ZZ

i4 : C=simplex R;

i5 : bC=boundaryOfPolytope C;

i6 : F=bC.fc_2_0

o6 = x x x
      0 1 2

o6 : face with 3 vertices

i7 : dF=dualize F

o7 = v v
      0 1

o7 : face with 2 vertices

i8 : F== dualize dF

o8 = true

i9 : 
