-- -*- M2-comint -*- hash: -174581100

i1 : R=QQ[x_0..x_4];

i2 : addCokerGrading(R)

o2 = | -1 -1 -1 -1 |
     | 1  0  0  0  |
     | 0  1  0  0  |
     | 0  0  1  0  |
     | 0  0  0  1  |

              5        4
o2 : Matrix ZZ  <--- ZZ

i3 : I=ideal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0)

o3 = ideal (x x , x x , x x , x x , x x )
             0 1   1 2   2 3   3 4   0 4

o3 : Ideal of R

i4 : mg=mingens I;

             1       5
o4 : Matrix R  <--- R

i5 : f=firstOrderDeformation(mg, vector {-1,-1,0,2,0})

       2
      x
       3
o5 = ----
     x x
      0 1

o5 : first order deformation space of dimension 1

i6 : degree f

o6 = 0

o6 : cokernel | -1 -1 -1 -1 |
              | 1  0  0  0  |
              | 0  1  0  0  |
              | 0  0  1  0  |
              | 0  0  0  1  |

i7 : dim f

o7 = 1

i8 : f1=firstOrderDeformation(mg,vector {-1,1,0,0,0})

     x
      1
o8 = --
     x
      0

o8 : first order deformation space of dimension 1

i9 : isTrivial f1

o9 = true

i10 : f2=firstOrderDeformation(mg,vector {0,-1,-1,2,0})

        2
       x
        3
o10 = ----
      x x
       1 2

o10 : first order deformation space of dimension 0

i11 : isNonzero f2

o11 = false

i12 : 
