-- -*- M2-comint -*- hash: -1655267809

i1 : R=QQ[x_0..x_4]

o1 = R

o1 : PolynomialRing

i2 : addCokerGrading R

o2 = | -1 -1 -1 -1 |
     | 1  0  0  0  |
     | 0  1  0  0  |
     | 0  0  1  0  |
     | 0  0  0  1  |

              5        4
o2 : Matrix ZZ  <--- ZZ

i3 : C=simplex R

o3 = 4: x x x x x  
         0 1 2 3 4

o3 : complex of dim 4 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 1}, Euler = 0

i4 : F=C.fc_1_0

o4 = x x
      0 1

o4 : face with 2 vertices

i5 : F.vert

o5 = {x , x }
       0   1

o5 : List

i6 : coordinates F

o6 = {{-1, -1, -1, -1}, {1, 0, 0, 0}}

o6 : List

i7 : (F.ofComplex)#0==C

o7 = true

i8 : bC=boundaryOfPolytope C

o8 = 3: x x x x  x x x x  x x x x  x x x x  x x x x  
         0 1 2 3  0 1 2 4  0 1 3 4  0 2 3 4  1 2 3 4

o8 : complex of dim 3 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 0}, Euler = -1

i9 : F==bC.fc_1_0

o9 = true

i10 : 
