-- -*- M2-comint -*- hash: 429749745

i1 : R=QQ[x_0..x_4]

o1 = R

o1 : PolynomialRing

i2 : C=boundaryOfPolytope simplex(R)

o2 = 3: x x x x  x x x x  x x x x  x x x x  x x x x  
         0 1 2 3  0 1 2 4  0 1 3 4  0 2 3 4  1 2 3 4

o2 : complex of dim 3 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 0}, Euler = -1

i3 : F=C.fc_0_0

o3 = x
      0

o3 : face with 1 vertex

i4 : link(F,C)

o4 = 2: x x x  x x x  x x x  x x x  
         1 2 3  1 2 4  1 3 4  2 3 4

o4 : complex of dim 2 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 4, 6, 4, 0, 0}, Euler = 1

i5 : closedStar(F,C)

o5 = 3: x x x x  x x x x  x x x x  x x x x  
         0 1 2 3  0 1 2 4  0 1 3 4  0 2 3 4

o5 : complex of dim 3 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 10, 4, 0}, Euler = 0

i6 : F=C.fc_1_0

o6 = x x
      0 1

o6 : face with 2 vertices

i7 : link(F,C)

o7 = 1: x x  x x  x x  
         2 3  2 4  3 4

o7 : complex of dim 1 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 3, 3, 0, 0, 0}, Euler = -1

i8 : closedStar(F,C)

o8 = 3: x x x x  x x x x  x x x x  
         0 1 2 3  0 1 2 4  0 1 3 4

o8 : complex of dim 3 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 9, 3, 0}, Euler = 0

i9 : R=QQ[x_0..x_4]

o9 = R

o9 : PolynomialRing

i10 : I=ideal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0)

o10 = ideal (x x , x x , x x , x x , x x )
              0 1   1 2   2 3   3 4   0 4

o10 : Ideal of R

i11 : C=idealToComplex I

o11 = 1: x x  x x  x x  x x  x x  
          0 2  0 3  1 3  1 4  2 4

o11 : complex of dim 1 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {1, 5, 5, 0, 0, 0}, Euler = -1

i12 : F=C.fc_0_0

o12 = x
       0

o12 : face with 1 vertex

i13 : link(F,C)

o13 = 0: x  x  
          2  3

o13 : complex of dim 0 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {1, 2, 0, 0, 0, 0}, Euler = 1

i14 : closedStar(F,C)

o14 = 1: x x  x x  
          0 2  0 3

o14 : complex of dim 1 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {1, 3, 2, 0, 0, 0}, Euler = 0

i15 : F=C.fc_1_0

o15 = x x
       0 2

o15 : face with 2 vertices

i16 : link(F,C)

o16 = -1: {} 

o16 : complex of dim -1 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {1, 0, 0, 0, 0, 0}, Euler = -1

i17 : closedStar(F,C)

o17 = 1: x x  
          0 2

o17 : complex of dim 1 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {1, 2, 1, 0, 0, 0}, Euler = 0

i18 : 
