-- -*- M2-comint -*- hash: -381383022

i1 : R=QQ[x_0..x_5]

o1 = R

o1 : PolynomialRing

i2 : C=boundaryCyclicPolytope(3,R)

o2 = 2: x x x  x x x  x x x  x x x  x x x  x x x  x x x  x x x  
         0 1 2  0 2 3  0 3 4  0 1 5  1 2 5  2 3 5  0 4 5  3 4 5

o2 : complex of dim 2 embedded in dim 5 (printing facets)
     equidimensional, simplicial, F-vector {1, 6, 12, 8, 0, 0, 0}, Euler = 1

i3 : grading R

o3 = | -1 -1 -1 -1 -1 |
     | 1  0  0  0  0  |
     | 0  1  0  0  0  |
     | 0  0  1  0  0  |
     | 0  0  0  1  0  |
     | 0  0  0  0  1  |

              6        5
o3 : Matrix ZZ  <--- ZZ

i4 : dC=dualize C

o4 = 2: v v v  v v v  v v v  v v v  v v v  v v v  v v v  v v v  
         0 1 2  0 1 4  0 3 4  1 2 3  1 2 5  1 4 5  2 3 4  3 4 5

o4 : co-complex of dim 2 embedded in dim 5 (printing facets)
     equidimensional, simplicial, F-vector {0, 0, 0, 8, 12, 6, 1}, Euler = 1

i5 : fdC=fc dC

o5 = {{}, {}, {}, {v v v , v v v , v v v , v v v , v v v , v v v , v v v ,
                    0 1 2   0 1 4   0 3 4   1 2 3   1 2 5   1 4 5   2 3 4 
     ------------------------------------------------------------------------
     v v v }, {v v v v , v v v v , v v v v , v v v v , v v v v , v v v v ,
      3 4 5     0 1 2 3   0 1 2 4   0 1 2 5   0 1 3 4   0 1 4 5   0 2 3 4 
     ------------------------------------------------------------------------
     v v v v , v v v v , v v v v , v v v v , v v v v , v v v v },
      0 3 4 5   1 2 3 4   1 2 3 5   1 2 4 5   1 3 4 5   2 3 4 5  
     ------------------------------------------------------------------------
     {v v v v v , v v v v v , v v v v v , v v v v v , v v v v v ,
       0 1 2 3 4   0 1 2 3 5   0 1 2 4 5   0 1 3 4 5   0 2 3 4 5 
     ------------------------------------------------------------------------
     v v v v v }, {v v v v v v }}
      1 2 3 4 5     0 1 2 3 4 5

o5 : List

i6 : Rdual=simplexRing dC

o6 = Rdual

o6 : PolynomialRing

i7 : grading Rdual

o7 = | -1 -1 -1 -1 5  |
     | -1 -1 -1 5  -1 |
     | -1 -1 5  -1 -1 |
     | -1 5  -1 -1 -1 |
     | 5  -1 -1 -1 -1 |
     | -1 -1 -1 -1 -1 |

              6        5
o7 : Matrix QQ  <--- QQ

i8 : dC1=coComplex(Rdual,fdC)

o8 = 2: v v v  v v v  v v v  v v v  v v v  v v v  v v v  v v v  
         0 1 2  0 1 4  0 3 4  1 2 3  1 2 5  1 4 5  2 3 4  3 4 5

o8 : co-complex of dim 2 embedded in dim 5 (printing facets)
     equidimensional, simplicial, F-vector {0, 0, 0, 8, 12, 6, 1}, Euler = 1

i9 : dC==dC1

o9 = true

i10 : 
