-- -*- M2-comint -*- hash: 1104254152

i1 : R=QQ[x_0..x_4]

o1 = R

o1 : PolynomialRing

i2 : C=simplex(R)

o2 = 4: x x x x x  
         0 1 2 3 4

o2 : complex of dim 4 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 1}, Euler = 0

i3 : grading C

o3 = | -1 -1 -1 -1 |
     | 1  0  0  0  |
     | 0  1  0  0  |
     | 0  0  1  0  |
     | 0  0  0  1  |

              5        4
o3 : Matrix ZZ  <--- ZZ

i4 : dA=dualGrading C

o4 = | -1 -1 -1 4  |
     | -1 -1 4  -1 |
     | -1 4  -1 -1 |
     | 4  -1 -1 -1 |
     | -1 -1 -1 -1 |

              5        4
o4 : Matrix QQ  <--- QQ

i5 : dA===grading dualize C

o5 = true

i6 : dA===C.dualComplex.simplexRing.grading

o6 = true

i7 : pf=polytopalFacets C

o7 = {x x x x , x x x x , x x x x , x x x x , x x x x }
       0 1 2 3   0 1 2 4   0 1 3 4   0 2 3 4   1 2 3 4

o7 : List

i8 : coordinates pf#0

o8 = {{-1, -1, -1, -1}, {1, 0, 0, 0}, {0, 1, 0, 0}, {0, 0, 1, 0}}

o8 : List

i9 : (dualGrading C)^{0}

o9 = | -1 -1 -1 4 |

              1        4
o9 : Matrix QQ  <--- QQ

i10 : 
