-- -*- M2-comint -*- hash: 87845484

i1 : R=QQ[x_0..x_4]

o1 = R

o1 : PolynomialRing

i2 : addCokerGrading R

o2 = | -1 -1 -1 -1 |
     | 1  0  0  0  |
     | 0  1  0  0  |
     | 0  0  1  0  |
     | 0  0  0  1  |

              5        4
o2 : Matrix ZZ  <--- ZZ

i3 : C=simplex R

o3 = 4: x x x x x  
         0 1 2 3 4

o3 : complex of dim 4 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 1}, Euler = 0

i4 : bC=boundaryOfPolytope C

o4 = 3: x x x x  x x x x  x x x x  x x x x  x x x x  
         0 1 2 3  0 1 2 4  0 1 3 4  0 2 3 4  1 2 3 4

o4 : complex of dim 3 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 0}, Euler = -1

i5 : F=bC.fc_2_0

o5 = x x x
      0 1 2

o5 : face with 3 vertices

i6 : coordinates F

o6 = {{-1, -1, -1, -1}, {1, 0, 0, 0}, {0, 1, 0, 0}}

o6 : List

i7 : dualize F

o7 = v v
      0 1

o7 : face with 2 vertices

i8 : coordinates dualize F

o8 = {{-1, -1, -1, 4}, {-1, -1, 4, -1}}

o8 : List

i9 : dbC=dualize bC

o9 = 0: v  v  v  v  v  
         0  1  2  3  4

o9 : co-complex of dim 0 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {0, 5, 10, 10, 5, 1}, Euler = 1

i10 : complement F

o10 = x x
       3 4

o10 : face with 2 vertices

i11 : coordinates complement F

o11 = {{0, 0, 1, 0}, {0, 0, 0, 1}}

o11 : List

i12 : complement bC

o12 = 0: x  x  x  x  x  
          4  3  2  1  0

o12 : co-complex of dim 0 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {0, 5, 10, 10, 5, 1}, Euler = 1

i13 : dualize complement bC

o13 = 3: v v v v  v v v v  v v v v  v v v v  v v v v  
          1 2 3 4  0 2 3 4  0 1 3 4  0 1 2 4  0 1 2 3

o13 : complex of dim 3 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 0}, Euler = -1

i14 : bC

o14 = 3: x x x x  x x x x  x x x x  x x x x  x x x x  
          0 1 2 3  0 1 2 4  0 1 3 4  0 2 3 4  1 2 3 4

o14 : complex of dim 3 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 0}, Euler = -1

i15 : coordinates dualize complement F

o15 = {{-1, 4, -1, -1}, {4, -1, -1, -1}, {-1, -1, -1, -1}}

o15 : List

i16 : coordinates F

o16 = {{-1, -1, -1, -1}, {1, 0, 0, 0}, {0, 1, 0, 0}}

o16 : List

i17 : 
