-- -*- M2-comint -*- hash: -1514543522

i1 : R=QQ[x_0..x_4]

o1 = R

o1 : PolynomialRing

i2 : addCokerGrading(R)

o2 = | -1 -1 -1 -1 |
     | 1  0  0  0  |
     | 0  1  0  0  |
     | 0  0  1  0  |
     | 0  0  0  1  |

              5        4
o2 : Matrix ZZ  <--- ZZ

i3 : C0=simplex(R)

o3 = 4: x x x x x  
         0 1 2 3 4

o3 : complex of dim 4 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 10, 10, 5, 1}, Euler = 0

i4 : I=ideal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0)

o4 = ideal (x x , x x , x x , x x , x x )
             0 1   1 2   2 3   3 4   0 4

o4 : Ideal of R

i5 : C=idealToComplex(I)

o5 = 1: x x  x x  x x  x x  x x  
         0 2  0 3  1 3  1 4  2 4

o5 : complex of dim 1 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 5, 0, 0, 0}, Euler = -1

i6 : embeddingComplex C

o6 = 4: x x x x x  
         0 1 2 3 4

o6 : complex of dim 4 embedded in dim 4 (printing facets)
     equidimensional, simplicial

i7 : idealToComplex(I,C0)

o7 = 1: x x  x x  x x  x x  x x  
         0 2  0 3  1 3  1 4  2 4

o7 : complex of dim 1 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {1, 5, 5, 0, 0, 0}, Euler = -1

i8 : complexToIdeal(C)

o8 = ideal (x x , x x , x x , x x , x x )
             0 1   1 2   2 3   0 4   3 4

o8 : Ideal of R

i9 : cC=idealToCoComplex(I,C0)

o9 = 2: x x x  x x x  x x x  x x x  x x x  
         0 1 3  0 2 3  0 2 4  1 2 4  1 3 4

o9 : co-complex of dim 2 embedded in dim 4 (printing facets)
     equidimensional, simplicial, F-vector {0, 0, 0, 5, 5, 1}, Euler = 1

i10 : cC==complement C

o10 = true

i11 : I==coComplexToIdeal(cC)

o11 = true

i12 : dualize cC

o12 = 1: v v  v v  v v  v v  v v  
          0 2  0 3  1 3  1 4  2 4

o12 : complex of dim 1 embedded in dim 4 (printing facets)
      equidimensional, simplicial, F-vector {1, 5, 5, 0, 0, 0}, Euler = -1

i13 : 
