-- -*- M2-comint -*- hash: -1976602538

i1 : R=QQ[x_0..x_4]

o1 = R

o1 : PolynomialRing

i2 : m=vector {1,-2,1,0,0}

o2 = |  1 |
     | -2 |
     |  1 |
     |  0 |
     |  0 |

       5
o2 : ZZ

i3 : laurent(m,R)

     x x
      0 2
o3 = ----
       2
      x
       1

o3 : frac R

i4 : R=QQ[x_0..x_4]

o4 = R

o4 : PolynomialRing

i5 : addCokerGrading(R);

              5        4
o5 : Matrix ZZ  <--- ZZ

i6 : I=ideal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0)

o6 = ideal (x x , x x , x x , x x , x x )
             0 1   1 2   2 3   3 4   0 4

o6 : Ideal of R

i7 : mg=mingens I;

             1       5
o7 : Matrix R  <--- R

i8 : f=firstOrderDeformation(mg, vector {-1,-1,0,2,0})

       2
      x
       3
o8 = ----
     x x
      0 1

o8 : first order deformation space of dimension 1

i9 : laurent f

       2
      x
       3
o9 = ----
     x x
      0 1

o9 : frac R

i10 : 
