-- -*- M2-comint -*- hash: 610700370

i1 : R=QQ[x_0..x_4];

i2 : I=ideal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0);

o2 : Ideal of R

i3 : possibleDenominators(I)

o3 = {{{x }, {x }, {x }, {x }, {x }}, {{x , x }, {x , x }, {x , x }, {x ,
         0     1     2     3     4       0   1     1   2     2   3     0 
     ------------------------------------------------------------------------
     x }, {x , x }}}
      4     3   4

o3 : List

i4 : possibleDenominators(I,{x_0,x_1,x_2});

i5 : 
