-- -*- M2-comint -*- hash: -356994424

i1 : R=QQ[x_0..x_4];

i2 : addCokerGrading(R);

              5        4
o2 : Matrix ZZ  <--- ZZ

i3 : I=ideal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0)

o3 = ideal (x x , x x , x x , x x , x x )
             0 1   1 2   2 3   3 4   0 4

o3 : Ideal of R

i4 : mg=mingens I;

             1       5
o4 : Matrix R  <--- R

i5 : f=firstOrderDeformation(mg, vector {-1,-1,0,2,0})

       2
      x
       3
o5 = ----
     x x
      0 1

o5 : first order deformation space of dimension 1

i6 : fhom=toHom f

o6 = | 0 0 0 0 x_3^2 |

o6 : Matrix

i7 : source fhom

o7 = image | x_3x_4 x_0x_4 x_2x_3 x_1x_2 x_0x_1 |

                             1
o7 : R-module, submodule of R

i8 : target fhom

o8 = cokernel | x_3x_4 x_0x_4 x_2x_3 x_1x_2 x_0x_1 |

                            1
o8 : R-module, quotient of R

i9 : 
