-- -*- M2-comint -*- hash: -1979189750

i1 : R=QQ[x_0..x_4];

i2 : addCokerGrading(R);

              5        4
o2 : Matrix ZZ  <--- ZZ

i3 : I=ideal(x_0*x_1,x_1*x_2,x_2*x_3,x_3*x_4,x_4*x_0)

o3 = ideal (x x , x x , x x , x x , x x )
             0 1   1 2   2 3   3 4   0 4

o3 : Ideal of R

i4 : mg=mingens I;

             1       5
o4 : Matrix R  <--- R

i5 : f=firstOrderDeformation(mg, vector {-1,-1,0,2,0})

       2
      x
       3
o5 = ----
     x x
      0 1

o5 : first order deformation space of dimension 1

i6 : S=QQ[t]

o6 = S

o6 : PolynomialRing

i7 : totalSpace(f,S)

                                       2
o7 = ideal (x x , x x , x x , x x , t*x  + x x )
             3 4   0 4   2 3   1 2     3    0 1

o7 : Ideal of QQ[t, x ..x ]
                     0   4

i8 : f1=firstOrderDeformation(mg, vector {0,-1,-1,0,2})

       2
      x
       4
o8 = ----
     x x
      1 2

o8 : first order deformation space of dimension 1

i9 : S=QQ[t1,t2]

o9 = S

o9 : PolynomialRing

i10 : totalSpace({f,f1},S)

                                   2             2
o10 = ideal (x x , x x , x x , t2*x  + x x , t1*x  + x x )
              3 4   0 4   2 3      4    1 2      3    0 1

o10 : Ideal of QQ[t1, t2, x ..x ]
                           0   4

i11 : 
