-- -*- M2-comint -*- hash: 496142662

i1 : T = triplet({1,2,3}, {0,2}, {0,2,3})

o1 = {{1, 2, 3}, {0, 2}, {0, 2, 3}}

o1 : Triplet

i2 : isDegreeTriplet T

o2 = true

i3 : rotForw T

o3 = {{0, 2}, {0, 2, 3}, {1, 2, 3}}

o3 : Triplet

i4 : rotBack T

o4 = {{0, 2, 3}, {1, 2, 3}, {0, 2}}

o4 : Triplet

i5 : Betti3 T
{1, 2, 3}   ===>   {3, 6, 2}
{0, 2}   ===>   {1, 3}
{0, 2, 3}   ===>   {2, 3, 1}

i6 : BettiDiagram3 T
       0 1 2            0 1            0 1 2
total: 3 6 2     total: 1 3     total: 2 3 1
    1: 3 6 2         0: 1 .         0: 2 . .
                     1: . 3         1: . 3 1

i7 : Th = toHomology T

o7 = {{1, 2, 3}, {1, 3}, {0, 2, 3}}

o7 : Triplet

i8 : isHomologyTriplet Th

o8 = true

i9 : cohTable (-7, 5,Th)

         -7 -6 -5 -4 -3 -2 -1 0 1  2  3  4  5
o9 =  2: 77 50 30 16  7  2  . . .  .  .  .  .
      1:  2  2  2  2  2  2  2 1 .  .  .  .  .
      0:  .  .  .  .  .  .  . . 1  2  3  4  5
     -1:  .  .  .  .  .  .  . 1 4 10 20 35 56

o9 : CohomologyTally

i10 : Thd = dualHomTriplet Th

o10 = {{0, 1, 2}, {0, 2, 3}, {1, 3}}

o10 : Triplet

i11 : cohTable (-7,5,Thd)

          -7 -6 -5 -4 -3 -2 -1 0 1  2  3  4  5
o11 =  2: 56 35 20 10  4  1  . . .  .  .  .  .
       1:  5  4  3  2  1  .  . . .  .  .  .  .
       0:  .  .  .  .  .  1  2 2 2  2  2  2  2
      -1:  .  .  .  .  .  .  . 2 7 16 30 50 77

o11 : CohomologyTally

i12 : 
