-- -*- M2-comint -*- hash: 1882877611

i1 : n = 4

o1 = 4

i2 : c = 2

o2 = 2

i3 : kk = ZZ/101

o3 = kk

o3 : QuotientRing

i4 : U = kk[x_0..x_(n-1)]

o4 = U

o4 : PolynomialRing

i5 : qq = matrix{{x_0^2+x_1^2,x_0*x_1}}

o5 = | x_0^2+x_1^2 x_0x_1 |

             1       2
o5 : Matrix U  <--- U

i6 : qq = random(U^1, U^{2:-2})

o6 = | 24x_0^2-36x_0x_1+19x_1^2-30x_0x_2+19x_1x_2-29x_2^2-29x_0x_3-10x_1x_3-
     ------------------------------------------------------------------------
     8x_2x_3-22x_3^2 -29x_0^2-24x_0x_1+39x_1^2-38x_0x_2+21x_1x_2+19x_2^2-16x_
     ------------------------------------------------------------------------
     0x_3+34x_1x_3-47x_2x_3-39x_3^2 |

             1       2
o6 : Matrix U  <--- U

i7 : Ubar = U/ideal qq

o7 = Ubar

o7 : QuotientRing

i8 : M = coker vars Ubar

o8 = cokernel | x_0 x_1 x_2 x_3 |

                                  1
o8 : Ubar-module, quotient of Ubar

i9 : M = coker random(Ubar^2, Ubar^{-1,-2,-2})

o9 = cokernel | -18x_0-43x_1-28x_2+38x_3 -16x_1^2+16x_0x_2+39x_1x_2-38x_2^2-48x_0x_3+48x_1x_3+46x_2x_3+22x_3^2 7x_1^2+22x_0x_2+43x_1x_2+33x_2^2-47x_0x_3+36x_1x_3-28x_2x_3-47x_3^2 |
              | -13x_0-15x_1-47x_2+2x_3  15x_1^2+45x_0x_2-17x_1x_2+40x_2^2+47x_0x_3+35x_1x_3+x_2x_3-23x_3^2    -23x_1^2-34x_0x_2-11x_1x_2+11x_2^2+19x_0x_3+11x_1x_3-3x_2x_3-7x_3^2 |

                                  2
o9 : Ubar-module, quotient of Ubar

i10 : C = ciModuleToCliffordModule M

o10 = CliffordModule{...6...}

o10 : CliffordModule

i11 : keys C

o11 = {hyperellipticBranchEquation, oddCenter, evenOperators, symmetricM,
      -----------------------------------------------------------------------
      evenCenter, oddOperators}

o11 : List

i12 : C.evenOperators

o12 = {{-1} | 0 0 0   -48t -38t2    -30t2    24st-23t2 -22t2    -3t2    
       {0}  | 0 0 -6  15   -29s+49t 3t       46s-40t   -46t     -40t    
       {0}  | 0 0 41  21   -47s-4t  -20s+38t 47s-16t   13s+28t  18s-44t 
       {0}  | 0 0 -29 4    7t       -11s-36t -47s+35t  -46s-27t 6s+39t  
       {0}  | 0 0 7   -34  30s+41t  28s-23t  44s-21t   -11s-47t -47s+42t
       {0}  | 0 0 12  20   24s+50t  28s+30t  -10s+24t  28s-24t  -37s+40t
       {0}  | 0 0 0   -44  -40s+16t -49s-41t 32s+25t   -43s-3t  -7s+45t 
       {0}  | 0 0 0   0    0        0        0         0        0       
       {1}  | 0 0 0   0    0        0        0         0        0       
       {1}  | 0 0 0   0    0        0        0         0        0       
       {2}  | 0 0 0   0    0        0        0         0        0       
       {2}  | 0 0 0   0    0        0        0         0        0       
      -----------------------------------------------------------------------
      -31t2    27st2+40t3      0            |, {-1} | 0 0 43t 42t 39st-6t2
      -11t     -29st-40t2      0            |  {0}  | 0 0 -43 -44 36s-9t  
      -6s+12t  29s2+22st+12t2  0            |  {0}  | 0 0 -21 37  5s-4t   
      -44s+26t -30s2+44st+13t2 0            |  {0}  | 0 0 33  -46 28s-32t 
      24s-45t  -27s2-44st-41t2 0            |  {0}  | 0 0 4   -5  46s+31t 
      26s+18t  35st-49t2       0            |  {0}  | 0 0 -16 28  40s-t   
      28s+9t   49st-26t2       0            |  {0}  | 0 0 0   47  -44s    
      0        0               -39s2t-48st2 |  {0}  | 0 0 0   0   0       
      0        0               28st+15t2    |  {1}  | 0 0 0   0   0       
      0        0               40st-33t2    |  {1}  | 0 0 0   0   0       
      0        0               13s-10t      |  {2}  | 0 0 0   0   0       
      0        0               -31s+37t     |  {2}  | 0 0 0   0   0       
      -----------------------------------------------------------------------
      22st+27t2 -9st+13t2 45st+24t2 -22st+29t2 43st-44t2 -7st2+3t3      
      -32s-41t  -7s+26t   -23s+14t  28s-38t    -11s+9t   -28st+16t2     
      19s-34t   41s-34t   -4s+10t   -50s-37t   26s-5t    -27s2-50st+25t2
      s-32t     -16s+27t  37s+24t   -7s-23t    50s-16t   -40s2+16t2     
      -50s-47t  -46s-15t  25s-43t   34s+25t    15s-34t   -s2-4st+10t2   
      -s+50t    27s       26s       -23s+27t   3s        39st           
      -23s-35t  35s       13s       -45s+14t   -45s      43st           
      0         0         0         0          0         0              
      0         0         0         0          0         0              
      0         0         0         0          0         0              
      0         0         0         0          0         0              
      0         0         0         0          0         0              
      -----------------------------------------------------------------------
      0              |, {-1} | 0   24s+14t 0  0  0       0      0      
      0              |  {0}  | 24  -41     0  0  0       0      0      
      0              |  {0}  | -36 10      0  0  0       0      0      
      0              |  {0}  | 19  -23     0  0  0       0      0      
      0              |  {0}  | 0   -36     0  0  0       0      0      
      0              |  {0}  | -30 6       0  0  0       0      0      
      0              |  {0}  | 0   32      0  0  0       0      0      
      9s2t-10st2+2t3 |  {0}  | 0   0       35 37 49s+46t -9s-4t -3s-43t
      3st-38t2       |  {1}  | 0   0       0  0  16      22     27     
      -47st+2t2      |  {1}  | 0   0       0  0  32      -47    -21    
      30s+40t        |  {2}  | 0   0       0  0  0       0      0      
      14s+24t        |  {2}  | 0   0       0  0  0       0      0      
      -----------------------------------------------------------------------
      0        0        0       0         0 |, {-1} | 0   -29s+25t 0  0  
      0        0        0       0         0 |  {0}  | -29 -22      0  0  
      0        0        0       0         0 |  {0}  | -24 38       0  0  
      0        0        0       0         0 |  {0}  | 39  -5       0  0  
      0        0        0       0         0 |  {0}  | 0   49       0  0  
      0        0        0       0         0 |  {0}  | -38 47       0  0  
      0        0        0       0         0 |  {0}  | 0   -24      0  0  
      -48s-35t -11s-39t 49s-20t 32st-14t2 0 |  {0}  | 0   0        -1 -28
      3        -28      30      10t       0 |  {1}  | 0   0        0  0  
      2        -26      -9      30t       0 |  {1}  | 0   0        0  0  
      0        0        0       -20       0 |  {2}  | 0   0        0  0  
      0        0        0       27        0 |  {2}  | 0   0        0  0  
      -----------------------------------------------------------------------
      0       0       0       0       0      0       0         0 |}
      0       0       0       0       0      0       0         0 |
      0       0       0       0       0      0       0         0 |
      0       0       0       0       0      0       0         0 |
      0       0       0       0       0      0       0         0 |
      0       0       0       0       0      0       0         0 |
      0       0       0       0       0      0       0         0 |
      -2s+31t 31s+47t -8s+15t 28s+43t 8s-47t -49s-3t 37st-35t2 0 |
      -29     -38     17      -39     30     -8      37t       0 |
      -31     -50     -29     -34     21     -48     -42t      0 |
      0       0       0       0       0      0       -48       0 |
      0       0       0       0       0      0       -20       0 |

o12 : List

i13 : C.symmetricM

o13 = | 0        0       -15s-41t -19s-40t |
      | 0        0       36s-5t   -8s+17t  |
      | -15s-41t 36s-5t  0        0        |
      | -19s-40t -8s+17t 0        0        |

                       4                4
o13 : Matrix (kk[s, t])  <--- (kk[s, t])

i14 : C.evenCenter

o14 = {1} | 4s2-4st-12t2 0            0              0              
      {1} | 0            4s2-4st-12t2 0              0              
      {1} | 0            0            -39s2+20st+3t2 -35s2-8st+8t2  
      {1} | 0            0            33s2-st-29t2   -25s2-31st-22t2
      {2} | 0            0            10s-17t        48s-28t        
      {2} | 0            0            32s+22t        -40s-36t       
      {2} | 0            0            -35s-40t       -s+43t         
      {2} | 0            0            2s+48t         29s+22t        
      {2} | 0            0            19s+22t        16s-4t         
      {2} | 0            0            -37s+11t       -17s+27t       
      {3} | 0            0            0              0              
      {0} | 0            0            0              0              
      -----------------------------------------------------------------------
      0                      0                     0                    
      0                      0                     0                    
      -25s3-42s2t-14st2-27t3 43s3+23s2t+32st2+35t3 -48s3+16s2t+3st2-12t3
      -27s3+18s2t-16st2+2t3  44s3+20s2t+8st2-36t3  29s3+23s2t+5st2-30t3 
      -11s2+8st-6t2          -15s2-5st-7t2         9s2+41st+44t2        
      11s2+46st+39t2         17s2+11st+18t2        -5s2+st-18t2         
      20s2+16st+14t2         -33s2-11st+24t2       38s2-st-19t2         
      6s2+39st-33t2          -24s2-8st-32t2        -45s2-40st+22t2      
      46s2+23st+10t2         -33s2-11st+9t2        -29s2-19st-29t2      
      20s2+38st+45t2         4s2+35st+23t2         -11s2-15st-15t2      
      0                      0                     0                    
      0                      0                     0                    
      -----------------------------------------------------------------------
      0                     0                      0                    
      0                     0                      0                    
      49s3+42s2t-19st2+8t3  -12s3+29s2t+33st2+6t3  28s3+8s2t+10st2-23t3 
      50s3-47s2t-33st2+43t3 -11s3+13s2t+36st2+29t3 -8s3-12s2t-17st2+46t3
      32s2+11st-30t2        -40s2+15st-43t2        38s2-30st+28t2       
      4s2+36st-47t2         27s2-47st+48t2         19s2-17st-42t2       
      -5s2-25st-15t2        16s2-27st              42s2-39st-21t2       
      6s2-16st+35t2         -42s2-12st-8t2         -49s2+49st-29t2      
      -25s2+45st+43t2       -44s2-14st+17t2        24s2-38st-48t2       
      -23s2-23st+21t2       -46s2-49st-27t2        22s2+7st-49t2        
      0                     0                      0                    
      0                     0                      0                    
      -----------------------------------------------------------------------
      0                            0            |
      0                            0            |
      -43s4-5s3t+49s2t2+21st3+15t4 0            |
      15s4-40s3t-35s2t2-33st3-11t4 0            |
      16s3-9s2t+26st2-48t3         0            |
      -32s3+18s2t-20st2+20t3       0            |
      30s3+2s2t+38st2+11t3         0            |
      -33s3+29s2t+26st2+3t3        0            |
      12s3-20s2t+11st2+39t3        0            |
      23s3+49s2t+9st2+17t3         0            |
      4s2-4st-12t2                 0            |
      0                            4s2-4st-12t2 |

                       12                12
o14 : Matrix (kk[s, t])   <--- (kk[s, t])

i15 : 
