-- -*- M2-comint -*- hash: -515807367

i1 : kk=ZZ/101; d=1;

i3 : n=2*d

o3 = 2

i4 : R=kk[a_0..a_(binomial(n+2,2))]

o4 = R

o4 : PolynomialRing

i5 : S=kk[x_0..x_(n-1),a_0..a_(binomial(n+2,2))]

o5 = S

o5 : PolynomialRing

i6 : M=genericSymmetricMatrix(S,a_0,n)

o6 = | a_0 a_1 |
     | a_1 a_2 |

             2       2
o6 : Matrix S  <--- S

i7 : X=(vars S)_{0..n-1}

o7 = | x_0 x_1 |

             1       2
o7 : Matrix S  <--- S

i8 : Y=X*M

o8 = | x_0a_0+x_1a_1 x_0a_1+x_1a_2 |

             1       2
o8 : Matrix S  <--- S

i9 : qq = X*transpose Y

o9 = | x_0^2a_0+2x_0x_1a_1+x_1^2a_2 |

             1       1
o9 : Matrix S  <--- S

i10 : (M1,M2)=matrixFactorizationK(X,Y);

i11 : (eOdd,eEv)=cliffordOperators(M1,M2,R);

i12 : (eOdd_0*eEv_0+eOdd_0*eEv_0)_(0,0) == 2*R_0

o12 = true

i13 : (eOdd_0*eEv_1+eOdd_1*eEv_0)_(0,0) == 2*R_1

o13 = true

i14 : 
