-- -*- M2-comint -*- hash: -118091516

i1 : kk=ZZ/101;

i2 : g=1;

i3 : rNP=randNicePencil(kk,g);

i4 : qq=rNP.quadraticForm;

i5 : S=rNP.qqRing;

i6 : cM=cliffordModule(rNP.matFact1,rNP.matFact2,rNP.baseRing)

o6 = CliffordModule{...6...}

o6 : CliffordModule

i7 : (M1,M2)=cliffordModuleToMatrixFactorization(cM,S);

i8 : r=rank source M1

o8 = 8

i9 : M1*M2 - qq*id_(S^r) == 0

o9 = true

i10 : M1 == rNP.matFact1

o10 = true

i11 : M2 == rNP.matFact2

o11 = true

i12 : cMu=cliffordModule(rNP.matFactu1,rNP.matFactu2,rNP.baseRing)

o12 = CliffordModule{...6...}

o12 : CliffordModule

i13 : (Mu1,Mu2)=cliffordModuleToMatrixFactorization(cMu,S);

i14 : ru=rank source Mu1

o14 = 4

i15 : Mu1*Mu2 - qq*id_(S^ru) == 0

o15 = true

i16 : Mu1 == rNP.matFactu1

o16 = true

i17 : Mu2 == rNP.matFactu2

o17 = true

i18 : 
