-- -*- M2-comint -*- hash: -942679571

i1 : kk=ZZ/101;

i2 : g=1;

i3 : rNP=randNicePencil(kk,g);

i4 : f=(cliffordModule(rNP.matFact1,rNP.matFact2,rNP.baseRing)).hyperellipticBranchEquation;

i5 : L0=randomLineBundle(0,f)

o5 = VectorBundleOnE{...1...}

o5 : VectorBundleOnE

i6 : degOnE L0

o6 = 0

i7 : L1=randomLineBundle(1,f)

o7 = VectorBundleOnE{...1...}

o7 : VectorBundleOnE

i8 : degOnE L1

o8 = 1

i9 : Lm1=randomLineBundle(-1,f)

o9 = VectorBundleOnE{...1...}

o9 : VectorBundleOnE

i10 : degOnE Lm1

o10 = -1

i11 : 
