-- -*- M2-comint -*- hash: 1564182161

i1 : kk=ZZ/101

o1 = kk

o1 : QuotientRing

i2 : n=2

o2 = 2

i3 : R=kk[a_0..a_(binomial(n+2,2))]

o3 = R

o3 : PolynomialRing

i4 : S=kk[x_0..x_(n-1),a_0..a_(binomial(n+2,2))]

o4 = S

o4 : PolynomialRing

i5 : M=genericSymmetricMatrix(S,a_0,n)

o5 = | a_0 a_1 |
     | a_1 a_2 |

             2       2
o5 : Matrix S  <--- S

i6 : X=(vars S)_{0..n-1}

o6 = | x_0 x_1 |

             1       2
o6 : Matrix S  <--- S

i7 : Y=X*M

o7 = | x_0a_0+x_1a_1 x_0a_1+x_1a_2 |

             1       2
o7 : Matrix S  <--- S

i8 : (M1,M2)=matrixFactorizationK(X,Y)

o8 = ({1} | -x_0          -x_1           |, {2} | -x_0a_0-x_1a_1 x_1  |)
      {0} | x_0a_1+x_1a_2 -x_0a_0-x_1a_1 |  {2} | -x_0a_1-x_1a_2 -x_0 |

o8 : Sequence

i9 : M12=M1*M2

o9 = {1} | x_0^2a_0+2x_0x_1a_1+x_1^2a_2 0                            |
     {0} | 0                            x_0^2a_0+2x_0x_1a_1+x_1^2a_2 |

             2       2
o9 : Matrix S  <--- S

i10 : 
