-- -*- M2-comint -*- hash: 1382965475

i1 : kk=ZZ/101;

i2 : g=1;

i3 : rNP=randNicePencil(kk,g);

i4 : S=rNP.qqRing;

i5 : qq=rNP.quadraticForm;

i6 : Mu1=rNP.matFactu1;

             4       4
o6 : Matrix S  <--- S

i7 : Mu2=rNP.matFactu2;

             4       4
o7 : Matrix S  <--- S

i8 : Mu1*Mu2 - qq*id_(S^(2^(g+1)))

o8 = 0

             4       4
o8 : Matrix S  <--- S

i9 : Mu1*Mu2 - Mu2*Mu1

o9 = 0

             4       4
o9 : Matrix S  <--- S

i10 : 
