-- -*- M2-comint -*- hash: -1434166043

i1 : kk=ZZ/101;

i2 : g=1;

i3 : rNP=randNicePencil(kk,g);

i4 : S=rNP.qqRing;

i5 : qq=rNP.quadraticForm;

i6 : M1=rNP.matFact1;

             8       8
o6 : Matrix S  <--- S

i7 : M2=rNP.matFact2;

             8       8
o7 : Matrix S  <--- S

i8 : M1*M2 - qq*id_(S^(2^(2*g+1)))

o8 = 0

             8       8
o8 : Matrix S  <--- S

i9 : M1*M2 - M2*M1

o9 = 0

             8       8
o9 : Matrix S  <--- S

i10 : 
