-- -*- M2-comint -*- hash: 1142625972

i1 : kk=ZZ/101;

i2 : g=1;

i3 : rNP=randNicePencil(kk,g);

i4 : cM=cliffordModule(rNP.matFact1,rNP.matFact2,rNP.baseRing);

i5 : f=cM.hyperellipticBranchEquation

          3       2 2        3      4
o5 = - 12s t - 50s t  - 16s*t  + 47t

o5 : kk[s, t]

i6 : L1=randomLineBundle(0,f)

o6 = VectorBundleOnE{...1...}

o6 : VectorBundleOnE

i7 : L2=randomLineBundle(2,f)

o7 = VectorBundleOnE{...1...}

o7 : VectorBundleOnE

i8 : V=randomExtension(L1,L2)

o8 = VectorBundleOnE{...1...}

o8 : VectorBundleOnE

i9 : V.yAction

o9 = {-1} | -18s2-13st-43t2 13s2+45st-16t2 40s4+37s3t+16s2t2+35st3  
     {-1} | 45s2-14st-t2    18s2+13st+43t2 11s4+45s3t+6s2t2-5st3+3t4
     {1}  | 0               0              48s2+36st+35t2           
     {-1} | 0               0              44s4+s3t-22s2t2+33st3-t4 
     ------------------------------------------------------------------------
     -42s2-33st-48t2 |
     39s2-30st+32t2  |
     -34             |
     -48s2-36st-35t2 |

                      4                4
o9 : Matrix (kk[s, t])  <--- (kk[s, t])

i10 : degOnE V

o10 = 2

i11 : V1=randomExtension(L2,V)

o11 = VectorBundleOnE{...1...}

o11 : VectorBundleOnE

i12 : V1.yAction

o12 = {1}  | 48s2+36st+35t2           -34             36             
      {-1} | 44s4+s3t-22s2t2+33st3-t4 -48s2-36st-35t2 29s2+40st-43t2 
      {-1} | 0                        0               -18s2-13st-43t2
      {-1} | 0                        0               45s2-14st-t2   
      {1}  | 0                        0               0              
      {-1} | 0                        0               0              
      -----------------------------------------------------------------------
      -38            -22s2-40st+6t2               -29             |
      41s2-19st-15t2 -28s4-20s3t+11s2t2+31st3-5t4 29s2-3st+50t2   |
      13s2+45st-16t2 40s4+37s3t+16s2t2+35st3      -42s2-33st-48t2 |
      18s2+13st+43t2 11s4+45s3t+6s2t2-5st3+3t4    39s2-30st+32t2  |
      0              48s2+36st+35t2               -34             |
      0              44s4+s3t-22s2t2+33st3-t4     -48s2-36st-35t2 |

                       6                6
o12 : Matrix (kk[s, t])  <--- (kk[s, t])

i13 : degOnE V1

o13 = 4

i14 : 
