-- -*- M2-comint -*- hash: 2113794517

i1 : kk=ZZ/101;

i2 : g=2;

i3 : rNP=randNicePencil(kk,g);

i4 : S=rNP.qqRing;

i5 : R=rNP.baseRing;

i6 : qq=rNP.quadraticForm;

i7 : qs=apply(2,i->diff(S_(2*g+2+i),qq))

                     2     2               2                             
o7 = {x y  + x y  - z , 35x  + 39x x  - 40x  - 13x y  + 44x y  + 39x y  -
       0 0    1 1    1     0      0 1      1      0 0      1 0      0 1  
     ------------------------------------------------------------------------
                                                     2                  
     37x y  - 30x z  + 42x z  + 29y z  + 48y z  - 44z  + x z  - 43x z  -
        1 1      0 1      1 1      0 1      1 1      1    0 2      1 2  
     ------------------------------------------------------------------------
                                  2
     6y z  + 23y z  + 31z z  - 38z }
       0 2      1 2      1 2      2

o7 : List

i8 : Mu1=rNP.matFactu1;

             8       8
o8 : Matrix S  <--- S

i9 : Mu2=rNP.matFactu2;

             8       8
o9 : Matrix S  <--- S

i10 : M=cliffordModule(Mu1,Mu2,R)

o10 = CliffordModule{...6...}

o10 : CliffordModule

i11 : elapsedTime Ulr = searchUlrich(M,S);
 -- 2.60456 seconds elapsed

i12 : betti res Ulr

             0  1 2
o12 = total: 8 16 8
          0: 8 16 8

o12 : BettiTally

i13 : ann Ulr == ideal qs

o13 = true

i14 : 
