-- -*- M2-comint -*- hash: -255291292

i1 : kk=ZZ/101;

i2 : g=2;

i3 : (S,qq,R,u, M1,M2, Mu1,Mu2) = randomNicePencil(kk,g);

i4 : M=cliffordModule (Mu1, Mu2, R);

i5 : f=M.hyperellipticBranchEquation

        5      4 2      3 3      2 4        5      6
o5 = 15s t + 6s t  + 33s t  + 30s t  - 48s*t  + 14t

o5 : R

i6 : L=randomLineBundle(0,f);

i7 : uL=translateIsotropicSubspace(M,L,S)

o7 = | y_1-36z_1-2z_2 y_0+20z_1+17z_2 x_1+25z_1-12z_2 x_0+40z_1-43z_2 |

             1       4
o7 : Matrix S  <--- S

i8 : assert (betti uL == betti u)

i9 : 
